
#Область Аккаунты
Функция ПолучитьТаблицуАккаунтовПоПоиску(СтрокаПоиска) Экспорт 	
	
	ТекСтрокаПоиска = "%"+СтрокаПоиска+"%";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекСтрокаПоиска", ТекСтрокаПоиска);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Акк.Аккаунт
		|ИЗ
		|	(ВЫБРАТЬ
		|		СайтПользователи.Ссылка КАК Аккаунт
		|	ИЗ
		|		Справочник.СайтПользователи КАК СайтПользователи
		|	ГДЕ
		|		(СайтПользователи.Код ПОДОБНО &ТекСтрокаПоиска
		|				ИЛИ СайтПользователи.Наименование ПОДОБНО &ТекСтрокаПоиска
		|				ИЛИ СайтПользователи.ЭлектроннаяПочта ПОДОБНО &ТекСтрокаПоиска
		|				ИЛИ СайтПользователи.КонтактныйТелефон ПОДОБНО &ТекСтрокаПоиска
		|				ИЛИ СайтПользователи.Имя ПОДОБНО &ТекСтрокаПоиска
		|				ИЛИ СайтПользователи.Фамилия ПОДОБНО &ТекСтрокаПоиска)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КИ.Ссылка
		|	ИЗ
		|		Справочник.СайтПользователи.КИ КАК КИ
		|	ГДЕ
		|		КИ.ЗначениеКИ ПОДОБНО &ТекСтрокаПоиска) КАК Акк";
	ТаблАккаунтов = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблАккаунтов;
	
КонецФункции


Функция ПолучитьМассивКонтрагентовАккаунта(Аккаунт) Экспорт 	
	
	Если НЕ ЗначениеЗаполнено(Аккаунт) Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СайтПользователиКонтрагенты.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
		|ГДЕ
		|	СайтПользователиКонтрагенты.Пользователь = &Аккаунт
		|	И СайтПользователиКонтрагенты.Контрагент <> Значение(Справочник.Контрагенты.ПустаяСсылка)
		|";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	
	Возврат Таблица.ВыгрузитьКолонку("Контрагент");
	
КонецФункции

//Чернавцев Н.А. по задаче №49227 14.12.21 Начало
Функция ПолучитьМассивКонтрагентовАккаунта_Новый(Аккаунт) Экспорт 	
	
	Если НЕ ЗначениеЗаполнено(Аккаунт) Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации КАК Контрагент,
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.ИНН КАК ИНН,
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.КПП КАК КПП,
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.Наименование КАК Наименование,
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.НаименованиеПолное КАК НаименованиеПолное,
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.Код КАК Код,
		|	ВЫБОР
		|		КОГДА АллокацииАккаунтовСрезПоследних.Подтверждено
		|			ТОГДА """"
		|		ИНАЧЕ ""Подтвердить""
		|	КОНЕЦ КАК Подтверждение,
		|	АллокацииАккаунтовСрезПоследних.Регистратор,
		|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.ЮрФизЛицо КАК ТипКонтрагента
		|ИЗ
		|	РегистрСведений.АллокацииАккаунтов.СрезПоследних(
		|			,
		|			НЕ ОбъектАллокации.ПометкаУдаления
		|				И ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.Контрагенты)) КАК АллокацииАккаунтовСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Аккаунт ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ АллокацииАккаунтовСрезПоследних.Аккаунт = &Аккаунт
		|		КОНЕЦ";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	
	Возврат Таблица.ВыгрузитьКолонку("Контрагент");
	
КонецФункции

//Чернавцев Н.А. по задаче №49227 14.12.21 Конец

Функция ПолучитьМассивАккаунтовПоКнтрагенту(Контрагент) Экспорт 	
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СайтПользователиКонтрагенты.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
		|ГДЕ		
		|	СайтПользователиКонтрагенты.Контрагент = &Контрагент 
		|	И 	СайтПользователиКонтрагенты.Пользователь <> Значение(Справочник.Контрагенты.ПустаяСсылка)
		|";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	
	Возврат Таблица.ВыгрузитьКолонку("Пользователь");
	
КонецФункции

Функция ПолучитьАккаунтПоКнтрагенту(Контрагент) Экспорт 	
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СайтПользователиКонтрагенты.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
		|ГДЕ		
		|	СайтПользователиКонтрагенты.Контрагент = &Контрагент 
		|	И 	СайтПользователиКонтрагенты.Пользователь <> Значение(Справочник.Контрагенты.ПустаяСсылка)
		|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Пользователь;
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСуммуДолгаПоАккаунту(Аккаунт,МассивКонтрагентовАккаунта = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", МассивКонтрагентовАккаунта);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ТекущаяДата, Контрагент В (&Контрагент)) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|";
	
	СуммаДолга = 0;
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОстатков.Количество() > 0 Тогда 
		СуммаДолга = ТаблицаОстатков.Итог("СуммаОстаток");	
	КонецЕсли;
	
	Возврат  СуммаДолга;
	
КонецФункции

Процедура ЗаписатьВходящиеСобытияДляОбработки(СсылкаНАОбъект, Аккаунт, ДатаЗаписи = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(СсылкаНАОбъект) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВходящиеСобытияДляОбработки.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНАОбъект);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		Запись = НаборЗаписей.Добавить();
		Запись.Активность	= Истина;
		Запись.Объект		= СсылкаНАОбъект;
		Запись.Период		= ?(ЗначениеЗаполнено(ДатаЗаписи),ДатаЗаписи,ТекущаяДата());
		Запись.Аккаунт		= Аккаунт;
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать регистр ВходящиеСобытияДляОбработки!" + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриЗаписиОбъекта_ИсторииКонтактовСАккаунтомПриЗаписи(Источник, Отказ) Экспорт

	Если Константы.ФормироватьИсториюКонтактовСАккаунтами.Получить() <> Истина Тогда 
		Возврат;
	КонецЕсли;
	
	
	МетаданныеДокумента = Источник.Метаданные();
	
	ИмяДока = МетаданныеДокумента.Имя;
	
	СсылкаНАОбъект = Источник.Ссылка;
	
	
	
			
	//зафиксируем историю контактов
	Если ИмяДока = "ЭлектронноеПисьмо" Тогда 
		
		СтатусыИсходящих = Новый Массив;
		СтатусыИсходящих.Добавить(Перечисления.СтатусыПисем.Исходящее);
		СтатусыИсходящих.Добавить(Перечисления.СтатусыПисем.Отправленное);
		СтатусыИсходящих.Добавить(Перечисления.СтатусыПисем.Сохраненное);
		
		Запрос = Новый Запрос;		
		Запрос.УстановитьПараметр("ПустаяСтрока"	,"");
		Запрос.УстановитьПараметр("СтатусыИсходящих",СтатусыИсходящих);	
		Запрос.УстановитьПараметр("СсылкаНАОбъект"	,СсылкаНАОбъект);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	данные.Ссылка КАК Письмо,
			|	данные.СтатусПисьма,
			|	данные.ПочтаПолучатель,
			|	данные.ПочтаОтправитель,
			|	данные.ПочтаАккаунта
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЭлектронноеПисьмоКомуТЧ.Ссылка КАК Ссылка,
			|		ЭлектронноеПисьмоКомуТЧ.Ссылка.СтатусПисьма КАК СтатусПисьма,
			|		ЭлектронноеПисьмоКомуТЧ.АдресЭлектроннойПочты КАК ПочтаПолучатель,
			|		ЭлектронноеПисьмоКомуТЧ.Ссылка.ОтправительАдресЭлектроннойПочты КАК ПочтаОтправитель,
			|		ЭлектронноеПисьмоКомуТЧ.АдресЭлектроннойПочты КАК ПочтаАккаунта
			|	ИЗ
			|		Документ.ЭлектронноеПисьмо.КомуТЧ КАК ЭлектронноеПисьмоКомуТЧ
			|	ГДЕ
			|		ЭлектронноеПисьмоКомуТЧ.Ссылка = &СсылкаНАОбъект
			|		И ЭлектронноеПисьмоКомуТЧ.Ссылка.СтатусПисьма В(&СтатусыИсходящих)
			|		И ЭлектронноеПисьмоКомуТЧ.АдресЭлектроннойПочты <> &ПустаяСтрока
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЭлектронноеПисьмо.Ссылка,
			|		ЭлектронноеПисьмо.СтатусПисьма,
			|		ВЫРАЗИТЬ(ЭлектронноеПисьмо.Кому КАК СТРОКА(250)),
			|		ЭлектронноеПисьмо.ОтправительАдресЭлектроннойПочты,
			|		ЭлектронноеПисьмо.ОтправительАдресЭлектроннойПочты
			|	ИЗ
			|		Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
			|	ГДЕ
			|		ЭлектронноеПисьмо.Ссылка = &СсылкаНАОбъект
			|		И НЕ ЭлектронноеПисьмо.СтатусПисьма В (&СтатусыИсходящих)) КАК данные
			|";

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивАккаунтов = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТекПисьмо = ВыборкаДетальныеЗаписи.Письмо;
			ТекДата   = ТекПисьмо.Дата;
			ТекСтатусПисьма   = ТекПисьмо.СтатусПисьма;
			
			Направление = Перечисления.НаправленияКонтактовАккаунта.Исход;
			Если СтатусыИсходящих.Найти(ТекСтатусПисьма) = Неопределено Тогда 
				Направление = Перечисления.НаправленияКонтактовАккаунта.Вход;	
			КонецЕсли;
			
			ПочтаАккаунта =ВыборкаДетальныеЗаписи.ПочтаАккаунта;
			
			//Заполняем поля поиска
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Код"				,ПочтаАккаунта);
			СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,ПочтаАккаунта);
			СтруктураПоиска.Вставить("КонтактныйТелефон",ПочтаАккаунта);
			
			Аккаунт = НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина);
							
			НаборЗапиписей = РегистрыСведений.ИсторияКонтактовСАккаунтом.СоздатьНаборЗаписей();
			НаборЗапиписей.Отбор.Объект.Установить(ТекПисьмо);
			НаборЗапиписей.Отбор.Аккаунт.Установить(Аккаунт);
			
			ЗАпись = НаборЗапиписей.Добавить();
			ЗАпись.Активность 		= Истина;
			ЗАпись.Аккаунт	  		= Аккаунт;
			ЗАпись.Объект	  		= ТекПисьмо;
			ЗАпись.Период	  		= ТекДата;
			ЗАпись.Направление	  	= Направление;
			
			
			Попытка
				НаборЗапиписей.Записать(Истина);	
			Исключение			
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать историю по "+ ТекПисьмо+ "! Причина:"+ОписаниеОшибки());	
			КонецПопытки;		
			
			//зафиксируем таблицу для обработки менеждером
			Если Направление = Перечисления.НаправленияКонтактовАккаунта.Вход Тогда 
				ЗаписатьВходящиеСобытияДляОбработки(СсылкаНАОбъект, Аккаунт,ТекДата); 
			КонецЕсли;
		КонецЦикла;
			
	
	ИначеЕсли ИмяДока = "Событие" Тогда 
			
		ТипыКИ = Новый Массив;
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаНАОбъект"	,СсылкаНАОбъект);
		Запрос.УстановитьПараметр("ВидСобытия"		, Перечисления.ВидыСобытий.ТелефонныйЗвонок);
		Запрос.УстановитьПараметр("ТипыКИ"				, ТипыКИ);		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Событие.Ссылка КАК Ссылка,
			|	Событие.ТипСобытия КАК ТипСобытия,
			|	Событие.АдресЭлектроннойПочты,
			|	Событие.Контрагент,
			|	Событие.КонтактноеЛицо
			|ПОМЕСТИТЬ ТАблицаСобытий
			|ИЗ
			|	Документ.Событие КАК Событие
			|ГДЕ
			|	Событие.ВидСобытия В(&ВидСобытия)
			|	И Событие.Ссылка  = &СсылкаНАОбъект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КонтактнаяИнформация.Объект,
			|	КонтактнаяИнформация.Представление,
			|	КонтактнаяИнформация.Тип
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Тип В (&ТипыКИ)
			|	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))) <> """"
			|	И КонтактнаяИнформация.Объект В
			|			(ВЫБРАТЬ
			|				ТАблицаСобытий.Контрагент
			|			ИЗ
			|				ТАблицаСобытий КАК ТАблицаСобытий
			|		
			|			ОБЪЕДИНИТЬ ВСЕ
			|		
			|			ВЫБРАТЬ
			|				ТАблицаСобытий.КонтактноеЛицо
			|			ИЗ
			|				ТАблицаСобытий КАК ТАблицаСобытий)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТАблицаСобытий.Ссылка,
			|	ТАблицаСобытий.ТипСобытия КАК ТипСобытия,
			|	ТАблицаСобытий.АдресЭлектроннойПочты,
			|	ТАблицаСобытий.Контрагент,
			|	ТАблицаСобытий.КонтактноеЛицо
			|ИЗ
			|	ТАблицаСобытий КАК ТАблицаСобытий";
		
		
		МассивРезульаттов = Запрос.ВыполнитьПакет();
		
		ТаблСобытий		 = МассивРезульаттов[2].Выгрузить();
		КИКонтрагентов	 = МассивРезульаттов[1].Выгрузить();
				
		для Каждого ВыборкаДетальныеЗаписи из ТаблСобытий Цикл 
								
			
			Объект = ВыборкаДетальныеЗаписи.Ссылка;
			ТипСобытия = ВыборкаДетальныеЗаписи.ТипСобытия;
			ТекДата = Объект.Дата;
			
			АдресЭлектроннойПочты = СокрЛП(Объект.АдресЭлектроннойПочты);
			
			Направление = Перечисления.НаправленияКонтактовАккаунта.Исход;
			Если ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Входящее Тогда 
				Направление = Перечисления.НаправленияКонтактовАккаунта.Вход;	
			КонецЕсли;
			
			//КонтактноеЛицо
			//Контрагент
			// сделать поиск аккаунат по все Ки контрагента!!!
			ТекТаблицаКИ = КИКонтрагентов.СкопироватьКолонки();
			
			Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			Если ЗначениеЗаполнено(Контрагент) Тогда 
				СтруктураОтбора = Новый Структура;			
				СтруктураОтбора.Вставить("Объект",Контрагент);
				
				ТекТаблицаКИПоКнотрагенту = КИКонтрагентов.Скопировать(СтруктураОтбора);
				
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТекТаблицаКИПоКнотрагенту, ТекТаблицаКИ);
				
			КонецЕсли;
			
			КонтактноеЛицо = ВыборкаДетальныеЗаписи.КонтактноеЛицо;
			Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда 
				СтруктураОтбора = Новый Структура;			
				СтруктураОтбора.Вставить("Объект",КонтактноеЛицо);
				
				ТекТаблицаКИПоКнотрагенту = КИКонтрагентов.Скопировать(СтруктураОтбора);
				
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТекТаблицаКИПоКнотрагенту, ТекТаблицаКИ);
				
			КонецЕсли;
			
			МассивКИ = ТекТаблицаКИ.ВыгрузитьКолонку("Представление");
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Код"				,АдресЭлектроннойПочты);
			СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,АдресЭлектроннойПочты);
			СтруктураПоиска.Вставить("КонтактныйТелефон",АдресЭлектроннойПочты);	
			
			Аккаунт = НайтиСоздатьАккаунт(СтруктураПоиска,Контрагент,МассивКИ,Истина);
			
			Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
				Продолжить;	
			КонецЕсли;
					
			НаборЗапиписей = РегистрыСведений.ИсторияКонтактовСАккаунтом.СоздатьНаборЗаписей();
			НаборЗапиписей.Отбор.Объект.Установить(Объект);
			НаборЗапиписей.Отбор.Аккаунт.Установить(Аккаунт);
			
			ЗАпись = НаборЗапиписей.Добавить();
			ЗАпись.Активность = Истина;
			ЗАпись.Аккаунт	  = Аккаунт;
			ЗАпись.Объект	  = Объект;
			ЗАпись.Период	  = ТекДата;
			ЗАпись.Направление= Направление;
			
			Попытка
				НаборЗапиписей.Записать(Истина);	
			Исключение			
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать историю по "+ Объект+ "! Причина:"+ОписаниеОшибки());	
			КонецПопытки;	
		КонецЦикла;

	//
	ИначеЕсли ИмяДока = "МИКО_стЗаписьИсторииЗвонков" Тогда 
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("СсылкаНАОбъект"	,СсылкаНАОбъект);
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИКО_стЗаписьИсторииЗвонков.Ссылка,
			|	МИКО_стЗаписьИсторииЗвонков.Src,
			|	МИКО_стЗаписьИсторииЗвонков.Dst,
			|	МИКО_стЗаписьИсторииЗвонков.recordingfile,
			|	МИКО_стЗаписьИсторииЗвонков.Направление,
			|	МИКО_стЗаписьИсторииЗвонков.Дата
			|ИЗ
			|	Документ.МИКО_стЗаписьИсторииЗвонков КАК МИКО_стЗаписьИсторииЗвонков
			|ГДЕ			
			|	МИКО_стЗаписьИсторииЗвонков.Ссылка  = &СсылкаНАОбъект
			|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТекДата 	= ВыборкаДетальныеЗаписи.Дата;
			Ссылка 		= ВыборкаДетальныеЗаписи.Ссылка;
			Направление = ВыборкаДетальныеЗаписи.Направление;
			Src			= СокрЛП(ВыборкаДетальныеЗаписи.Src);
			Dst			= СокрЛП(ВыборкаДетальныеЗаписи.Dst);
			
			НаборЗапиписей = РегистрыСведений.ИсторияКонтактовСАккаунтом.СоздатьНаборЗаписей();
			НаборЗапиписей.Отбор.Объект.Установить(Ссылка);
			НаборЗапиписей.Очистить();
			
			Если Направление = Перечисления.МИКО_стВидыТелефонныхЗвонков.Исходящий Тогда 
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Код"				,Dst);
				СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,Dst);
				СтруктураПоиска.Вставить("КонтактныйТелефон",Dst);	
				
				Аккаунт = НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина);
			//		
				Если ЗначениеЗаполнено(Аккаунт) Тогда 
					ЗАпись = НаборЗапиписей.Добавить();
					ЗАпись.Активность = Истина;
					ЗАпись.Аккаунт	  = Аккаунт;
					ЗАпись.Объект	  = Ссылка;
					ЗАпись.Период	  = ТекДата;
					ЗАпись.Направление= Перечисления.НаправленияКонтактовАккаунта.Исход;
				КонецЕсли;
				//
					
				
			ИначеЕсли Направление = Перечисления.МИКО_стВидыТелефонныхЗвонков.Входящий Тогда 
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Код"				,Src);
				СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,Src);
				СтруктураПоиска.Вставить("КонтактныйТелефон",Src);	
				
				Аккаунт = НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина);
			//		
				Если ЗначениеЗаполнено(Аккаунт) Тогда 
					ЗАпись = НаборЗапиписей.Добавить();
					ЗАпись.Активность = Истина;
					ЗАпись.Аккаунт	  = Аккаунт;
					ЗАпись.Объект	  = Ссылка;
					ЗАпись.Период	  = ТекДата;
					ЗАпись.Направление= Перечисления.НаправленияКонтактовАккаунта.Вход;
				КонецЕсли;
						
			Иначе 
				
				СтруктураПоиска.Вставить("Код"				,Dst);
				СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,Dst);
				СтруктураПоиска.Вставить("КонтактныйТелефон",Dst);	
				
				Аккаунт = НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина);
			//		
				Если ЗначениеЗаполнено(Аккаунт) Тогда 
					ЗАпись = НаборЗапиписей.Добавить();
					ЗАпись.Активность = Истина;
					ЗАпись.Аккаунт	  = Аккаунт;
					ЗАпись.Объект	  = Ссылка;
					ЗАпись.Период	  = ТекДата;	
					ЗАпись.Направление= Перечисления.НаправленияКонтактовАккаунта.Внутр;
				КонецЕсли;
				
				СтруктураПоиска.Вставить("Код"				,Src);
				СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,Src);
				СтруктураПоиска.Вставить("КонтактныйТелефон",Src);	
				
				Аккаунт = НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина);
			//		
				Если ЗначениеЗаполнено(Аккаунт) Тогда 
					ЗАпись = НаборЗапиписей.Добавить();
					ЗАпись.Активность = Истина;
					ЗАпись.Аккаунт	  = Аккаунт;
					ЗАпись.Объект	  = Ссылка;
					ЗАпись.Период	  = ТекДата;	
					ЗАпись.Направление= Перечисления.НаправленияКонтактовАккаунта.Внутр;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НаборЗапиписей.Количество() > 0 Тогда 
				Попытка
					НаборЗапиписей.Записать(Истина);	
				Исключение			
					ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать историю по "+ Ссылка+ "! Причина:"+ОписаниеОшибки());	
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли  ИмяДока = "СайтПользователиЗапросыИСообщения" Тогда 	 		
		
			Аккаунт = Источник.Пользователь; 
							
			НаборЗапиписей = РегистрыСведений.ИсторияКонтактовСАккаунтом.СоздатьНаборЗаписей();
			НаборЗапиписей.Отбор.Объект.Установить(СсылкаНАОбъект);
			НаборЗапиписей.Отбор.Аккаунт.Установить(Аккаунт);
			
			ЗАпись = НаборЗапиписей.Добавить();
			ЗАпись.Активность 		= Истина;
			ЗАпись.Аккаунт	  		= Аккаунт;
			ЗАпись.Объект	  		= СсылкаНАОбъект;
			ЗАпись.Период	  		= ?(ЗначениеЗаполнено(Источник.Дата),Источник.Дата, ТекущаяДата());
			ЗАпись.Направление	  	= Перечисления.НаправленияКонтактовАккаунта.Вход;
			
			Попытка
				НаборЗапиписей.Записать(Истина);	
			Исключение			
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать историю по "+ ТекПисьмо+ "! Причина:"+ОписаниеОшибки());	
			КонецПопытки;		
			
			//зафиксируем таблицу для обработки менеждером			
			ЗаписатьВходящиеСобытияДляОбработки(СсылкаНАОбъект, Аккаунт,Источник.Дата); 
			
	
	КонецЕсли;
	
	
КонецПроцедуры


Функция НайтиСоздатьАккаунт(СтрукутраПоиска, Контрагент = Неопределено,МассивКИВходящий = Неопределено, СоздаватьНовыйСпр = Ложь, ДопРеквизиты = Неопределено) Экспорт 
	
	
	МассивКИ = Новый Массив;
	Если ТипЗнч(МассивКИВходящий) = Тип("Массив") Тогда 
		Для Каждого ТекСтркоаКИ Из МассивКИВходящий Цикл  
			//ТекСтрока = СокрЛП(ТекСтркоаКИ);
			ТекСтрока	= ПолучитьСтрокуКИБезЛишнихСимволов(ТекСтркоаКИ);
			ТекСтрока	=  ПревестиСтрокуКИКФормату(ТекСтрока);
			Если ЗначениеЗаполнено(ТекСтрока) Тогда 
				МассивКИ.Добавить(ТекСтрока);	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Если СтрукутраПоиска.Количество()  = 0
		и Не ЗначениеЗаполнено(Контрагент)
			Тогда 
		Возврат Справочники.СайтПользователи.ПустаяСсылка();		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		
		ТипыКИ = Новый Массив;
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТипыКИ",ТипыКИ);		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТь(КонтактнаяИнформация.Представление КАК СТРОКА(100)) КАК КИ
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Контрагент
			|	И 	КонтактнаяИнформация.Тип В (&ТипыКИ)
			|";				
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РезультатЗапроса Цикл 
			ТекСтрока 	= ПолучитьСтрокуКИБезЛишнихСимволов(СтрокаТЧ.КИ); 					
			ТекСтрока	= ПревестиСтрокуКИКФормату(ТекСтрока);
			Если ЗначениеЗаполнено(ТекСтрока) Тогда 
				МассивКИ.Добавить(ТекСтрока);	
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	
	Запрос =  Новый Запрос;
	
	ТекстЗапроса = "";
	ТекстУсловия = "";
	Сч= 0;
		
	Запрос.УстановитьПараметр("Контрагент",Контрагент);		
	Запрос.УстановитьПараметр("МассивКИ",МассивКИ);		

	
	//СайтПользователи.Код = &Код
	Для Каждого ТекПоказатель из СтрукутраПоиска Цикл 
		Имя 		= ТекПоказатель.Ключ;
		Значение	= ПолучитьСтрокуКИБезЛишнихСимволов(ТекПоказатель.Значение);
		Значение	= ПревестиСтрокуКИКФормату(Значение);
		
		Если не ЗначениеЗаполнено(Значение) Тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяПараметраЗапроса = "Парам"+Сч; 
		
		Запрос.УстановитьПараметр(ИмяПараметраЗапроса,Значение);		
		
		ТекУсловие  = "Спр."+Имя +" = &"+ИмяПараметраЗапроса;
		
		ТекстУсловия = ТекстУсловия + " ИЛИ "  + ТекУсловие;   
		
		Сч = Сч + 1;
	КонецЦикла;
	
	//Если не ЗначениеЗаполнено(ТекстУсловия) Тогда 
	//	Возврат Справочники.СайтПользователи.ПустаяСсылка();		
	//КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))
	|	ПОМЕСТИТЬ ТАблциаКонтрагетовКИ
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)) В (&МассивКИ)
	|	И КонтактнаяИнформация.Объект Ссылка Справочник.Контрагенты	
	|;
	|
	|ВЫБРАТЬ
	|	СайтПользователиКонтрагенты.Пользователь КАК Аккаунт	
	|ИЗ
	|	РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
	|ГДЕ
	|	(СайтПользователиКонтрагенты.Контрагент = &Контрагент ИЛИ СайтПользователиКонтрагенты.Контрагент В(ВЫБРАТЬ ТАблциаКонтрагетовКИ.Объект ИЗ ТАблциаКонтрагетовКИ КАК ТАблциаКонтрагетовКИ))
	|	И СайтПользователиКонтрагенты.Пользователь <> Значение(Справочник.СайтПользователи.ПустаяСсылка)
	|	И СайтПользователиКонтрагенты.Контрагент <> Значение(Справочник.Контрагенты.ПустаяСсылка)	
	|;
	|
	|ВЫБРАТЬ
	|	Спр.Ссылка КАК Аккаунт
	|ИЗ
	|	Справочник.СайтПользователи КАК Спр
	|ГДЕ
	|	Спр.Код В(&МассивКИ) ИЛИ Спр.ЭлектроннаяПочта В(&МассивКИ) ИЛИ Спр.КонтактныйТелефон В(&МассивКИ) 
	|	"+ТекстУсловия+"
	|
	| ОБЪЕДИНИТЬ 
	|ВЫБРАТЬ                   
	|	СайтПользователиКИ.Ссылка КАК Аккаунт
	|ИЗ
	|	Справочник.СайтПользователи.КИ КАК СайтПользователиКИ
	|ГДЕ
	|	СайтПользователиКИ.ЗначениеКИ В(&МассивКИ) 
	|
	|";
		
	Запрос.Текст = ТекстЗапроса;
	
	МассивРезультатов				= Запрос.ВыполнитьПакет();	
	ТаблицаАккаунтовПоКонтрагентам	= МассивРезультатов[1].Выгрузить();
	ТаблицаАккаунтов 				= МассивРезультатов[2].Выгрузить();	
	
	ТекАккаунт = Неопределено;
	
	Если ТаблицаАккаунтов.Количество() > 0 Тогда 
		ТекАккаунт  = ТаблицаАккаунтов[0].Аккаунт;
		//Сообщить(ТекАккаунт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент)
		и ТаблицаАккаунтовПоКонтрагентам.Количество() >0 Тогда 
		ТекАккаунт  = ТаблицаАккаунтовПоКонтрагентам[0].Аккаунт;	
		//Сообщить(ТекАккаунт);
	КонецЕсли;	
	
	
	//дополним ки, на всякий 
	//Если ЕстьКИВМассиве =  Ложь
		
	ЕстьКИВМассиве = (ТипЗнч(МассивКИ) = Тип("Массив") и МассивКИ.Количество() >0);
	//создавить будем если есть 
	
	Если СтрукутраПоиска.Количество() = 0
		//и нЕ ЗначениеЗаполнено(Контрагент) 
			и НЕ ЕстьКИВМассиве Тогда 
		Возврат Справочники.СайтПользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если СоздаватьНовыйСпр
		и не ЗначениеЗаполнено(ТекАккаунт) Тогда 
		
		МассивСвойств = Новый Массив;
		МассивСвойств.Добавить("Код");
		МассивСвойств.Добавить("Наименование");
		
		МетаданныеСпр = Метаданные.Справочники.СайтПользователи;
		
		ТекАккаунтОбъект = Справочники.СайтПользователи.СоздатьЭлемент();
		
		Для Каждого ТекПоказатель из СтрукутраПоиска Цикл 
			Имя 		= ТекПоказатель.Ключ;
			Значение	= ПолучитьСтрокуКИБезЛишнихСимволов(ТекПоказатель.Значение);
			Значение	= ПревестиСтрокуКИКФормату(Значение);
			
			Если НЕ ЗначениеЗаполнено(Значение) Тогда 
				Продолжить;
			КонецЕсли;
			
					
			
			Если ОбщегоНазначения.ЕстьРеквизитДокумента(Имя,МетаданныеСпр)
				ИЛИ МассивСвойств.Найти(Имя) <> Неопределено Тогда  				
				
				ТекАккаунтОбъект[Имя] = Значение;	
				
			КонецЕсли;
			
		КонецЦикла;	
		
		
		Если ТипЗнч(ДопРеквизиты) = Тип("Структура") Тогда 
			Для Каждого ТекПоказатель из ДопРеквизиты Цикл 
				
				Имя 		= ТекПоказатель.Ключ;
				Значение	= ПолучитьСтрокуКИБезЛишнихСимволов(ТекПоказатель.Значение);
				Значение	= ПревестиСтрокуКИКФормату(Значение);
				
				Если НЕ ЗначениеЗаполнено(Значение) Тогда 
					Продолжить;
				КонецЕсли;
				
				Если ОбщегоНазначения.ЕстьРеквизитДокумента(Имя,МетаданныеСпр)
					ИЛИ МассивСвойств.Найти(Имя) <> Неопределено Тогда  				
					
					ТекАккаунтОбъект[Имя] = Значение;	
					
				КонецЕсли;
			
		КонецЦикла;	
	
		КонецЕсли;
		
		Если ЕстьКИВМассиве Тогда 
			ТекСтрока = МассивКИ[0];				
			Если НЕ ЗначениеЗаполнено(ТекАккаунтОбъект.Код) Тогда 
				ТекАккаунтОбъект.Код = ТекСтрока;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекАккаунтОбъект.Наименование) Тогда 
				ТекАккаунтОбъект.Наименование = ТекСтрока;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекАккаунтОбъект.КонтактныйТелефон) Тогда 
				ТекАккаунтОбъект.КонтактныйТелефон = ТекСтрока;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекАккаунтОбъект.ЭлектроннаяПочта) Тогда 
				ТекАккаунтОбъект.ЭлектроннаяПочта = ТекСтрока;
			КонецЕсли;
			
			//Нужно заполнить Табличную часть
			Для Каждого ТекСтрокаКИ из МассивКИ Цикл  
				ТекЗначениеКИ	= ПолучитьСтрокуКИБезЛишнихСимволов(ТекСтрокаКИ); 
				ТекЗначениеКИ	= ПревестиСтрокуКИКФормату(ТекЗначениеКИ);
				Если Не ЗначениеЗаполнено(ТекЗначениеКИ) Тогда 
					Продолжить;
				КонецЕсли;
				
				//Если есть @ -это почта
				//Если есть 5-ть цифр это телефон
				
				ЭтоТелефон = ЭтоТелефон(ТекЗначениеКИ);				
				
				ЭтоПочта   = ЭтоЕмайл(ТекЗначениеКИ);
				Если НЕ ЭтоТелефон
					и не ЭтоПочта Тогда 
					Продолжить;
				КонецЕсли;
								
				КИ = ТекАккаунтОбъект.КИ;
				СтрокаКИ = КИ.Найти(ТекЗначениеКИ,"ЗначениеКИ");
				Если СтрокаКИ = Неопределено Тогда 
					НоваяСтрокаКИ = КИ.Добавить();
					НоваяСтрокаКИ.ЗначениеКИ = ТекЗначениеКИ;
					НоваяСтрокаКИ.Тип = ?(ЭтоТелефон,Перечисления.ТипыКонтактнойИнформации.Телефон,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		Попытка
			ТекАккаунтОбъект.Комментарий = "Сформирован автоматически!";
			ТекАккаунтОбъект.Записать();
			ТекАккаунт = ТекАккаунтОбъект.Ссылка;
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать Аккаунт(" +ТекАккаунтОбъект.Код +" "+ТекАккаунтОбъект.Наименование + ")! Причина:"+ ОписаниеОшибки());

		КонецПопытки;
		
		//
		
	КонецЕсли;
	
	
	Возврат ТекАккаунт;
КонецФункции

Функция ЭтоТелефон(ТекЗначениеКИ)
	
	СтрокаЧисел = "0123456789";
	
	ДлиннаСтроки = СтрДлина(ТекЗначениеКИ);
	
	КоличествоЦифр = 0;
	
	Для сч = 1 по ДлиннаСтроки Цикл 
		ТекСимвол = Сред(ТекЗначениеКИ,сч-1,1); 
		
		Если Найти(СтрокаЧисел,ТекСимвол) > 0 Тогда 
			КоличествоЦифр = КоличествоЦифр + 1;	
		КонецЕсли;		
	КонецЦикла;
	
	
	Возврат (КоличествоЦифр >= 8);
	
КонецФункции

Функция ЭтоЕмайл(ТекЗначениеКИ)
	
	ЭтоЕмайл = (Найти(ТекЗначениеКИ,"@")>0); 
	Возврат	ЭтоЕмайл; 
КонецФункции

// + 003719 ДДГ 23 ноя 2020
// https://infostart.ru/1c/articles/192489/
Функция ЭтоВалидныйЕмейл(АдресЭлПочты) Экспорт
    // проверка по RFC 5322 Section 3.2.3 (ограниченная)
    // ссылки:
    // http://tools.ietf.org/html/rfc5322
    // http://en.wikipedia.org/wiki/E-mail_address
    
    Адрес=СокрЛП(АдресЭлПочты);
    
    Если ПустаяСтрока(Адрес) Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Адрес1=Адрес;
    Поз=Найти(Адрес,"@");
    Если Поз=0 Тогда
        Возврат Ложь;
    КонецЕсли;
    Пока Поз>0 Цикл
        Поз1=Поз;
        Адрес1=Сред(Адрес1,Поз+1);
        Поз=Найти(Адрес1,"@");
    КонецЦикла;
    
    ДоменнаяЧасть=Адрес1;
    ЛокальнаяЧасть=Лев(Адрес,СтрДлина(Адрес)-СтрДлина(ДоменнаяЧасть)-1);
    
    Если (ПустаяСтрока(ДоменнаяЧасть)) ИЛИ (ПустаяСтрока(ЛокальнаяЧасть)) Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Если (СтрДлина(ЛокальнаяЧасть)>64) ИЛИ (СтрДлина(ДоменнаяЧасть)>253) ИЛИ (СтрДлина(Адрес)>254) Тогда
        // превышена допустимая длина
        Возврат Ложь;
    КонецЕсли;
    
    // проверка локальной части
    
    Разрешенные="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!#$%&'*+-/=?^_`{|}~.";
    
    Если (Лев(ЛокальнаяЧасть,1)=".") ИЛИ (Прав(ЛокальнаяЧасть,1)=".") Тогда
        // точка в начале и в конце запрещена
        Возврат Ложь;
    КонецЕсли;
    
    Поз=Найти(ЛокальнаяЧасть,"..");
    Если Поз>0 Тогда
        // удвоенная точка запрещена
        Возврат 0;
    КонецЕсли;
    
    Для нс=1 По СтрДлина(ЛокальнаяЧасть) Цикл
        Поз=Найти(Разрешенные,Сред(ЛокальнаяЧасть,нс,1));
        Если Поз=0 Тогда
            // встретился недопустимый символ
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    
    // проверка доменной части
    
    Разрешенные="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-.";
    
    Если (Лев(ДоменнаяЧасть,1)=".") ИЛИ (Прав(ДоменнаяЧасть,1)=".") Тогда
        // точка в начале и в конце запрещена
        Возврат Ложь;
    КонецЕсли;
    
    Поз=Найти(ДоменнаяЧасть,"..");
    Если Поз>0 Тогда
        // удвоенная точка запрещена
        Возврат Ложь;
    КонецЕсли;
    
    Для нс=1 По СтрДлина(ДоменнаяЧасть) Цикл
        Поз=Найти(Разрешенные,Сред(ДоменнаяЧасть,нс,1));
        Если Поз=0 Тогда
            // встретился недопустимый символ
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    
    // проверки завершены
    
    Возврат Истина;

КонецФункции
// - 003719 ДДГ 23 ноя 2020

Функция ИспользованиеАккаунтовВДокументах(Знач пДатаДок = Неопределено, Подразделение = Неопределено) Экспорт 
	мТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ОсновноеПодразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь,"ОсновноеПодразделение");
	ТекКонстанта = Константы.НачалоРаботыДокументовПоАккаунтам.Получить();
	
	ТекПодразделение = Справочники.Подразделения.НайтиПоКоду("4");
	пДатаДок = ?(ЗначениеЗаполнено(пДатаДок),пДатаДок, ТекущаяДата());
	
	ИспользованиеАккаунтовВДокументах = (ЗначениеЗаполнено(ТекКонстанта) и пДатаДок >= ТекКонстанта) И ((Подразделение =ТекПодразделение) ИЛИ ОсновноеПодразделение =ТекПодразделение)  ;
	
	
	Возврат ИспользованиеАккаунтовВДокументах;
КонецФункции

Функция АккаунтВерифицирован(Аккаунт) Экспорт 
	
	//АккаунтВерифицирован = Ложь;
	//
	//Если НЕ ЗначениеЗаполнено(Аккаунт) Тогда 
	//	Возврат АккаунтВерифицирован;
	//КонецЕсли;
	//
	//Ки = Аккаунт.КИ;
	//Для Каждого СтрокаКи из Ки Цикл 
	//	Если СтрокаКи.Верифицирован	= Истина Тогда 
	//		АккаунтВерифицирован = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Чернавцев Н.А. по задаче №49227 14.12.21 Начало
	АккаунтВерифицирован = Истина;
	//Чернавцев Н.А. по задаче №49227 14.12.21 Конец

	// + PN3-134 ДДГ  7 ноя 2023
//	АккаунтВерифицирован = РаботаСАккаунтамиСервер.ЛиАккаунтПодтвержден(Аккаунт);
	// - PN3-134 ДДГ  7 ноя 2023

	Возврат АккаунтВерифицирован;

КонецФункции


Процедура ВыполнитьВерификациюКонтакта(Аккаунт, ЗначениеКИ) Экспорт 
	
	
	Если НЕ ЗначениеЗаполнено(Аккаунт) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекАккаунтОбект = Аккаунт.ПолучитьОбъект();
	ТаблКи = ТекАккаунтОбект.КИ;
	
	СтрокаКИ = ТаблКи.Найти(ЗначениеКИ,"ЗначениеКИ");
	Если СтрокаКИ <> Неопределено Тогда 
		СтрокаКИ.Верифицирован = Истина;
	КонецЕсли;
	
	Попытка
		ТекАккаунтОбект.Записать();
	Исключение
		Сообщить("Ошибка записи Аккаунта"+ТекАккаунтОбект.Ссылка + "!");
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьПисьмо(Получатель,ТемаПисьма,ТекстПисьма,ТекстПисьмаHTML, ПисьмоВерификации = Ложь) Экспорт 
	
	Отправитель = Константы.УчетнаяЗаписьРассылкиПисем.Получить(); 
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.УчетнаяЗапись	 = Отправитель;
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	Письмо.Тема 			 = ТемаПисьма;
	Письмо.Дата              = ТекущаяДата();
	Письмо.ЕстьВложения      = Ложь;
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
	Письмо.КодировкаПисьма   = "koi8-r";
	Письмо.ЗаголовокПисьма   = ТемаПисьма;
	Письмо.ОтправительАдресЭлектроннойПочты =  Отправитель;
	Письмо.Кому              = Получатель;
	Письмо.КомуПредставление = Получатель;
	Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
	Письмо.ТекстПисьма       = ТекстПисьма;
	Письмо.ВерификацияПочты  = ПисьмоВерификации;
	Письмо.ПроверитьЗаполнение();
	//
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = Получатель;
	Получатели.Представление 	     = Получатель;
	
	//"<HTML>Просроченна задача "+СтрокаРезультат.Ссылка.Номер+".<BR>Тема задачи:"+СтрокаРезультат.Ссылка.Наименование+"+<BR>Обратите внимание важность выполнения задач в срок!</HTML>";
	Письмо.ТекстПисьма = ТекстПисьмаHTML;
	Письмо.ОтправитьПисьмо();	
	
КонецПроцедуры
#КонецОбласти
// Аккаунты

Процедура АктуализироватьНамиенованиеПоСсылкам(СсылкаНаНаименованиеНоменклатуры, Знач ТекНаименование = "") Экспорт 
	
	
	
	Если Не ЗначениеЗаполнено(СсылкаНаНаименованиеНоменклатуры)  Тогда 
		Возврат;		
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ТекНаименование) Тогда 
		ТекНаименование = СсылкаНаНаименованиеНоменклатуры.Наименование;
	КонецЕсли;
	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("НаименованиеНоменклатуры",СсылкаНаНаименованиеНоменклатуры);	
	Запрос.УстановитьПараметр("Наименование",ТекНаименование);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.НаименованиеНоменклатуры = &НаименованиеНоменклатуры
	               |	И Номенклатура.Наименование <> &Наименование
	               |	И НЕ Номенклатура.ЭтоГруппа
				   |";
	
	
	ВЫборка = Запрос.Выполнить().Выбрать();
	
	Пока ВЫборка.Следующий() цикл
		
		Об = ВЫборка.ССылка.ПолучитьОбъект();
		Об.Наименование			= ТекНаименование;
		об.НаименованиеПолное	= ТекНаименование;
		Попытка
			Об.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось изменить наименование номенклатуры!" + об.Артикул + "! Причина:"+ОписаниеОшибки());
		КонецПопытки;
		//Сообщить("Изменено наименование номенклатуры "+об.Артикул + " "+об.бренд);
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", ТекНаименование);
	Запрос.УстановитьПараметр("НаименованиеНоменклатуры", СсылкаНаНаименованиеНоменклатуры);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СайтГруппыКроссов.Ссылка
		|ИЗ
		|	Справочник.СайтГруппыКроссов КАК СайтГруппыКроссов
		|ГДЕ
		|	СайтГруппыКроссов.НаименованиеНоменклатуры = &НаименованиеНоменклатуры
		|	И СайтГруппыКроссов.Наименование <> &Наименование";
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	КонецЦикла;
	
КонецПроцедуры

Function Ping(IPАдрес)
  objShell = Новый COMОбъект("WScript.Shell") ;
   objScriptExec = objShell.Exec("ping.exe -n 1 " + IPАдрес) ;
   strPingResults = НРег(objScriptExec.StdOut.ReadAll());
   Возврат   Найти(strPingResults, "ttl=");
EndFunction

//Функция ИзвлечьСвойствоИзСтруктуры(ДанныеДоступаАПИ, ИмяПоля)
//	
//	Возврат ДанныеДоступаАПИ.ИмяПоля;
//	
//КонецФункции

#Область ФискальныйРегистратор
Процедура ОбработатьОчередьФР() Экспорт
	
	ОбработкаСсылка = Константы.ОбработкаОбработкаОчереди.Получить();
	Если ЗначениеЗаполнено(ОбработкаСсылка) Тогда 
		ИмяФайла = ПолучитьИмяВременногоФайла(".epf");
		ДвоичныеДанные = ОбработкаСсылка.ХранилищеВнешнейОбработки.Получить();
		ДвоичныеДанные.Записать(ИмяФайла);
		
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла,Ложь);
		ВнешняяОбработка.Дата  = ТекущаяДата();
		//
		ВнешняяОбработка.ОбработатьОчередьФР();				
		
		УдалитьФайлы(ИмяФайла);					
	КонецЕсли;	
	
КонецПроцедуры

// + IS 21.01.2021
Функция ФРДоступен(КассаККМ) Экспорт 
	ДоступенФР = Ложь;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда 
		
		ИП  = СокрЛП(КассаККМ.IP);
		
		ответ = ping(ИП);
		ДоступенФР =?(ответ >0 ,Истина,Ложь);		
		
	КонецЕсли;
	
	Возврат ДоступенФР;
	
КонецФункции
// - IS 21.01.2021

// + IS 21.01.2021
Функция БазаФРДоступна() Экспорт 
	//Прокси = ПолучитьПроксиФР();
	//БазаДоступна = Ложь;
	//Если Прокси<> Неопределено Тогда 
	//	 БазаДоступна = Прокси.Пинг();
	//КонецЕсли;
	//
	//Возврат БазаДоступна;
	
	СтрокаАвторизации = ПолучитьBase64СтрокуИзДвоичныхДанных(
ПолучитьДвоичныеДанныеИзСтроки(
"1:",КодировкаТекста.UTF8,Ложь));

Заголовки = Новый Соответствие;
Заголовки.Вставить("Content-Type", "application/json; charset=utf-8"); 
Заголовки.Вставить("Authorization", "Basic "+СтрокаАвторизации); 
	Соединение = Новый HTTPСоединение(
        "192.168.1.36", // сервер (хост)
        80, // порт, по умолчанию для http используется 80, для https 443
        , 1
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
          // защищенное соединение, если используется https
    );
 
    // Получаем текст корневой страницы через GET-запрос.
    Запрос = Новый HTTPЗапрос("basefr/hs/service/ping",Заголовки);
    // Если бы нужна была другая страница, мы бы указали,
    // например, "/about" или "/news".
	
	Результат = Соединение.Получить(Запрос);
	
	Возврат Результат.КодСостояния = 200;
	

	
КонецФункции

Функция ПолучитьМассивИДПОКассеККМ(КассаККМ) Экспорт 
	
	Если Не ЗначениеЗаполнено(КассаККМ) Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговоеОборудование.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
		|ГДЕ
		|	ТорговоеОборудование.КассаККМ = &КассаККМ
		|";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	ТаблицаОборудования = Запрос.Выполнить().Выгрузить();
	МассивИД = ТаблицаОборудования.ВыгрузитьКолонку("Идентификатор");
	
	
	Возврат МассивИД;
	
КонецФункции

Функция ПолучитьПроксиФР() Экспорт

	Адрес 		 = Константы.АдресWSФР.Получить();
	Пользователь = Константы.ПользовательWSФР.Получить();
	Пароль 		 = Константы.ПарольWSФР.Получить();
	Путь		 = Константы.ПутьWSФР.Получить();

	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		Сообщить("Не заполнен адрес подключения к базе ФР");
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Путь) Тогда
		//Путь = "tralmobxcg";
		Адрес = Адрес + "/ws/mobile.1cws?wsdl";
	Иначе
		Адрес = Адрес + "/" + Путь + "/ws/mobile.1cws?wsdl";
	КонецЕсли;
	
	Попытка
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль);

		Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SB/MobileExchange", "MobileExchange", "MobileExchangeSoap");
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль = Пароль;

//	Попытка
//		SSL = Новый ЗащищенноеСоединениеOpenSSL();
//		Адрес = Адрес + "/ws/mobile.1cws?wsdl";
//		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль,,,SSL);

//		Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SB/MobileExchange", "MobileExchange", "MobileExchangeSoap",,,SSL);
//		Прокси.Пользователь = Пользователь;
//		Прокси.Пароль = Пароль;
//	Исключение
//		Сообщить("Не удалось установить WS-соединение со стационарной базой.
//		|Проверьте параметры покдлючения."+?(ЗначениеЗаполнено(Склад),"("+Склад+")",""));
//		Возврат Неопределено;
//	КонецПопытки;

		Возврат Прокси;
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("ОШИБКА ПОДКЛЮЧЕНИЯ К Базе ФР! Причина: "+ОписаниеОшибки());
		Возврат Неопределено;		
	КонецПопытки;

КонецФункции
// - IS 21.01.2021

// + IvanSidoruk 28.06.2019
Процедура УведомитьООстановкеОбработкеОчереди() Экспорт
	
	
	ВремяПростояДляОтправкиУведомленийВМинутах	= Константы.ВремяПростояДляОтправкиУведомленийВМинутах.Получить();
	ЕмейлДляУведомленийПоФР 					= Константы.ЕмейлДляУведомленийПоФР.Получить(); 
	
	Если НЕ ЗначениеЗаполнено(ЕмейлДляУведомленийПоФР) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВремяПростояДляОтправкиУведомленийВМинутах) Тогда 
		ВремяПростояДляОтправкиУведомленийВМинутах = 5;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МинутПростоя", ВремяПростояДляОтправкиУведомленийВМинутах);
	Запрос.УстановитьПараметр("СЕГОДНЯ", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОперацийФР.ОперацияФР,
		|	ОчередьОперацийФР.Период,
		|	ОчередьОперацийФР.ИДУстройства,
		|	ОчередьОперацийФР.НомерЧека,
		|	ОчередьОперацийФР.Документ,
		|	ОчередьОперацийФР.Сумма,
		|	ОчередьОперацийФР.гуидВнесениеИзъятие,
		|	ОчередьОперацийФР.ТекстОшибки
		|ИЗ
		|	РегистрСведений.ОчередьОперацийФР КАК ОчередьОперацийФР
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ОчередьОперацийФР.Период, ДЕНЬ) = &СЕГОДНЯ
		|	И НЕ ОчередьОперацийФР.ОбработанФР
		|	И РАЗНОСТЬДАТ(ОчередьОперацийФР.Период, &ТекущееВремя, МИНУТА) >= &МинутПростоя";
	
	ТАблицаПростоя = Запрос.Выполнить().Выгрузить();	
	
	Если ТАблицаПростоя.Количество() > 0 Тогда 
		
		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("robot@7detalei.ru");
		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
		Письмо.Тема 			 = "ФР";
		Письмо.Дата              = ТекущаяДата();
		Письмо.ЕстьВложения      = Ложь;
		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
		Письмо.КодировкаПисьма   = "koi8-r";
		Письмо.ЗаголовокПисьма   = "ФР "+ТекущаяДата();
		Письмо.ОтправительАдресЭлектроннойПочты =  "robot@7detalei.ru";
		Письмо.Кому              = ЕмейлДляУведомленийПоФР;
		Письмо.КомуПредставление = ЕмейлДляУведомленийПоФР;
		Письмо.ОтправительИмя    = """7detalei.ru""";
		Письмо.ТекстПисьма       = "Ваш резерв аннулирован. Интернет-магазин ""7detalei.ru""";
		Письмо.ПроверитьЗаполнение();
		//
		Получатели = Письмо.КомуТЧ.Добавить();
		Получатели.АдресЭлектроннойПочты = ЕмейлДляУведомленийПоФР;
		Получатели.Представление 	     = ЕмейлДляУведомленийПоФР;
		
	
		Письмо.Записать();
		
	   ТекстПисьма ="";
	   
	   Для Каждого СтрокаПростоя из ТАблицаПростоя Цикл 
		   ТекСтрока = "ОПИСАНИЕ ОШИБКИ:"+СокрЛП(СтрокаПростоя.ТекстОшибки)+". Операция:"+СтрокаПростоя.ОперацияФР + ". Период:"+СтрокаПростоя.Период +". ИДУстройства:"+СтрокаПростоя.ИДУстройства+". Документ:"+СтрокаПростоя.Документ+". гуидВнесениеИзъятие:"+СтрокаПростоя.гуидВнесениеИзъятие+". Сумма:"+СтрокаПростоя.Сумма ;		   
		   
		   ТекстПисьма = ТекстПисьма + ?(ЗначениеЗаполнено(ТекстПисьма),Символы.ПС,"") + ТекСтрока;
		   
	   КонецЦикла;
	
		Письмо.ТекстПисьма = ТекстПисьма;
		Письмо.ОтправитьПисьмо();

		
		
	КонецЕсли;
	
	
КонецПроцедуры
//  IvanSidoruk 28.06.2019
#КонецОбласти


#Область РаботаСоСтроками
Функция УдалитьНеЦифрыИзСтроки(Знач СтрокаОбработки) Экспорт
	
	Если ТипЗнч(СтрокаОбработки) <> Тип("Строка") Тогда
		СтрокаОбработки = Строка( СтрокаОбработки);
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаОбработки) Тогда
		Возврат "";
	КонецЕсли; 
	
	РезультирующаяСтрока = "";
	Для Сч = 1 По СтрДлина(СтрокаОбработки) Цикл
		ТекСимвол =  Сред(СтрокаОбработки, Сч, 1);
		КодСимвола = КодСимвола(ТекСимвол);
		Если КодСимвола >= 48 И КодСимвола <= 57 Тогда
			РезультирующаяСтрока = РезультирующаяСтрока + ТекСимвол;
		КонецЕсли; 
	КонецЦикла; 

	Возврат РезультирующаяСтрока;
	
КонецФункции

Функция ЗашифроватьСтроку(ВходящаяСтрока,Кодировка) Экспорт 
	
	КодировкаФайла = Кодировка;
    
    Если Кодировка = "ANSI" Тогда
        КодировкаФайла = КодировкаТекста.ANSI;
        
    ИначеЕсли Кодировка = "OEM" Тогда
        КодировкаФайла = КодировкаТекста.OEM;
        
    ИначеЕсли Кодировка = "UTF8" Тогда
        КодировкаФайла = КодировкаТекста.UTF8;
        
    ИначеЕсли Кодировка = "UTF16" Тогда
        КодировкаФайла = КодировкаТекста.UTF16;
        
    ИначеЕсли Кодировка = "Системная" Тогда
        КодировкаФайла = КодировкаТекста.Системная;
    
    КонецЕсли;
    ВременныйФайл = ПолучитьИмяВременногоФайла();
    
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаФайла);
    Запись.ЗаписатьСтроку(ВходящаяСтрока,"");
    Запись.Закрыть();
    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    СтрокаРезультат = Base64Строка(ДвДанные);
    
    УдалитьФайлы(ВременныйФайл);
	
	Возврат СтрокаРезультат;
	
КонецФункции

// + IvanSidoruk 15.04.2019
Функция ЕстьКириллицаВСтроке(Знач СтрокаПроверки) Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	КодыДопустимыхСимволов.Добавить(1105); // "ё"
	КодыДопустимыхСимволов.Добавить(1025); // "Ё"
	
	//Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
	//	КодыДопустимыхСимволов.Добавить(КодСимвола(Сред(ДопустимыеСимволы, Индекс, 1)));
	//КонецЦикла;
	
	ЕстьКириллица = Ложь;
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		Если ((КодСимвола < 1040) Или (КодСимвола > 1103)) Тогда  
			Продолжить;
		Иначе 
			ЕстьКириллица =Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьКириллица;
	
КонецФункции
// - IvanSidoruk 15.04.2019

// + IvanSidoruk 15.04.2019
Функция ЗаменитьРаскладку(знач Имя, знакПробела = Неопределено, знакСлеша = Неопределено, вНижнийРегистр = Истина) Экспорт
	
	Рез = Имя;
	//Если убиратьСпецСимволы Тогда
	//	Рез = ЗетаWEBРедактирHTML.RegExp_ЗаменитьВхождения("[^a-zA-Z0-9а-яА-Я /_-]", Имя, "");
	//КонецЕсли;
	
	//НаправлениеРУ_АНГ = ЕстьКириллицаВСтроке;
	//Если есть хотябы 1-н русский сивол - прообразовываем в Анг
	
	
	
	Рез = СокрЛП(Рез); 
	
	ИсходнаяСтрока = СокрЛП(Рез); 
	
	
	//заменим русские буквы на латинцицу
	Рез = СтрЗаменить(Рез,"а","f");
	Рез = СтрЗаменить(Рез,"б",",");
	Рез = СтрЗаменить(Рез,"в","d");
	Рез = СтрЗаменить(Рез,"г","u");
	Рез = СтрЗаменить(Рез,"д","l");
	Рез = СтрЗаменить(Рез,"е","t");
	Рез = СтрЗаменить(Рез,"ё","`");
	Рез = СтрЗаменить(Рез,"ж",";");
	Рез = СтрЗаменить(Рез,"з","p");
	Рез = СтрЗаменить(Рез,"и","b");
	Рез = СтрЗаменить(Рез,"й","q");
	Рез = СтрЗаменить(Рез,"к","r");
	Рез = СтрЗаменить(Рез,"л","k");
	Рез = СтрЗаменить(Рез,"м","v");
	Рез = СтрЗаменить(Рез,"н","y");
	Рез = СтрЗаменить(Рез,"о","j");
	Рез = СтрЗаменить(Рез,"п","g");
	Рез = СтрЗаменить(Рез,"р","h");
	Рез = СтрЗаменить(Рез,"с","c");
	Рез = СтрЗаменить(Рез,"т","n");
	Рез = СтрЗаменить(Рез,"у","e");
	Рез = СтрЗаменить(Рез,"ф","a");
	Рез = СтрЗаменить(Рез,"х","[");
	Рез = СтрЗаменить(Рез,"ц","w");
	Рез = СтрЗаменить(Рез,"ч","x");
	Рез = СтрЗаменить(Рез,"ш","i");
	Рез = СтрЗаменить(Рез,"щ","o");
	Рез = СтрЗаменить(Рез,"ь","m");
	Рез = СтрЗаменить(Рез,"ы","s");
	Рез = СтрЗаменить(Рез,"ъ","]");
	Рез = СтрЗаменить(Рез,"э","'");
	Рез = СтрЗаменить(Рез,"ю",".");	
	Рез = СтрЗаменить(Рез,"я","z");
	Рез = СтрЗаменить(Рез,"А","F");
	Рез = СтрЗаменить(Рез,"Б","<");
	Рез = СтрЗаменить(Рез,"В","D");
	Рез = СтрЗаменить(Рез,"Г","U");
	Рез = СтрЗаменить(Рез,"Д","L");
	Рез = СтрЗаменить(Рез,"Е","T");
	Рез = СтрЗаменить(Рез,"Ё","~");
	Рез = СтрЗаменить(Рез,"Ж",":");
	Рез = СтрЗаменить(Рез,"З","P");
	Рез = СтрЗаменить(Рез,"И","B");
	Рез = СтрЗаменить(Рез,"Й","~");
	Рез = СтрЗаменить(Рез,"К","R");
	Рез = СтрЗаменить(Рез,"Л","K");
	Рез = СтрЗаменить(Рез,"М","V");
	Рез = СтрЗаменить(Рез,"Н","Y");
	Рез = СтрЗаменить(Рез,"О","J");
	Рез = СтрЗаменить(Рез,"П","G");
	Рез = СтрЗаменить(Рез,"Р","P");
	Рез = СтрЗаменить(Рез,"С","C");
	Рез = СтрЗаменить(Рез,"Т","N");
	Рез = СтрЗаменить(Рез,"У","E");
	Рез = СтрЗаменить(Рез,"Ф","A");
	Рез = СтрЗаменить(Рез,"Х","{");
	Рез = СтрЗаменить(Рез,"Ц","W");
	Рез = СтрЗаменить(Рез,"Ч","X");
	Рез = СтрЗаменить(Рез,"Ш","I");
	Рез = СтрЗаменить(Рез,"Щ","O");
	Рез = СтрЗаменить(Рез,"Ь","M");
	Рез = СтрЗаменить(Рез,"Ы","S");
	Рез = СтрЗаменить(Рез,"Ъ","}");	
	Рез = СтрЗаменить(Рез,"Э","""");
	Рез = СтрЗаменить(Рез,"Ю",">");
	Рез = СтрЗаменить(Рез,"Я","Z");
	
	Рез1= ИсходнаяСтрока;
	//мы заменили 
	//В Рез - заменили все русский на английские
	Рез1 = СтрЗаменить(Рез1,"f","а");
	Рез1 = СтрЗаменить(Рез1,",","б");
	Рез1 = СтрЗаменить(Рез1,"d","в");
	Рез1 = СтрЗаменить(Рез1,"u","г");
	Рез1 = СтрЗаменить(Рез1,"l","д");
	Рез1 = СтрЗаменить(Рез1,"t","е");
	Рез1 = СтрЗаменить(Рез1,"`","ё");
	Рез1 = СтрЗаменить(Рез1,";","ж");
	Рез1 = СтрЗаменить(Рез1,"p","з");
	Рез1 = СтрЗаменить(Рез1,"b","и");
	Рез1 = СтрЗаменить(Рез1,"q","й");
	Рез1 = СтрЗаменить(Рез1,"r","к");
	Рез1 = СтрЗаменить(Рез1,"k","л");
	Рез1 = СтрЗаменить(Рез1,"v","м");
	Рез1 = СтрЗаменить(Рез1,"y","н");
	Рез1 = СтрЗаменить(Рез1,"j","о");
	Рез1 = СтрЗаменить(Рез1,"g","п");
	Рез1 = СтрЗаменить(Рез1,"h","р");
	Рез1 = СтрЗаменить(Рез1,"c","с");
	Рез1 = СтрЗаменить(Рез1,"n","т");
	Рез1 = СтрЗаменить(Рез1,"e","у");
	Рез1 = СтрЗаменить(Рез1,"a","ф");
	Рез1 = СтрЗаменить(Рез1,"[","х");
	Рез1 = СтрЗаменить(Рез1,"w","ц");
	Рез1 = СтрЗаменить(Рез1,"x","ч");
	Рез1 = СтрЗаменить(Рез1,"i","ш");
	Рез1 = СтрЗаменить(Рез1,"o","щ");
	Рез1 = СтрЗаменить(Рез1,"m","ь");
	Рез1 = СтрЗаменить(Рез1,"s","ы");
	Рез1 = СтрЗаменить(Рез1,"]","ъ");
	Рез1 = СтрЗаменить(Рез1,"'","э");
	Рез1 = СтрЗаменить(Рез1,".","ю");	
	Рез1 = СтрЗаменить(Рез1,"z","я");
	Рез1 = СтрЗаменить(Рез1,"F","А");
	Рез1 = СтрЗаменить(Рез1,"<","Б");
	Рез1 = СтрЗаменить(Рез1,"D","В");
	Рез1 = СтрЗаменить(Рез1,"U","Г");
	Рез1 = СтрЗаменить(Рез1,"L","Д");
	Рез1 = СтрЗаменить(Рез1,"T","Е");
	Рез1 = СтрЗаменить(Рез1,"~","Ё");
	Рез1 = СтрЗаменить(Рез1,":","Ж");
	Рез1 = СтрЗаменить(Рез1,"P","З");
	Рез1 = СтрЗаменить(Рез1,"B","И");
	Рез1 = СтрЗаменить(Рез1,"~","Й");
	Рез1 = СтрЗаменить(Рез1,"R","К");
	Рез1 = СтрЗаменить(Рез1,"K","Л");
	Рез1 = СтрЗаменить(Рез1,"V","М");
	Рез1 = СтрЗаменить(Рез1,"Y","Н"); 
	Рез1 = СтрЗаменить(Рез1,"J","О");
	Рез1 = СтрЗаменить(Рез1,"G","П");
	Рез1 = СтрЗаменить(Рез1,"Р","З");
	Рез1 = СтрЗаменить(Рез1,"C","С");
	Рез1 = СтрЗаменить(Рез1,"N","Т");
	Рез1 = СтрЗаменить(Рез1,"E","У");
	Рез1 = СтрЗаменить(Рез1,"A","Ф");
	Рез1 = СтрЗаменить(Рез1,"{","Х");
	Рез1 = СтрЗаменить(Рез1,"W","Ц");
	Рез1 = СтрЗаменить(Рез1,"X","Ч");
	Рез1 = СтрЗаменить(Рез1,"I","Ш");
	Рез1 = СтрЗаменить(Рез1,"O","Щ");
	Рез1 = СтрЗаменить(Рез1,"M","Ь");
	Рез1 = СтрЗаменить(Рез1,"S","Ы");
	Рез1 = СтрЗаменить(Рез1,"}","Ъ");	
	Рез1 = СтрЗаменить(Рез1,"""","Э");
	Рез1 = СтрЗаменить(Рез1,">","Ю");
	Рез1 = СтрЗаменить(Рез1,"Z","Я");

	СтрДлинна = СтрДлина(ИсходнаяСтрока);
	
	//сравним символы с исходной строкой и построим новую
	СтрокаРЕзультат = "";
	Для Сч = 1 по СтрДлинна Цикл 
		СимволИсходный = Сред(ИсходнаяСтрока,Сч,1);
		Символ0 = Сред(Рез,Сч,1);
		Символ1 = Сред(Рез1,Сч,1);
		
		Если СимволИсходный <> Символ0 Тогда 
			СтрокаРЕзультат = СтрокаРЕзультат + Символ0; 
			Продолжить;
		КонецЕсли;
		
		Если СимволИсходный <> Символ1 Тогда 
			СтрокаРЕзультат = СтрокаРЕзультат + Символ1; 
			Продолжить;
		КонецЕсли;

		СтрокаРЕзультат = СтрокаРЕзультат + СимволИсходный; 
		
	КонецЦикла;
	
	
	Возврат (СтрокаРЕзультат);
КонецФункции
// - IvanSidoruk 15.04.2019

Функция ПолучитьСтрокуКИБезЛишнихСимволов(ВходящаяСтркоа) Экспорт 
	
	ТекСтрокаЗначение = СокрЛП(ВходящаяСтркоа);
	ТекСтрокаЗначение = СтрЗаменить(ТекСтрокаЗначение,"+","");
	ТекСтрокаЗначение = СтрЗаменить(ТекСтрокаЗначение,"(","");
	ТекСтрокаЗначение = СтрЗаменить(ТекСтрокаЗначение,")","");	
	ТекСтрокаЗначение = СтрЗаменить(ТекСтрокаЗначение," ","");	
	ТекСтрокаЗначение = СтрЗаменить(ТекСтрокаЗначение,Символы.НПП,"");	
	
	Возврат ТекСтрокаЗначение;
	
КонецФункции

Функция ПревестиСтрокуКИКФормату(Знач ТекЗначениеКИ, Тип = 0, ИгнорироватьТип = Ложь) Экспорт 
	
	ЭтоТелефон = (ЭтоТелефон(ТекЗначениеКИ) и ((ЗначениеЗаполнено(Тип) и Тип = Перечисления.ТипыКонтактнойИнформации.Телефон) ИЛИ ИгнорироватьТип = Истина) );
	Если ЭтоТелефон =  Истина Тогда 
		
		ТекЗначениеКИ = СтрЗаменить(ТекЗначениеКИ,"+","");
		
		ЛевыйСивол = Лев(ТекЗначениеКИ,1);	
		
		
		//пропускаем телефонны начинающиеся на 3
		Если ЛевыйСивол = "3" Тогда 
			ТекЗначениеКИ = ТекЗначениеКИ;		
		ИначеЕсли  ЛевыйСивол <> "7" Тогда 
			ТекЗначениеКИ = "7"+ТекЗначениеКИ;	
		КонецЕсли;		
		
		ТекЗначениеКИ = "+"+ТекЗначениеКИ;
		
	КонецЕсли;

	Возврат ТекЗначениеКИ;
	
КонецФункции

// + ДДГ
Функция ОчиститьНомерТелефона(Знач СтрокаНомера) Экспорт

	Очищенный = СтрокаНомера;

	Очищенный = СтрЗаменить(Очищенный, " ", "");
	Очищенный = СтрЗаменить(Очищенный, Символы.НПП, "");
	Очищенный = СтрЗаменить(Очищенный, Символы.Таб, "");
	Очищенный = СтрЗаменить(Очищенный, "(", "");
	Очищенный = СтрЗаменить(Очищенный, ")", "");
	Очищенный = СтрЗаменить(Очищенный, "-", "");
	Очищенный = СтрЗаменить(Очищенный, "+", "");

	Возврат Очищенный;

КонецФункции

Функция ОптимизироватьПробелы(Знач ВходнаяСтрока, УбратьЛП = Ложь, ЗаменитьТаб = Ложь, ЗаменитьНПП = Ложь, ЗаменитьПС = Ложь) Экспорт

	Очищенный = ВходнаяСтрока;

	Если УбратьЛП Тогда
		Очищенный = СокрЛП(Очищенный);
	КонецЕсли;

	Если ЗаменитьТаб Тогда
		Очищенный = СтрЗаменить(Очищенный, Символы.Таб, " ");
	КонецЕсли;

	Если ЗаменитьНПП Тогда
		Очищенный = СтрЗаменить(Очищенный, Символы.НПП, " ");
	КонецЕсли;

	Если ЗаменитьПС Тогда
		Очищенный = СтрЗаменить(Очищенный, Символы.ПС, " ");
		Очищенный = СтрЗаменить(Очищенный, Символы.ВК, " ");
	КонецЕсли;

	ДлинаСтроки = СтрДлина(Очищенный);

	Пока Истина Цикл

		ОчищенныйОтПробелов = СтрЗаменить(Очищенный, "  ", " ");

		ДлинаОчищенного = СтрДлина(ОчищенныйОтПробелов);

		Если ДлинаСтроки = ДлинаОчищенного Тогда
			Прервать;
		КонецЕсли;

		Очищенный   = ОчищенныйОтПробелов;
		ДлинаСтроки = ДлинаОчищенного;

	КонецЦикла;

	Возврат Очищенный;

КонецФункции

Функция ЭтоСимволРусскогоАлфавита(Знач Символ) Экспорт

	КодТекСимв	= КодСимвола(Символ);

	ЛимитПервойБуквы		= КодСимвола("А") - 1;
	ЛимитПоследнейБуквы		= КодСимвола("я") + 1;

	КодБуквыЁ_ЗАГЛ	= КодСимвола("Ё");
	КодБуквыЁ_строч	= КодСимвола("ё");

	Результат
		= (КодТекСимв > ЛимитПервойБуквы
			И КодТекСимв < ЛимитПоследнейБуквы)
		ИЛИ КодТекСимв = КодБуквыЁ_ЗАГЛ
		ИЛИ КодТекСимв = КодБуквыЁ_строч
	;

	Возврат Результат;

КонецФункции

Функция ЭтоСловоИзБуквРусскогоАлфавита(Знач ВходнаяСтрока) Экспорт

	Результат = Ложь;

	ДлинаСтроки = СтрДлина(ВходнаяСтрока);

	Если ДлинаСтроки < 1 Тогда
		Возврат Результат;
	КонецЕсли;

	ЛимитПервойБуквы		= КодСимвола("А") - 1;
	ЛимитПоследнейБуквы		= КодСимвола("я") + 1;

	КодБуквыЁ_ЗАГЛ	= КодСимвола("Ё");
	КодБуквыЁ_строч	= КодСимвола("ё");

	Для ИДХ = 1 По ДлинаСтроки Цикл

		ТекСимв		= Сред(ВходнаяСтрока, ИДХ, 1);
		КодТекСимв	= КодСимвола(ТекСимв);

		Результат
			= (КодТекСимв > ЛимитПервойБуквы
				И КодТекСимв < ЛимитПоследнейБуквы)
			ИЛИ КодТекСимв = КодБуквыЁ_ЗАГЛ
			ИЛИ КодТекСимв = КодБуквыЁ_строч
		;

		Если НЕ Результат Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// возвращает 0 если нельзя преобразовать
Функция ПреобразоватьСтрокуВЧисло(Знач ВходнаяСтрока, Очищать = Ложь, МаксДлинаЧисла = 0, МаксДлинаСтроки = 0) Экспорт

	Результат = 0;

	Очищенный = ВходнаяСтрока;

	//

	Если МаксДлинаСтроки > 0 Тогда

		ДлинаСтроки = СтрДлина(Очищенный);

		Если ДлинаСтроки > МаксДлинаСтроки Тогда
			Возврат Результат;
		КонецЕсли;

	КонецЕсли;

	//

	Если Очищать Тогда
		Очищенный = СтрЗаменить(Очищенный, " ", "");
		Очищенный = СтрЗаменить(Очищенный, Символы.НПП, "");
		Очищенный = СтрЗаменить(Очищенный, Символы.Таб, "");
	КонецЕсли;

	//

	Если МаксДлинаЧисла > 0 Тогда

		ДлинаСтроки = СтрДлина(Очищенный);

		Если ДлинаСтроки > МаксДлинаЧисла Тогда
			Возврат Результат;
		КонецЕсли;

	КонецЕсли;

	//

	Попытка
		Результат = Число(Очищенный);
	Исключение
	КонецПопытки;

	//

	Возврат Результат;

КонецФункции

// возвращает форматированную строку
Функция ВыделитьПодстрокуСтроки(
	  Представление
	, СтрокаВыделения
	, ШрифтПодсветки = Неопределено
	, ЦветПодсветки  = Неопределено
	, ТолькоПервоеВхождение = Ложь
) Экспорт

	МассивРезультата = Новый Массив;

	НРегПредставление	= НРег(Представление);
	НРегВыделения		= НРег(СтрокаВыделения);

	ДлинаПредставления	= СтрДлина(НРегПредставление);
	ДлинаВыделения		= СтрДлина(НРегВыделения);

		Если ШрифтПодсветки = Неопределено Тогда
			ШрифтПодсветки = Новый Шрифт(, , Истина);
		КонецЕсли;

		Если ЦветПодсветки = Неопределено Тогда
			ЦветПодсветки = Новый Цвет(230, 20, 20);
		КонецЕсли;

	Пока Истина Цикл

		Позиция = Найти(НРегПредставление, НРегВыделения);

		Если Позиция < 1 Тогда

			МассивРезультата.Добавить(Новый ФорматированнаяСтрока(Представление));

			Прервать;

		ИначеЕсли Позиция = 1 Тогда	// выделение в начале строки

			Если ДлинаПредставления = ДлинаВыделения Тогда

				МассивРезультата.Добавить(Новый ФорматированнаяСтрока(Представление, ШрифтПодсветки, ЦветПодсветки));

				Прервать;

			Иначе

				ВыделеннаяЧасть	= Лев(Представление, ДлинаВыделения);
				Выделение		= Новый ФорматированнаяСтрока(ВыделеннаяЧасть, ШрифтПодсветки, ЦветПодсветки);

				ОстальнаяЧасть	= Прав(Представление, ДлинаПредставления - ДлинаВыделения);
				Остальное		= Новый ФорматированнаяСтрока(ОстальнаяЧасть);

				МассивРезультата.Добавить(Выделение);
//				МассивРезультата.Добавить(Остальное);

				Представление		= Остальное;

			КонецЕсли;

		ИначеЕсли (Позиция + ДлинаВыделения) > ДлинаПредставления Тогда	// выделение в конце строки

			ВыделеннаяЧасть	= Прав(Представление, ДлинаВыделения);
			Выделение		= Новый ФорматированнаяСтрока(ВыделеннаяЧасть, ШрифтПодсветки, ЦветПодсветки);

			ОстальнаяЧасть	= Лев(Представление, ДлинаПредставления - ДлинаВыделения);
			Остальное		= Новый ФорматированнаяСтрока(ОстальнаяЧасть);

			МассивРезультата.Добавить(Остальное);
			МассивРезультата.Добавить(Выделение);

			Прервать;

		Иначе 	// выделение в середине строки

			ВыделеннаяЧасть		= Сред(Представление, Позиция, ДлинаВыделения);
			Выделение			= Новый ФорматированнаяСтрока(ВыделеннаяЧасть, ШрифтПодсветки, ЦветПодсветки);

			ЧастьДоВыделения	= Лев(Представление, Позиция - 1);
			ДоВыделения			= Новый ФорматированнаяСтрока(ЧастьДоВыделения);

			ЧастьПослеВыделения	= Прав(Представление, ДлинаПредставления - Позиция - ДлинаВыделения + 1);
			ПослеВыделения		= Новый ФорматированнаяСтрока(ЧастьПослеВыделения);

			МассивРезультата.Добавить(ДоВыделения);
			МассивРезультата.Добавить(Выделение);
//			МассивРезультата.Добавить(ПослеВыделения);

			Представление		= ПослеВыделения;

		КонецЕсли;

		Если ТолькоПервоеВхождение Тогда
			МассивРезультата.Добавить(Представление);
			Прервать;
		КонецЕсли;

		НРегПредставление	= НРег(Представление);
		ДлинаПредставления	= СтрДлина(НРегПредставление);

	КонецЦикла;

	Результат = Новый ФорматированнаяСтрока(МассивРезультата);

	Возврат Результат;

КонецФункции

Функция ДополнитьКонечнымСлэшем(ВходнаяСтрока, ВиндовыйСлэш = Истина) Экспорт

	СтрокаРезультат = ВходнаяСтрока;

	СимволСлэша = ?(ВиндовыйСлэш, "\", "/");

	ДлинаСтроки = СтрДлина(СтрокаРезультат);

	Если ДлинаСтроки < 1 Тогда
		Возврат СтрокаРезультат;
	КонецЕсли;

	ПоследнийСимвол = Прав(СтрокаРезультат, 1);

	Если ПоследнийСимвол = "\" ИЛИ ПоследнийСимвол = "/" Тогда
		Возврат СтрокаРезультат;
	КонецЕсли;

	СтрокаРезультат = СтрокаРезультат + СимволСлэша;

	Возврат СтрокаРезультат;

КонецФункции

Функция Между(Значение, НаименьшееЗначение, НаибольшееЗначение) Экспорт
	Возврат Значение >= НаименьшееЗначение И Значение <= НаибольшееЗначение;
КонецФункции

Функция ИзвлечьИзСтрокиТолькоБуквыЦифры(
	  Знач ВходнаяСтрока
	, Знач ТолькоЛатиница	= Ложь
	, Знач РазрешитьПробелы	= Ложь
	, Знач РазрешитьДефисы	= Ложь
) Экспорт

	Если Не ЗначениеЗаполнено(ВходнаяСтрока) Тогда
		Возврат "";
	КонецЕсли;

	КодПервойЦифры		= КодСимвола("0");
	КодПоследнейЦифры	= КодСимвола("9");

	КодПервойБуквыЛатЗАГЛ		= КодСимвола("A");
	КодПоследнейБуквыЛатЗАГЛ	= КодСимвола("Z");

	КодПервойБуквыЛатСтроч		= КодСимвола("a");
	КодПоследнейБуквыЛатСтроч	= КодСимвола("z");

	КодПервойБуквыКирЗАГЛ		= КодСимвола("А");
	КодПоследнейБуквыКирЗАГЛ	= КодСимвола("Я");

	КодПервойБуквыКирСтроч		= КодСимвола("а");
	КодПоследнейБуквыКирСтроч	= КодСимвола("я");

	КодБуквыЁ_ЗАГЛ	= КодСимвола("Ё");
	КодБуквыЁ_строч	= КодСимвола("ё");

	КодПробела = КодСимвола(" ");
	КодДефиса  = КодСимвола("-");

	СтрокаРезультат = "";

	ВходнаяСтрока = СокрЛП(ВходнаяСтрока);

	ДлинаСтроки = СтрДлина(ВходнаяСтрока);

	Для ИДХ=1 По ДлинаСтроки Цикл

		ТекСимв		= Сред(ВходнаяСтрока, ИДХ, 1);
		КодТекСимв	= КодСимвола(ТекСимв);

		Если Между(КодТекСимв, КодПервойЦифры,			КодПоследнейЦифры)
		 ИЛИ Между(КодТекСимв, КодПервойБуквыЛатЗАГЛ,	КодПоследнейБуквыЛатЗАГЛ)
		 ИЛИ Между(КодТекСимв, КодПервойБуквыЛатСтроч,	КодПоследнейБуквыЛатСтроч)
		 ИЛИ (НЕ ТолькоЛатиница И (
			     Между(КодТекСимв, КодПервойБуквыКирЗАГЛ,	КодПоследнейБуквыКирЗАГЛ)
			 ИЛИ Между(КодТекСимв, КодПервойБуквыКирСтроч,	КодПоследнейБуквыКирСтроч)
			 ИЛИ КодТекСимв = КодБуквыЁ_ЗАГЛ
			 ИЛИ КодТекСимв = КодБуквыЁ_строч
		 ))
		 ИЛИ (РазрешитьПробелы И КодТекСимв = КодПробела)
		 ИЛИ (РазрешитьДефисы  И КодТекСимв = КодДефиса)
		Тогда
			СтрокаРезультат = СтрокаРезультат + ТекСимв;
		КонецЕсли;

	КонецЦикла;

	Возврат СтрокаРезультат;

КонецФункции

Функция ЭтаСтрокаСостоитИзБуквИлиЦифр(Знач ВходнаяСтрока, Знач ТолькоЛатиница = Ложь, Знач ДаЕслиПустая = Истина) Экспорт

	Если Не ЗначениеЗаполнено(ВходнаяСтрока) Тогда
		Возврат ДаЕслиПустая;
	КонецЕсли;

	КодПервойЦифры		= КодСимвола("0");
	КодПоследнейЦифры	= КодСимвола("9");

	КодПервойБуквыЛатЗАГЛ		= КодСимвола("A");
	КодПоследнейБуквыЛатЗАГЛ	= КодСимвола("Z");

	КодПервойБуквыЛатСтроч		= КодСимвола("a");
	КодПоследнейБуквыЛатСтроч	= КодСимвола("z");

	КодПервойБуквыКирЗАГЛ		= КодСимвола("А");
	КодПоследнейБуквыКирЗАГЛ	= КодСимвола("Я");

	КодПервойБуквыКирСтроч		= КодСимвола("а");
	КодПоследнейБуквыКирСтроч	= КодСимвола("я");

	КодБуквыЁ_ЗАГЛ	= КодСимвола("Ё");
	КодБуквыЁ_строч	= КодСимвола("ё");

	ДлинаСтроки = СтрДлина(ВходнаяСтрока);

	Результат = Истина;

	Для ИДХ=1 По ДлинаСтроки Цикл

		ТекСимв		= Сред(ВходнаяСтрока, ИДХ, 1);
		КодТекСимв	= КодСимвола(ТекСимв);

		Результат = Результат И (
		     Между(КодТекСимв, КодПервойЦифры,			КодПоследнейЦифры)
		 ИЛИ Между(КодТекСимв, КодПервойБуквыЛатЗАГЛ,	КодПоследнейБуквыЛатЗАГЛ)
		 ИЛИ Между(КодТекСимв, КодПервойБуквыЛатСтроч,	КодПоследнейБуквыЛатСтроч)
		 ИЛИ (НЕ ТолькоЛатиница И (
			     Между(КодТекСимв, КодПервойБуквыКирЗАГЛ,	КодПоследнейБуквыКирЗАГЛ)
			 ИЛИ Между(КодТекСимв, КодПервойБуквыКирСтроч,	КодПоследнейБуквыКирСтроч)
			 ИЛИ КодТекСимв = КодБуквыЁ_ЗАГЛ
			 ИЛИ КодТекСимв = КодБуквыЁ_строч
			))
		);

		Если НЕ Результат Тогда
			Возврат Результат;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьПолноеИмя(Знач Фамилия, Знач Имя, Знач Отчество) Экспорт

	ПолноеИмя = "";

	ФамилияОчищенная	= СокрЛП(Фамилия);
	ИмяОчищенное		= СокрЛП(Имя);
	ОтчествоОчищенное	= СокрЛП(Отчество);

	ПолноеИмя
		= ?(ЗначениеЗаполнено(ФамилияОчищенная),	ФамилияОчищенная	+ " ", "")
		+ ?(ЗначениеЗаполнено(ИмяОчищенное),		ИмяОчищенное		+ " ", "")
		+ ?(ЗначениеЗаполнено(ОтчествоОчищенное),	ОтчествоОчищенное		 , "")
	;

	ПолноеИмя = СокрЛП(ПолноеИмя);

	Возврат ПолноеИмя;

КонецФункции

Функция ПолучитьМассивГласныхНейотированныхБукв() Экспорт

	МассивБукв = Новый Массив;

	МассивБукв.Добавить("а");
	МассивБукв.Добавить("и");
	МассивБукв.Добавить("о");
	МассивБукв.Добавить("у");
	МассивБукв.Добавить("ы");
	МассивБукв.Добавить("э");

	Возврат МассивБукв;

КонецФункции

Функция ПолучитьМассивГласныхЙотированныхБукв() Экспорт

	МассивБукв = Новый Массив;

	МассивБукв.Добавить("е");
	МассивБукв.Добавить("ё");
	МассивБукв.Добавить("ю");
	МассивБукв.Добавить("я");

	Возврат МассивБукв;

КонецФункции

Функция ПолучитьМассивРедуцированныхБукв() Экспорт

	МассивБукв = Новый Массив;

	МассивБукв.Добавить("ь");
	МассивБукв.Добавить("ъ");

	Возврат МассивБукв;

КонецФункции

Функция СократитьСлово(Знач Слово, Знач НомерКластера = 1, Знач ДобавитьСимволСокр = Ложь, Знач СимволСокр = ".") Экспорт

	СоотвГласныхРедуцированных = Новый Соответствие;

	МассивНейотированных	= ПолучитьМассивГласныхНейотированныхБукв();
	МассивЙотированных		= ПолучитьМассивГласныхЙотированныхБукв();
	МассивРедуцированных	= ПолучитьМассивРедуцированныхБукв();

	Для Каждого Буква Из МассивНейотированных Цикл
		СоотвГласныхРедуцированных.Вставить(Буква, Истина);
	КонецЦикла;

	Для Каждого Буква Из МассивЙотированных Цикл
		СоотвГласныхРедуцированных.Вставить(Буква, Истина);
	КонецЦикла;

	Для Каждого Буква Из МассивРедуцированных Цикл
		СоотвГласныхРедуцированных.Вставить(Буква, Истина);
	КонецЦикла;

	СловоСокр = "";

	ДлинаСлова = СтрДлина(Слово);

	ТекКластер		= 1;
	ПредГласная		= Ложь;

	Для ИДХ=1 По ДлинаСлова Цикл

		ТекСимвол = Сред(Слово, ИДХ, 1);

		ТекГласная = СоотвГласныхРедуцированных.Получить(ТекСимвол);

		Если ТекГласная Тогда
			Если НЕ ПредГласная Тогда

				ТекКластер = ТекКластер + 1;

				Если ТекКластер >= НомерКластера Тогда
					Прервать;
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

		ПредГласная = ТекГласная;

		СловоСокр = СловоСокр + ТекСимвол;

	КонецЦикла;

	Если ДобавитьСимволСокр И (СловоСокр <> Слово) Тогда
		СловоСокр = СловоСокр + СимволСокр;
	КонецЕсли;

	Возврат СловоСокр;

КонецФункции

Функция ОдносимвольныйКодИзЧисла(Знач ИсхЧисло) Экспорт

	Если ТипЗнч(ИсхЧисло) <> Тип("Число") Тогда
		ВызватьИсключение "Допустимо преобразовать только число.";
	КонецЕсли;

	Если ИсхЧисло < 0 Тогда
		ВызватьИсключение "Нельзя преобразовать отрицательное число.";
	КонецЕсли;

	Если ИсхЧисло < 10 Тогда
		Возврат Строка(ИсхЧисло);
	КонецЕсли;

	Усечение = ИсхЧисло - 10;

	КодЛатА = КодСимвола("A");
	КодЛатЯ = КодСимвола("Z");

	КодРезульт = КодЛатА + Усечение;

	Если КодРезульт <= КодЛатЯ Тогда
		Результат = Символ(КодРезульт);
		Возврат Результат;
	КонецЕсли;

	РазностьКодов = КодЛатЯ - КодЛатА + 1;

	Усечение = Усечение - РазностьКодов;

	КодКирА = КодСимвола("а");
	КодКирЯ = КодСимвола("я");

	КодРезульт = КодКирА + Усечение;

	Если КодРезульт <= КодКирЯ Тогда
		Результат = Символ(КодРезульт);
		Возврат Результат;
	КонецЕсли;

	ВызватьИсключение "Число к преобразованию слишком большое.";

КонецФункции

Функция ТранслитерироватьСтроку(ВходнаяСтрока) Экспорт

	СоотвРусЛат = Новый Соответствие;

	СоотвРусЛат.Вставить("А", "A");
	СоотвРусЛат.Вставить("а", "a");

	СоотвРусЛат.Вставить("Б", "B");
	СоотвРусЛат.Вставить("б", "b");

	СоотвРусЛат.Вставить("В", "V");
	СоотвРусЛат.Вставить("в", "v");

	СоотвРусЛат.Вставить("Г", "G");
	СоотвРусЛат.Вставить("г", "g");

	СоотвРусЛат.Вставить("Д", "D");
	СоотвРусЛат.Вставить("д", "d");

	СоотвРусЛат.Вставить("Е", "Ye");
	СоотвРусЛат.Вставить("е", "ye");

	СоотвРусЛат.Вставить("Ё", "Yo");
	СоотвРусЛат.Вставить("ё", "yo");

	СоотвРусЛат.Вставить("Ж", "Zh");
	СоотвРусЛат.Вставить("ж", "zh");

	СоотвРусЛат.Вставить("З", "Z");
	СоотвРусЛат.Вставить("з", "z");

	СоотвРусЛат.Вставить("И", "I");
	СоотвРусЛат.Вставить("и", "i");

	СоотвРусЛат.Вставить("Й", "Y");
	СоотвРусЛат.Вставить("й", "y");

	СоотвРусЛат.Вставить("К", "K");
	СоотвРусЛат.Вставить("к", "k");

	СоотвРусЛат.Вставить("Л", "L");
	СоотвРусЛат.Вставить("л", "l");

	СоотвРусЛат.Вставить("М", "M");
	СоотвРусЛат.Вставить("м", "m");

	СоотвРусЛат.Вставить("Н", "N");
	СоотвРусЛат.Вставить("н", "n");

	СоотвРусЛат.Вставить("О", "O");
	СоотвРусЛат.Вставить("о", "o");

	СоотвРусЛат.Вставить("П", "P");
	СоотвРусЛат.Вставить("п", "p");

	СоотвРусЛат.Вставить("Р", "R");
	СоотвРусЛат.Вставить("р", "r");

	СоотвРусЛат.Вставить("С", "S");
	СоотвРусЛат.Вставить("с", "s");

	СоотвРусЛат.Вставить("Т", "T");
	СоотвРусЛат.Вставить("т", "t");

	СоотвРусЛат.Вставить("У", "U");
	СоотвРусЛат.Вставить("у", "u");

	СоотвРусЛат.Вставить("Ф", "F");
	СоотвРусЛат.Вставить("ф", "f");

	СоотвРусЛат.Вставить("Х", "H");
	СоотвРусЛат.Вставить("х", "h");

	СоотвРусЛат.Вставить("Ц", "C");
	СоотвРусЛат.Вставить("ц", "c");

	СоотвРусЛат.Вставить("Ч", "Ch");
	СоотвРусЛат.Вставить("ч", "ch");

	СоотвРусЛат.Вставить("Ш", "Sh");
	СоотвРусЛат.Вставить("ш", "sh");

	СоотвРусЛат.Вставить("Щ", "Shy");
	СоотвРусЛат.Вставить("щ", "shy");

	СоотвРусЛат.Вставить("Ъ", "");
	СоотвРусЛат.Вставить("ъ", "");

	СоотвРусЛат.Вставить("Ы", "Y");
	СоотвРусЛат.Вставить("ы", "y");

	СоотвРусЛат.Вставить("Ь", "J");
	СоотвРусЛат.Вставить("ь", "j");

	СоотвРусЛат.Вставить("Э", "E");
	СоотвРусЛат.Вставить("э", "e");

	СоотвРусЛат.Вставить("Ю", "Yu");
	СоотвРусЛат.Вставить("ю", "yu");

	СоотвРусЛат.Вставить("Я", "Ya");
	СоотвРусЛат.Вставить("я", "ya");

	МассивСимволов = Новый Массив;

	ДлинаСтроки = СтрДлина(ВходнаяСтрока);

	Для ИДХ=1 По ДлинаСтроки Цикл

		ТекСимвол = Сред(ВходнаяСтрока, ИДХ, 1);

		Замена = СоотвРусЛат.Получить(ТекСимвол);

		Если Замена = Неопределено Тогда
			Замена = ТекСимвол;
		КонецЕсли;

		МассивСимволов.Добавить(Замена);

	КонецЦикла;

	Результат = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивСимволов, "");

	Возврат Результат;

КонецФункции
// - ДДГ

#КонецОбласти
// РаботаСоСтроками

#Область SendPulse
#Область Подключение
Функция Подключение() Экспорт 

	Попытка
		Соед=Новый HTTPСоединение("api.sendpulse.com",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Исключение
		Сообщить("Не удалось установить соединение с api.sendpulse.com");
	КонецПопытки;
	
	Возврат Соед;
	
КонецФункции

Функция ПолучитьID() Экспорт 
	
	Возврат СокрЛП(Константы.SendPulsID.Получить());
	
КонецФункции

Функция ПолучитьSecret() Экспорт 
	
	Возврат СокрЛП(Константы.SendPulsSecret.Получить());
	
КонецФункции

Функция ПолучитьКлюч(Соед, Аккаунт = Неопределено) Экспорт 
	
	Если Аккаунт = Неопределено Тогда 
		Сообщить("Не установлено значение Аккаунт : ПолучитьКлюч");
		Возврат "";		
	КонецЕсли;
	
	Ключ = "";
	Заголовки=Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	
	Запрос=Новый HTTPЗапрос("/oauth/access_token",Заголовки);
	//Запрос.УстановитьТелоИзСтроки("grant_type=client_credentials&client_id="+Сокрлп(ПолучитьID())+"&client_secret="+Сокрлп(ПолучитьSecret()),,ИспользованиеByteOrderMark.НеИспользовать);
 	Запрос.УстановитьТелоИзСтроки("grant_type=client_credentials&client_id="+Аккаунт.client_id+"&client_secret="+Аккаунт.client_secret,,ИспользованиеByteOrderMark.НеИспользовать);

//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

	СтрОтвет= Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния<>200 Тогда
		 Сообщить("Код ответа="+Ответ.КодСостояния+" "+СтрОтвет);
		Возврат Ключ;
	КонецЕсли;

	Чтение=Новый  ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрОтвет);
	Мас=ПрочитатьJSON(Чтение,Истина);
	
	Ключ=Мас["access_token"];  //ключ годен 1 час
		
	Возврат Ключ;
	
КонецФункции

Функция ПолучитьЗаголовокАвторизации(Соед) 
	
	Соед = Подключение();
	
	Ключ = ПолучитьКлюч(Соед);
	
	Заголовки=Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	Заголовки.Вставить("Authorization","Bearer "+Сокрлп(Ключ));
	
	Возврат Заголовки;
	
КонецФункции

Функция ПолучитьЗаголовкиSendPulse(Ключ)
	Заголовки=Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	Заголовки.Вставить("Authorization","Bearer " + СокрЛП(Ключ));
	Возврат Заголовки;
КонецФункции

Функция ПолучитьЗаголовкиSendPulseJSON(Ключ)
	Заголовки=Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	Заголовки.Вставить("Authorization","Bearer " + СокрЛП(Ключ));
	Возврат Заголовки;
КонецФункции

Процедура ПереподключениеSendPulse(Аккаунт, Соед, Заголовки, ЗаголовокДжСОН = Ложь) Экспорт
	Соед = Подключение();
	Ключ = ПолучитьКлюч(Соед, Аккаунт);
	Заголовки =
		?(ЗаголовокДжСОН
		, ПолучитьЗаголовкиSendPulseJSON(Ключ)
		, ПолучитьЗаголовкиSendPulse(Ключ)
	);
КонецПроцедуры

Функция ПолучитьОшибкуОтветаSendPulse(СчитСоотв, КодСостояния = Неопределено)
	КодОшибки		= СчитСоотв.Получить("error_code");
	ПояснениеОшибки	= СчитСоотв.Получить("message");
	СтрокаДляВывода = ", ошибка " + КодОшибки + ": " + ПояснениеОшибки;
	Если КодСостояния <> Неопределено Тогда
		СтрокаДляВывода = ", код ответа: " + КодСостояния + СтрокаДляВывода;
	КонецЕсли;
	Возврат СтрокаДляВывода;
КонецФункции
#КонецОбласти
// Подключение

#Область АдресныеКниги
Функция ПолучитьСоотвСтатусыЕмейловSendPulse() Экспорт
	// + 003815 ДДГ 07.12.2020
	// обнов ДДГ 01 апр 2022
	СоотвСтатусов = Новый Соответствие();
	СоотвСтатусов.Вставить(-1, "Не входит в адресную книгу");
	СоотвСтатусов.Вставить(0, "Новый");
	СоотвСтатусов.Вставить(1, "Активный");
	СоотвСтатусов.Вставить(2, "Запрошена подписка");
	СоотвСтатусов.Вставить(3, "Запрошена активация ч/з админ-панель");
	СоотвСтатусов.Вставить(4, "Отписался от рассылки");
	СоотвСтатусов.Вставить(5, "Отменена активация");
	СоотвСтатусов.Вставить(6, "Отписался от всех рассылок");
	СоотвСтатусов.Вставить(7, "Отправлен запрос подписки");
	СоотвСтатусов.Вставить(8, "Заблокирован");
	СоотвСтатусов.Вставить(9, "Ошибка отправки");
	СоотвСтатусов.Вставить(10, "Блокировка по хосту");
	СоотвСтатусов.Вставить(11, "Блокировка по пользователю");
	СоотвСтатусов.Вставить(12, "Блокировка по маске");
	СоотвСтатусов.Вставить(13, "Удалён");
	СоотвСтатусов.Вставить(14, "Временно недоступен");
	Возврат СоотвСтатусов;
	// - 003815 ДДГ 07.12.2020
КонецФункции

Функция ПолучитьОписаниеСтатусаЕмейл(ИДСтатуса) Экспорт
	// + 003815 ДДГ 07.12.2020
	СоотвСтатусов = ПолучитьСоотвСтатусыЕмейловSendPulse();

	Возврат СоотвСтатусов.Получить(ИДСтатуса);
	// - 003815 ДДГ 07.12.2020
КонецФункции

Функция НайтиАдреснуюКнигуSendPulse(ИдКниги, Аккаунт = Неопределено, ОтборПометкиУдаления = Истина, ПометкаУдаления = Ложь) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	spАдресныеКниги.Ссылка
	|ИЗ
	|	Справочник.spАдресныеКниги КАК spАдресныеКниги
	|ГДЕ
	|	ИдКниги = &ИдКниги
	|	И ВЫБОР
	|		КОГДА &ПоискПоАккаунту
	|		ТОГДА spАдресныеКниги.Аккаунт = &Аккаунт
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ОтборПометкиУдаления
	|		ТОГДА spАдресныеКниги.ПометкаУдаления = &ПометкаУдаления
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|");

	Запрос.УстановитьПараметр("Аккаунт",				Аккаунт);
	Запрос.УстановитьПараметр("ПоискПоАккаунту",		ЗначениеЗаполнено(Аккаунт));
	Запрос.УстановитьПараметр("ИдКниги",				ИдКниги);
	Запрос.УстановитьПараметр("ОтборПометкиУдаления",	ОтборПометкиУдаления);
	Запрос.УстановитьПараметр("ПометкаУдаления",		ПометкаУдаления);

	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция НайтиАдреснуюКнигуИзКэша(
	КэшированнаяТаблица, ИдКниги
	, Аккаунт = Неопределено, ОтборПометкиУдаления = Истина, ПометкаУдаления = Ложь
) Экспорт

	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ID", ИдКниги);
	Если ЗначениеЗаполнено(Аккаунт) Тогда
		ПараметрыПоиска.Вставить("Аккаунт", Аккаунт);
	КонецЕсли;
	Если ОтборПометкиУдаления Тогда
		ПараметрыПоиска.Вставить("ПометкаУдаления", ПометкаУдаления);
	КонецЕсли;

	НайденныеСтроки = КэшированнаяТаблица.НайтиСтроки(ПараметрыПоиска);

	Если НайденныеСтроки.Количество() Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		Возврат НайденнаяСтрока.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция КэшироватьАдресныеКнигиSendPulse(Аккаунт = Неопределено, ОтборПометкиУдаления = Истина, ПометкаУдаления = Ложь) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	spАдресныеКниги.Ссылка,
	|	spАдресныеКниги.ID,
	|	spАдресныеКниги.Аккаунт,
	|	spАдресныеКниги.ПометкаУдаления
	|ИЗ
	|	Справочник.spАдресныеКниги КАК spАдресныеКниги
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ПоискПоАккаунту
	|		ТОГДА spАдресныеКниги.Аккаунт = &Аккаунт
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ОтборПометкиУдаления
	|		ТОГДА spАдресныеКниги.ПометкаУдаления = &ПометкаУдаления
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|");

	Запрос.УстановитьПараметр("Аккаунт",				Аккаунт);
	Запрос.УстановитьПараметр("ПоискПоАккаунту",		ЗначениеЗаполнено(Аккаунт));
	Запрос.УстановитьПараметр("ОтборПометкиУдаления",	ОтборПометкиУдаления);
	Запрос.УстановитьПараметр("ПометкаУдаления",		ПометкаУдаления);

	Результат	= Запрос.Выполнить();
	ТаблицаРезультата = Результат.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции

// выгружает из сервиса в 1С все адресные книги (их id, name, список email)
Процедура ЗагрузитьВсеАдресныеКниги(Аккаунт = Неопределено, Обновлять = Ложь) Экспорт
	// если указан аккаунт, загружаем только для данного аккаунта
	Если ЗначениеЗаполнено(Аккаунт) Тогда
		ЗагрузитьspАдресныеКниги(Аккаунт, Обновлять);
	Иначе
	// иначе загружаем для всех аккаунтов
		ВыборкаАккаунтов = Справочники.spАккаунты.Выбрать();
		Пока ВыборкаАккаунтов.Следующий() Цикл
			Аккаунт = ВыборкаАккаунтов.Ссылка;
			ЗагрузитьspАдресныеКниги(Аккаунт, Обновлять);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьspАдресныеКниги(Аккаунт, Обновлять = Ложь) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗагрузитьspАдресныеКниги)");
		Возврат;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос = Новый HTTPЗапрос("/addressbooks?access_token="+Сокрлп(Ключ),Заголовки);
		
//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	ТаблицаАдресныхКниг = КэшироватьАдресныеКнигиSendPulse(Аккаунт);

	Для Каждого Соотв Из Результат Цикл

		ИдКниги				= СокрЛП(Соотв["id"]);
		ИмяКниги			= СокрЛП(Соотв["name"]);
		СтрокаДатаСоздания	= СокрЛП(Соотв["creationdate"]);
		ДатаСоздания		= ПолучитьДатуИзФорматаДжСОН(СтрокаДатаСоздания);

		ТекСпр = НайтиАдреснуюКнигуИзКэша(ТаблицаАдресныхКниг, ИдКниги, Аккаунт);

		Если НЕ ЗначениеЗаполнено(ТекСпр) Тогда 

			СпрОбъект = Справочники.spАдресныеКниги.СоздатьЭлемент();
			СпрОбъект.ID 			= ИдКниги;
			СпрОбъект.Наименование  = ИмяКниги;
			СпрОбъект.Аккаунт 		= Аккаунт;
			СпрОбъект.ДатаСоздания 	= ДатаСоздания;

			Попытка
				СпрОбъект.Записать();
				ТекСпр = СпрОбъект.Ссылка;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать книгу: ID("+ИдКниги+"), name("+ИмяКниги+")! Причина:"+ОписаниеОшибки());
				Возврат;
			КонецПопытки;

		ИначеЕсли Обновлять Тогда

			СпрОбъект = ТекСпр.ПолучитьОбъект();
			СпрОбъект.Наименование  = ИмяКниги;
			СпрОбъект.ДатаСоздания 	= ДатаСоздания;
			СпрОбъект.Записать();

		КонецЕсли;

		ЗаполнитьАдреснуюКнигуПолучателиБезПроверок(ТекСпр, Аккаунт);

	КонецЦикла;	
КонецПроцедуры

// выгружает из сервиса в 1С набор email для указанной адресной книги (через id)
Процедура ЗаполнитьАдреснуюКнигуПолучатели(АдреснаяКнига, Аккаунт = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		Аккаунт = АдреснаяКнига.Аккаунт;
		Если Не ЗначениеЗаполнено(Аккаунт) Тогда
			Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗаполнитьАдреснуюКнигуПолучатели)");
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если АдреснаяКнига.ПометкаУдаления Тогда
		Сообщить("Книга помечена на удаление!");
		Возврат;
	КонецЕсли;

	ЗаполнитьАдреснуюКнигуПолучателиБезПроверок(АдреснаяКнига, Аккаунт);

КонецПроцедуры

Процедура ЗаполнитьАдреснуюКнигуПолучателиБезПроверок(АдреснаяКнига, Аккаунт) Экспорт

	ИдКниги = АдреснаяКнига.ID;
	ид = СтрЗаменить(ИдКниги, Символы.НПП, "");

	МассивСтрАдресов = Новый Массив;

	ДатаНачала = Дата(1,1,1);

	Для Инд=1 По 1000 Цикл   //цикл нужен, т.к. метод за 1 раз отдает не более 100 адресов

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		Смещение = (Инд-1) * 100;
		СмещениеСтрокой = УбратьПробелыИзСтроки(Смещение);

		//https://api.sendpulse.com/addressbooks/{id}/emails
		//Запрос=Новый HTTPЗапрос("/addressbooks/" + ид + "/emails", Заголовки);
		Запрос=Новый HTTPЗапрос("/addressbooks/" + ид + "/emails?access_token="+Сокрлп(Ключ)+"&limit=100&offset="+СмещениеСтрокой,Заголовки);

//		ВыхИмя=ПолучитьИмяВременногоФайла("txt");

		Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

		Если Ответ.КодСостояния<>200 Тогда
			 Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
			Возврат;
		КонецЕсли;

		Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		Если Результат = Неопределено
		 ИЛИ Результат.Количество() = 0
		Тогда //кончились адреса
			Прервать;
		КонецЕсли;

		Для Каждого СтрРезультат Из Результат Цикл 
			email			= СтрРезультат.Получить("email");
			status			= СтрРезультат.Получить("status");
			status_explain	= СтрРезультат.Получить("status_explain");

			СтрАдреса = Новый Структура;
			СтрАдреса.Вставить("email",				email);
			СтрАдреса.Вставить("status",			status);
			СтрАдреса.Вставить("status_explain",	status_explain);

			МассивСтрАдресов.Добавить(СтрАдреса);
		КонецЦикла;

	КонецЦикла;

	СпрОбъект = АдреснаяКнига.ПолучитьОбъект();
	
	ПолучателиТЧ = СпрОбъект.Получатели;

	СоотвВсехАдресов = Новый Соответствие;

	Для Каждого СтрАдреса Из МассивСтрАдресов Цикл 

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Адрес", СтрАдреса.email);

		НайденныеСтроки = ПолучателиТЧ.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТЧ = НайденныеСтроки[0];
		Иначе
			СтрокаТЧ = ПолучателиТЧ.Добавить();
			СтрокаТЧ.Адрес			= СтрАдреса.email;
//			СтрокаТЧ.ДатаДобавления	= ТекущаяДатаСеанса();
		КонецЕсли;

		СтрокаТЧ.Статус				= СтрАдреса.status;
		СтрокаТЧ.СтатусПояснение	= ПолучитьОписаниеСтатусаЕмейл(СтрАдреса.status);
		//СтрокаТЧ.СтатусПояснение	= СтрАдреса.status_explain;

		//Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДатаДобавления) Тогда

		//	ДетальнаяИнформация		= ПолучитьДетальнуюИнформациюЕмейла(Аккаунт, СтрАдреса.email, Ключ, Соед);
		//	ДетальнаяИнформация		= ?(ДетальнаяИнформация = Неопределено, Новый Массив, ДетальнаяИнформация);

		//	Для Каждого record Из ДетальнаяИнформация Цикл

		//		ИдКнигиЗаписи = record.Получить("list_id");
		//		ИдКнигиЗаписи = СтрЗаменить(ИдКнигиЗаписи, Символы.НПП, "");

		//		Если ИдКнигиЗаписи = ид Тогда
		//			СтрокаТЧ.ДатаДобавления = ПолучитьДатуИзФорматаДжСОН(record.Получить("add_date"));
		//		КонецЕсли;

		//	КонецЦикла;

		//КонецЕсли;

		СоотвВсехАдресов.Вставить(СтрАдреса.email, Истина);

	КонецЦикла;

	ВсегоПолучателейТЧ = ПолучателиТЧ.Количество();
	ИДХ = 0;

	Пока ИДХ < ВсегоПолучателейТЧ Цикл

		ТекСтрока = ПолучателиТЧ[ИДХ];

		Если СоотвВсехАдресов.Получить(ТекСтрока.Адрес) = Неопределено Тогда
			ПолучателиТЧ.Удалить(ТекСтрока);
			ВсегоПолучателейТЧ = ВсегоПолучателейТЧ - 1;
		Иначе
			ИДХ = ИДХ + 1;
		КонецЕсли;

	КонецЦикла;

	Попытка
		СпрОбъект.Записать();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(
			"Не удалось заполнить адресную книгу: ID(" + ИдКниги
			+ "), name(" + АдреснаяКнига.Наименование
			+ ")! Причина:" + ОписаниеОшибки()
		);
	КонецПопытки;

КонецПроцедуры

// + 50637 ДДГ 03 мар 2022
Процедура ЗаполнитьДетальнуюИнформациюЕмейлов(Аккаунт) Экспорт

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗаполнитьДетальнуюИнформациюЕмейлов)");
		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("Аккаунт", Аккаунт);

	СоотвКниг	= Новый Соответствие;

	ВыборкаКниг	= Справочники.spАдресныеКниги.Выбрать(,, Отбор);

	Пока ВыборкаКниг.Следующий() Цикл

		СтруктураКниги	= Новый Структура;
		МассивАдресов	= Новый Массив;

		СтруктураКниги.Вставить("Книга",	ВыборкаКниг.Ссылка);
		СтруктураКниги.Вставить("Адреса",	МассивАдресов);

		СоотвКниг.Вставить(ВыборкаКниг.ID, СтруктураКниги);

	КонецЦикла;

	//

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	spАдресныеКнигиПолучатели.Адрес
		|ИЗ
		|	Справочник.spАдресныеКниги.Получатели КАК spАдресныеКнигиПолучатели
		|ГДЕ
		|	spАдресныеКнигиПолучатели.Ссылка.Аккаунт = &Аккаунт
		|	И НЕ spАдресныеКнигиПолучатели.Ссылка.ПометкаУдаления
		|	И spАдресныеКнигиПолучатели.Ссылка.ID <> """"
		|	И spАдресныеКнигиПолучатели.ДатаДобавления = ДАТАВРЕМЯ(1,1,1)";

	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	ДатаНачала = Дата(1,1,1);

	Пока Выборка.Следующий() Цикл

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
//			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		Емейл = Выборка.Адрес;

		ДетальнаяИнформация		= ПолучитьДетальнуюИнформациюЕмейла(Аккаунт, Емейл, Ключ, Соед);
		ДетальнаяИнформация		= ?(ДетальнаяИнформация = Неопределено, Новый Массив, ДетальнаяИнформация);

		Для Каждого record Из ДетальнаяИнформация Цикл

			ИдКнигиЗаписи = Строка(record.Получить("list_id"));

			СтруктураКниги = СоотвКниг.Получить(ИдКнигиЗаписи);

			Если СтруктураКниги = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			СтруктураАдреса = Новый Структура;
			СтруктураАдреса.Вставить("Емейл", Емейл);
			СтруктураАдреса.Вставить("ДатаДобавления",
				ПолучитьДатуИзФорматаДжСОН(record.Получить("add_date")));

			СтруктураКниги.Адреса.Добавить(СтруктураАдреса);

		КонецЦикла;

	КонецЦикла;

	//

	Для Каждого КлючЗначение Из СоотвКниг Цикл

		СтруктураКниги	= КлючЗначение.Значение;
		АдресаКниги		= СтруктураКниги.Адреса;

		Если АдресаКниги.Количество() < 1 Тогда
			Продолжить;
		КонецЕсли;

		ОбъектКниги	= СтруктураКниги.Книга.ПолучитьОбъект();
		Получатели	= ОбъектКниги.Получатели;
		Записывать	= Ложь;

		Для Каждого АдресКниги Из АдресаКниги Цикл

			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Адрес",	АдресКниги.Емейл);
			НайденныеСтроки = Получатели.НайтиСтроки(СтруктураПоиска);

			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.ДатаДобавления) Тогда
					НайденнаяСтрока.ДатаДобавления = АдресКниги.ДатаДобавления;
					Записывать = Истина;
					Продолжить;
				КонецЕсли;
			КонецЦикла;

		КонецЦикла;

		Если Записывать Тогда
			ОбъектКниги.Записать();
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДетальнуюИнформациюЕмейла(Аккаунт, Емейл, Ключ = Неопределено, Соед = Неопределено) Экспорт

	Соед		= ?(Соед = Неопределено, Подключение(), Соед);
	Ключ		= ?(Ключ = Неопределено, ПолучитьКлюч(Соед, Аккаунт), Ключ);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	//https://api.sendpulse.com/emails/{email}/details
	//Запрос=Новый HTTPЗапрос("/addressbooks/" + ид + "/emails", Заголовки);
	Запрос = Новый HTTPЗапрос("/emails/" + Емейл + "/details?access_token="+Сокрлп(Ключ), Заголовки);

	Спать(1);

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	ТелоОтвета	= Ответ.ПолучитьТелоКакСтроку();

	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Код ответа=" + Ответ.КодСостояния + " " + ТелоОтвета);
		Возврат Неопределено;
	КонецЕсли;

	ДанныеДжСОН	= ПолучитьДанныеДжСОН(ТелоОтвета);

	Сообщить("Дополнительные данные адреса " + Емейл + " получены успешно.");

	Возврат ДанныеДжСОН;

КонецФункции
// - 50637 ДДГ 03 мар 2022

// удалить АдреснуюКнигу из sendPulse
Процедура УдалитьАдреснуюКнигуSendPulse(АдреснаяКнига, Ключ = Неопределено, Соед = Неопределено) Экспорт

	Аккаунт		= АдреснаяКнига.Аккаунт;
	ТекИд		= УбратьПробелыИзСтроки(АдреснаяКнига.ID);
	ИмяКниги	= СокрЛП(АдреснаяКнига.Наименование);

	Соед		= ?(Соед = Неопределено, Подключение(), Соед);
	Ключ		= ?(Ключ = Неопределено, ПолучитьКлюч(Соед, Аккаунт), Ключ);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос		= Новый HTTPЗапрос("/addressbooks/"+ТекИд,Заголовки);
	Ответ		= ПолучитьОтветНаЗапросДЭЛИТ(Соед, Запрос);

	СтрокаОтвета	= Ответ.ПолучитьТелоКакСтроку();

	Мас	= ПолучитьДанныеДжСОН(СтрокаОтвета);

	Если Мас = Неопределено Тогда
		Сообщить("Ошибка удаления книги: " + ТекИд + ", код ответа=" + Ответ.КодСостояния + " " + СтрокаОтвета);
		Возврат;
	КонецЕсли;

	Если Ответ.КодСостояния = 400 Тогда
		Результ	= Мас.Получить("error_code");
		Если Результ = 213 Тогда	// книга не найдена
			ОчиститьИД(АдреснаяКнига);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Ошибка удаления книги: " + ТекИд + ", код ответа=" + Ответ.КодСостояния + " " + СтрокаОтвета);
	Иначе
		Результ	= Мас.Получить("result");
		Если Результ Тогда
			ОчиститьИД(АдреснаяКнига);
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("статус удаления книги " + ТекИд + ": " + СтрокаОтвета);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// создаёт адресные книги, которые есть в 1С, но нет на сервисе (через bookName), удаляет помеченые на удаление, выгружает емейлы
Процедура ВыгрузитьВсеАдресныеКниги(Аккаунт = Неопределено) Экспорт
	// если указан аккаунт, выгружаем только для данного аккаунта
	Если ЗначениеЗаполнено(Аккаунт) Тогда
		ВыгрузитьspАдресныеКниги(Аккаунт);
	Иначе
	// иначе выгружаем для всех аккаунтов
		ВыборкаАккаунтов = Справочники.spАккаунты.Выбрать();
		Пока ВыборкаАккаунтов.Следующий() Цикл
			Аккаунт = ВыборкаАккаунтов.Ссылка;
			ВыгрузитьspАдресныеКниги(Аккаунт);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузитьspАдресныеКниги(Аккаунт, ПередаватьВсе = Ложь) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ВыгрузитьspАдресныеКниги)");
		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("Аккаунт", Аккаунт);

	ВыборкаКниг  = Справочники.spАдресныеКниги.Выбрать(,, Отбор);

	ДатаНачала = Дата(1,1,1);

	Пока ВыборкаКниг.Следующий() Цикл 

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		ТекИд		= УбратьПробелыИзСтроки(ВыборкаКниг.ID);
		ИмяКниги	= СокрЛП(ВыборкаКниг.Наименование);

		// + 003590 ДДГ 22 окт 2020

		// если есть id
		Если ЗначениеЗаполнено(ТекИд) Тогда 
			Если ВыборкаКниг.ПометкаУдаления Тогда
				УдалитьАдреснуюКнигуSendPulse(ВыборкаКниг, Ключ, Соед);
				Продолжить;
			КонецЕсли;

			ВыгрузитьПолучателейАдреснойКниги(ВыборкаКниг.Ссылка, ПередаватьВсе, Ключ, Соед);
			Продолжить;

		КонецЕсли;

		// если нет id
		Если ВыборкаКниг.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ИмяКниги) Тогда
			Сообщить("Наименование книги не должно быть пустым!");
			Продолжить;
		КонецЕсли;
		// - 003590 ДДГ 22 окт 2020

		Запрос=Новый HTTPЗапрос("/addressbooks?"+"bookName="+ИмяКниги,Заголовки);
		Запрос.УстановитьТелоИзСтроки("bookName="+ИмяКниги);
				
		Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

		Если Ответ.КодСостояния<>200 Тогда
			
		КонецЕсли;

		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();

		Результат = ПолучитьДанныеДжСОН(СтрокаОтвета);

		Если Результат = Неопределено Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при создании " + ИмяКниги + "! Причина:"+ СтрокаОтвета);
			Продолжить;
		КонецЕсли;

		ТекИД = Результат.Получить("id");
		
		СообщениеОбОшибке = Результат.Получить("message");
		
		Если ЗначениеЗаполнено(ТекИД) Тогда 
			ТекКнигаОбъект = ВыборкаКниг.Ссылка.ПолучитьОбъект();			
			ТекКнигаОбъект.ID = ТекИД;
			Попытка
				ТекКнигаОбъект.Записать();
				// + 003590 ДДГ 22 окт 2020
				ВыгрузитьПолучателейАдреснойКниги(ТекКнигаОбъект.Ссылка, ПередаватьВсе);
				// - 003590 ДДГ 22 окт 2020
			Исключение
			КонецПопытки;
		Иначе 
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при создании " + ИмяКниги + "! Причина:"+ СообщениеОбОшибке);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// перезаполняет емейлы адресной книги на сервисе из 1С (через id)
Процедура ВыгрузитьПолучателейАдреснойКниги(СсылкаНаКнигу, ПередаватьВсе = Ложь, Ключ = Неопределено, Соед = Неопределено) Экспорт 

	Если не ЗначениеЗаполнено(СсылкаНаКнигу) ИЛИ СсылкаНаКнигу.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	ИдКниги  = УбратьПробелыИзСтроки(СсылкаНаКнигу.ID);

	// + 003590 ДДГ 22 окт 2020
	Если Не ЗначениеЗаполнено(ИдКниги) Тогда
		//ОбщегоНазначения.СообщитьОбОшибке("У "+СсылкаНаКнигу +" нет ID выгрузка невозможна!");
		ИдКниги = ЗагрузитьАдреснуюКнигуНаSendPulse(СсылкаНаКнигу, Ключ, Соед);
		Если ИдКниги = -1 Тогда
			Возврат;
		Иначе
			ИдКниги = УбратьПробелыИзСтроки(ИдКниги);
		КонецЕсли;
	КонецЕсли;

	//СвойстваКниги = ВыгрузитьСвойстваАдреснойКниги(СсылкаНаКнигу);

	//Если СвойстваКниги = Неопределено Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Книга " + СсылкаНаКнигу + " не найдена на сервисе!");
	//КонецЕсли;
	// - 003590 ДДГ 22 окт 2020

	Аккаунт		= СсылкаНаКнигу.Аккаунт;

	//соберем массив почт на сервисе
	ТекМассивПочтБыло = Новый  Массив;

	ДатаНачала = Дата(1,1,1);

	Для Инд=1 По 1000 Цикл   //цикл нужен, т.к. метод за 1 раз отдает не более 100 адресов

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		//ВыхИмя = ПолучитьИмяВременногоФайла("txt");
		//ОбработкаПрерыванияПользователя();
		Смещение = (Инд-1)*100;
		СмещениеСтрокой = УбратьПробелыИзСтроки(Смещение);
		Запрос = Новый HTTPЗапрос("/addressbooks/"+Сокрлп(ИдКниги)+"/emails?access_token="+Сокрлп(Ключ)+"&limit=100&offset="+СмещениеСтрокой,Заголовки);

		Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

		Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		Если Результат = Неопределено
		 ИЛИ Результат.Количество()=0
		Тогда //кончились адреса
			Прервать;
		КонецЕсли;

		Если Ответ.КодСостояния <> 200 тогда
			СтрокаОшибкиОтвета = ПолучитьОшибкуОтветаSendPulse(Результат, Ответ.КодСостояния);
			Сообщить("Ошибка выгрузки емейлов из адресной книги: " + ИдКниги + СтрокаОшибкиОтвета);
			Возврат;
		КонецЕсли;

		Для Каждого Соотв Из Результат Цикл
			Почта 	= СокрЛП(Соотв["email"]);
			Если ЗначениеЗаполнено(Почта) Тогда 
				ТекМассивПочтБыло.Добавить(Почта);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	// формирует массив почт хранящихся в 1С, но отсутствующих на сервисе
	Мас=Новый Массив;

	Для Каждого СтрокаПолучателя из СсылкаНаКнигу.Получатели Цикл 
		текПочта = СокрЛП(СтрокаПолучателя.Адрес); 
		текПочта = НРег(текПочта);

		// добавляет в Мас емейлы, которые есть в книге, но нет на сервисе
		Структ=Новый Структура;
		Структ.Вставить("email",текПочта);
		//Структ.Вставить("variables",Новый Структура("имя","Вася"));

		Если ЗначениеЗаполнено(текПочта) Тогда 
			ТекЭлемент = ТекМассивПочтБыло.Найти(текПочта);

			// убирает из ТекМассивПочтБыло емейлы, которые есть в книге
			Если ТекЭлемент <> Неопределено Тогда
				ТекМассивПочтБыло.Удалить(ТекЭлемент);
			КонецЕсли;

			// если ПередаватьВсе тогда
				// добавляем емейл в Мас
			// иначе
				// добавляет емейл в Мас если его нет на сервисе
			Если ПередаватьВсе ИЛИ ТекЭлемент = Неопределено Тогда
				Мас.Добавить(Структ);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	// отправляет на сервис список емейлов из 1С
	Если Мас.Количество() > 0 Тогда
		Запись=Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись,Мас); 
		Стр=Запись.Закрыть();

		Запрос=Новый HTTPЗапрос("/addressbooks/"+Сокрлп(ИдКниги)+"/emails",Заголовки);
		Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&emails="+Стр);

		Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());

	КонецЕсли;

	///елси добавлены -ок, то удаляемя лишние( приоритет 1С)
	Если Ответ.КодСостояния = 200 Тогда 

		// удаление емейлов, не найденных в базе 1С
		СтрокаУдаления ="";
		для Каждого ТекУдаления из ТекМассивПочтБыло Цикл 
			Адрес = СокрЛП(ТекУдаления);
			СтрокаУдаления = ""+СтрокаУдаления+?(ЗначениеЗаполнено(СтрокаУдаления),",","") + """"+Адрес+"""";
		КонецЦикла;

		Если ТекМассивПочтБыло.Количество() > 0 Тогда 

			Запрос=Новый HTTPЗапрос("/addressbooks/"+Сокрлп(ИдКниги)+"/emails",Заголовки);
			Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&emails=["+СтрокаУдаления+"]");
			Ответ = ПолучитьОтветНаЗапросДЭЛИТ(Соед, Запрос);
			ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// возвращает свойства адресной книги из сервиса (через ид)
Функция ВыгрузитьСвойстваАдреснойКниги(СсылкаНаКнигу) Экспорт

	Если не ЗначениеЗаполнено(СсылкаНаКнигу) ИЛИ СсылкаНаКнигу.ПометкаУдаления Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИдКниги  = УбратьПробелыИзСтроки(СсылкаНаКнигу.ID);

	Если Не ЗначениеЗаполнено(ИдКниги) Тогда 
		Возврат Неопределено;
	КонецЕсли;

	Аккаунт		= СсылкаНаКнигу.Аккаунт;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос = Новый HTTPЗапрос("/addressbooks/" + Сокрлп(ИдКниги) + "?access_token="+Сокрлп(Ключ),Заголовки);

//	ВыхИмя = ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	СвойстваКниги = Новый Структура;

	// + 003590 ДДГ 22 окт 2020
	Для Каждого Соотв Из Результат Цикл
		СвойстваКниги.Вставить("ИмяКниги",					СокрЛП(Соотв["name"]));
		СвойстваКниги.Вставить("ИдКниги",					СокрЛП(Соотв["id"]));
		СвойстваКниги.Вставить("ОбщееКолвоАдресов",			Соотв["all_email_qty"]);
		СвойстваКниги.Вставить("КолвоАктивныхАдресов",		Соотв["active_email_qty"]);
		СвойстваКниги.Вставить("КолвоНеактивныхАдресов",	Соотв["inactive_email_qty"]);
		СвойстваКниги.Вставить("ДатаСоздания",				ПолучитьДатуИзСтрокиДжСОН((Соотв["creationdate"])));
		СвойстваКниги.Вставить("Статус",					Соотв["status"]);
		СвойстваКниги.Вставить("ОписаниеСтатуса",			Соотв["status_explain"]);
	КонецЦикла;	
	// - 003590 ДДГ 22 окт 2020

	Возврат СвойстваКниги;

КонецФункции

// создаёт новую адресную книгу на сервисе и получает её ид, либо -1 если не была создана
Функция ЗагрузитьАдреснуюКнигуНаSendPulse(СсылкаНаКнигу, Ключ = Неопределено, Соед = Неопределено) Экспорт

	Если не ЗначениеЗаполнено(СсылкаНаКнигу) Тогда
		Возврат -1;
	КонецЕсли;

	ИмяКниги = СокрЛП(СсылкаНаКнигу.Наименование);

	Если ПустаяСтрока(ИмяКниги) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Наименование адресной книги не заполнено, книга создана не будет!");
		Возврат -1;
	КонецЕсли;

	Если СсылкаНаКнигу.ПометкаУдаления Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Адресная книга помечена на удаление, книга выгружена не будет!");
		Возврат -1;
	КонецЕсли;

	Аккаунт		= СсылкаНаКнигу.Аккаунт;

	Соед		= ?(Соед = Неопределено, Подключение(), Соед);
	Ключ		= ?(Ключ = Неопределено, ПолучитьКлюч(Соед, Аккаунт), Ключ);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос = Новый HTTPЗапрос("/addressbooks", Заголовки);
	Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&bookName="+ИмяКниги);

//	ВыхИмя = ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат -1;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат -1;
	КонецЕсли;

	ИдКниги = СокрЛП(Результат["id"]);

	АдреснаяКнига = СсылкаНаКнигу.ПолучитьОбъект();
	АдреснаяКнига.ID = ИдКниги;
	АдреснаяКнига.Записать();

	Возврат ИдКниги;

КонецФункции

// получить все емейлы, привязанные к аккаунтом
Функция ПолучитьВыборкуВсехЕмейловАккаунтов(Регион = null) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АллокацииАккаунтов.ОбъектАллокации.Логин КАК Адрес
	|ИЗ
	|	РегистрСведений.АллокацииАккаунтов КАК АллокацииАккаунтов
	|ГДЕ
	|	АллокацииАккаунтов.ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.ПользователиСайтов)
	| И	НЕ АллокацииАккаунтов.Аккаунт.ПометкаУдаления
	| И	НЕ АллокацииАккаунтов.ОбъектАллокации.ПометкаУдаления
	| И	АллокацииАккаунтов.ОбъектАллокации.ВидЛогина = 2
	| И ВЫБОР
	| 	КОГДА &Регион IS NULL
	| 	ТОГДА ИСТИНА
	| 	ИНАЧЕ АллокацииАккаунтов.Аккаунт.Регион = &Регион
	| КОНЕЦ
	|";

	Если НЕ ЗначениеЗаполнено(Регион) Тогда
		Регион = null;
	КонецЕсли;

	Запрос.УстановитьПараметр("Регион", Регион);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
КонецФункции

// + 51085 ДДГ 28 мар 2022
Функция ПолучитьВыборкуЕмейловДляДополненияАдреснойКнигиПоАккаунту(АдреснаяКнига = null, Регион = null) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	spАдресныеКнигиПолучатели.Адрес
	|ПОМЕСТИТЬ
	|	ПолучателиКниги
	|ИЗ
	|	Справочник.spАдресныеКниги.Получатели
	|КАК
	|	spАдресныеКнигиПолучатели
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &АдреснаяКнига IS NULL
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ spАдресныеКнигиПолучатели.Ссылка = &АдреснаяКнига
	|	КОНЕЦ
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АллокацииАккаунтов.ОбъектАллокации.Логин КАК Адрес
	|ПОМЕСТИТЬ
	|	АдресаАккаунтов
	|ИЗ
	|	РегистрСведений.АллокацииАккаунтов.СрезПоследних(
	|		 , ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.ПользователиСайтов)
	|		 И НЕ Аккаунт.ПометкаУдаления
	|		 И НЕ ОбъектАллокации.ПометкаУдаления
	|		 И ОбъектАллокации.ВидЛогина = 2
	|		 И ВЫБОР
	|		 	КОГДА &Регион IS NULL
	|		 	ТОГДА ИСТИНА
	|		 	ИНАЧЕ Аккаунт.Регион = &Регион
	|		 КОНЕЦ
	|	) КАК АллокацииАккаунтов
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АдресаАккаунтов.Адрес,
	|	ИСТИНА КАК Добавить
	|ИЗ
	|	АдресаАккаунтов
	|ГДЕ
	|	АдресаАккаунтов.Адрес НЕ В (ВЫБРАТЬ Адрес ИЗ ПолучателиКниги)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПолучателиКниги.Адрес,
	|	ЛОЖЬ КАК Добавить
	|ИЗ
	|	ПолучателиКниги
	|ГДЕ
	|	ПолучателиКниги.Адрес НЕ В (ВЫБРАТЬ Адрес ИЗ АдресаАккаунтов)
	|
	|";

	Запрос.УстановитьПараметр("АдреснаяКнига",	АдреснаяКнига);
	Запрос.УстановитьПараметр("Регион",			Регион);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Возврат ВыборкаРезультата;

КонецФункции
// - 51085 ДДГ 28 мар 2022

#КонецОбласти
// АдресныеКниги

#Область Шаблоны
Процедура ЗагрузитьШаблоны(Аккаунт = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗагрузитьШаблоны)");
		Возврат;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	//Запрос=Новый HTTPЗапрос("/templates/ru?owner=me?access_token="+Сокрлп(Ключ),Заголовки);
	Запрос=Новый HTTPЗапрос("/templates/ru?owner=me?access_token="+Сокрлп(Ключ),Заголовки);
	
		
	//ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Для Каждого Соотв Из Результат Цикл
		
		НашШаблон =  Соотв.Получить("owner") = "you";
		real_id	  =  СокрЛП(Соотв.Получить("real_id"));
		name	  =  СокрЛП(Соотв.Получить("name"));
		preview	  =  СокрЛП(Соотв.Получить("preview"));

		created		= Соотв.Получить("created");

		Если НашШаблон 
			И ЗначениеЗаполнено(real_id)			
			Тогда 
			
			Спртут = Справочники.spШаблоны.НайтиПоРеквизиту("real_id",real_id);
			Если Не ЗначениеЗаполнено(Спртут) Тогда 				
				Спртут = Справочники.spШаблоны.НайтиПоНаименованию(name);	
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(Спртут) Тогда 				
				СпртутОбъект = Справочники.spШаблоны.СоздатьЭлемент();
			Иначе 
				СпртутОбъект = Спртут.ПолучитьОбъект();	
			КонецЕсли;
			
			СпртутОбъект.real_id = real_id; 
			СпртутОбъект.Наименование = name; 
			СпртутОбъект.preview = preview;
			СпртутОбъект.Аккаунт = Аккаунт;

			Если ЗначениеЗаполнено(created) Тогда
				СпртутОбъект.created = ПреобразоватьДатуSendPulse(created);
			КонецЕсли;

			Попытка
				СпртутОбъект.Записать();
			Исключение
				
			КонецПопытки;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВыгрузитьШаблоны(Аккаунт = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ВыгрузитьШаблоны)");
		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("Аккаунт", Аккаунт);
	
	ВыборкаШабонов  = Справочники.spШаблоны.Выбрать(,,Отбор);

	ДатаНачала = Дата(1,1,1);

	Пока ВыборкаШабонов.Следующий() Цикл 

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда

			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Accept", "application/json");
			Заголовки.Вставить("Content-Type","application/json");
			Заголовки.Вставить("charset","UTF-8");  	
			Заголовки.Вставить("Authorization","Bearer "+Сокрлп(Ключ));

		КонецЕсли;

	//	
		ШаблонСсылка 		= 	ВыборкаШабонов.Ссылка; 
		ТекИд  				=	ВыборкаШабонов.real_id;
		НаименованиеШаблона = 	СокрЛП(ВыборкаШабонов.Наименование);
		ВерсткаДляСайта		=   СокрЛП(ВыборкаШабонов.ВерсткаДляСайта);
		
		Если ВыборкаШабонов.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
	//	
		Если ЗначениеЗаполнено(ТекИд) Тогда 
			Продолжить;	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НаименованиеШаблона) Тогда 
			Продолжить;
		КонецЕсли;
		
		Кодировка = "UTF8";  
		
		//Кодировка = "ANSI";
		//Кодировка = "OEM";
		//Кодировка = "UTF8";
		//Кодировка = "UTF16";
		//Кодировка = "Системная";
	
	//	
		body64 = ЗашифроватьСтроку(ВерсткаДляСайта,Кодировка);
	//	
		Структура = новый Структура;
		Структура.Вставить("body",body64);
		Структура.Вставить("name",НаименованиеШаблона);

		ЗаписьJSON  = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,Структура);
		body64 = ЗаписьJSON.Закрыть();
	
	
		//body64 = Base64Строка(ВерсткаДляСайта);
		//Запson = yjрос=Новый HTTPЗапрос("/template?"+"name="+НаименованиеШаблона+"?lang=ru"+"?body="+body64,Заголовки);
		//Запрос=Новый HTTPЗапрос("/template?"+"name="+НаименованиеШаблона,Заголовки);
		//Запрос.УстановитьТелоИзСтроки("name="+НаименованиеШаблона+"&body="+body64+"&lang=ru",КодировкаТекста.UTF8);

		Запрос=Новый HTTPЗапрос("/template",Заголовки);
		//Запрос.УстановитьТелоИзСтроки("name="+НаименованиеШаблона+"&body="+body64+"&lang=ru",КодировкаТекста.UTF8);
		Запрос.УстановитьТелоИзСтроки(body64,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	//			
		Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

		Если Ответ.КодСостояния<>200 Тогда
		КонецЕсли;

		ОбщегоНазначения.СообщитьОбОшибке(""+Ответ.ПолучитьТелоКакСтроку());

		Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		ТекИД = Неопределено;

		Если Результат <> Неопределено Тогда
			ТекИД = Результат.Получить("id");
			СообщениеООшибке = Результат.Получить("message");
		КонецЕсли;

	//	
		//Если ЗначениеЗаполнено(ТекИД) Тогда 
		//	ТекКнигаОбъект 			= ШаблонСсылка.ПолучитьОбъект();			
		//	ТекКнигаОбъект.real_id	= ТекИД;
		//	Попытка
		//		ТекКнигаОбъект.Записать();
		//	Исключение				
		//	КонецПопытки;
		//Иначе 
		//	ОбщегоНазначения.СообщитьОбОшибке("Ошикибка при созадниии "+НаименованиеШаблона + "! Причина:"+ СообщениеООшибке);
		//КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// проверяет доступность картинки-предпросмотра на сервисе, возвращает булевое значение
Функция ДоступенВнешнийВидШаблона(ВебАдрес) Экспорт

	Если НЕ ЗначениеЗаполнено(ВебАдрес) Тогда
		Возврат Ложь;
	КонецЕсли;

	Домен = "login.sendpulse.com";
	Хост = "https://" + Домен + "/";

	ВебАдресКартинки = СтрЗаменить(ВебАдрес, Хост, "");

	Соед	= Новый HTTPСоединение(Домен);
	Запрос	= Новый HTTPЗапрос(ВебАдресКартинки);
	Ответ	= ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(
			 "Возможно, шаблон был удалён из сервиса. Код ответа = "
			+ Ответ.КодСостояния + ": " + Ответ.ПолучитьТелоКакСтроку()
		);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции
#КонецОбласти
// Шаблоны

#Область Отправители
Процедура ЗагрузитьОтправителей(Аккаунт = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗагрузитьОтправителей)");
		Возврат;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	//Запрос=Новый HTTPЗапрос("/templates/ru?owner=me?access_token="+Сокрлп(Ключ),Заголовки);
	Запрос=Новый HTTPЗапрос("/senders?access_token="+Сокрлп(Ключ),Заголовки);
		
//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Для Каждого Соотв Из Результат Цикл

		email = Соотв.Получить("email");
		email = СокрЛП(email);

		name = Соотв.Получить("name");
		name = СокрЛП(name);

		Статус = Соотв.Получить("status");
		
		Если ЗначениеЗаполнено(email) Тогда 

			ТекСпр = Справочники.spОтправители.НайтиПоРеквизиту("email",email);
			Если ЗначениеЗаполнено(ТекСпр) Тогда 
				ТекСпрОбъект = ТекСпр.ПолучитьОбъект(); 									
			Иначе 
				ТекСпрОбъект = Справочники.spОтправители.СоздатьЭлемент();
			КонецЕсли;

			ТекСпрОбъект.email			= email;
			ТекСпрОбъект.Наименование	= name;
			ТекСпрОбъект.Статус			= Статус;
			ТекСпрОбъект.Аккаунт		= Аккаунт;

			Попытка
				ТекСпрОбъект.Записать();
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать Отправителя ("+name+" "+email+") ");
			КонецПопытки;			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьОтправителей(Аккаунт = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ВыгрузитьОтправителей)");
		Возврат;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Отбор = Новый Структура;
	Отбор.Вставить("Аккаунт", Аккаунт);
	ВыборкаОтправителей  = Справочники.spОтправители.Выбрать(,,Отбор);

	// получаем перечень отправителей, которые уже есть в базе SendPulse
	СоотвЕмейлИмя = ПолучитьСписокОтправителей(Аккаунт);

	Пока ВыборкаОтправителей.Следующий() Цикл 
		//
		email 		 = СокрЛП(ВыборкаОтправителей.email);
		
		Наименование = СокрЛП(ВыборкаОтправителей.Наименование);
		//ИдКниги  =УбратьПробелыИзСтроки(ВыборкаКниг.ID);
		//
		Если НЕ ЗначениеЗаполнено(email) Тогда 
			Продолжить;
		КонецЕсли;

		Имя = СоотвЕмейлИмя.Получить(email);

		// пропускаем емейлы, которые уже есть в базе SendPulse
		Если Имя <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Запрос=Новый HTTPЗапрос("/senders?email="+email+"?name="+Наименование,Заголовки);
		Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&email="+email+"&name="+Наименование);

		Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

		Если Ответ.КодСостояния<>200 Тогда
			Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		КонецЕсли;

		Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		Если Результат = Неопределено Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
			Продолжить;
		КонецЕсли;

		ЗагрузкаРезультат =  Результат.Получить("result");
		Ошибка = Результат.Получить("message"); 

		Если ЗагрузкаРезультат <> Истина  Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка ("+email + "  "+Наименование+")"+Ошибка);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСписокОтправителей(Аккаунт = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ПолучитьМассивОтправителей)");
		Возврат Неопределено;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	//Запрос=Новый HTTPЗапрос("/templates/ru?owner=me?access_token="+Сокрлп(Ключ),Заголовки);
	Запрос=Новый HTTPЗапрос("/senders?access_token="+Сокрлп(Ключ),Заголовки);
	
		
//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	НаборЕмейлов = Новый Соответствие;

	Для Каждого Соотв Из Результат Цикл

		email = Соотв.Получить("email");
		email = СокрЛП(email);

		name = Соотв.Получить("name");
		name = СокрЛП(name);

		НаборЕмейлов.Вставить(email, name);

	КонецЦикла;

	Возврат НаборЕмейлов;

КонецФункции
#КонецОбласти
// Отправители

#Область ЧерныйСписок
// + IavanSidoruk 21.05.2019
Функция ПолучитьЧерныйСписок(МассивАдресов = Неопределено, Аккаунт = Неопределено) Экспорт 
	
	ТекстУсловия = "";
	Если ЗначениеЗаполнено(МассивАдресов) Тогда 
		ТекстУсловия  = "  И spЧерныйСписок.Адрес В(&МассивАдресов)	" + Символы.ПС;
	КонецЕсли;
	Если ЗначениеЗаполнено(Аккаунт) Тогда 
		ТекстУсловия  = "  И spЧерныйСписок.Аккаунт = &Аккаунт	" + Символы.ПС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивАдресов", МассивАдресов);
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	spЧерныйСписок.Адрес  КАК Адрес
		|ИЗ
		|	РегистрСведений.spЧерныйСписок КАК spЧерныйСписок
		|ГДЕ
		| ИСТИНА	
		|	"	+ТекстУсловия+"	
		|";
	
	ТаблицаРез = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблицаРез;
	
	
КонецФункции
// - IavanSidoruk 21.05.2019

// загружает чёрный список из SendPulse
Функция ПолучитьЧерныйСписокSendPulse(Аккаунт) Экспорт

	МассивАдресов = Новый Массив;

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ПолучитьЧерныйСписокSendPulse)");
		Возврат МассивАдресов;
	КонецЕсли;

	ДатаНачала = Дата(1,1,1);

	Для Инд=1 По 1000 Цикл   //цикл нужен, т.к. метод за 1 раз отдает не более 100 адресов

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		Смещение=(Инд-1)*100;
		СмещениеСтрокой = УбратьПробелыИзСтроки(Смещение);

		Запрос=Новый HTTPЗапрос("/blacklist/?access_token="+Сокрлп(Ключ)+"&limit=100&offset="+СмещениеСтрокой,Заголовки);

//		ВыхИмя=ПолучитьИмяВременногоФайла("txt");

		Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

		Если Ответ.КодСостояния<>200 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
			Возврат МассивАдресов;
		КонецЕсли;

		Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		Если Результат = Неопределено
		 ИЛИ Результат.Количество() = 0
		Тогда //кончились адреса
			Прервать;
		КонецЕсли;

		Для Каждого Соотв Из Результат Цикл
			ТекСтрока = СокрЛП(Соотв);
			
			//Добавим в базу
			Если ЗначениеЗаполнено(ТекСтрока) Тогда 
				МассивАдресов.Добавить(ТекСтрока);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

	Возврат МассивАдресов;

КонецФункции

// записывает загруженный чёрный список из SendPulse в 1С
Процедура ЗагрузитьЧерныйСписок(Аккаунт = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗагрузитьЧерныйСписок)");
		Возврат;
	КонецЕсли;

	МассивАдресов = ПолучитьЧерныйСписокSendPulse(Аккаунт);

	Для Каждого Адрес Из МассивАдресов Цикл

		Запись = РегистрыСведений.spЧерныйСписок.СоздатьМенеджерЗаписи();
		Запись.Адрес 		= Адрес; 
		Запись.Аккаунт		= Аккаунт;
		Запись.Прочитать();

		Если НЕ Запись.Выбран() Тогда
			Запись.Адрес 		= Адрес; 
			Запись.Аккаунт		= Аккаунт;
			Запись.ВведеноАвтоматически = Истина;
			Попытка
				Запись.Записать(Истина);
			Исключение
				
			КонецПопытки;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// выгружает чёрный список из 1С в SendPulse
Функция ВыгрузитьЧерныйСписок(Аккаунт = Неопределено, МассивАдресов = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ВыгрузитьЧерныйСписок)");
		Возврат Ложь;
	КонецЕсли;

	// если ничего не задано, то выгрузится всё, чего ещё нет на сервисе
	Если НЕ ЗначениеЗаполнено(МассивАдресов) Тогда

		ВсеАдреса = ПолучитьЧерныйСписокSendPulse(Аккаунт);

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	spЧерныйСписок.Адрес КАК Адрес
			|ИЗ
			|	РегистрСведений.spЧерныйСписок КАК spЧерныйСписок
			|ГДЕ
			|	spЧерныйСписок.Аккаунт = &Аккаунт
			| И spЧерныйСписок.Адрес НЕ В (&Адреса)";
		Запрос.УстановитьПараметр("Аккаунт",		Аккаунт);
		Запрос.УстановитьПараметр("Адреса",			ВсеАдреса);

		РезультатЗапроса = Запрос.Выполнить();

		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("Нет невыгруженных адресов.");
			Возврат Ложь;
		КонецЕсли;

		МассивАдресов = Новый Массив;

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивАдресов.Добавить(ВыборкаДетальныеЗаписи.Адрес);
		КонецЦикла;

	КонецЕсли;

	СтрокаСЗАпятыми ="";
	Для Каждого Адрес Из МассивАдресов Цикл

		ТекАдрес = СокрЛП(Адрес);
		ТекАдрес = НРег(ТекАдрес);

		Если ЗначениеЗаполнено(ТекАдрес) Тогда 
			СтрокаСЗАпятыми = СтрокаСЗАпятыми + ?(ЗначениеЗаполнено(СтрокаСЗАпятыми),",","") + ТекАдрес;						
		КонецЕсли;		

	КонецЦикла;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulseJSON(Ключ);

	СтрокаСЗАпятыми64 = ЗашифроватьСтроку(СтрокаСЗАпятыми,"ANSI");
	ТелоДжСОН = "{""emails"":""" + СтрокаСЗАпятыми64 + """}";

	Запрос=Новый HTTPЗапрос("/blacklist", Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоДжСОН, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
	
	КонецЕсли;

	Мас = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Результат = Ложь;

	Если Мас <> Неопределено Тогда
		Результат = Мас.Получить("result");
	КонецЕсли;

	Если Результат = Истина Тогда 
		Сообщить("Успешно выгружено на SendPulse.");
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка обновления черного списка!");
	КонецЕсли;

	Возврат Результат;

КонецФункции

// удаляет емейлы из чёрного списка SendPulse
Функция УдалитьАдресИзЧерногоСписка(Аккаунт = Неопределено, МассивАдресов)  Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (УдалитьАдресИзЧерногоСписка)");
		Успех = Ложь;
		Возврат Успех;
	КонецЕсли;


	СтрокаАдреса = "";
	Сч = 0;
	Для Каждого ТекАдрес из МассивАдресов Цикл 
		Если ЗначениеЗаполнено(ТекАдрес) Тогда 
			Сч = Сч +1;
			СтрокаАдреса = СтрокаАдреса  +?(ЗначениеЗаполнено(СтрокаАдреса),",","")+ТекАдрес; 
		КонецЕсли;		
	КонецЦикла;
	
	Если Сч = 0 Тогда
		Успех = Ложь;
		Возврат Успех;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulseJSON(Ключ);

	СтрокаСЗАпятыми64 = ЗашифроватьСтроку(СтрокаАдреса,"ANSI");
	ТелоДжСОН = "{""emails"":""" + СтрокаСЗАпятыми64 + """}";

	Запрос=Новый HTTPЗапрос("/blacklist", Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоДжСОН, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Ответ = ПолучитьОтветНаЗапросДЭЛИТ(Соед, Запрос);

	ТекСообщение = Ответ.ПолучитьТелоКакСтроку(); 

	Если Ответ.КодСостояния <> 200 Тогда 
		Успех = Ложь;
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+ТекСообщение);
	Иначе 
		Успех = Истина;		
		Сообщить("Успешно удалено из SendPulse.");
	КонецЕсли;

	Возврат Успех;

КонецФункции

Процедура ОчиститьЧерныйСписок(Аккаунт) Экспорт

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ОчиститьЧерныйСписок)");
		Возврат;
	КонецЕсли;

	// + 003590 ДДГ 10 ноя 2020
	// очистка регистра от имеющихся записей, чтобы в регистр попали только ящики из сервиса
	НаборЗаписей = РегистрыСведений.spЧерныйСписок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Аккаунт.Установить(Аккаунт);
	НаборЗаписей.Записать();
	// - 003590 ДДГ 10 ноя 2020

КонецПроцедуры

#КонецОбласти
// ЧерныйСписок

#Область Кампании
Процедура ЗагрузитьКомпании(Аккаунт = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ЗагрузитьКомпании)");
		Возврат;
	КонецЕсли;

	ДатаНачала = ТекущаяДатаСеанса();

	Соед = РазработкаСервер.Подключение();
	
	Ключ = ПолучитьКлюч(Соед, Аккаунт);		

	Заголовки=Новый Соответствие;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type","application/json");
	Заголовки.Вставить("charset","UTF-8");  	
	Заголовки.Вставить("Authorization","Bearer "+Сокрлп(Ключ));

	//Запрос=Новый HTTPЗапрос("/templates/ru?owner=me?access_token="+Сокрлп(Ключ),Заголовки);
	//Запрос=Новый HTTPЗапрос("/campaigns?access_token="+Сокрлп(Ключ),Заголовки);
	Запрос=Новый HTTPЗапрос("/campaigns", Заголовки);

//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Заголовки = ПолучитьЗаголовкиSendPulse(Ключ);

	Для Каждого Соотв Из Результат Цикл

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		Текid			= СокрЛП(Соотв.Получить("id"));
		name			= Соотв.Получить("name");

		Если ЗначениеЗаполнено(Текid) Тогда

			ТекСпр = Справочники.spКомпании.НайтиПоРеквизиту("ID",Текid);
			Если ЗначениеЗаполнено(ТекСпр) Тогда 
				ТекСпрОбъект = ТекСпр.ПолучитьОбъект(); 									
			Иначе 
				ТекСпрОбъект = Справочники.spКомпании.СоздатьЭлемент();
			КонецЕсли;

			идКампании = Текid;
			идКампании = УбратьПробелыИзСтроки(идКампании);

			Запрос=Новый HTTPЗапрос("/campaigns/"+идКампании ,Заголовки);
			Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&id="+идКампании);
			
//			ВыхИмя=ПолучитьИмяВременногоФайла("txt");

			Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

			Если Ответ.КодСостояния<>200 Тогда
				Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
				Продолжить;
			КонецЕсли;

			Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

			Если Результат = Неопределено Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
				Продолжить;
			КонецЕсли;

			ЗаполнитьИнформациюПоКампании(ТекСпрОбъект, Результат);
			ТекСпрОбъект.Аккаунт = Аккаунт;

			Попытка
				ТекСпрОбъект.Записать();
				ЗаписатьСтатистикуКампании(ТекСпрОбъект.Ссылка, Результат);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать Кампании ("+name+" "+Текid+") ");
			КонецПопытки;			
			
		КонецЕсли;

		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВыгрузитьКомапании(Аккаунт = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ВыгрузитьКомапании)");
		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("Аккаунт", Аккаунт);
	
	ВыборкаКампаний  = Справочники.spКомпании.Выбрать(,,Отбор);
	
	//Ограничение - 4 рассылки в час!

	ДатаНачала = Дата(1,1,1);

	Пока ВыборкаКампаний.Следующий() Цикл 

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		ТекИд			=	ВыборкаКампаний.ID;
		ТекИд			=	УбратьПробелыИзСтроки(ТекИд);
		ИмяКампании		=	СокрЛП(ВыборкаКампаний.Наименование);
		
		Если ЗначениеЗаполнено(ТекИд) Тогда 
			Продолжить;	
		КонецЕсли;
		
		Если ВыборкаКампаний.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
			 
		
		Если НЕ ЗначениеЗаполнено(ИмяКампании) Тогда 
			Продолжить;
		КонецЕсли;
		//
		ДатаОтправки = ВыборкаКампаний.send_date;	
		
		sender_name = СокрЛП(ВыборкаКампаний.Оправитель.Наименование);
		sender_email= СокрЛП(ВыборкаКампаний.Оправитель.email);
		subject     = ВыборкаКампаний.subject;
		body		= "";
		template_id = УбратьПробелыИзСтроки(ВыборкаКампаний.Шаблон.real_id);
		list_id     = УбратьПробелыИзСтроки(ВыборкаКампаний.АдреснаяКнига.ID);
		send_date   = Формат(ДатаОтправки,"ЧЦ=; ДФ=гггг-ММ-дд")+" "+Формат(ДатаОтправки,"ДФ=ЧЧ:мм:сс");
		name        = ИмяКампании;
		
		
		//
		Запрос=Новый HTTPЗапрос("/campaigns?"+"name="+name+"&sender_name="+sender_name+"&sender_email="+sender_email+""
		+"&subject="+subject+"&body="+body+"&template_id="+template_id+"&list_id="+list_id+"&send_date="+send_date
		,Заголовки);
		
		Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&name="+name+"&sender_name="+sender_name+"&sender_email="+sender_email+""
		+"&subject="+subject+"&body="+body+"&template_id="+template_id+"&list_id="+list_id+"&send_date="+send_date);
		
		
		//Запрос.УстановитьТелоИзСтроки("name="+name);
		//		
		Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

		Если Ответ.КодСостояния<>200 Тогда			
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
		  	Возврат
		КонецЕсли;

		Мас = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		Если Мас = Неопределено Тогда
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
			Возврат;
		КонецЕсли;

		ТекИД 			 =  СокрЛП(Мас.Получить("id"));
		СообщениеООшибке =  СокрЛП(Мас.Получить("message"));
		status		     =  СокрЛП(Мас.Получить("status"));
		tariff_email_qty =  Мас.Получить("tariff_email_qty");
		overdraft_price	 =  Мас.Получить("overdraft_price");
		paid_email_qty   =  Мас.Получить("paid_email_qty");
		ovedraft_currency=  Мас.Получить("ovedraft_currency");
		count			 =  Мас.Получить("count");

		//
		Если ЗначениеЗаполнено(ТекИД) Тогда

			ТекКомания = ВыборкаКампаний.Ссылка;
			ТекКоманияОбъект = ТекКомания.ПолучитьОбъект();
			ЗаполнитьСтатусыКампании(ТекКоманияОбъект, Мас);
			//Руслан 20.05.2021 12:45:21{
			Адреса = ТекКоманияОбъект.АдреснаяКнига.Получатели.Выгрузить();
			СписокАдресов = Адреса.ВыгрузитьКолонку("Адрес");
			
			ЗапросКИ = Новый Запрос;
			ЗапросКИ.Текст = "ВЫБРАТЬ
			|	КонтактнаяИнформация.Ссылка,
			|	КонтактнаяИнформация.Наименование
			|ПОМЕСТИТЬ КИ
			|ИЗ
			|	Справочник.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.ВидЛогина = 2
			|	И КонтактнаяИнформация.Наименование В(&СписокАдресов)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Адреса.Адрес,
			|	Адреса.Статус,
			|	Адреса.СтатусПояснение,
			|	КИ.Ссылка КАК КонтактнаяИнформация
			|ИЗ
			|	Адреса КАК Адреса
			|		ЛЕВОЕ СОЕДИНЕНИЕ КИ КАК КИ
			|		ПО Адреса.Адрес = КИ.Наименование";
			ЗапросКИ.УстановитьПараметр("СписокАдресов",СписокАдресов);
			РезультатЗапросаКИ = ЗапросКИ.Выполнить().Выгрузить();
			
			
			ТекКоманияОбъект.Адреса.Загрузить(РезультатЗапросаКИ);//}Руслан 20.05.2021 12:47:44
			
			Попытка
				ТекКоманияОбъект.Записать();
				ЗаписатьСтатистикуКампании(ТекКомания, Мас);
			Исключение				
			КонецПопытки;
		Иначе 
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при выгрузке кампании "+ИмяКампании + "! Причина:"+ СообщениеООшибке);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьКомапанию(Аккаунт, Кампания) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ВыгрузитьКомапании)");
		Возврат;
	КонецЕсли;

	ТекИд			=	Кампания.ID;
	ТекИд			=	УбратьПробелыИзСтроки(ТекИд);
	ИмяКампании		=	СокрЛП(Кампания.Наименование);

	Если ЗначениеЗаполнено(ТекИд) ИЛИ Кампания.ПометкаУдаления ИЛИ НЕ ЗначениеЗаполнено(ИмяКампании) Тогда 
		Возврат;	
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	//
	ДатаОтправки = Кампания.send_date;	

	sender_name = СокрЛП(Кампания.Оправитель.Наименование);
	sender_email= СокрЛП(Кампания.Оправитель.email);
	subject     = Кампания.subject;
	body		= "";
	template_id = УбратьПробелыИзСтроки(Кампания.Шаблон.real_id);
	list_id     = УбратьПробелыИзСтроки(Кампания.АдреснаяКнига.ID);
	send_date   = Формат(ДатаОтправки,"ЧЦ=; ДФ=гггг-ММ-дд")+" "+Формат(ДатаОтправки,"ДФ=ЧЧ:мм:сс");
	name        = ИмяКампании;

	Запрос=Новый HTTPЗапрос("/campaigns?"+"name="+name+"&sender_name="+sender_name+"&sender_email="+sender_email+""
	+"&subject="+subject+"&body="+body+"&template_id="+template_id+"&list_id="+list_id+"&send_date="+send_date
	,Заголовки);

	Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&name="+name+"&sender_name="+sender_name+"&sender_email="+sender_email+""
	+"&subject="+subject+"&body="+body+"&template_id="+template_id+"&list_id="+list_id+"&send_date="+send_date);

	Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда			
		Сообщить(Ответ.ПолучитьТелоКакСтроку());
	  	Возврат;
	КонецЕсли;

	Мас = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Мас = Неопределено Тогда
		Сообщить(Ответ.ПолучитьТелоКакСтроку());
	  	Возврат;
	КонецЕсли;

	ТекИД 			 =  СокрЛП(Мас.Получить("id"));
	СообщениеООшибке =  СокрЛП(Мас.Получить("message"));
	status		     =  СокрЛП(Мас.Получить("status"));
	tariff_email_qty =  Мас.Получить("tariff_email_qty");
	overdraft_price	 =  Мас.Получить("overdraft_price");
	paid_email_qty   =  Мас.Получить("paid_email_qty");
	ovedraft_currency=  Мас.Получить("ovedraft_currency");
	count			 =  Мас.Получить("count");

	//
	Если ЗначениеЗаполнено(ТекИД) Тогда 

		ТекКоманияОбъект = Кампания.Ссылка.ПолучитьОбъект();			

		ТекКоманияОбъект.ID = ТекИД;

		ЗаполнитьСтатусыКампании(ТекКоманияОбъект, Мас);

		Попытка
			ТекКоманияОбъект.Записать();
		Исключение
		КонецПопытки;

	Иначе 
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при выгрузке кампании "+ИмяКампании + "! Причина:"+ СообщениеООшибке);
	КонецЕсли;					
	
КонецПроцедуры

Процедура ОтменитьКампанию(Аккаунт, Кампания) Экспорт

	// + 003590 ДДГ 22 окт 2020
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ОтменитьКампанию)");
		Возврат;
	КонецЕсли;

	ТекИд			=	Кампания.ID;
	ТекИд			=	УбратьПробелыИзСтроки(ТекИд);

	Если Не ЗначениеЗаполнено(ТекИд) Тогда
		Сообщить("ID не заполнен!");
		Возврат;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос = Новый HTTPЗапрос("/campaigns/"+ТекИд, Заголовки);
	Ответ = ПолучитьОтветНаЗапросДЭЛИТ(Соед, Запрос);
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();

	Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
	// - 003590 ДДГ 22 окт 2020

КонецПроцедуры

// получить стоимость рассылки по адресной книге
Функция ПолучитьСтоимостьКампании(АдреснаяКнига) Экспорт

	Если НЕ ЗначениеЗаполнено(АдреснаяКнига) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИдКниги = УбратьПробелыИзСтроки(АдреснаяКнига.ID);

	Если НЕ ЗначениеЗаполнено(ИдКниги) Тогда 
		Возврат Неопределено;
	КонецЕсли;

	Аккаунт = АдреснаяКнига.Аккаунт;

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("У выбранной книги не заполнен аккаунт! (ПолучитьСтоимостьКампании)");
		Возврат Неопределено;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос = Новый HTTPЗапрос("/addressbooks/" + Сокрлп(ИдКниги) + "/cost/" + "?access_token="+Сокрлп(Ключ), Заголовки);

//	ВыхИмя = ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	СтруктураОтвета = Новый Структура;

	// + 003590 ДДГ 22 окт 2020
	Для Каждого Соотв Из Результат Цикл
		СтруктураОтвета.Вставить(Соотв.Ключ, Соотв.Значение);
	КонецЦикла;
	// - 003590 ДДГ 22 окт 2020

	Возврат СтруктураОтвета;

КонецФункции

// получить баланс
Функция ПолучитьБаланс(Аккаунт=Неопределено, Валюта="") Экспорт

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ПолучитьБаланс)");
		Возврат Неопределено;
	КонецЕсли;

	Если ПустаяСтрока(Валюта) Тогда 
		Сообщить("Не заполнена валюта! (ПолучитьБаланс)");
		Возврат Неопределено;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, Аккаунт);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	Запрос = Новый HTTPЗапрос("/balance/" + Валюта + "?access_token="+Сокрлп(Ключ), Заголовки);

//	ВыхИмя = ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	СтруктураОтвета = Новый Структура;

	// + 003590 ДДГ 22 окт 2020
	Для Каждого Соотв Из Результат Цикл
		СтруктураОтвета.Вставить(Соотв.Ключ, Соотв.Значение);
	КонецЦикла;
	// - 003590 ДДГ 22 окт 2020

	Возврат СтруктураОтвета;

	// currency				"RUR"
	// balance_currency		0

КонецФункции
#КонецОбласти
// Кампании

#Область СтатистикаКампании
Функция ПолучитьОписаниеСтатуса(ТекСтатус) Экспорт 
	
	ТекСоответстиве = Новый Соответствие;
	ТекСоответстиве.Вставить("0","Новое задание на рассылку");
	ТекСоответстиве.Вставить("1","Ожидается отправка (на модерации)");
	ТекСоответстиве.Вставить("2","Отправляется");
	ТекСоответстиве.Вставить("3","Отправлено");
	ТекСоответстиве.Вставить("4","Тестовая отправка (на имейл пользователя)");
	ТекСоответстиве.Вставить("5","Рассылка заблокирована (администрацией)");
	ТекСоответстиве.Вставить("6","Рассылка помечена для удаления");
	ТекСоответстиве.Вставить("7","Обновление статусов (последует статус «3»)");
	ТекСоответстиве.Вставить("8","Тестовая кампания отправлена");
	ТекСоответстиве.Вставить("9","Идет отправка");
	ТекСоответстиве.Вставить("10","Обрабатывается, готовится к отправке");
	ТекСоответстиве.Вставить("11","Ожидается ответ от пользователя на уточняющий вопрос модератора");
	ТекСоответстиве.Вставить("12","Нет активных адресов");
	ТекСоответстиве.Вставить("13","Кампания в процессе создания — адреса из адресной книги переносятся в кампанию. После окончания переноса выставляется статус «2» для адресов меньше 20-ти или «1» в ином случае.");
	ТекСоответстиве.Вставить("14","Кампания создана и отправлена в очередь для отправки. После отправки статус изменится на «3».");
	ТекСоответстиве.Вставить("15","Кампания ожидает итога A/B тестирования");
	ТекСоответстиве.Вставить("16","Отправка кампании отменена пользователем");
	ТекСоответстиве.Вставить("22","Отправляется частично");
	ТекСоответстиве.Вставить("23","Отправлена частично");
	ТекСоответстиве.Вставить("25","Рассылка заблокирована администрацией после частичной отправки");
	ТекСоответстиве.Вставить("26","Черновик");
	ТекСоответстиве.Вставить("28","Запланирована отправка по непрочитанным");
	ТекСоответстиве.Вставить("33","Автосерии. Для отправки рассылки не хватило средств на балансе");
	ТекСоответстиве.Вставить("36","Черновик автосерии");
	
	СткрокаКлюч = СокрЛП(ТекСтатус);
	ТекПредставление = СокрЛП(ТекСоответстиве.Получить(СткрокаКлюч));
	Если Не ЗначениеЗаполнено(ТекПредставление) Тогда 
		ТекПредставление = "Не неопределено";	
	КонецЕсли;
	
	Возврат ТекПредставление;
	
	//0 Новое задание на рассылку
	//1 Ожидается отправка (на модерации)
	//2Отправляется
	//3Отправлено
	//4Тестовая отправка (на имейл пользователя)
	//5Рассылка заблокирована (администрацией)
	//6Рассылка помечена для удаления
	//7Обновление статусов (последует статус «3»)
	//8Тестовая кампания отправлена
	//9Идет отправка
	//10Обрабатывается, готовится к отправке
	//11Ожидается ответ от пользователя на уточняющий вопрос модератора
	//12Нет активных адресов
	//13Кампания в процессе создания — адреса из адресной книги переносятся в кампанию. После окончания переноса выставляется статус «2» для адресов меньше 20-ти или «1» в ином случае.
	//14Кампания создана и отправлена в очередь для отправки. После отправки статус изменится на «3».
	//15Кампания ожидает итога A/B тестирования
	//16Отправка кампании отменена пользователем
	//22Отправляется частично
	//23Отправлена частично
	//25 Рассылка заблокирована администрацией после частичной отправки
	//26 Черновик
	//27Необходимо редактирование
	//28Запланирована отправка по непрочитанным
	//33Автосерии. Для отправки рассылки не хватило средств на балансе
	//36Черновик автосерии
	
	
	
	
	
	
КонецФункции

Процедура ОбновитьСтатистику(Аккаунт = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(Аккаунт) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ОбновитьСтатистику)");
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	// + 003590 ДДГ 22 окт 2020
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	// - 003590 ДДГ 22 окт 2020
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	spКомпании.ID КАК ID,
		|	spКомпании.Ссылка
		|ИЗ
		|	Справочник.spКомпании КАК spКомпании
		|ГДЕ
		|	spКомпании.ID <> &ПустаяСтрока
		| И spКомпании.Аккаунт = &Аккаунт
		|";

	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ДатаНачала = Дата(1,1,1);

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		КомпанияСсылка = ВыборкаДетальныеЗаписи.Ссылка; 
		
		идКомпании = ВыборкаДетальныеЗаписи.ID;
		идКомпании = УбратьПробелыИзСтроки(идКомпании);
		Если Не ЗначениеЗаполнено(идКомпании) Тогда 
			Продолжить;
		КонецЕсли;
		
		//
		//campaigns/{id}
		//"?access_token="+Сокрлп(Ключ)
		Запрос=Новый HTTPЗапрос("/campaigns/"+идКомпании ,Заголовки);
		Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&id="+идКомпании);
		
//		ВыхИмя=ПолучитьИмяВременногоФайла("txt");

		Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

		Если Ответ.КодСостояния <> 200 Тогда
			Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
			Возврат;
		КонецЕсли;

		Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

		Если Результат = Неопределено Тогда
			Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
			Возврат;
		КонецЕсли;

		ТекКомпания = ВыборкаДетальныеЗаписи.Ссылка;
		ТекКомпанияОбъект = ТекКомпания.ПолучитьОбъект();
		ЗаполнитьИнформациюПоКампании(ТекКомпанияОбъект, Результат);

		Попытка
			ТекКомпанияОбъект.Записать();
			ЗаписатьСтатистикуКампании(ТекКомпания, Результат);
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать "+ВыборкаДетальныеЗаписи.Ссылка+ "!");
		КонецПопытки;
		
		//Для Каждого Соотв Из Мас Цикл
		//КонецЦикла
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьСтатистикуКампании(Кампания) Экспорт 

	аккаунтКампании = Кампания.Аккаунт;

	Если Не ЗначениеЗаполнено(аккаунтКампании) Тогда 
		Сообщить("Перед выполнением нужно выбрать аккаунт! (ОбновитьСтатистикуКампании)");
		Возврат;
	КонецЕсли;

	идКампании = Кампания.ID;
	идКампании = УбратьПробелыИзСтроки(идКампании);

	Если ПустаяСтрока(идКампании) Тогда
		Сообщить("Невозможно обновить статистику кампании, которая не была выгружена на сервис (пустой id).");
		Возврат;
	КонецЕсли;

	Соед		= Подключение();
	Ключ		= ПолучитьКлюч(Соед, аккаунтКампании);
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	//
	//campaigns/{id}
	//"?access_token="+Сокрлп(Ключ)
	Запрос=Новый HTTPЗапрос("/campaigns/"+идКампании ,Заголовки);
	Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&id="+идКампании);
	
//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Свойства = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Свойства = Неопределено Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	ТекКомпанияОбъект = Кампания.ПолучитьОбъект();

	ЗаполнитьИнформациюПоКампании(ТекКомпанияОбъект, Свойства);

	Попытка
		ТекКомпанияОбъект.Записать();
		ЗаписатьСтатистикуКампании(Кампания, Свойства);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать " + Кампания + "!");
	КонецПопытки;

	//Для Каждого Соотв Из Мас Цикл
	//КонецЦикла
	
КонецПроцедуры

Процедура ЗаписатьСтатистикуКампании(КампанияСсылка, Свойства) Экспорт

	statistics	= Свойства.Получить("statistics");
	general		= statistics.Получить("general");

	Если general = Неопределено Тогда
		general = statistics;
	КонецЕсли;

	Если general <> Неопределено Тогда 			
		Для Каждого СтрокаСтатистики из general Цикл 
			Пояснение 	= СокрЛП(СтрокаСтатистики.Получить("explain"));
			Количество	= СтрокаСтатистики.Получить("count");
			Код 		= СтрокаСтатистики.Получить("code");
			
			Если ЗначениеЗаполнено(Пояснение) Тогда 
				
				Набор = РегистрыСведений.СтатистикаПоКомпаниям.СоздатьНаборЗаписей();
				Набор.Отбор.Компания.Установить(КампанияСсылка);
				Набор.Отбор.Пояснение.Установить(Пояснение);
				
				Набор.Прочитать();
				
				Если Набор.Количество() = 0 Тогда 
					Запись = Набор.Добавить();
					Запись.Активность	= Истина;
					Запись.Компания		= КампанияСсылка;
					Запись.Пояснение	= Пояснение;
				Иначе 
					Запись = Набор[0];
				КонецЕсли;
				
				Если Запись.Количество <> Количество 
					или Запись.Код <> Код Тогда 
					
					Запись.Количество	= Количество;
					Запись.Код			= Код;
					
					Попытка
						Набор.Записать();
						КампанияОбъект = КампанияСсылка.ПолучитьОбъект();
						КампанияОбъект.ДатаОбновленияСтатистики = ТекущаяДатаСеанса();
						КампанияОбъект.Записать();
					Исключение							
					КонецПопытки;
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСтатусыКампании(КампанияОбъект, Свойства)

	ID					= Строка(Свойства.Получить("id"));
	status				= Свойства.Получить("status");
	all_email_qty		= Свойства.Получить("all_email_qty");
	tariff_email_qty	= Свойства.Получить("tariff_email_qty");
	overdraft_currency	= Свойства.Получить("overdraft_currency");
	paid_email_qty		= Свойства.Получить("paid_email_qty");
	overdraft_price		= Свойства.Получить("overdraft_price");

	КампанияОбъект.ID 					= ID;
	КампанияОбъект.status 				= status;
	КампанияОбъект.all_email_qty 		= all_email_qty;
	КампанияОбъект.tariff_email_qty		= tariff_email_qty;
	КампанияОбъект.paid_email_qty		= paid_email_qty;
	КампанияОбъект.overdraft_price 		= overdraft_price;
	КампанияОбъект.overdraft_currency 	= overdraft_currency;

	КампанияОбъект.СтатусСтрока			= ПолучитьОписаниеСтатуса(status);

КонецПроцедуры

Процедура ЗаполнитьИнформациюПоКампании(КампанияОбъект, Свойства)

	ЗаполнитьСтатусыКампании(КампанияОбъект, Свойства);

	name				= Свойства.Получить("name");
	КампанияОбъект.Наименование			= name;

	send_date			= Свойства.Получить("send_date");
	Если ЗначениеЗаполнено(send_date) Тогда
		КампанияОбъект.send_date = ПреобразоватьДатуSendPulse(send_date);
	КонецЕсли;

	message				= Свойства.Получить("message");

	Если ТипЗнч(message) = Тип("Соответствие") Тогда 
		subject 	= message.Получить("subject");
		attachments = message.Получить("attachments");
		list_id 	= Строка(message.Получить("list_id"));
		sender_email = message.Получить("sender_email"); 
		
		Оправитель		= Справочники.spОтправители.НайтиПоРеквизиту("email",sender_email);
		//Шаблон			= Справочники.spШаблоны.НайтиПоРеквизиту("real_id",list_id);
		АдреснаяКнига	= Справочники.spАдресныеКниги.НайтиПоРеквизиту("ID",list_id);

		КампанияОбъект.Оправитель 		= Оправитель;
		КампанияОбъект.subject 			= subject;
		КампанияОбъект.attachments		= attachments;						
		КампанияОбъект.АдреснаяКнига	= АдреснаяКнига;

	КонецЕсли;

КонецПроцедуры

Функция ПреобразоватьДатуSendPulse(send_date) Экспорт
	// + 003590 ДДГ 22 окт 2020

	ПреобразованнаяДата = СтрЗаменить(send_date,"-","");
	ПреобразованнаяДата = СтрЗаменить(ПреобразованнаяДата,":","");
	ПреобразованнаяДата = СтрЗаменить(ПреобразованнаяДата," ","");

	// дата возвращается по гринвичу, добавляем 3 часа для Москвы
	ПреобразованнаяДата = Дата(ПреобразованнаяДата) + 3*3600;
	Возврат ПреобразованнаяДата;

	// - 003590 ДДГ 22 окт 2020
КонецФункции
#КонецОбласти
// СтатистикаКампании

#Область СтатистикаРассылок
//СТАТИСТИКА ПО EMAIL РАССЫЛКЕ
Процедура ИнформацияКомпанииПоID(Аккаунт, Компания) Экспорт
	
	//https://api.sendpulse.com/campaigns/{id}
	Соед = Подключение();
	
	Ключ = ПолучитьКлюч(Соед, Аккаунт);

	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	идКомпании = Компания.ID;
	идКомпании = УбратьПробелыИзСтроки(идКомпании);
	Если Не ЗначениеЗаполнено(идКомпании) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос=Новый HTTPЗапрос("/campaigns/"+идКомпании ,Заголовки);
	Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&id="+идКомпании);
	
//	ВыхИмя=ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

	Если Ответ.КодСостояния<>200 Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Мас = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Мас = Неопределено Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Набор_spИнформацияПоКомпаниям = РегистрыСведений.spИнформацияПоКомпаниям.СоздатьНаборЗаписей();
	Набор_spИнформацияПоКомпаниям.Отбор.Компания.Установить(Компания);
	Набор_spИнформацияПоКомпаниям.Прочитать();
	
	Если Набор_spИнформацияПоКомпаниям.Количество() = 0 Тогда
		Запись_spИнформацияПоКомпаниям = Набор_spИнформацияПоКомпаниям.Добавить();	
		Запись_spИнформацияПоКомпаниям.Активность	= Истина;
		Запись_spИнформацияПоКомпаниям.Компания	= Компания;
	Иначе 
		Запись_spИнформацияПоКомпаниям = Набор_spИнформацияПоКомпаниям[0];
	КонецЕсли;
		
	Запись_spИнформацияПоКомпаниям.status				= Мас.Получить("status");
	Запись_spИнформацияПоКомпаниям.all_email_qty		= Мас.Получить("all_email_qty");
	Запись_spИнформацияПоКомпаниям.tariff_email_qty		= Мас.Получить("tariff_email_qty");
	Запись_spИнформацияПоКомпаниям.overdraft_currency	= Мас.Получить("overdraft_currency");
	Запись_spИнформацияПоКомпаниям.send_date			= Мас.Получить("send_date");
	Запись_spИнформацияПоКомпаниям.paid_email_qty		= Мас.Получить("paid_email_qty");
	Запись_spИнформацияПоКомпаниям.permalink			= Мас.Получить("permalink");
	Запись_spИнформацияПоКомпаниям.name					= Мас.Получить("name");
	Запись_spИнформацияПоКомпаниям.overdraft_price		= Мас.Получить("overdraft_price");
	
	statistics = Мас.Получить("statistics");
	message	   = Мас.Получить("message");
		
	Если ТипЗнч(message) = Тип("Соответствие") Тогда 
		Запись_spИнформацияПоКомпаниям.sender_name  = message.Получить("sender_name");
		Запись_spИнформацияПоКомпаниям.subject 	    = message.Получить("subject");
		Запись_spИнформацияПоКомпаниям.body 		= Новый ХранилищеЗначения(message.Получить("body"), Новый СжатиеДанных(9));
		Запись_spИнформацияПоКомпаниям.sender_email = message.Получить("sender_email");
		Запись_spИнформацияПоКомпаниям.list_id 	    = message.Получить("list_id");
	КонецЕсли;
	
	Попытка
		Набор_spИнформацияПоКомпаниям.Записать(Истина);
	Исключение
	КонецПопытки;
	
	Если statistics <> Неопределено Тогда 			
		Для Каждого СтрокаСтатистики из statistics Цикл 
			Пояснение 	= СокрЛП(СтрокаСтатистики.Получить("explain"));
			Количество	= СтрокаСтатистики.Получить("count");
			Код 		= СтрокаСтатистики.Получить("code");	
			
			Статус = Справочники.spСтатусыАдресовКомпании.НайтиПоКоду(Код);
			Если Не ЗначениеЗаполнено(Статус) Тогда 
				СпрОбъект = Справочники.spСтатусыАдресовКомпании.СоздатьЭлемент();
				СпрОбъект.Код = Код;
				СпрОбъект.Наименование = Пояснение;
				СпрОбъект.Записать();
				Статус = СпрОбъект.Ссылка;
			КонецЕсли;
			
			Набор_spИнформацияПоКомпаниямСтатусыАдресов = РегистрыСведений.spИнформацияПоКомпаниямСтатусыАдресов.СоздатьНаборЗаписей();
			Набор_spИнформацияПоКомпаниямСтатусыАдресов.Отбор.Компания.Установить(Компания);
			Набор_spИнформацияПоКомпаниямСтатусыАдресов.Отбор.Статус.Установить(Статус);
			Набор_spИнформацияПоКомпаниямСтатусыАдресов.Прочитать();
			
			Если Набор_spИнформацияПоКомпаниямСтатусыАдресов.Количество() = 0 Тогда
				Запись_spИнформацияПоКомпаниямСтатусыАдресов = Набор_spИнформацияПоКомпаниямСтатусыАдресов.Добавить();	
				Запись_spИнформацияПоКомпаниямСтатусыАдресов.Активность	= Истина;
			Иначе 
				Запись_spИнформацияПоКомпаниямСтатусыАдресов = Набор_spИнформацияПоКомпаниямСтатусыАдресов[0];
			КонецЕсли;
			
			Запись_spИнформацияПоКомпаниямСтатусыАдресов.Компания	= Компания;
			Запись_spИнформацияПоКомпаниямСтатусыАдресов.Статус	= Статус;
			Запись_spИнформацияПоКомпаниямСтатусыАдресов.Пояснение	= Пояснение;
			Запись_spИнформацияПоКомпаниямСтатусыАдресов.Количество	= Количество;
			
			Попытка
				Набор_spИнформацияПоКомпаниямСтатусыАдресов.Записать(Истина);
			Исключение
			КонецПопытки;
			
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

Процедура СтатистикаАдресовПоВсемКомпаниям(Аккаунт, МассивАдресов = Неопределено) Экспорт
	
	//https://api.sendpulse.com/emails/campaigns
	Если МассивАдресов = Неопределено Тогда 
		МассивАдресов = ЭлектронныеАдресаАккаунта(Аккаунт);	
	КонецЕсли;
	
	Если Не ТипЗнч(МассивАдресов) = Тип("Массив") Тогда 
		Возврат;
	КонецЕсли;
	
	Если МассивАдресов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
		
	Соед = Подключение();
	
	Ключ = ПолучитьКлюч(Соед, Аккаунт);
	
	Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,МассивАдресов); 
	СтрокаJSONАдреса = ЗаписьJSON.Закрыть();
	
	Запрос=Новый HTTPЗапрос("/emails/campaigns?emails="+СтрокаJSONАдреса,Заголовки);
	Запрос.УстановитьТелоИзСтроки("access_token="+Сокрлп(Ключ)+"&emails="+СтрокаJSONАдреса);

//	ВременныйФайл = ПолучитьИмяВременногоФайла("txt");

	Ответ = ПолучитьОтветНаЗапросПОСТ(Соед, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());

	Если Результат = Неопределено Тогда
		Сообщить("Код ответа="+Ответ.КодСостояния+" "+Ответ.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;

	Для Каждого ЭлАдрес Из Результат Цикл 
		ЭлАдресСтрока = ЭлАдрес.Ключ;
		sent = ЭлАдрес.Значение.Получить("sent");
		link = ЭлАдрес.Значение.Получить("link");
		blacklist = ЭлАдрес.Значение.Получить("blacklist");
		open = ЭлАдрес.Значение.Получить("open");
		adressbooks = ЭлАдрес.Значение.Получить("adressbooks");
		КоличествоАдресныхКниг = adressbooks.Количество();
		//Для Каждого АдресныеКниги Из adressbooks Цикл 
		//	АдресныеКнигаИмя = АдресныеКниги.Получить("name");
		//	АдресныеКнигаId = АдресныеКниги.Получить("id");
		//КонецЦикла;	
		
		Набор_spСтатистикаАдресовПоКомпаниям = РегистрыСведений.spСтатистикаАдресовПоВсемКомпаниям.СоздатьНаборЗаписей();
		Набор_spСтатистикаАдресовПоКомпаниям.Отбор.ЭлектронныйАдрес.Установить(ЭлАдресСтрока);
		Набор_spСтатистикаАдресовПоКомпаниям.Прочитать();
		
		Если Набор_spСтатистикаАдресовПоКомпаниям.Количество() = 0 Тогда
			Запись_spСтатистикаАдресовПоКомпаниям = Набор_spСтатистикаАдресовПоКомпаниям.Добавить();	
			Запись_spСтатистикаАдресовПоКомпаниям.ЭлектронныйАдрес	= ЭлАдресСтрока;
		Иначе 
			Запись_spСтатистикаАдресовПоКомпаниям = Набор_spСтатистикаАдресовПоКомпаниям[0];
		КонецЕсли;
		
		Запись_spСтатистикаАдресовПоКомпаниям.sent = sent;
		Запись_spСтатистикаАдресовПоКомпаниям.link = link;
		Запись_spСтатистикаАдресовПоКомпаниям.blacklist = blacklist;
		Запись_spСтатистикаАдресовПоКомпаниям.open = open;
		Запись_spСтатистикаАдресовПоКомпаниям.КоличествоАдресныхКниг = КоличествоАдресныхКниг;		
		
		Попытка
			Набор_spСтатистикаАдресовПоКомпаниям.Записать(Истина);
		Исключение
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Процедура СтатистикаАдресовПоКомпании(Аккаунт, МассивКомпаний = Неопределено) Экспорт

	ЭлектронныеАдреса = ЭлектронныеАдресаАккаунта(Аккаунт);
	Если МассивКомпаний = Неопределено Тогда 
		МассивКомпаний   = ПолучитьМассивКомпанийАккаунта(Аккаунт);
	КонецЕсли;

	Сч = 0;//Руслан 20.05.2021 16:58:14
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("IDКампании");
	ТЗ.Колонки.Добавить("Статистика");
	ТЗ.Колонки.Добавить("ЭлектронныйАдрес");
	ТЗРег = Новый ТаблицаЗначений;
	ТЗРег.Колонки.Добавить("IDКампании");
	ТЗРег.Колонки.Добавить("Статистика");	
	ТЗРег.Колонки.Добавить("ЭлектронныйАдрес");

	//https://api.sendpulse.com/campaigns/{id}/email/{email}

	ДатаНачала = Дата(1,1,1);

	Для Каждого Стр Из МассивКомпаний Цикл

		Если ТекущаяДатаСеанса() - ДатаНачала > 3500 Тогда
			ДатаНачала	= ТекущаяДатаСеанса();
			Соед		= Подключение();
			Ключ		= ПолучитьКлюч(Соед, Аккаунт);
			Заголовки	= ПолучитьЗаголовкиSendPulse(Ключ);
		КонецЕсли;

		ЭлектронныеАдреса = ЭлектронныеАдресаАккаунта(Аккаунт,Стр);

		Для Каждого email Из ЭлектронныеАдреса Цикл 

			МассивСтруктурСтрокJSON = Новый Массив;
			ЭлектронныйАдрес        = email.ЭлектронныйАдрес;	
		
			Компания = Стр;
			идКомпании = СтрЗаменить(Компания.ID, " ", "");		
			идКомпании = СтрЗаменить(идКомпании, Символы.НПП, "");
			//идКомпании = Формат(идКомпании,"ЧГ=0");
			//Для Каждого email Из ЭлектронныеАдреса Цикл 
			//	
			//	ЭлектронныйАдрес = email.ЭлектронныйАдрес;
			Запрос = Новый HTTPЗапрос("/campaigns/" + идКомпании + "/email/" + ЭлектронныйАдрес, Заголовки);

//			Спать(1);

			Результат	= Неопределено;
			Ответ		= ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

			Если Ответ.КодСостояния = 200 Тогда
				Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());
			КонецЕсли;

			Если Результат <> Неопределено Тогда

				СтроковаяДата = Результат.Получить("sent_date");
				СтроковаяДата = СтрЗаменить(СтроковаяДата , "-", "");
				СтроковаяДата = СтрЗаменить(СтроковаяДата , ":", "");
				СтроковаяДата = СтрЗаменить(СтроковаяДата , " ", "");

				sent_date             = ?(ЗначениеЗаполнено(СтроковаяДата), Дата(СтроковаяДата), Дата(1,1,1));
				global_status_explain = Результат.Получить("global_status_explain");//Sent
				global_status         = Результат.Получить("global_status");//1
				detail_status         = Результат.Получить("detail_status");//3
				detail_status_explain = Результат.Получить("detail_status_explain");//Opened
				
				СтруктураСтатистики = Новый Структура("IDКампании,sent_date,global_status_explain,detail_status_explain",идКомпании,sent_date,global_status_explain,detail_status_explain);
				
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.IDКампании 		= идКомпании;
				СтрокаТЗ.Статистика 	    = СтруктураСтатистики;
				СтрокаТЗ.ЭлектронныйАдрес   = email.ЭлектронныйАдрес;
				ДобавитьЗаписьВРегистрСтататистикаПоАдресам(ТЗ);
				ТЗ.Очистить();

			Иначе

				ДатаНачала	= ТекущаяДатаСеанса();
				Соед = Подключение();
				Ключ = ПолучитьКлюч(Соед, Аккаунт);
				Заголовки = ПолучитьЗаголовкиSendPulse(Ключ);
				
				Запрос = Новый HTTPЗапрос("/campaigns/" + идКомпании + "/email/" + ЭлектронныйАдрес, Заголовки);

				Результат	= Неопределено;
				Ответ		= ПолучитьОтветНаЗапросГЕТ(Соед, Запрос);

				Если Ответ.КодСостояния = 200 Тогда
					Результат = ПолучитьДанныеДжСОН(Ответ.ПолучитьТелоКакСтроку());
				КонецЕсли;

				Если Результат <> Неопределено Тогда

					СтроковаяДата = Результат.Получить("sent_date");
					СтроковаяДата = СтрЗаменить(СтроковаяДата , "-", "");
					СтроковаяДата = СтрЗаменить(СтроковаяДата , ":", "");
					СтроковаяДата = СтрЗаменить(СтроковаяДата , " ", "");
					
					sent_date             = ?(ЗначениеЗаполнено(СтроковаяДата), Дата(СтроковаяДата), Дата(1,1,1));
					global_status_explain = Результат.Получить("global_status_explain");//Sent
					global_status         = Результат.Получить("global_status");//1
					detail_status         = Результат.Получить("detail_status");//3
					detail_status_explain = Результат.Получить("detail_status_explain");//Opened
					
					СтруктураСтатистики = Новый Структура("IDКампании,sent_date,global_status_explain,detail_status_explain",идКомпании,sent_date,global_status_explain,detail_status_explain);
					
					СтрокаТЗ = ТЗ.Добавить();
					СтрокаТЗ.IDКампании 		= идКомпании;
					СтрокаТЗ.Статистика 	    = СтруктураСтатистики;
					СтрокаТЗ.ЭлектронныйАдрес   = email.ЭлектронныйАдрес;
					ДобавитьЗаписьВРегистрСтататистикаПоАдресам(ТЗ);
					ТЗ.Очистить();

				КонецЕсли;
			КонецЕсли;

			Если Сч=9 Тогда
				СчОжидания = ТекущаяДата()+1;
				Пока ТекущаяДата()<=СчОжидания Цикл 
				КонецЦикла;
				Сч = 0;
			Иначе 	
				Сч = Сч+1;	
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлектронныеАдресаАккаунта(Аккаунт,Компания=Неопределено)
	Если ЗначениеЗаполнено(Компания) Тогда 
		Если ЗначениеЗаполнено(Компания.АдреснаяКнига) Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	spАдресныеКнигиПолучатели.Адрес КАК ЭлектронныйАдрес
			|ИЗ
			|	Справочник.spАдресныеКниги.Получатели КАК spАдресныеКнигиПолучатели
			|ГДЕ
			|	НЕ spАдресныеКнигиПолучатели.Ссылка.ПометкаУдаления
			|	И spАдресныеКнигиПолучатели.Ссылка.Аккаунт = &Аккаунт
			|	И spАдресныеКнигиПолучатели.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	spАдресныеКнигиПолучатели.Адрес";
			Запрос.УстановитьПараметр("Аккаунт",Аккаунт);
			Запрос.УстановитьПараметр("Ссылка" ,Компания.АдреснаяКнига);
			Возврат Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;	
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	spАдресныеКнигиПолучатели.Адрес КАК ЭлектронныйАдрес
	|ИЗ
	|	Справочник.spАдресныеКниги.Получатели КАК spАдресныеКнигиПолучатели
	|ГДЕ
	|	НЕ spАдресныеКнигиПолучатели.Ссылка.ПометкаУдаления
	|	И spАдресныеКнигиПолучатели.Ссылка.Аккаунт = &Аккаунт
	|
	|СГРУППИРОВАТЬ ПО
	|	spАдресныеКнигиПолучатели.Адрес";
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьМассивКомпанийАккаунта(Аккаунт)
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	spКомпании.Ссылка КАК Компания
	|ИЗ
	|	Справочник.spКомпании КАК spКомпании
	|ГДЕ
	|	spКомпании.Аккаунт = &Аккаунт
	|	И НЕ spКомпании.ПометкаУдаления
	|	И spКомпании.send_date >= &send_date
	|	И spКомпании.СтатусСтрока ПОДОБНО &СтатусСтрока
	|	И spКомпании.АдреснаяКнига <> &АдреснаяКнига";
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	Запрос.УстановитьПараметр("send_date", ТекущаяДата()-360*60*60*24);
	Запрос.УстановитьПараметр("send_date", ТекущаяДата()-180*60*60*24);
	Запрос.УстановитьПараметр("СтатусСтрока","Отправлено");
	Запрос.УстановитьПараметр("АдреснаяКнига",Справочники.spАдресныеКниги.ПустаяСсылка());

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Компания");
	
		
	
КонецФункции
#КонецОбласти
// СтатистикаРассылок

#Область Утилитарные
Функция УбратьПробелыИзСтроки(СтрокаВход)
	
	
	СтрокаИх = СокрЛП(СтрокаВход); 
	СтрокаИх = СтрЗаменить(СтрокаИх," ","");
	СтрокаИх = СтрЗаменить(СтрокаИх,Символы.НПП,"");
	
	Возврат СтрокаИх;
	
	
КонецФункции

Функция ПолучитьДатуИзСтрокиДжСОН(СтрокаДжСон)
	// + 003590 ДДГ 22 окт 2020
	СтрокаДаты   = СтрЗаменить(СтрокаДжСон, "-", ".");
	ДатаИзСтроки = Дата(СтрокаДаты);
	Возврат ДатаИзСтроки;
	// - 003590 ДДГ 22 окт 2020
КонецФункции

Функция ОчиститьИД(ОбъектСсылка)
	// + 003590 ДДГ 22 окт 2020
	ОбъектИзСсылки = ОбъектСсылка.ПолучитьОбъект();
	ОбъектИзСсылки.ID = "";
	ОбъектИзСсылки.Записать();
	// - 003590 ДДГ 22 окт 2020
КонецФункции
#КонецОбласти
// Утилитарные

#Область РегламентныеЗадания
Процедура spИнформацияПоКомпаниям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	spКомпании.Ссылка КАК Компания,
	|	spКомпании.Аккаунт
	|ИЗ
	|	Справочник.spКомпании КАК spКомпании
	|ГДЕ
	|	НЕ spКомпании.ПометкаУдаления
	|	И НЕ spКомпании.Аккаунт.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 	
		ИнформацияКомпанииПоID(Выборка.Аккаунт, Выборка.Компания);	
	КонецЦикла;
	
КонецПроцедуры

Процедура spСтатистикаАдресовПоВсемКомпаниям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	spАккаунты.Ссылка КАК Аккаунт
	|ИЗ
	|	Справочник.spАккаунты КАК spАккаунты
	|ГДЕ
	|	НЕ spАккаунты.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтатистикаАдресовПоВсемКомпаниям(Выборка.Аккаунт);
	КонецЦикла;
	
КонецПроцедуры

Процедура spСтатистикаАдресовПоКомпании() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	spАккаунты.Ссылка КАК Аккаунт
	|ИЗ
	|	Справочник.spАккаунты КАК spАккаунты
	|ГДЕ
	|	НЕ spАккаунты.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтатистикаАдресовПоКомпании(Выборка.Аккаунт);
	КонецЦикла;
	
КонецПроцедуры

Процедура РегламентныйОбменСSendPulse() Экспорт 
	
	
	//1. Получим черный список.
	
	//2. Удалим из Контактных книг адреса из черного списка 
	
	//3. Выгрузим шаблоны
	
	//4. Выгрузим отправителей
	
	//5. выгрузим книги
	
	
	//6. создавать кампании
	
	
	
	
КонецПроцедуры
#КонецОбласти
// РегламентныеЗадания
#КонецОбласти
// SendPulse

#Область ПечатьШтрихкода
// Функция выполняет формирование изображения штрихкода.
// Параметры: 
//   ПараметрыШтрихкода 
// Возвращаемое значение: 
//   Картинка - Картинка со сформированным штрихкодом или НЕОПРЕДЕЛЕНО
Функция ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода) Экспорт
	
	ВнешняяКомпонента = ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	
	Если ВнешняяКомпонента = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Ошибка подключения внешней компоненты печати штрихкода!';uk='Помилка підключення зовнішньої компоненти друку штрихкоду!'");
	КонецЕсли;
	
	// Зададим размер картинки
	ВнешняяКомпонента.Ширина = Окр(ПараметрыШтрихкода.Ширина);
	ВнешняяКомпонента.Высота = Окр(ПараметрыШтрихкода.Высота);
	
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ТипШтрихкодаВрем = ОпределитьТипШтрихкода(ПараметрыШтрихкода.Штрихкод);
		Если ТипШтрихкодаВрем = "EAN8" Тогда
			ВнешняяКомпонента.ТипКода = 0;
		ИначеЕсли ТипШтрихкодаВрем = "EAN13" Тогда
			ВнешняяКомпонента.ТипКода = 1;
			// Если код содержит контрольный символ, обязательно указываем
			ВнешняяКомпонента.СодержитКС = СтрДлина(ПараметрыШтрихкода.Штрихкод) = 13;
		ИначеЕсли ТипШтрихкодаВрем = "EAN128" Тогда
			ВнешняяКомпонента.ТипКода = 2;
		ИначеЕсли ТипШтрихкодаВрем = "CODE39" Тогда
			ВнешняяКомпонента.ТипКода = 3;
		ИначеЕсли ТипШтрихкодаВрем = "CODE128" Тогда
			ВнешняяКомпонента.ТипКода = 4;
		ИначеЕсли ТипШтрихкодаВрем = "ITF14" Тогда
			ВнешняяКомпонента.ТипКода = 11;
		Иначе
			ВнешняяКомпонента.АвтоТип = Истина;
		КонецЕсли;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;

	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	
	// Формируем картинку штрихкода
	ВнешняяКомпонента.ЗначениеКода = ПараметрыШтрихкода.Штрихкод;
	
	Если ПараметрыШтрихкода.Свойство("УголПоворота") Тогда
		ВнешняяКомпонента.УголПоворота = ПараметрыШтрихкода.УголПоворота;
	Иначе
		ВнешняяКомпонента.УголПоворота = 0;
	КонецЕсли;
	
	// Если установленная нами ширина меньше минимально допустимой для этого штрихкода
	Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
	КонецЕсли;
	
	// Если установленная нами высота меньше минимально допустимой для этого штрихкода
	Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
		ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
	КонецЕсли;

	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();
	
	// Если картинка сформировалась
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция выполняет подключение внешней компоненты и ее первоначальную настройку.
// Возвращаемое значение: НЕОПРЕДЕЛЕНО - компоненту не удалось загрузить
Функция ПодключитьВнешнююКомпонентуПечатиШтрихкода() Экспорт
	
	ПодключениеВыполнено =

		ПодключитьВнешнююКомпоненту(
			  "ОбщийМакет.КомпонентаПечатиШтрихкодов"
			, "КартинкаШтрихкода"
			, ТипВнешнейКомпоненты.Native
		);
	
	// Создадим объект внешней компоненты
	Если ПодключениеВыполнено Тогда
		ВнешняяКомпонента = Новый("AddIn.КартинкаШтрихкода.Barcode");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет возможности рисовать
	Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем
		Возврат Неопределено;
	Иначе
		// Установим основные параметры компоненты
		// Если в системе установлен шрифт Tahoma
		Если ВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт для формирования картинки
			ВнешняяКомпонента.Шрифт = "Tahoma";
		Иначе
			// Шрифт Tahoma в системе отсутствует
			// Обойдем все доступные компоненте шрифты
			Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте
				ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом для формирования штрихкода
					ВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Установим размер шрифта
		ВнешняяКомпонента.РазмерШрифта = 12;
		
		Возврат ВнешняяКомпонента;
	КонецЕсли;
	
КонецФункции

// Функция определяет тип штрихкода по значение кода
// 
Функция ОпределитьТипШтрихкода(Штрихкод) Экспорт
	
	ТипШтрихкода = "";	
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	Если ДлинаШтрихкода = 0 Тогда
		Возврат ТипШтрихкода;
	КонецЕсли;
	
	Сумма = 0;
	
	Если ДлинаШтрихкода = 14 Тогда // ITF14
		
		Коэффициент = 1; 
		Для Сч = 1 По 13 Цикл
			КодСимв = КодСимвола(Штрихкод, Сч);
			Если КодСимв < 48 Или КодСимв > 57 Тогда
				Прервать;
			КонецЕсли;
			Сумма       = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма = (10 - Сумма % 10) % 10;
		Если КодСимвола(Штрихкод, 14) = Сумма + 48 Тогда
			ТипШтрихкода = "ITF14";
 		КонецЕсли;
		
	ИначеЕсли ДлинаШтрихкода = 13 Тогда // EAN13
		
		EAN13 = Истина;
		Коэффициент = 1;
		Для Сч = 1 По 12 Цикл
			КодСимв     = КодСимвола(Штрихкод, Сч);
			Если КодСимв < 48 Или КодСимв > 57 Тогда
				EAN13 = Ложь;
				Прервать;
			КонецЕсли;
			Сумма  = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма = (10 - Сумма % 10) % 10;
		ПроверочныйСимвол = Символ(Сумма + 48);
		Если EAN13 И ПроверочныйСимвол = Прав(Штрихкод, 1) Тогда
			ТипШтрихкода = "EAN13";
		КонецЕсли;
		
	ИначеЕсли ДлинаШтрихкода = 8 Тогда // EAN8
		
		EAN8 = Истина;
		Коэффициент = 3;
		Для Сч = 1 По 7 Цикл
			КодСимв = КодСимвола(Штрихкод, Сч);
			Если КодСимв < 48 Или КодСимв > 57 Тогда
				EAN8 = Ложь;
				Прервать;
			КонецЕсли;
			Сумма       = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма = (10 - Сумма % 10) % 10;
		Если EAN8 И (КодСимвола(Штрихкод, 8) = Сумма + 48) Тогда
			ТипШтрихкода = "EAN8";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипШтрихкода= "" Тогда // CODE39
		
		CODE39 = Истина;
		Для Сч = 1 По ДлинаШтрихкода Цикл
			КодСимв = КодСимвола(Штрихкод, Сч);
			Если (КодСимв <> 32)
				И (КодСимв < 36 Или КодСимв > 37)
				И (КодСимв <> 43)
				И (КодСимв < 45 Или КодСимв > 57)
				И (КодСимв < 65 Или КодСимв > 90) Тогда
				CODE39 = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если CODE39 Тогда
			ТипШтрихкода = "CODE39";
		КонецЕсли                                                     
		
	КонецЕсли;
	
	Если ТипШтрихкода= ""  Тогда // CODE128
		// CODE128 — символы ASCII от 0 до 127 (цифры от «0» до «9», буквы от «A» до «Z» и от «a» до «z») и специальные символы;
		CODE128 = Истина;
		Для Сч = 1 По ДлинаШтрихкода Цикл
			КодСимв = КодСимвола(Штрихкод, Сч);
			Если (КодСимв > 127) Тогда
				CODE128 = Ложь;
			Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если CODE128 Тогда
			ТипШтрихкода = "CODE128";
		КонецЕсли                                                     
		
	КонецЕсли;
	
	Если ТипШтрихкода= "CODE128"  Тогда // EAN128
		// В коде EAN128 регламентирован словарь CODE128 но регламентированы группы кодов
		Если КодСимвола(Штрихкод, 1) = 40 Тогда
			ТипШтрихкода = "EAN128";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипШтрихкода;
	
КонецФункции

// Возвращает значение типа штрихкода для использования в ЭУ
// "1С:Печать штрихкодов"
//
// Параметры
// 	ТипКода -	ПланыВидовХарактеристик.ТипыШтрихкодов - тип, значение для которого
//				нужно получить
//
// Возвращаемое значение:
//   Число, которое может быть присвоено свойству ЭУ "ТипКода"
//
Функция ПолучитьЗначениеТипаШтрихкодаДляЭУ(ТипКода) Экспорт
	Перем Значение;
	
	Если ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
		Значение = 0;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
		Значение = 1;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128 Тогда
		Значение = 2;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39 Тогда
		Значение = 3;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128 Тогда
		Значение = 4;
	Иначе
		Значение = -1;
	КонецЕсли;
	
	Возврат Значение;
КонецФункции // ПолучитьЗначениеТипаШтрихкодаДляЭУ()
#КонецОбласти

Процедура УстановитьСтатусСМС() Экспорт
	
	ОбработкаОтправкаСМС = Обработки.ОтправкаСМС.Создать();
	ОбработкаОтправкаСМС.ЗаполнитьЗначенияРеквизитов();
	ОбработкаОтправкаСМС.УстановитьСтатусСМС();
	
КонецПроцедуры


Функция ПолучитьПроксиWSНаСервере() Экспорт

	Адрес 		 = Константы.АдресWS.Получить();
	Пользователь = Константы.ПользовательWS.Получить();
	Пароль 		 = Константы.ПарольWS.Получить();

	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		Сообщить("Не заполнен адрес подключения к стационарной базе.");
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Адрес = Адрес + "/ws/mobile.1cws?wsdl";
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль);

		Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SB/MobileExchange", "MobileExchange", "MobileExchangeSoap");
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль = Пароль;
	Исключение
		Сообщить("Не удалось установить WS-соединение со стационарной базой.
		|Проверьте параметры покдлючения.");
		Возврат Неопределено;
	КонецПопытки;

	Возврат Прокси;

КонецФункции

#Область ВыгрузкаФидов
Процедура Регламент_яндекс_ПолнаяВыгрузкаТоваровYML() Экспорт
	
	//яндекс_1_ПолнаяВыгрузкаТоваровYML
	ОбработкаВыгрузкаТоваровYML = Обработки.ВыгрузкаТоваровYML.Создать();
	ОбработкаВыгрузкаТоваровYML.ПолнаяВыгрузкаТоваровВНаличииYML();
		
	//яндекс_2_ВыгрузкаТоваровБУYML
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаТоваровБУYML();
	
	//яндекс_3_ВыгрузкаТоваровНовыйYML
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаТоваровНовыйYML();
	
	//tiu_ru_ПолнаяВыгрузкаТоваровYML
	ОбработкаВыгрузкаТоваровYML.ПолнаяВыгрузкаТоваровВНаличииYML_TIU_RU();

	// + 002706 ДДГ 27 апр 2020
	//гугл_мерчант_ВыгрузкаТоваров
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаТоваровГуглМерчант();
	// - 002706 ДДГ 27 апр 2020

КонецПроцедуры

Процедура Регламент_яндекс_ВыгрузкаТоваровБУYML() Экспорт
	
	ОбработкаВыгрузкаТоваровYML = Обработки.ВыгрузкаТоваровYML.Создать();	
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаТоваровБУYML();
	
КонецПроцедуры

Процедура Регламент_яндекс_ВыгрузкаТоваровНовыйYML() Экспорт
	
	ОбработкаВыгрузкаТоваровYML = Обработки.ВыгрузкаТоваровYML.Создать();	
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаТоваровНовыйYML();
	
КонецПроцедуры

Процедура tiu_ru_ПолнаяВыгрузкаТоваровYML() Экспорт
	
	ОбработкаВыгрузкаТоваровYML = Обработки.ВыгрузкаТоваровYML.Создать();	
	ОбработкаВыгрузкаТоваровYML.ПолнаяВыгрузкаТоваровВНаличииYML_TIU_RU();
	
КонецПроцедуры

// + 002706 ДДГ 27 апр 2020
Процедура Регламент_ВыгрузкаГуглМерчант() Экспорт
	ОбработкаВыгрузкаТоваровYML = Обработки.ВыгрузкаТоваровYML.Создать();	
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаТоваровГуглМерчант();
КонецПроцедуры
// - 002706 ДДГ 27 апр 2020

// + 002803 ДДГ 01 июнь 2020
Процедура Регламент_ВыгрузкаК50() Экспорт
	ОбработкаВыгрузкаТоваровYML = Обработки.ВыгрузкаТоваровYML.Создать();	
	ОбработкаВыгрузкаТоваровYML.ВыгрузкаК50();
КонецПроцедуры
// - 002803 ДДГ 01 июнь 2020
#КонецОбласти
// ВыгрузкаФидов


#Область ФидыУтилитарные
Функция ПолучитьНомерБУ(Характеристиика)
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Значение
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектов.Объект
	               |			И (ХарактеристикиНоменклатуры.Ссылка = &Характеристика)
	               |			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Ссылка = &Характеристика";
	Запрос.УстановитьПараметр("Характеристика",Характеристиика);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("7.Номер детали"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат СтрЗаменить(СтрЗаменить(РезультатЗапроса[0].Значение,Символы.НПП,"")," ","");
	иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция НайтиЭлементПоКодуСправочника(ИмяСправочника, КодЭлемента) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяСправочника) Тогда
		Возврат Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(КодЭлемента) Тогда
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	Иначе
		Возврат Справочники[ИмяСправочника].НайтиПоКоду(КодЭлемента);
	КонецЕсли;		
	
КонецФункции

Функция НайтиЭлементПоНаименованиюСправочника(ИмяСправочника, НаименованиеЭлемента) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяСправочника) Тогда
		Возврат Неопределено;
	//ИначеЕсли Не ЗначениеЗаполнено(КодЭлемента) Тогда
	//	Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	//Иначе
	//	Возврат Справочники[ИмяСправочника].НайтиПоКоду(КодЭлемента);
	КонецЕсли;		
	
	Возврат Неопределено;
	
КонецФункции
#КонецОбласти
// ФидыУтилитарные

Процедура ЗарегистрироватьИзмененияВПланеОбмена_ОбменPowerBI(ДокументОбъект, Отказ) Экспорт
	
	ОбработкаВыгрузкаДанныхВSQL	= Обработки.ВыгрузкаДанныхВSQL.Создать();
	ОбработкаВыгрузкаДанныхВSQL.ЗарегистрироватьИзмененияВПланеОбмена(ДокументОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбменPowerBI() Экспорт
	//Чернавцев Н.А. по задаче №49227 15.12.21 Начало
	//Временно закомментировал для отладки
	ОбработкаВыгрузкаДанныхВSQL	= Обработки.ВыгрузкаДанныхВSQL.Создать();
	ОбработкаВыгрузкаДанныхВSQL.ВыгрузитьДанныеPowerBI();	
	//Чернавцев Н.А. по задаче №49227 15.12.21 Конец
КонецПроцедуры


//++++++YML+++++
#Область YML
Процедура РегламентОбменПоПлануОбменаYML() Экспорт
	
	Результат = ОбменПоПлануОбменаYML();
	Если Результат Тогда 
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланыОбмена.ОбменYML.НайтиПоКоду("YML"));
	КонецЕсли;
	
КонецПроцедуры

Функция ОбменПоПлануОбменаYML() Экспорт
	
	УзелОбмена = ПланыОбмена.ОбменYML.НайтиПоКоду("YML");
	ОбменДаннымиXML = Обработки.УниверсальныйОбменДаннымиXML2.Создать();
	ОбменДаннымиXML.РежимОбмена = "Выгрузка";
	ОбменДаннымиXML.НепосредственноеЧтениеВИБПриемнике = Ложь;
	ОбменДаннымиXML.ТипИнформационнойБазыДляПодключения = Ложь;
	ОбменДаннымиXML.ИмяСервераИнформационнойБазыДляПодключения = "";
	ОбменДаннымиXML.ВерсияПлатформыИнформационнойБазыДляПодключения = "V8";
	ОбменДаннымиXML.ПользовательИнформационнойБазыДляПодключения = "";
	ОбменДаннымиXML.ВыводВПротоколСообщенийОбОшибках = Ложь;
	ОбменДаннымиXML.ДописыватьДанныеВПротоколОбмена = Ложь;
	ОбменДаннымиXML.ЗагружатьДанныеВРежимеОбмена = Истина;
	ОбменДаннымиXML.ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты = Истина;
	ОбменДаннымиXML.ДатаНачала = НачалоДня(ТекущаяДата());
	ОбменДаннымиXML.ДатаОкончания = КонецДня(ТекущаяДата());
	ОбменДаннымиXML.ИмяИнформационнойБазыНаСервереДляПодключения = "";
	ОбменДаннымиXML.ИмяФайлаПравилОбмена = "\\Z\temp\ПравилаОбменаДаннымиYML.xml";
	
	//+++
	ОбменДаннымиXML.ИмяФайлаОбмена = "\\Z\temp\dataYML.xml";
	ОбменДаннымиXML.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
	ОбменДаннымиXML.ОбработчикиСобытийЧитаемИзФайлаПравилОбмена = Истина;
	ОбменДаннымиXML.ОбъектыПоСсылкеЗагружатьБезПометкиУдаления = Истина;
	ОбменДаннымиXML.ОптимизированнаяЗаписьОбъектов = Истина;
	ОбменДаннымиXML.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0;
	//---
	
	ОбменДаннымиXML.ЗагрузитьПравилаОбмена();
	
	УстановитьУзелОбменаУСтрокДерева(ОбменДаннымиXML.ТаблицаПравилВыгрузки.Строки, УзелОбмена);
	
	Попытка
		ОбменДаннымиXML.ВыполнитьВыгрузку();
		//ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
		Возврат Истина;
		
	Исключение
		//#Если Клиент Тогда
		////Сообщить(ОписаниеОшибки());
		//#КонецЕсли
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Процедура УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
    
    Для Каждого Строка Из Дерево Цикл
        
        Если Строка.ЭтоГруппа Тогда
            
            УстановитьУзелОбменаУСтрокДерева(Строка.Строки, УзелОбмена);
            
        Иначе
            
            Строка.СсылкаНаУзелОбмена = УзелОбмена;
            
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Процедура УдалитьРегистрациюИзминенийYML(ОбменДаннымиXML)
	
	СоответствиеУзловИПравилВыгрузки = Новый Соответствие();
	СтруктураДляУдаленияРегистрацииИзменений = Новый Соответствие();

	ОбработатьПравилаВыгрузки(ОбменДаннымиXML, ОбменДаннымиXML.ТаблицаПравилВыгрузки.Строки, СоответствиеУзловИПравилВыгрузки);
	
	УдачноВыгруженоПоПланамОбмена = ОбменДаннымиXML.ОбработатьВыгрузкуДляПлановОбмена(СоответствиеУзловИПравилВыгрузки, СтруктураДляУдаленияРегистрацииИзменений);
	
	Если УдачноВыгруженоПоПланамОбмена Тогда
			
		Для Каждого Элемент Из СоответствиеУзловИПравилВыгрузки Цикл
			Для Каждого ВыгруженноеПКО Из Элемент.Значение.МассивПКО Цикл
						
				Попытка
					
					Правило = ОбменДаннымиXML.Правила[ВыгруженноеПКО.ПравилоКонвертации];
					
					Менеджер = ОбменДаннымиXML.Менеджеры[Правило.Источник];
					
					ПланыОбмена.УдалитьРегистрациюИзменений(Элемент.Ключ, Менеджер.ОбъектМД);	
					
				Исключение			
				КонецПопытки;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьПравилаВыгрузки(ОбменДаннымиXML, Строки, СоответствиеУзловПланаОбменаИСтрокВыгрузки)
	
	Для каждого ПравилоВыгрузки Из Строки Цикл
		
		Если ПравилоВыгрузки.Включить = 0 Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если (ПравилоВыгрузки.СсылкаНаУзелОбмена <> Неопределено 
				И НЕ ПравилоВыгрузки.СсылкаНаУзелОбмена.Пустая()) Тогда
			
			МассивПравилВыгрузки = СоответствиеУзловПланаОбменаИСтрокВыгрузки.Получить(ПравилоВыгрузки.СсылкаНаУзелОбмена);
			
			Если МассивПравилВыгрузки = Неопределено Тогда
				
				МассивПравилВыгрузки = Новый Массив();	
				
			КонецЕсли;
			
			МассивПравилВыгрузки.Добавить(ПравилоВыгрузки);
			
			СоответствиеУзловПланаОбменаИСтрокВыгрузки.Вставить(ПравилоВыгрузки.СсылкаНаУзелОбмена, МассивПравилВыгрузки);
			
			Продолжить;
			
		КонецЕсли;

		Если ПравилоВыгрузки.ЭтоГруппа Тогда
			
			ОбработатьПравилаВыгрузки(ОбменДаннымиXML, ПравилоВыгрузки.Строки, СоответствиеУзловПланаОбменаИСтрокВыгрузки);
			Продолжить;
			
		КонецЕсли;
		
		ОбменДаннымиXML.ВыгрузитьДанныеПоПравилу(ПравилоВыгрузки);
		
	КонецЦикла; 
	
КонецПроцедуры
#КонецОбласти
//-----YML------

#Область ПолучениеДанных
// + Климентьев 28.04.2020 upd 04 мар 2021 by ДДГ - убрал бессмысленные директивы &НаСервере
// Получение реквизитов на клиенте
Функция ПолучитьРеквизит(Ссылка, Реквизит) Экспорт
    Возврат Ссылка[Реквизит];
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
	      ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
	      ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
			Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	Если Не ЭтоСсылка(ТипЗнч(Ссылка)) 
		Или Ссылка = Неопределено Тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли; 
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Проверка того, что тип имеет ссылочный тип данных
//
Функция ЭтоСсылка(Тип) Экспорт
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип)
		ИЛИ Задачи.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип);
	
КонецФункции

Функция ПолучитьЗначениеКонстанты(Константа) Экспорт
	Возврат Константы[Константа].Получить();
КонецФункции	
// - Климентьев 28.04.2020

// + ДДГ 56901  7 фев 2023
Функция НайтиЗначениеПеременнойКэша(Имя) Экспорт

	ПолученноеЗначение = Неопределено;

	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();

	Если Кэш = Неопределено Тогда
		Возврат ПолученноеЗначение;
	КонецЕсли;

	Кэш.Свойство(Имя, ПолученноеЗначение);

	Возврат ПолученноеЗначение;

КонецФункции

Процедура ЗакэшироватьЗначениеПеременной(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь, Принудительно = Ложь) Экспорт
	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();	
	ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, Кэш, Значение, ОбновлятьВоВсехКэшах, Принудительно);
	ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Кэш);	
КонецПроцедуры

Функция НайтиДанныеДоступаИзКэша(Назначение) Экспорт

	НайденноеЗначение = Неопределено;

	ИмяКэша = "КэшРегистраДоступы";
	КэшРегистра = НайтиЗначениеПеременнойКэша(ИмяКэша);

	Если КэшРегистра = Неопределено Тогда
		ЗакэшироватьЗначениеПеременной(ИмяКэша, Новый Структура, , Истина);
		Возврат НайденноеЗначение;
	КонецЕсли;

	КэшРегистра.Свойство(Назначение, НайденноеЗначение);

	Возврат НайденноеЗначение;

КонецФункции

Процедура ЗакэшироватьДанныеДоступа(Назначение, МенеджерРегистра) Экспорт

	СтруктураДанных = Новый Структура("Назначение,Адрес,Логин,Пароль,Порт,Токен,Метод");

	ЗаполнитьЗначенияСвойств(СтруктураДанных, МенеджерРегистра);

	ИмяКэша = "КэшРегистраДоступы";
	КэшРегистра = НайтиЗначениеПеременнойКэша(ИмяКэша);

	Если КэшРегистра = Неопределено Тогда
		КэшРегистра = Новый Структура;
	КонецЕсли;

	КэшРегистра.Вставить(Назначение, СтруктураДанных);

	ЗакэшироватьЗначениеПеременной(ИмяКэша, КэшРегистра, , Истина);

КонецПроцедуры
// - ДДГ 56901  7 фев 2023
#КонецОбласти

#Область РаботаССайтомИФТП
// + 003676 ДДГ 10 ноя 2020
// обнов 55029 ДДГ  8 ноя 2022
// обнов 55029 ДДГ 15 ноя 2022
// обнов 56901 ДДГ  7 фев 2023
Функция ПолучитьДанныеДоступа(Назначение, ИспользоватьКэш = Истина, ОбновитьКэш = Истина) Экспорт

	Если ИспользоватьКэш Тогда

		СтруктураДанных = НайтиДанныеДоступаИзКэша(Назначение);

		Если ЗначениеЗаполнено(СтруктураДанных) Тогда
			Возврат СтруктураДанных;
		КонецЕсли;

	КонецЕсли;

	МенеджерРегистра = РегистрыСведений.Доступы.СоздатьМенеджерЗаписи();
	МенеджерРегистра.Назначение = Назначение;
	МенеджерРегистра.Прочитать();

	Если НЕ МенеджерРегистра.Выбран() Тогда
		Сообщить("В регистре Доступы отсутствуют данные для " + Назначение);
	КонецЕсли;

	Если ИспользоватьКэш ИЛИ ОбновитьКэш Тогда
		ЗакэшироватьДанныеДоступа(Назначение, МенеджерРегистра);
	КонецЕсли;

	Возврат МенеджерРегистра;

КонецФункции

Функция ПолучитьПротоколАдрес(Назначение, Протокол = "", ДобавитьЛогинПарольФТП = Ложь) Экспорт

	МенеджерРегистра = ПолучитьДанныеДоступа(Назначение);

	Если МенеджерРегистра.Адрес = Неопределено Тогда
		Сообщить("В регистре Доступы отсутствуют данные для " + Назначение);
		Возврат Неопределено;
	КонецЕсли;

	СтрокаАдреса 	= МенеджерРегистра.Адрес;
	СтрокаЛогина 	= "";

	Если ЗначениеЗаполнено(Протокол) Тогда
		// пропускаем
	ИначеЕсли МенеджерРегистра.Порт = "443" Тогда
		Протокол = "https://";
	ИначеЕсли МенеджерРегистра.Порт = "21" Тогда
		Протокол = "ftp://";
	Иначе
		Протокол = "http://";
	КонецЕсли;

	Если Протокол = "ftp://"
	   И ДобавитьЛогинПарольФТП
	   И ЗначениеЗаполнено(МенеджерРегистра.Логин)
	Тогда

		СтрокаЛогина = МенеджерРегистра.Логин;

		Если ЗначениеЗаполнено(МенеджерРегистра.Пароль) Тогда
			СтрокаЛогина = СтрокаЛогина + ":" + МенеджерРегистра.Пароль;
		КонецЕсли;

		СтрокаЛогина = СтрокаЛогина + "@";

	КонецЕсли;

	СтрокаАдреса = Протокол + СтрокаЛогина + СтрокаАдреса;

	Возврат СтрокаАдреса;

КонецФункции

Функция ПолучитьАдресКартинкиНаCDN(Ссылка) Экспорт
	ГУИД = Строка(Ссылка.УникальныйИдентификатор());
	ПервыеДваСимвола = Сред(ГУИД, 0, 2);
	СимволыТретийИЧетвертый = Сред(ГУИД, 3, 2);
	СимволыПятыйИШестой = Сред(ГУИД, 5, 2);
	Адрес = ПервыеДваСимвола+"/"+СимволыТретийИЧетвертый+"/"+СимволыПятыйИШестой+"/"+ГУИД+".jpg";
	Возврат Адрес;
КонецФункции

Функция ПолучитьПолныйАдресКартинкиНаCDN(Ссылка) Экспорт
	Возврат ПолучитьПолныйАдресКартинкиНаCDN_настраиваемая(Ссылка, "КартинкиСайт", "КаталогКартинокФТП");
КонецФункции

Функция ПолучитьПолныйАдресКартинкиАвтомобиляНаCDN(Ссылка) Экспорт
	Возврат ПолучитьПолныйАдресКартинкиНаCDN_настраиваемая(Ссылка, "КартинкиАвтомобилейСервер", "КартинкиАвтомобилейКаталог");
КонецФункции

Функция ПолучитьПолныйАдресКартинкиНаCDN_настраиваемая(Ссылка, НастройкаАдресCDN, КаталогКартинок)

	АдресCDN = ПолучитьПротоколАдрес(НастройкаАдресCDN);

	Если ЗначениеЗаполнено(АдресCDN) Тогда

		ДанныеДоступа = ПолучитьДанныеДоступа(КаталогКартинок);
		АдресКартинок = ДанныеДоступа.Адрес;

		Если ЗначениеЗаполнено(АдресКартинок) Тогда

			Если ЗначениеЗаполнено(Ссылка) Тогда
				Возврат АдресCDN + АдресКартинок + ПолучитьАдресКартинкиНаCDN(Ссылка);
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ЗаглушкаНетФото		= ПолучитьПротоколАдрес("ЗаглушкаНетФото");
	Возврат ЗаглушкаНетФото;

КонецФункции

Функция ПолучитьКорневойПутьКартинокГлавныйCDN() Экспорт
	Возврат ПолучитьКорневойПутьКартинокНаCDN_настраиваемая("КартинкиСайт", "КорневойКаталогКартинокФТП");
КонецФункции

Функция ПолучитьКорневойПутьКартинокАвтомобилейCDN() Экспорт
	Возврат ПолучитьКорневойПутьКартинокНаCDN_настраиваемая("КартинкиАвтомобилейСервер", "КартинкиАвтомобилейКорень");
КонецФункции

Функция ПолучитьКорневойПутьКартинокНаCDN_настраиваемая(НастройкаАдресCDN, НастройкаКорень)

	АдресCDN = ПолучитьПротоколАдрес(НастройкаАдресCDN);

	ДанныеДоступа = ПолучитьДанныеДоступа(НастройкаКорень);
	АдресКартинок = ДанныеДоступа.Адрес;

	Возврат АдресCDN + АдресКартинок;

КонецФункции

Функция ЗагрузитьВоВременныйФайлИзФТП(СоединениеФТП, ПутьФайлаФТП, ВременныйФайл) Экспорт

	Попытка
		СоединениеФТП.Получить(ПутьФайлаФТП, ВременныйФайл);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Файл = Новый Файл(ВременныйФайл);
	Если Файл.Существует() И Файл.Размер() > 0 Тогда
		Возврат ВременныйФайл;
	//Иначе
		//Сообщить("Не удаётся загрузить или записать файл: " + ПутьФайлаФТП);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции
// - 003676 ДДГ 10 ноя 2020

// + 55029 ДДГ  8 ноя 2022
// обнов 55029 ДДГ 14 ноя 2022
Функция УстановитьПоНазначениюСоединениеФТП(
	  Назначение
	, ЧислоПопыток	= 5
	, СпатьСекунд	= 5
	, Пассивное		= Истина
) Экспорт

	ДанныеДоступа = ПолучитьДанныеДоступа(Назначение);

	Если ДанныеДоступа.Адрес = Неопределено Тогда
		Сообщить("В регистре Доступы отсутствуют данные для " + Назначение);
		Возврат Неопределено;
	КонецЕсли;

	Возврат УстановитьСоединениеФТП(
		  ДанныеДоступа.Адрес
		, ДанныеДоступа.Порт
		, ДанныеДоступа.Логин
		, ДанныеДоступа.Пароль
		, ЧислоПопыток
		, СпатьСекунд
		, Пассивное
	);
	
КонецФункции

Функция УстановитьСоединениеФТП(
	  Адрес
	, Порт			= Неопределено
	, Логин			= Неопределено
	, Пароль		= Неопределено
	, ЧислоПопыток	= 5
	, СпатьСекунд	= 5
	, Пассивное		= Истина
) Экспорт

	Для ИДХ=1 ПО ЧислоПопыток Цикл
		Попытка
			Возврат Новый FTPСоединение(
				Адрес, Порт, Логин, Пароль, , Пассивное
			);
		Исключение
			Спать(СпатьСекунд);
		КонецПопытки;
	КонецЦикла;

	Сообщить("Не могу соединиться с ФТП: " + Адрес + ":" + Порт);

	Возврат Неопределено;
	
КонецФункции

Функция ЗагрузитьФайлИзФТП(
	  СоединениеФТП
	, ПутьФайла
	, ЧислоПопыток	= 5
	, СпатьСекунд	= 5
) Экспорт

	Для ИДХ=1 ПО ЧислоПопыток Цикл
		Попытка

			ПотокДанных = Новый ПотокВПамяти();

			СоединениеФТП.Получить(ПутьФайла, ПотокДанных);

			ДанныеФайла = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();

			Возврат ДанныеФайла;

		Исключение
			Спать(СпатьСекунд);
		КонецПопытки;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции
// - 55029 ДДГ  8 ноя 2022

// + 004611 ДДГ 07 апр 2021
// обнов 55029 ДДГ 14 ноя 2022
// обнов ДДГ 22 янв 2023
Функция УстановитьПоНазначениюСоединениеССайтом(
	  Назначение
	, ЧислоПопыток = 5
	, СпатьСекунд = 5
	, ТаймАут = 0
) Экспорт

	ДанныеДоступа = ПолучитьДанныеДоступа(Назначение);

	Если ДанныеДоступа.Адрес = Неопределено Тогда
		Сообщить("В регистре Доступы отсутствуют данные для " + Назначение);
		Возврат Неопределено;
	КонецЕсли;

	Возврат УстановитьСоединениеССайтом(
		  ДанныеДоступа.Адрес
		,
		, ДанныеДоступа.Порт
		, ,
		, ЧислоПопыток
		, СпатьСекунд
		, ТаймАут
	);

КонецФункции

Функция УстановитьСоединениеССайтом(
	  АдресСервера
	, Защищенное		= Ложь
	, Порт				= Неопределено
	, Пользователь		= Неопределено
	, Пароль			= Неопределено
	, ЧислоПопыток		= 5
	, ДлительностьСна	= 5
	, ТаймАут			= Неопределено
) Экспорт

	Соединение = Неопределено;

	Для НомерПопытки=1 По ЧислоПопыток Цикл
		Попытка

			Соединение = Новый HTTPСоединение(
				АдресСервера, Порт, Пользователь, Пароль, , ТаймАут
				, ?(Защищенное ИЛИ Порт = 443, Новый ЗащищенноеСоединениеOpenSSL, Неопределено)
			);

			Прервать;

		Исключение
			Спать(ДлительностьСна);
		КонецПопытки;
	КонецЦикла;

	Возврат Соединение;

КонецФункции

Функция ЗагрузитьФайлИзСайта(
	  СоединениеСайт
	, ПутьФайла
	, ЧислоПопыток	= 5
	, СпатьСекунд	= 5
) Экспорт

	ЗапросФайла = Новый HTTPЗапрос(ПутьФайла);

	Для ИДХ=1 ПО ЧислоПопыток Цикл
		Попытка

			ОтветСайта = СоединениеСайт.Получить(ЗапросФайла);

			Если ОтветСайта.КодСостояния = 200 Тогда

				ДанныеФайла =  ОтветСайта.ПолучитьТелоКакДвоичныеДанные();

				Возврат ДанныеФайла;

			КонецЕсли;

		Исключение
			Спать(СпатьСекунд);
		КонецПопытки;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Процедура Спать(Секунд) Экспорт

	Если Секунд <= 0 Тогда
		Возврат;
	КонецЕсли;

	КомандаWindows = "Timeout /T " + Формат(Секунд, "ЧГ=0"); // + " /NoBreak";
	WshShell = Новый COMОбъект("WScript.Shell"); 
	WshShell.Run(КомандаWindows, 0, -1);

КонецПроцедуры
// - 004611 ДДГ 07 апр 2021
#КонецОбласти
// РаботаСФТП

///Картинки/////////////
Функция ПолучитьАдресКартинкиПоИдентификатору(ГУИД) Экспорт 
		Если Не ПустаяСтрока(ГУИД) Тогда
			ПервыеДваСимвола = Сред(ГУИД, 0, 2);
			СимволыТретийИЧетвертый = Сред(ГУИД, 3, 2);
			СимволыПятыйИШестой = Сред(ГУИД, 5, 2);
			url = "https://cdn.7detalei.ru/Loaded/fullsize/"+ПервыеДваСимвола+"/"+СимволыТретийИЧетвертый+"/"+СимволыПятыйИШестой+"/"+ГУИД+".jpg";
			Возврат url;
		КонецЕсли; 		
	КонецФункции

// + 51133 ДДГ  8 апр 2022
Функция ПолучитьПервуюКартинкуОбъекта(ОбъектСсылка) Экспорт

	ТипОбъекта = ТипЗнч(ОбъектСсылка);

	Если ТипОбъекта = Тип("СправочникСсылка.Номенклатура")
	 ИЛИ ТипОбъекта = Тип("СправочникСсылка.СайтГруппыКроссов")
	Тогда

		ОсновноеИзображение = ОбъектСсылка.ОсновноеИзображение;

		Если ЗначениеЗаполнено(ОсновноеИзображение) Тогда
			Возврат ОсновноеИзображение;
		КонецЕсли;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХранилищеДополнительнойИнформации.Ссылка
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации
		|КАК
		|	ХранилищеДополнительнойИнформации
		|
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХранилищеДополнительнойИнформации.ПорядокСортировки ВОЗР
		|";

	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат Справочники.ХранилищеДополнительнойИнформации.ПустаяСсылка();

КонецФункции
// - 51133 ДДГ  8 апр 2022


// + 003966 ДДГ 06 янв 2021
// выделил код из управляемой формы контрагента для переиспользования
// возвращает Ложь, если не найден ИНН
Функция ЗаполнениеКонтрагентаПоСтруктуреДанныхПоИНН(Объект, СтруктураДанныхПоИНН) Экспорт

	Попытка
		СтруктураДляЗаполнения = Новый Структура;
		СтруктураДляЗаполнения.Вставить("ФормаСобственностиЮрЛицаРоссия", СтруктураДанныхПоИНН.suggestions[0].data.opf.short);
		СтруктураДляЗаполнения.Вставить("Наименование", СтруктураДанныхПоИНН.suggestions[0].data.name.full);

		Если СтрДлина(Объект.ИНН) = 10 Тогда
			СтруктураДляЗаполнения.Вставить("КПП",	СтруктураДанныхПоИНН.suggestions[0].data.kpp);
			СтруктураДляЗаполнения.Вставить("ОКПО",	СтруктураДанныхПоИНН.suggestions[0].data.okpo);
		КонецЕсли;
		СтруктураДляЗаполнения.Вставить("ЮридическийАдрес", СтруктураДанныхПоИНН.suggestions[0].data.address.unrestricted_value);

		Если Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда

			Если Строка(Объект.ФормаСобственностиЮрЛицаРоссия) <> СтруктураДляЗаполнения.ФормаСобственностиЮрЛицаРоссия Тогда
				Попытка
					Объект.ФормаСобственностиЮрЛицаРоссия = Справочники.ВариантыЮрЛиц[СтруктураДляЗаполнения.ФормаСобственностиЮрЛицаРоссия];	
				Исключение
					Сообщить("Не найдено соответствие Формы собственности по данным ИНН, укажите вручную");
				КонецПопытки;
			КонецЕсли;

			Если Объект.КодПоОКПО <> СтруктураДляЗаполнения.ОКПО Тогда
				Объект.КодПоОКПО = СтруктураДляЗаполнения.ОКПО;
			КонецЕсли;
			Если Объект.КПП <> СтруктураДляЗаполнения.КПП Тогда
				Объект.КПП = СтруктураДляЗаполнения.КПП;
			КонецЕсли;

		КонецЕсли;
		
		Если Объект.Наименование <> СтруктураДляЗаполнения.Наименование Тогда
			Объект.Наименование = СтруктураДляЗаполнения.Наименование;
		КонецЕсли;
		
		Объект.ЮридическийАдрес = СтруктураДляЗаполнения.ЮридическийАдрес;

	Исключение
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;	

КонецФункции

Процедура СформироватьПолноеНаименованиеПоФормеСобственности(Объект) Экспорт
	
	Объект.НаименованиеПолное = ?(Строка(Объект.ФормаСобственностиЮрЛицаРоссия) = "", "Индивидульный Предприниматель", Строка(Объект.ФормаСобственностиЮрЛицаРоссия)) + " " + ?(Строка(Объект.ФормаСобственностиЮрЛицаРоссия) = "", "", """") + Объект.Наименование + ?(Строка(Объект.ФормаСобственностиЮрЛицаРоссия) = "", "", """");
	
КонецПроцедуры
// - 003966 ДДГ 06 янв 2021

Функция ДобавитьЗаписьВРегистрСтататистикаПоАдресам(ТЗ)
	
	Для Каждого СтрокаТЗ из ТЗ цикл
				
				МассивДляЗаписи = новый Массив;
				МассивДляЗаписи.Добавить(СтрокаТЗ.Статистика);
				
				Запись        = Новый ЗаписьJSON;
				Запись.УстановитьСтроку();
				ЗаписатьJSON(Запись,МассивДляЗаписи);
				Статистика = Запись.Закрыть();

				
				
				
				Набор_spСтатистикаАдресовПоКомпании = РегистрыСведений.spСтатистикаАдресовПоКомпании.СоздатьНаборЗаписей();
				Набор_spСтатистикаАдресовПоКомпании.Отбор.ЭлектронныйАдрес.Установить(СтрокаТЗ.ЭлектронныйАдрес);
				Набор_spСтатистикаАдресовПоКомпании.Прочитать();
				
				Если Набор_spСтатистикаАдресовПоКомпании.Количество() = 0 Тогда
					Запись_spСтатистикаАдресовПоКомпании                    = Набор_spСтатистикаАдресовПоКомпании.Добавить();	
					Запись_spСтатистикаАдресовПоКомпании.ЭлектронныйАдрес	= СтрокаТЗ.ЭлектронныйАдрес;
					Запись_spСтатистикаАдресовПоКомпании.Статистика         = Статистика;
				Иначе 
					Запись_spСтатистикаАдресовПоКомпании = Набор_spСтатистикаАдресовПоКомпании[0];
					СтатистикаВРегистре                  = Запись_spСтатистикаАдресовПоКомпании.Статистика;
					
					Чтение = Новый ЧтениеJSON;
					Чтение.УстановитьСтроку(СтатистикаВРегистре);
					ДанныеСтатистикиВРегистре = ПрочитатьJSON(Чтение);
					Чтение.Закрыть();				
					
					Для Каждого СтрокаДанныхВРегистре Из ДанныеСтатистикиВРегистре Цикл 
						Если СтрокаДанныхВРегистре.IDКампании <> СтрокаТЗ.IDКампании Тогда  
							
							МассивДляЗаписи.Добавить(СтрокаДанныхВРегистре);
						Иначе
							
						КонецЕсли;
					КонецЦикла;
					
					Запись            = Новый ЗаписьJSON;
					Запись.УстановитьСтроку();
					ЗаписатьJSON(Запись,МассивДляЗаписи);
					Статистика = Запись.Закрыть();
					Набор_spСтатистикаАдресовПоКомпании[0].Статистика = Статистика;
				
			КонецЕсли;
			ЗапросКИ = Новый Запрос;
			ЗапросКИ.Текст = "ВЫБРАТЬ
			|	КонтактнаяИнформация.Ссылка
			|ИЗ
			|	Справочник.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.ВидЛогина = 2
			|	И КонтактнаяИнформация.Наименование = &Наименование";
			ЗапросКИ.УстановитьПараметр("Наименование",СтрокаТЗ.ЭлектронныйАдрес);
			РезультатЗапросаКИ = ЗапросКИ.Выполнить().Выбрать();
			Если РезультатЗапросаКИ.Следующий() Тогда
				КонтактнаяИнформация = РезультатЗапросаКИ.Ссылка;
				Запись_spСтатистикаАдресовПоКомпании.КонтактнаяИнформация = КонтактнаяИнформация;
			КонецЕсли;			
			Запись_spСтатистикаАдресовПоКомпании.Период = ТекущаяДата();
			Набор_spСтатистикаАдресовПоКомпании.Записать(Истина);
	
		КонецЦикла;

	
КонецФункции

Процедура ЗагрТелТест() Экспорт //Руслан 27.05.2021 7:55:02{
	
	ADOConnection = Новый COMОбъект("ADODB.Connection");

	Если ADOConnection.State = 0 Тогда
		ИмяСервера      = "192.168.1.33";	
		ИмяБазы         = "BI";		        
		ИмяПользователя	= "kostin";		   
		Пароль			= "Cfnehy23";		        
		
		стрПодключения	= "Provider=SQLOLEDB.1;
		|User ID=" + ИмяПользователя + ";
		|Pwd=" + Пароль + ";
		|Data Source=" + ИмяСервера + ";
		|Initial Catalog=" + ИмяБазы + "";
		
		Попытка
			ADOConnection.Open(стрПодключения); 
		Исключение
			ADOConnection = Неопределено;
			Message(ErrorDescription());
		КонецПопытки;
	КонецЕсли;

	
	//ADOConnection = ПодключитьсякБазеBI();
	Если ADOConnection = Неопределено Тогда

	КонецЕсли;

	ДатаКонец  = КонецДня(Дата(2021,05,06));;
	ДатаНачала = ДатаКонец-1*60*24*60;

	//ЗагрузкаТелефонииCEL(ADOConnection,	ДатаНачала, ДатаКонец);
	//RequestText = "SELECT cel_sort.linkedid,min(cel_sort.id) FROM cel cel_sort LEFT JOIN cel full_cel ON cel_sort.id = full_cel.id AND cel_sort.linkedid = full_cel.linkedid GROUP BY cel_sort.linkedid";
	//+
	//	"WHERE eventtime > " + "'"+Формат(НачалоДня(ТекущаяДата()-1*60*1*60),"ДФ=dd.MM.yyyy HH:mm:ss")+"'";//SELECT * FROM UNIID WHERE eventtime
		//RequestText = "SELECT * FROM cel "+
		
	//RequestText = "SELECT *,lag(linkedid,1) OVER(ORDER BY id) previd,CASE WHEN lag(linkedid,1) OVER(ORDER BY id)  <> linkedid THEN 1 Else 2 END First FROM cel "+		
	//	"WHERE eventtype='ANSWER' AND eventtime > " + "'"+Формат(НачалоДня(ТекущаяДата()-1*60*1*60),"ДФ=dd.MM.yyyy HH:mm:ss")+"'";//SELECT * FROM UNIID WHERE eventtime
	RequestText = "SELECT "+
" cel_f.id fid,cel_f.uniqueid funiqueid,cel_f.eventtype feventtype,cel_f.eventtime feventtime,cel_f.cid_name fcid_name,cel_f.cid_num fcid_num,cel_f.cid_ani fcid_ani, "+
" cel_f.cid_rdnis fcid_rdnis,cel_f.cid_dnid fcid_dnid,cel_f.exten fexten,cel_f.context fcontext,cel_f.channame fchanname,cel_f.appname fappname,cel_f.appdata fappdata, "+
" cel_f.amaflags famaflags,cel_f.accountcode faccountcode,cel_f.uniqueid funiqueid,cel_f.linkedid flinkedid,cel_f.peer fpeer,cel_f.userdeftype fuserdeftype,cel_f.extra fextra, "+
" cel_answer.id sid,cel_answer.linkedid slinkedid,cel_answer.cid_num scid_num "+	
	
	
	",lag(cel_f.linkedid,1) OVER(ORDER BY cel_f.linkedid,cel_f.id) previd,len(cel_f.cid_num) l,len(cel_f.exten) e,right(cel_f.cid_num,10) r,right(cel_f.exten,10) re "+
	",CASE WHEN lag(cel_f.linkedid,1) OVER(ORDER BY cel_f.linkedid,cel_f.id)  <> cel_f.linkedid THEN 1 Else 2 END First"+
	",CASE WHEN lag(cel_answer.linkedid,1) OVER(ORDER BY cel_answer.linkedid,cel_answer.id)  <> cel_answer.linkedid THEN 1 Else 2 END Second,right(cel_answer.cid_num,10) rca "+
	
	" FROM cel cel_f LEFT JOIN cel cel_answer on cel_f.linkedid=cel_answer.linkedid AND "+		
				" cel_answer.eventtype='ANSWER' AND "+
				" len(cel_answer.cid_num)=2  "+
	" WHERE "+
		"cel_f.eventtime > " + "'"+Формат(НачалоДня(ТекущаяДата()-1*60*1*60),"ДФ=dd.MM.yyyy HH:mm:ss")+"'";//SELECT * FROM UNIID WHERE eventtime

	
	Table = ADOConnection.Execute(RequestText);

	Пока НЕ Table.EOF Цикл

		Менеджер = РегистрыСведений.МИКО_стИсторияЗвонковCEL.СоздатьМенеджерЗаписи();
		First = Table.Fields("First").Value;
		Если First = 2 Тогда
			Table.MoveNext();
			Продолжить;
		КонецЕсли;
		fid = Table.Fields("fid").Value;
		sid = Table.Fields("sid")                 .Value;		
		Сообщить("fid: "+fid+" sid: "+sid);
		Менеджер.AcctId                =  Table.Fields("fid")                    .Value;
		Менеджер.UID                   =  Число("1" + СтрЗаменить(Table.Fields("funiqueid").Value, ".", ""));
		Менеджер.eventtype             =  Table.Fields("feventtype")             .Value;
		Менеджер.eventtime             =  Table.Fields("feventtime")             .Value;
		Менеджер.cidname               =  Table.Fields("fcid_name")              .Value;
		Менеджер.cidnum                =  Table.Fields("fcid_num")               .Value;
		Менеджер.cidani                =  Table.Fields("fcid_ani")               .Value;
		Менеджер.cidrdnis              =  Table.Fields("fcid_rdnis")             .Value;
		Менеджер.ciddnid               =  Table.Fields("fcid_dnid")              .Value;
		Менеджер.exten                 =  Table.Fields("fexten")                 .Value;
		Менеджер.context               =  Table.Fields("fcontext")               .Value;
		Менеджер.channame              =  Table.Fields("fchanname")              .Value;
		Менеджер.appname               =  Table.Fields("fappname")               .Value;
		Менеджер.appdata               =  Table.Fields("fappdata")               .Value;
		Менеджер.amaflags              =  Table.Fields("famaflags")              .Value;
		Менеджер.accountcode           =  Table.Fields("faccountcode")           .Value;
		Менеджер.uniqueid              =  Table.Fields("funiqueid")              .Value;
		Менеджер.linkedid              =  Table.Fields("flinkedid")              .Value;
		Менеджер.peer                  =  Table.Fields("fpeer")                  .Value;
		Менеджер.userdeftype           =  Table.Fields("fuserdeftype")           .Value;
		Менеджер.eventextra            =  Table.Fields("fextra")                 .Value;
		If sid = null then
			Менеджер.MissedCall            =  True;
		else
		Менеджер.subdivision            =  Table.Fields("scid_num")                 .Value;  //Table.Fields("flinkedid")              .Value=1622201973.199198
     
		EndIf;
		Менеджер.Записать(Истина);
		
		Table.MoveNext();

	КонецЦикла;

	Table.Close();

	ADOConnection.Close();
	
КонецПроцедуры		

//	--	--	--	//	--	--	--	//	--	--	--	//	--	--	--	//	--	--	--	//

// + ДДГ
#Область ХТМЛ
Функция ПолучитьХТМЛХДИ(СсылкаХДИ) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаХДИ) Тогда
		Возврат "";
	КонецЕсли;

	ВидДанных = СсылкаХДИ.ВидДанных;

	Если ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение
	   И СсылкаХДИ.ВыгруженоНаСерверFTP
	Тогда
		Адрес		= ПолучитьПолныйАдресКартинкиНаCDN(СсылкаХДИ);
	Иначе
		ДанныеХДИ	= СсылкаХДИ.Хранилище.Получить();
		Адрес		= ПоместитьВоВременноеХранилище(ДанныеХДИ, Новый УникальныйИдентификатор);
	КонецЕсли;

	ХТМЛ = СформироватьХТМЛ(ВидДанных, Адрес);

	Возврат ХТМЛ;

КонецФункции

Функция ПолучитьАдресКартинкиДляХТМЛ(СсылкаХДИ) ЭКспорт

	Если НЕ ЗначениеЗаполнено(СсылкаХДИ) Тогда
		Возврат "";
	КонецЕсли;

	Если СсылкаХДИ.ВыгруженоНаСерверFTP Тогда
		Адрес		= ПолучитьПолныйАдресКартинкиНаCDN(СсылкаХДИ);
	Иначе
		ДанныеХДИ	= СсылкаХДИ.Хранилище.Получить();
		Адрес		= ПоместитьВоВременноеХранилище(ДанныеХДИ, Новый УникальныйИдентификатор);
	КонецЕсли;

	Возврат Адрес;

КонецФункции

Функция ПолучитьКартинкуХТМЛ(СсылкаХДИ) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаХДИ) Тогда
		Возврат "";
	КонецЕсли;

	Если СсылкаХДИ.ВыгруженоНаСерверFTP Тогда
		Адрес		= ПолучитьПолныйАдресКартинкиНаCDN(СсылкаХДИ);
	Иначе
		ДанныеХДИ	= СсылкаХДИ.Хранилище.Получить();
		Адрес		= ПоместитьВоВременноеХранилище(ДанныеХДИ, Новый УникальныйИдентификатор);
	КонецЕсли;

	ХТМЛ	= ПолучитьИзАдресаКартинкиХТМЛ(Адрес);

	Возврат ХТМЛ;

КонецФункции

Функция ПолучитьИзАдресаКартинкиХТМЛ(АдресКартинки) Экспорт

	ХТМЛ = "
	|<!DOCTYPE html>
	|<html>
	|<head>
	|<style type=""text/css"">
	|	* {
	|		margin:		0;
	|		padding:	0;
	|	}
	|	img {
	|		width:		100%;
	|		height:		100%;
	|		max-width:	100%;
	|		max-height:	100%;
	|		object-fit:	contain;
	|	}
	|</style>
	|</head>
	|	<body>
	|		<img src=""" + АдресКартинки + """>
	|	</body>
	|</html>
	|";

	Возврат ХТМЛ;

КонецФункции

Функция ПолучитьАудиоХТМЛ(СсылкаХДИ) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаХДИ) Тогда
		Возврат "";
	КонецЕсли;

	ДанныеХДИ	= СсылкаХДИ.Хранилище.Получить();
	Адрес		= ПоместитьВоВременноеХранилище(ДанныеХДИ, Новый УникальныйИдентификатор);

	ХТМЛ	= ПолучитьИзАдресаАудиоХТМЛ(Адрес);

	Возврат ХТМЛ;

КонецФункции

Функция ПолучитьИзАдресаАудиоХТМЛ(АдресАудио) Экспорт

	ХТМЛ = "
	|<!DOCTYPE html>
	|<html>
	|<head>
	|</head>
	|	<body>
	|		<audio controls>
	|			<source src=""" + АдресАудио + """>
	|			Воспроизведение не поддерживается, загрузите файл на диск.
//	|			<a href=""" + АдресАудио + """>Загрузить</a>
	|		</audio>
	|	</body>
	|</html>
	|";

	Возврат ХТМЛ;

КонецФункции

Функция ПолучитьВидеоХТМЛ(СсылкаХДИ) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаХДИ) Тогда
		Возврат "";
	КонецЕсли;

	ДанныеХДИ	= СсылкаХДИ.Хранилище.Получить();
	Адрес		= ПоместитьВоВременноеХранилище(ДанныеХДИ, Новый УникальныйИдентификатор);

	ХТМЛ	= ПолучитьИзАдресаВидеоХТМЛ(Адрес);

	Возврат ХТМЛ;

КонецФункции

Функция ПолучитьИзАдресаВидеоХТМЛ(АдресВидео) Экспорт

	ХТМЛ = "
	|<!DOCTYPE html>
	|<html>
	|<head>
	|</head>
	|	<body>
	|		<video controls>
	|			<source src=""" + АдресВидео + """>
	|			Воспроизведение не поддерживается, загрузите файл на диск.
//	|			<a href=""" + АдресВидео + """>Загрузить</a>
	|		</audio>
	|	</body>
	|</html>
	|";

	Возврат ХТМЛ;

КонецФункции

Функция СформироватьХТМЛ(ВидДанных, АдресДанных) Экспорт

	ХТМЛ = "";

	Если ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение Тогда
		ХТМЛ = ПолучитьИзАдресаКартинкиХТМЛ(АдресДанных);
	ИначеЕсли ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Аудио Тогда
		ХТМЛ = ПолучитьИзАдресаАудиоХТМЛ(АдресДанных);
	ИначеЕсли ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Видео Тогда
		ХТМЛ = ПолучитьИзАдресаВидеоХТМЛ(АдресДанных);
	КонецЕсли;

	Возврат ХТМЛ;

КонецФункции
#КонецОбласти

#Область ХМЛ
Процедура ДобавитьЭлементЗаписиХМЛ(ЗаписьХМЛ, ИмяТэга, СодержимоеТэга) Экспорт
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента(ИмяТэга);
		ЗаписьХМЛ.ЗаписатьТекст(СодержимоеТэга);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
КонецПроцедуры

Функция ПолучитьСтруктуруИзХМЛ(ТекстХМЛ) Экспорт

	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(ТекстХМЛ);

	СтруктураХМЛ = Новый Структура;

	РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, СтруктураХМЛ);

	ЧтениеХМЛ.Закрыть();

	Возврат СтруктураХМЛ;

КонецФункции

Процедура РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, ТекущийЭлемент) Экспорт

	СтруктураАтрибутов = Новый Структура;

	ТекущийЭлемент.Вставить("___Атрибуты_", СтруктураАтрибутов);

	Пока ЧтениеХМЛ.ПрочитатьАтрибут() Цикл
		СтруктураАтрибутов.Вставить(ЧтениеХМЛ.Имя, ЧтениеХМЛ.Значение);
	КонецЦикла;

	Пока ЧтениеХМЛ.Прочитать()
	   И ЧтениеХМЛ.ТипУзла <> ТипУзлаXML.КонецЭлемента
	Цикл

		Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

			ИмяЭлемента   = ЧтениеХМЛ.Имя;
			НовыйЭлемент  = Новый Структура;
			СтарыйЭлемент = ИзвлечьСвойствоИзСтруктуры(ТекущийЭлемент, ИмяЭлемента);

			Если СтарыйЭлемент = Неопределено Тогда
				ТекущийЭлемент.Вставить(ИмяЭлемента, НовыйЭлемент);
			ИначеЕсли ТипЗнч(СтарыйЭлемент) = Тип("Массив") Тогда
				СтарыйЭлемент.Добавить(НовыйЭлемент);
			Иначе
				МассивЭлементов = Новый Массив;
				МассивЭлементов.Добавить(СтарыйЭлемент);
				МассивЭлементов.Добавить(НовыйЭлемент);
				ТекущийЭлемент.Вставить(ИмяЭлемента, МассивЭлементов);
			КонецЕсли;

			РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, НовыйЭлемент);

		ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.Текст Тогда

			ТекущийЭлемент.Вставить("___Текст_", ЧтениеХМЛ.Значение);

//		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда

//			Возврат;

		КонецЕсли ;

	КонецЦикла;

КонецПроцедуры

Функция ИзвлечьТекстЗначенияКлючаСтруктурыХМЛ(ЭлементСтруктурыХМЛ, ИмяКлюча) Экспорт

	ЗначениеКлюча = Неопределено;

	СтруктураКлюча = ИзвлечьСвойствоИзСтруктуры(ЭлементСтруктурыХМЛ, ИмяКлюча);

	Если ТипЗнч(СтруктураКлюча) <> Тип("Структура") Тогда
		Возврат ЗначениеКлюча;
	КонецЕсли;

	ЗначениеКлюча = ИзвлечьСвойствоИзСтруктуры(СтруктураКлюча, "___Текст_");

	Возврат ЗначениеКлюча;

КонецФункции
#КонецОбласти

#Область RESTAPI
Функция ВыполнитьВебЗапросПолучитьОтвет(
	  АдресСайта, Защищенное = Ложь
	, Метод, ЗаголовкиЗапроса = Неопределено, ТипЗапроса, ТелоЗапроса = Неопределено
	, ЧислоПопыток = 5, ДлительностьСна = 5, ПовторЕслиНе200 = Ложь
) Экспорт

	Соединение = УстановитьСоединениеССайтом(АдресСайта, Защищенное);

	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ЗаголовкиЗапроса = Неопределено Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
	КонецЕсли;

	ЗапросАПИ = Новый HTTPЗапрос(Метод, ЗаголовкиЗапроса);
	ЗапросАПИ.УстановитьТелоИзСтроки(ТелоЗапроса);

	ОтветАПИ = РазработкаСервер.ПолучитьОтветНаЗапрос(Соединение, ЗапросАПИ, ТипЗапроса, ЧислоПопыток, ДлительностьСна, ПовторЕслиНе200);

	Возврат ОтветАПИ;

КонецФункции

Функция ПолучитьОтветНаЗапрос(Соединение, Запрос, ТипЗапроса, ЧислоПопыток = 5, ДлительностьСна = 5, ПовторЕслиНе200 = Ложь) Экспорт

	Ответ = Новый HTTPСервисОтвет(500);
	Ответ.УстановитьТелоИзСтроки("Не удалось выполнить запрос.");

	ТипЗапроса = ВРЕГ(ТипЗапроса);

	Для НомерПопытки=1 По ЧислоПопыток Цикл
		Попытка

			Если ТипЗапроса = "POST" Тогда
				Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			ИначеЕсли ТипЗапроса = "GET" Тогда
				Ответ = Соединение.Получить(Запрос);
			ИначеЕсли ТипЗапроса = "DELETE" Тогда
				Ответ = Соединение.Удалить(Запрос);
			КонецЕсли;

			Если ПовторЕслиНе200 И Ответ.КодСостояни <> 200 Тогда
				ВызватьИсключение("Ответ != 200");
			КонецЕсли;

			Прервать;

		Исключение
			Если НомерПопытки < ЧислоПопыток Тогда
				Спать(ДлительностьСна);
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;

	Возврат Ответ;

КонецФункции

Функция ПолучитьОтветНаЗапросПОСТ(Соединение, Запрос, ЧислоПопыток = 5, ДлительностьСна = 5, ПовторЕслиНе200 = Ложь) Экспорт
	Возврат ПолучитьОтветНаЗапрос(Соединение, Запрос, "POST", ЧислоПопыток, ДлительностьСна, ПовторЕслиНе200);
КонецФункции

Функция ПолучитьОтветНаЗапросГЕТ(Соединение, Запрос, ЧислоПопыток = 5, ДлительностьСна = 5, ПовторЕслиНе200 = Ложь) Экспорт
	Возврат ПолучитьОтветНаЗапрос(Соединение, Запрос, "GET", ЧислоПопыток, ДлительностьСна, ПовторЕслиНе200);
КонецФункции

Функция ПолучитьОтветНаЗапросДЭЛИТ(Соединение, Запрос, ЧислоПопыток = 5, ДлительностьСна = 5, ПовторЕслиНе200 = Ложь) Экспорт
	Возврат ПолучитьОтветНаЗапрос(Соединение, Запрос, "DELETE", ЧислоПопыток, ДлительностьСна, ПовторЕслиНе200);
КонецФункции

Функция ПолучитьДанныеДжСОН(СтрокаДжСОН, ПолучитьСоответствие = Истина) Экспорт
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаДжСОН);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, ПолучитьСоответствие);
		ЧтениеJSON.Закрыть();
		Возврат ДанныеJSON;
	Исключение
	КонецПопытки;

	Возврат Неопределено;
КонецФункции

Функция ПолучитьДатуИзФорматаДжСОН(Знач СтрокаДаты, Знач УбратьДолиСекунды = Ложь, Знач УчестьЧасовойПояс = Истина) Экспорт

	ЗначениеДаты = Дата(1,1,1);

	ОчищеннаяСтрока = СокрЛП(СтрокаДаты);

	МассивПодСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОчищеннаяСтрока, "+");

	Если МассивПодСтрок.Количество() < 1 Тогда
		Возврат ЗначениеДаты;
	КонецЕсли;

	ОчищеннаяСтрока = МассивПодСтрок[0];

	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, " ",			"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, Символы.НПП,	"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, Символы.ПС,	"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, Символы.Таб,	"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, Символы.Таб,	"");

	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, "T",			"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, "Z",			"");

	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, ",",			"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, "-",			"");
	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, ":",			"");

	Если УбратьДолиСекунды Тогда
		ИДХ = СтроковыеФункцииКлиентСервер.НайтиСимволСКонца(ОчищеннаяСтрока, ".");
		ИДХ = ИДХ - 1;
		ОчищеннаяСтрока = Сред(ОчищеннаяСтрока, 1, ИДХ);
	КонецЕсли;

	ОчищеннаяСтрока = СтрЗаменить(ОчищеннаяСтрока, ".",			"");

	Попытка
		ЗначениеДаты = Дата(ОчищеннаяСтрока);
	Исключение
		Возврат ЗначениеДаты;
	КонецПопытки;

	Если УчестьЧасовойПояс И МассивПодСтрок.Количество() > 1 Тогда

		СтрокаЧасовогоПояса = МассивПодСтрок[1];

		СтрокаЧасовогоПояса = СтрЗаменить(СтрокаЧасовогоПояса, " ",			"");
		СтрокаЧасовогоПояса = СтрЗаменить(СтрокаЧасовогоПояса, Символы.НПП,	"");
		СтрокаЧасовогоПояса = СтрЗаменить(СтрокаЧасовогоПояса, Символы.ПС,	"");
		СтрокаЧасовогоПояса = СтрЗаменить(СтрокаЧасовогоПояса, Символы.Таб,	"");
		СтрокаЧасовогоПояса = СтрЗаменить(СтрокаЧасовогоПояса, Символы.Таб,	"");

		МассивПодСтрокЧП = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЧасовогоПояса, ":");

		ВсегоПодСтрок = МассивПодСтрокЧП.Количество();

		Часов = 0;
		Минут = 0;

		Если ВсегоПодСтрок = 2 Тогда

			Попытка
				Часов = Число(МассивПодСтрокЧП[0]);
			Исключение
			КонецПопытки;

			Попытка
				Минут = Число(МассивПодСтрокЧП[1]);
			Исключение
			КонецПопытки;

		ИначеЕсли ВсегоПодСтрок = 1 Тогда

			Попытка
				Часов = Число(МассивПодСтрокЧП[0]);
			Исключение
			КонецПопытки;

		КонецЕсли;

		Если Часов > 0 ИЛИ Минут > 0 Тогда
			Часов = Часов - ЧасовойПоясПоУмолчанию();
			КорректировкаСекунд = Часов * 3600 + Минут * 60;
			ЗначениеДаты = ЗначениеДаты - КорректировкаСекунд;
		КонецЕсли;

	КонецЕсли;

	Возврат ЗначениеДаты;

КонецФункции

Функция ПолучитьТелоДжСОНИзСтруктуры(СтруктураДанных, УниверсальнаяДата = Ложь) Экспорт

	Перем СтрокаJSON, НастройкиСериализации;

	Если УниверсальнаяДата Тогда
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	КонецЕсли;

	ЗаписьJSON  = Новый ЗаписьJSON;

	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных, НастройкиСериализации);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Возврат СтрокаJSON;

КонецФункции

Функция ПолучитьТелоКодированиеУРЛ(СтруктураДанных) Экспорт

	МассивПараметров = Новый Массив;

	Для Каждого КлючЗначение Из СтруктураДанных Цикл
		МассивПараметров.Добавить(КлючЗначение.Ключ + "=" + КлючЗначение.Значение);
	КонецЦикла;

	СтрокаПараметров = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(
		МассивПараметров, "&"
	);

	ТелоЗапроса = "&" + СтрокаПараметров;

	Возврат ТелоЗапроса;

КонецФункции

Функция ПолучитьСоотвФорматТипКонтента() Экспорт

	СоотвФорматТипКонтента = Новый Соответствие;

	СоотвФорматТипКонтента.Вставить("html"	, "text/html");
	СоотвФорматТипКонтента.Вставить("htm"	, "text/html");
	СоотвФорматТипКонтента.Вставить("json"	, "application/json");
	СоотвФорматТипКонтента.Вставить("xml"	, "application/xml");
	СоотвФорматТипКонтента.Вставить("yaml"	, "text/yaml");
	СоотвФорматТипКонтента.Вставить("yml"	, "text/yaml");

	Возврат СоотвФорматТипКонтента;

КонецФункции

Функция ПолучитьТипКонтента(Формат) Экспорт
	СоотвФорматТипКонтента = ПолучитьСоотвФорматТипКонтента();
	Возврат СоотвФорматТипКонтента.Получить(Формат);
КонецФункции
#КонецОбласти

#Область СтруктурыСоответствия
Функция ИзвлечьСвойствоИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено, ЗаполнитьПоУмолчаниюЕслиПусто = Ложь) Экспорт

	ЗначениеСвойства = ЗначениеПоУмолчанию;

	Если ИсходнаяСтруктура.Свойство(ИмяСвойства) Тогда
		ЗначениеСвойства = ИсходнаяСтруктура[ИмяСвойства];
	КонецЕсли;

	Если ЗаполнитьПоУмолчаниюЕслиПусто И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ЗначениеСвойства = ЗначениеПоУмолчанию;
	КонецЕсли;

	Возврат ЗначениеСвойства;

КонецФункции

Процедура ДобавитьНеПустоеСвойствоВСоответствие(ИсходноеСоответствие, Ключ, Значение) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда
		ИсходноеСоответствие.Вставить(Ключ, Значение);
	КонецЕсли;
КонецПроцедуры

Функция СформироватьОбратноеСоответствие(ИсходноеСоответствие) Экспорт

	ОбратноеСоответствие = Новый Соответствие;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл

		Ключ		= КлючЗначение.Ключ;
		Значение	= КлючЗначение.Значение;

		ОбратноеСоответствие.Вставить(Значение, Ключ);

	КонецЦикла;

	Возврат ОбратноеСоответствие;

КонецФункции

Функция ПолучитьСоответствиеИзМассива(ИсходныйМассив) Экспорт

	СоответствиеИзМассива = Новый Соответствие;

	Для Каждого ЭлементМассива Из ИсходныйМассив Цикл
		СоответствиеИзМассива.Вставить(ЭлементМассива, Истина);
	КонецЦикла;

	Возврат СоответствиеИзМассива;

КонецФункции

Функция ПолучитьМассивКлючейСоответствия(ИсходноеСоответствие) Экспорт

	МассивКлючей = Новый Массив;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл
		МассивКлючей.Добавить(КлючЗначение.Ключ);
	КонецЦикла;

	Возврат МассивКлючей;

КонецФункции

Функция СкопироватьКоллекциюРекурсивно(ИсходнаяКоллекция) Экспорт

	СоотвДопустимыеТипы = Новый Соответствие;
	// только эти типы копируются рекурсивно
	СоотвДопустимыеТипы.Вставить(Тип("Структура")	, Новый Структура);
	СоотвДопустимыеТипы.Вставить(Тип("Соответствие"), Новый Соответствие);
	СоотвДопустимыеТипы.Вставить(Тип("Массив")		, Новый Массив);

	ТипКоллекции = ТипЗнч(ИсходнаяКоллекция);

	КопияКоллекции = СоотвДопустимыеТипы.Получить(ТипКоллекции);

	Если КопияКоллекции = Неопределено Тогда
		ВызватьИсключение "Не могу сделать рекурсивную копию для этого типа: " + ТипКоллекции;
	КонецЕсли;

	//

	Если ТипКоллекции = Тип("Массив") Тогда

		Для Каждого Значение Из ИсходнаяКоллекция Цикл

			КопияЗначения = Значение;

			Проверка = СоотвДопустимыеТипы.Получить(ТипЗнч(Значение));

			Если Проверка <> Неопределено Тогда
				КопияЗначения = СкопироватьКоллекциюРекурсивно(Значение);
			КонецЕсли;

			КопияКоллекции.Добавить(КопияЗначения);

		КонецЦикла;

		Возврат КопияКоллекции;

	КонецЕсли;

	//

	Для Каждого КлючЗначение Из ИсходнаяКоллекция Цикл

		Ключ		= КлючЗначение.Ключ;
		Значение	= КлючЗначение.Значение;

		КопияКлюча		= Ключ;
		КопияЗначения	= Значение;

		//

		Проверка = СоотвДопустимыеТипы.Получить(ТипЗнч(Ключ));

		Если Проверка <> Неопределено Тогда
			КопияКлюча = СкопироватьКоллекциюРекурсивно(Ключ);
		КонецЕсли;

		//

		Проверка = СоотвДопустимыеТипы.Получить(ТипЗнч(Значение));

		Если Проверка <> Неопределено Тогда
			КопияЗначения = СкопироватьКоллекциюРекурсивно(Значение);
		КонецЕсли;

		//

		КопияКоллекции.Вставить(КопияКлюча, КопияЗначения);

	КонецЦикла;

	Возврат КопияКоллекции;

КонецФункции

Функция СкопироватьСтруктуру(ИсходнаяСтруктура) Экспорт

	НоваяСтруктура = Новый Структура;

	Для Каждого КлючЗначение Из ИсходнаяСтруктура Цикл
		НоваяСтруктура.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	Возврат НоваяСтруктура;

КонецФункции

Функция СкопироватьСоответствие(ИсходноеСоответствие) Экспорт

	НовоеСоответствие = Новый Соответствие;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл
		НовоеСоответствие.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	Возврат НовоеСоответствие;

КонецФункции

Функция ПолучитьМаксКлючСоответствия(ИсходноеСоответствие) Экспорт

	Выбрано = Неопределено;

	ВсегоКлючей = ИсходноеСоответствие.Количество();

	Если ВсегоКлючей = 0 Тогда
		Возврат Выбрано;
	КонецЕсли;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл
		Выбрано = КлючЗначение.Ключ;
		Прервать;
	КонецЦикла;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл

		Ключ = КлючЗначение.Ключ;

		Если Ключ > Выбрано Тогда
			Выбрано = Ключ;
		КонецЕсли;

	КонецЦикла;

	Возврат Выбрано;

КонецФункции

Функция ПолучитьМинКлючСоответствия(ИсходноеСоответствие) Экспорт

	Выбрано = Неопределено;

	ВсегоКлючей = ИсходноеСоответствие.Количество();

	Если ВсегоКлючей = 0 Тогда
		Возврат Выбрано;
	КонецЕсли;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл
		Выбрано = КлючЗначение.Ключ;
		Прервать;
	КонецЦикла;

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл

		Ключ = КлючЗначение.Ключ;

		Если Ключ < Выбрано Тогда
			Выбрано = Ключ;
		КонецЕсли;

	КонецЦикла;

	Возврат Выбрано;

КонецФункции

Функция ЭтоСоответствиеИлиСтруктураИлиМассив(ВходныеДанные) Экспорт
	Возврат ТипЗнч(ВходныеДанные) = Тип("Соответствие")
		ИЛИ ТипЗнч(ВходныеДанные) = Тип("Структура")
		ИЛИ ТипЗнч(ВходныеДанные) = Тип("Массив")
	;
КонецФункции

Функция СтрокаИзСоответствия(ИсходноеСоответствие) Экспорт

	СтрокаСоответствия = "";

	Для Каждого КлючЗначение Из ИсходноеСоответствие Цикл

		Ключ		= КлючЗначение.Ключ;
		Значение	= КлючЗначение.Значение;

		ТипЗначения = ТипЗнч(Значение);

		Если ТипЗначения = Тип("Соответствие")
		 ИЛИ ТипЗначения = Тип("Структура")
		Тогда
			СтрокаЗначения
				= Символы.ПС
				+ СтрокаИзСоответствия(Значение)
				+ Символы.ПС
			;
		Иначе
			СтрокаЗначения = Строка(Значение);
		КонецЕсли;

		СтрокаКлючЗначение = Строка(Ключ) + ": " + СтрокаЗначения + Символы.ПС;

		СтрокаСоответствия = СтрокаСоответствия + СтрокаКлючЗначение;

	КонецЦикла;

	Возврат СтрокаСоответствия;

КонецФункции

Функция ПолучитьПустуюСтруктуруСтрокиТаблицыЗначений(ИсходнаяТаблица) Экспорт

	ПустаяСтруктура = Новый Структура;

	КолонкиТаблицы = ИсходнаяТаблица.Колонки;

	Для Каждого Колонка Из КолонкиТаблицы Цикл
		ПустаяСтруктура.Вставить(Колонка.Имя, Неопределено);
	КонецЦикла;

	Возврат ПустаяСтруктура;

КонецФункции

Функция МассивСтруктурИзТаблицыЗначений(ИсходнаяТаблица, МассивКолонок = Неопределено) Экспорт

	МассивСтруктур = Новый Массив;

	Если МассивКолонок = Неопределено Тогда
		МассивКолонок = ПолучитьМассивКолонокТаблицыЗначений(ИсходнаяТаблица);
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл

		СтруктураСтроки = Новый Структура;

		МассивСтруктур.Добавить(СтруктураСтроки);

		Для Каждого ИмяКолонки Из МассивКолонок Цикл
			СтруктураСтроки.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
		КонецЦикла;

	КонецЦикла;

	Возврат МассивСтруктур;

КонецФункции

Функция СравнитьОбъектСоСтруктурой(ОбъектДанных, СтруктураСравнения) Экспорт

	Совпадают = Истина;

	Для Каждого КлючЗначение Из СтруктураСравнения Цикл

		Ключ		= КлючЗначение.Ключ;
		Значение	= КлючЗначение.Значение;

		Если ОбъектДанных[Ключ] <> Значение Тогда
			Совпадают = Ложь;
			Возврат Совпадают;
		КонецЕсли;

	КонецЦикла;

	Возврат Совпадают;

КонецФункции

Функция СравнитьПрименитьЗначенияПолейОбъекта(ПроверяемыйОбъект, СтруктураИлиСоответствие) Экспорт

	Совпадают = Истина;

	Для Каждого КлючЗначение Из СтруктураИлиСоответствие Цикл

		ИмяПоля			= КлючЗначение.Ключ;
		ЗначениеПоля	= КлючЗначение.Значение;

		Если ПроверяемыйОбъект[ИмяПоля] <> ЗначениеПоля Тогда
			ПроверяемыйОбъект[ИмяПоля] = ЗначениеПоля;
			Совпадают = Ложь;
		КонецЕсли;

	КонецЦикла;

	Возврат Совпадают;

КонецФункции

Функция ПустаяСтруктураРегистраСведений(ИмяРегистра) Экспорт

	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();

	СтруктураПолей = Новый Структура;

	Измерения = Метаданные.РегистрыСведений[ИмяРегистра].Измерения;

	Для Каждого Измерение Из Измерения Цикл
		ИмяПоля = Измерение.Имя;
		ПустоеЗначение = МенеджерЗаписи[ИмяПоля];
		СтруктураПолей.Вставить(ИмяПоля, ПустоеЗначение);
	КонецЦикла;

	Ресурсы = Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы;

	Для Каждого Ресурс Из Ресурсы Цикл
		ИмяПоля = Ресурс.Имя;
		ПустоеЗначение = МенеджерЗаписи[ИмяПоля];
		СтруктураПолей.Вставить(ИмяПоля, ПустоеЗначение);
	КонецЦикла;

	Реквизиты = Метаданные.РегистрыСведений[ИмяРегистра].Реквизиты;

	Для Каждого Реквизит Из Реквизиты Цикл
		ИмяПоля = Реквизит.Имя;
		ПустоеЗначение = МенеджерЗаписи[ИмяПоля];
		СтруктураПолей.Вставить(ИмяПоля, ПустоеЗначение);
	КонецЦикла;

	Возврат СтруктураПолей;

КонецФункции

Функция СфСтруктуруВозврата(СтатусОшибки, ТекстОшибки) Экспорт

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтатусОшибки", СтатусОшибки);
	СтруктураВозврата.Вставить("ТекстОшибки" , ТекстОшибки);

	Возврат СтруктураВозврата;

КонецФункции
#КонецОбласти

#Область Массивы
Функция СписокЗначенийИзМассива(МассивЗначений) Экспорт

	НовыйСписок = Новый СписокЗначений;

	Для Каждого ЭлементМассива Из МассивЗначений Цикл
		НовыйСписок.Добавить(ЭлементМассива);
	КонецЦикла;

	Возврат НовыйСписок;

КонецФункции

Функция МассивИзСпискаЗначений(ИсходныйСписок) Экспорт

	МассивЗначений = Новый Массив;

	Для Каждого ЭлементСписка Из ИсходныйСписок Цикл
		МассивЗначений.Добавить(ЭлементСписка);
	КонецЦикла;

	Возврат МассивЗначений;

КонецФункции

Функция ПолучитьМассивКолонокТаблицыЗначений(ИсходнаяТаблица) Экспорт

	МассивКолонок = Новый Массив;

	КолонкиТаблицы = ИсходнаяТаблица.Колонки;

	Для Каждого Колонка Из КолонкиТаблицы Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;

	Возврат МассивКолонок;

КонецФункции

Процедура УдалитьПустыеЗначенияИзМассива(ИсходныйМассив) Экспорт

	ИДХ = ИсходныйМассив.Количество();

	Пока ИДХ > 0 Цикл

		ИДХ = ИДХ - 1;

		Если НЕ ЗначениеЗаполнено(ИсходныйМассив[ИДХ]) Тогда
			ИсходныйМассив.Удалить(ИДХ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция МинЗначениеКромеПустого(МассивЗначений) Экспорт

	Результ = NULL;

	ВсегоЭлементов = МассивЗначений.Количество();

	Если ВсегоЭлементов < 1 Тогда
		Возврат Результ;
	ИначеЕсли ВсегоЭлементов = 1 Тогда
		Результ = МассивЗначений[0];
		Возврат Результ;
	КонецЕсли;

	Для Каждого Элемент Из МассивЗначений Цикл

		Если НЕ ЗначениеЗаполнено(Элемент) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Результ) Тогда
			Результ = Элемент;
			Продолжить;
		КонецЕсли;

		Результ = Мин(Результ, Элемент);

	КонецЦикла;

	Возврат Результ;

КонецФункции

Функция Максимум(МассивЗначений) Экспорт

	ЗначениеМаксимума = Неопределено;

	Если МассивЗначений.Количество() < 1 Тогда
		Возврат ЗначениеМаксимума;
	КонецЕсли;

	ЗначениеМаксимума = МассивЗначений[0];

	Для Каждого Значение Из МассивЗначений Цикл
		ЗначениеМаксимума = Макс(ЗначениеМаксимума, Значение);
	КонецЦикла;

	Возврат ЗначениеМаксимума;

КонецФункции

Функция Минимум(МассивЗначений) Экспорт

	ЗначениеМинимума = Неопределено;

	Если МассивЗначений.Количество() < 1 Тогда
		Возврат ЗначениеМинимума;
	КонецЕсли;

	ЗначениеМинимума = МассивЗначений[0];

	Для Каждого Значение Из МассивЗначений Цикл
		ЗначениеМинимума = Мин(ЗначениеМинимума, Значение);
	КонецЦикла;

	Возврат ЗначениеМинимума;

КонецФункции

Функция УникальныеЗначения(МассивЗначений) Экспорт

	МассивРезультата = Новый Массив;

	Для Каждого Значение Из МассивЗначений Цикл
		Если МассивРезультата.Найти(Значение) = Неопределено Тогда
			МассивРезультата.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивРезультата;

КонецФункции
#КонецОбласти

#Область УтилитыДатаВремя
Функция ПолучитьСоотвЧислуДняНедели() Экспорт

	СоотвЧислуДняНедели = Новый Соответствие;

	СоотвЧислуДняНедели.Вставить(1, Перечисления.ДниНедели.Понедельник);
	СоотвЧислуДняНедели.Вставить(2, Перечисления.ДниНедели.Вторник);
	СоотвЧислуДняНедели.Вставить(3, Перечисления.ДниНедели.Среда);
	СоотвЧислуДняНедели.Вставить(4, Перечисления.ДниНедели.Четверг);
	СоотвЧислуДняНедели.Вставить(5, Перечисления.ДниНедели.Пятница);
	СоотвЧислуДняНедели.Вставить(6, Перечисления.ДниНедели.Суббота);
	СоотвЧислуДняНедели.Вставить(7, Перечисления.ДниНедели.Воскресенье);

	Возврат СоотвЧислуДняНедели;

КонецФункции

Функция МесяцИзЧисла(Знач МесяцЧислом) Экспорт

	МесяцСтрокой = "";

	Если ТипЗнч(МесяцЧислом) <> Тип("Число")
	 ИЛИ НЕ Между(МесяцЧислом, 1, 12)
	Тогда
		Возврат МесяцСтрокой;
	КонецЕсли;

	МесяцДатой = Дата(1998, МесяцЧислом, 19);

	МесяцСтрокой = Формат(МесяцДатой, "ДФ=MMMM");

	Возврат МесяцСтрокой;

КонецФункции

Функция Время(Знач ДатаВремя) Экспорт
	Возврат Дата(1,1,1) + (ДатаВремя - НачалоДня(ДатаВремя));
КонецФункции

Функция ДатаИзЮниксТайм(Знач ЮниксТайм, Знач ЧасовойПояс = 0) Экспорт

	Ризалт = Неопределено;

	ЭпохаЮникс = Дата(1970,1,1);

	Если ТипЗнч(ЮниксТайм) <> Тип("Число") Тогда

		СтрокаЮниксТайм = Строка(ЮниксТайм);

		Попытка
			ЮниксТайм = Число(СтрокаЮниксТайм);
		Исключение
			Возврат Ризалт;
		КонецПопытки;

	КонецЕсли;

	Ризалт = ЭпохаЮникс + ЮниксТайм + ЧасовойПояс * Часов();

	Возврат Ризалт;

КонецФункции

Функция ЧасовойПоясПоУмолчанию() Экспорт
	Возврат 3;	// МСК
КонецФункции

Функция Минут() Экспорт
	Возврат 60;
КонецФункции

Функция Часов() Экспорт
	Возврат 3600;
КонецФункции

Функция Суток() Экспорт
	Возврат 86400;
КонецФункции
#КонецОбласти

#Область УтилитыПеречисления
Функция ДанныеВыбораПеречисления(Знач ИмяПеречисления) Экспорт

	СтруктураДанных	= Новый Структура;
	ОтборДанных		= Новый Структура;
	СтрокаПоиска	= Неопределено;
	СтруктураДанных.Вставить("Отбор", ОтборДанных);
	СтруктураДанных.Вставить("СтрокаПоиска", СтрокаПоиска);
	ДанныеВыбора	= Перечисления[ИмяПеречисления].ПолучитьДанныеВыбора(СтруктураДанных);

	Возврат ДанныеВыбора;

КонецФункции

Функция ЗаполнитьСоотвЗначениеПеречисленияКод(Знач ИмяПеречисления, Знач СоотвЗначениеКод = Неопределено, Знач ИДХ = 0) Экспорт

	СоотвЗначениеКод = ?(СоотвЗначениеКод = Неопределено, Новый Соответствие, СоотвЗначениеКод);

	ДанныеВыбора = РазработкаСервер.ДанныеВыбораПеречисления(ИмяПеречисления);

	ПустоеЗначение = Перечисления[ИмяПеречисления].ПустаяСсылка();
	СтруктураЗначения = Новый Структура;
	СтруктураЗначения.Вставить("Значение", ПустоеЗначение);
	ДанныеВыбора.Вставить(0, СтруктураЗначения, "");

	Для Каждого ЭлементСписка Из ДанныеВыбора Цикл

		ЗначениеПеречисления = ЭлементСписка.Значение.Значение;

		Код1С = РазработкаСервер.ОдносимвольныйКодИзЧисла(ИДХ);
		СоотвЗначениеКод.Вставить(ЗначениеПеречисления, Код1С);

		ИДХ = ИДХ + 1;

	КонецЦикла;

	Возврат СоотвЗначениеКод;

КонецФункции

// https://its.1c.ru/db/metod8dev/content/2466/hdoc
Функция ПолучитьИмяПеречисления(Знач ЗначениеПеречисления) Экспорт
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	Возврат ИмяПеречисления;
КонецФункции

Функция ПолучитьИмяЗначенияПеречисления(Знач ЗначениеПеречисления) Экспорт
	ИмяПеречисления = ПолучитьИмяПеречисления(ЗначениеПеречисления);
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	Возврат ИмяЗначенияПеречисления;
КонецФункции

Функция СоответствиеИмяЗначениеПеречисления(ИмяПеречисления) Экспорт

	СоотвИмяЗначениеПеречисления = Новый Соответствие;

	ДанныеВыбора = ДанныеВыбораПеречисления(ИмяПеречисления);

	Для Каждого ЭлементСписка Из ДанныеВыбора Цикл

		ЗначениеПеречисления = ЭлементСписка.Значение.Значение;
		ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
		ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;

		СоотвИмяЗначениеПеречисления.Вставить(ИмяЗначенияПеречисления, ЗначениеПеречисления);

	КонецЦикла;

	Возврат СоотвИмяЗначениеПеречисления;

КонецФункции
#КонецОбласти

#Область УтилитыПолучениеДанныхИзБазы
// предназначена для выполнения тяжёлых запросов фоновым заданием, либо под отладкой
Функция ВыполнитьЗапросВыгрузитьРезультат(ЗапросБД = Неопределено, ТекстЗапроса = Неопределено) Экспорт

	Если ЗапросБД = Неопределено Тогда
		ЗапросБД = Новый Запрос(ТекстЗапроса);
	КонецЕсли;

	РезультатЗапроса  = ЗапросБД.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции

Функция ПолучитьВыборкуМассиваСсылок(МассивСсылок, Знач ИмяТаблицы) Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Номенклатура", ИмяТаблицы);

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Возврат ВыборкаРезультата;

КонецФункции

Функция БезопасноПолучитьЧерезЦепочкуРеквизитов(Знач Ссылка, Знач ПоследовательностьИменРеквизитов) Экспорт

	Результат = Неопределено;

	Если ТипЗнч(ПоследовательностьИменРеквизитов) <> Тип("Массив") Тогда
		ПоследовательностьИменРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоследовательностьИменРеквизитов, ".");
	КонецЕсли;

	Для Каждого ИмяРеквизита Из ПоследовательностьИменРеквизитов Цикл

		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
			Возврат Результат;
		КонецЕсли;

		Ссылка = Ссылка[ИмяРеквизита];

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьБулевоеЗначениеПраваДляТекущегоПользователя(Право) Экспорт

	ЗначениеПрава = Ложь;

	СписокПрав = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
		Право, Ложь
	);

	Если СписокПрав.Количество() < 1 Тогда
		Возврат ЗначениеПрава;
	КонецЕсли;

	Для Каждого ЭлементСписка Из СписокПрав Цикл

		ЗначениеПрава = ЗначениеПрава ИЛИ ЭлементСписка.Значение;

		Если ЗначениеПрава Тогда
			Возврат ЗначениеПрава;
		КонецЕсли;

	КонецЦикла;

	Возврат ЗначениеПрава;

КонецФункции

Функция ПолучитьЗначениеПраваДляПользователя(Пользователь, Право) Экспорт

	ЗначениеПрава = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияДополнительныхПравПользователя.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхПравПользователя
	|КАК
	|	ЗначенияДополнительныхПравПользователя
	|
	|ГДЕ ЗначенияДополнительныхПравПользователя.Пользователь = &Пользователь
	|  И ЗначенияДополнительныхПравПользователя.Право = &Право";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Право", Право);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	Если ВыборкаРезультата.Следующий() Тогда
		ЗначениеПрава = ВыборкаРезультата.Значение;
	КонецЕсли;

	Возврат ЗначениеПрава;

КонецФункции

Функция ДоступнаАдресацияЗадачРольПользователя(Исполнитель, Роль = null, Подразделение = null) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адресация.Исполнитель,
		|	Адресация.Роль,
		|	Адресация.Подразделение
		|ИЗ
		|	РегистрСведений.Адресация КАК Адресация
		|
		|ГДЕ Адресация.Исполнитель = &Исполнитель
		|  И ВЫБОР
		|		КОГДА &Роль IS NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ Адресация.Роль = &Роль
		|	КОНЕЦ
		|  И ВЫБОР
		|		КОГДА &Подразделение IS NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ Адресация.Подразделение = &Подразделение
		|	КОНЕЦ
		|";

	Запрос.УстановитьПараметр("Исполнитель",	Исполнитель);
	Запрос.УстановитьПараметр("Роль",			Роль);
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);

	РезультатЗапроса = Запрос.Выполнить();

	РольНазначена = НЕ РезультатЗапроса.Пустой();

	Возврат РольНазначена;

КонецФункции

Функция ПолучитьОрганизацииПодразделения(Подразделение) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка
	               |ИЗ
	               |	Справочник.Организации
				   |КАК
				   |	Организации
				   |
	               |ГДЕ Организации.Подразделение = &Подразделение
				   |  И НЕ Организации.ПометкаУдаления
				   |";
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	МассивРезультатов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат МассивРезультатов;

КонецФункции
#КонецОбласти

Функция БезопасноЗаписатьПровестиДокумент(ДокументОбъект, Знач Провести = Ложь, Знач Оперативно = Ложь) Экспорт

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Ошибка"		, Ложь);
	СтруктураВозврата.Вставить("ТекстОшибки", "");
	СтруктураВозврата.Вставить("Ссылка"		, Неопределено);
	СтруктураВозврата.Вставить("Записан"	, Ложь);
	СтруктураВозврата.Вставить("Проведен"	, Ложь);

	Попытка

		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		СтруктураВозврата.Вставить("Ссылка" , ДокументОбъект.Ссылка);
		СтруктураВозврата.Вставить("Записан", Истина);

		Если Провести Тогда

			Попытка
				РежимПроведения = ?(Оперативно, РежимПроведенияДокумента.Оперативный, РежимПроведенияДокумента.Неоперативный);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);
				СтруктураВозврата.Вставить("Проведен", Истина);
			Исключение
				СтруктураВозврата.Вставить("Ошибка"		, Истина);
				СтруктураВозврата.Вставить("ТекстОшибки", ОписаниеОшибки());
			КонецПопытки;

		КонецЕсли;

	Исключение
		СтруктураВозврата.Вставить("Ошибка"		, Истина);
		СтруктураВозврата.Вставить("ТекстОшибки", ОписаниеОшибки());
	КонецПопытки;

	Возврат СтруктураВозврата;

КонецФункции

Функция АвтоПодборАвтомобиля(СтрокаПоиска, МаксимумРезультатов = 20, СтруктураОтборов = Неопределено) Экспорт

	ТекстСоединения = "";

	Если СтруктураОтборов = Неопределено Тогда
		СтруктураОтборов = Новый Структура;
	КонецЕсли;

	Подразделение  = РазработкаСервер.ИзвлечьСвойствоИзСтруктуры(СтруктураОтборов, "Подразделение", NULL, Истина);
	Статусы = РазработкаСервер.ИзвлечьСвойствоИзСтруктуры(СтруктураОтборов, "Статусы", NULL, Истина);

	МассивОтборов = Новый Массив;

	Если ЗначениеЗаполнено(Подразделение) Тогда
		СтрокаОтбора = "	И Автомобили.Подразделение = &Подразделение";
		МассивОтборов.Добавить(СтрокаОтбора);
	КонецЕсли;

	Если ЗначениеЗаполнено(Статусы) Тогда

		СтрокаОтбора = "	И ВыкупАвтомобиляСрезПоследних.Статус В (&Статусы)";
		МассивОтборов.Добавить(СтрокаОтбора);

		ТекстСоединения = "
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыкупЗетаБУАвтомобиля.СрезПоследних
		|КАК ВыкупАвтомобиляСрезПоследних
		| ПО Автомобили.Ссылка = ВыкупАвтомобиляСрезПоследних.Автомобиль
		|";

	КонецЕсли;

	ТекстОтборы = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивОтборов, Символы.ПС);

	НачалоСтроки	= СтрокаПоиска + "%";
	ПодстрокаПоиска	= "%" + НачалоСтроки;

	СписокВыбора = Новый СписокЗначений;

	Запрос = Новый Запрос;

	ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	Автомобили.Ссылка,
		|	Автомобили.Наименование,
		|	Автомобили.Код,
		|	Автомобили.VIN
		|ПОМЕСТИТЬ КодПоНачалуСтроки
		|ИЗ
		|	Справочник.ЗетаБУАвтомобили КАК Автомобили
		|//&ТекстСоединения
		|ГДЕ
		|	НЕ Автомобили.ПометкаУдаления
		|	И Автомобили.Код ПОДОБНО &ПодстрокаПоиска
		|	И &Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автомобили.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	Автомобили.Ссылка,
		|	Автомобили.Наименование,
		|	Автомобили.Код,
		|	Автомобили.VIN
		|ПОМЕСТИТЬ VINПоНачалуСтроки
		|ИЗ
		|	Справочник.ЗетаБУАвтомобили КАК Автомобили
		|//&ТекстСоединения
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ
		|				КОЛИЧЕСТВО(КодПоНачалуСтроки.Наименование) < &МаксимумРезультатов
		|			ИЗ
		|				КодПоНачалуСтроки)
		|	И НЕ Автомобили.Код В
		|				(ВЫБРАТЬ
		|					КодПоНачалуСтроки.Код
		|				ИЗ
		|					КодПоНачалуСтроки)
		|	И НЕ Автомобили.ПометкаУдаления
		|	И Автомобили.VIN ПОДОБНО &НачалоСтроки
		|	И &Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автомобили.VIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодПоНачалуСтроки.Ссылка,
		|	КодПоНачалуСтроки.Наименование,
		|	КодПоНачалуСтроки.Код,
		|	КодПоНачалуСтроки.VIN
		|ПОМЕСТИТЬ
		|	ВыбранныеПоКоду
		|ИЗ
		|	КодПоНачалуСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	VINПоНачалуСтроки.Ссылка,
		|	VINПоНачалуСтроки.Наименование,
		|	VINПоНачалуСтроки.Код,
		|	VINПоНачалуСтроки.VIN
		|ИЗ
		|	VINПоНачалуСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	Автомобили.Ссылка,
		|	Автомобили.Наименование,
		|	Автомобили.Код,
		|	Автомобили.VIN
		|ПОМЕСТИТЬ VINПоПодстроке
		|ИЗ
		|	Справочник.ЗетаБУАвтомобили КАК Автомобили
		|//&ТекстСоединения
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ
		|				КОЛИЧЕСТВО(ВыбранныеПоКоду.Наименование) < &МаксимумРезультатов
		|			ИЗ
		|				ВыбранныеПоКоду)
		|	И НЕ Автомобили.Код В
		|				(ВЫБРАТЬ
		|					ВыбранныеПоКоду.Код
		|				ИЗ
		|					ВыбранныеПоКоду)
		|	И НЕ Автомобили.ПометкаУдаления
		|	И Автомобили.VIN ПОДОБНО &ПодстрокаПоиска
		|	И &Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автомобили.VIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеПоКоду.Ссылка,
		|	ВыбранныеПоКоду.Наименование,
		|	ВыбранныеПоКоду.Код,
		|	ВыбранныеПоКоду.VIN
		|ПОМЕСТИТЬ
		|	ВыбранныеПоVIN
		|ИЗ
		|	ВыбранныеПоКоду
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	VINПоПодстроке.Ссылка,
		|	VINПоПодстроке.Наименование,
		|	VINПоПодстроке.Код,
		|	VINПоПодстроке.VIN
		|ИЗ
		|	VINПоПодстроке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	Автомобили.Ссылка,
		|	Автомобили.Наименование,
		|	Автомобили.Код,
		|	Автомобили.VIN
		|ПОМЕСТИТЬ НаименованияПоНачалуСтроки
		|ИЗ
		|	Справочник.ЗетаБУАвтомобили КАК Автомобили
		|//&ТекстСоединения
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ
		|				КОЛИЧЕСТВО(ВыбранныеПоVIN.Наименование) < &МаксимумРезультатов
		|			ИЗ
		|				ВыбранныеПоVIN)
		|	И НЕ Автомобили.Код В
		|				(ВЫБРАТЬ
		|					ВыбранныеПоVIN.Код
		|				ИЗ
		|					ВыбранныеПоVIN)
		|	И НЕ Автомобили.ПометкаУдаления
		|	И Автомобили.Наименование ПОДОБНО &НачалоСтроки
		|	И &Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автомобили.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеПоVIN.Ссылка,
		|	ВыбранныеПоVIN.Наименование,
		|	ВыбранныеПоVIN.Код,
		|	ВыбранныеПоVIN.VIN
		|ПОМЕСТИТЬ
		|	Выбранные
		|ИЗ
		|	ВыбранныеПоVIN
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НаименованияПоНачалуСтроки.Ссылка,
		|	НаименованияПоНачалуСтроки.Наименование,
		|	НаименованияПоНачалуСтроки.Код,
		|	НаименованияПоНачалуСтроки.VIN
		|ИЗ
		|	НаименованияПоНачалуСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	Автомобили.Ссылка,
		|	Автомобили.Наименование,
		|	Автомобили.Код,
		|	Автомобили.VIN
		|ПОМЕСТИТЬ НаименованияПоПодстроке
		|ИЗ
		|	Справочник.ЗетаБУАвтомобили КАК Автомобили
		|//&ТекстСоединения
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ
		|				КОЛИЧЕСТВО(Выбранные.Наименование) < &МаксимумРезультатов
		|			ИЗ
		|				Выбранные)
		|	И НЕ Автомобили.Код В
		|				(ВЫБРАТЬ
		|					Выбранные.Код
		|				ИЗ
		|					Выбранные)
		|	И НЕ Автомобили.ПометкаУдаления
		|	И Автомобили.Наименование ПОДОБНО &ПодстрокаПоиска
		|	И &Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автомобили.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выбранные.Ссылка,
		|	Выбранные.Наименование,
		|	Выбранные.Код,
		|	Выбранные.VIN
		|ИЗ
		|	Выбранные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НаименованияПоПодстроке.Ссылка,
		|	НаименованияПоПодстроке.Наименование,
		|	НаименованияПоПодстроке.Код,
		|	НаименованияПоПодстроке.VIN
		|ИЗ
		|	НаименованияПоПодстроке
		|";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 0"		, "ВЫБРАТЬ ПЕРВЫЕ " + МаксимумРезультатов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	И &Отборы"			, ТекстОтборы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&ТекстСоединения"	, ТекстСоединения);

	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("НачалоСтроки",			НачалоСтроки);
	Запрос.УстановитьПараметр("ПодстрокаПоиска",		ПодстрокаПоиска);
	Запрос.УстановитьПараметр("МаксимумРезультатов",	МаксимумРезультатов);

	Для Каждого КлючЗначение Из СтруктураОтборов Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ,	КлючЗначение.Значение);
	КонецЦикла;

	РезультатЗапроса	= Запрос.Выполнить();

	ТаблицаРезультата	= РезультатЗапроса.Выгрузить();

	ВсегоСтрок			= ТаблицаРезультата.Количество();
	ПоследнийИндекс		= ?(ВсегоСтрок > МаксимумРезультатов, МаксимумРезультатов, ВсегоСтрок) - 1;

	Для ИДХ=0 По ПоследнийИндекс Цикл

		СтрокаТР = ТаблицаРезультата[ИДХ];

//		СсылкаЗначения = СтрокаТР.Ссылка;

		Представление = "(" + СтрокаТР.Код + ") " + СтрокаТР.Наименование + " " + СтрокаТР.VIN;

		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("Значение",			СтрокаТР.Ссылка);
		СтруктураЗначения.Вставить("Представление",		Представление);
		СтруктураЗначения.Вставить("ПометкаУдаления",	Ложь);

		ФорматированноеПредставление = РазработкаСервер.ВыделитьПодстрокуСтроки(Представление, СтрокаПоиска);

		СписокВыбора.Добавить(СтруктураЗначения, ФорматированноеПредставление);

	КонецЦикла;

	Возврат СписокВыбора;

КонецФункции

#Область Номенклатура
Функция АвтоПодборАртикула(
	  СтрокаПоиска
	, МаксимумРезультатов = 20
) Экспорт

	НачалоСтроки	= СтрокаПоиска + "%";
	ПодстрокаПоиска	= "%" + НачалоСтроки;

	СписокВыбора = Новый СписокЗначений;

	Запрос = Новый Запрос;

	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	Номенклатура.Артикул
		|ПОМЕСТИТЬ НаименованияПоНачалуСтроки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Артикул ПОДОБНО &НачалоСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	Номенклатура.Артикул
		|ПОМЕСТИТЬ НаименованияПоПодстроке
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ
		|				КОЛИЧЕСТВО(НаименованияПоНачалуСтроки.Артикул) < &МаксимумРезультатов
		|			ИЗ
		|				НаименованияПоНачалуСтроки)
		|	И НЕ Номенклатура.Артикул В
		|				(ВЫБРАТЬ
		|					НаименованияПоНачалуСтроки.Артикул
		|				ИЗ
		|					НаименованияПоНачалуСтроки)
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Артикул ПОДОБНО &ПодстрокаПоиска
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаименованияПоНачалуСтроки.Артикул
		|ИЗ
		|	НаименованияПоНачалуСтроки КАК НаименованияПоНачалуСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НаименованияПоПодстроке.Артикул
		|ИЗ
		|	НаименованияПоПодстроке КАК НаименованияПоПодстроке";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 0", "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ " + МаксимумРезультатов);

	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("НачалоСтроки",				НачалоСтроки);
	Запрос.УстановитьПараметр("ПодстрокаПоиска",			ПодстрокаПоиска);
	Запрос.УстановитьПараметр("МаксимумРезультатов",		МаксимумРезультатов);

	РезультатЗапроса	= Запрос.Выполнить();

	ТаблицаРезультата	= РезультатЗапроса.Выгрузить();

	ВсегоСтрок			= ТаблицаРезультата.Количество();
	ПоследнийИндекс		= ?(ВсегоСтрок > МаксимумРезультатов, МаксимумРезультатов, ВсегоСтрок) - 1;

	Для ИДХ=0 По ПоследнийИндекс Цикл

		СтрокаТР = ТаблицаРезультата[ИДХ];

//		СсылкаЗначения = СтрокаТР.Ссылка;

		Представление = СтрокаТР.Артикул;

		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("Значение",			Представление);
		СтруктураЗначения.Вставить("ПометкаУдаления",	Ложь);

		ФорматированноеПредставление = РазработкаСервер.ВыделитьПодстрокуСтроки(Представление, СтрокаПоиска);

		СписокВыбора.Добавить(СтруктураЗначения, ФорматированноеПредставление);

	КонецЦикла;

	Возврат СписокВыбора;

КонецФункции

Функция НоменклатураЕстьВБазе(Артикул, Бренд, НоменклатураСсылка = null) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|	И ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(&Бренд) = ТИП(Справочник.СайтБренды)
	|		ТОГДА Номенклатура.Бренд = &Бренд
	|		ИНАЧЕ Номенклатура.БрендРучной = &Бренд
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &Номенклатура IS NULL
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ Номенклатура.Ссылка <> &Номенклатура
	|	КОНЕЦ
	|";
	Запрос.УстановитьПараметр("Артикул",		Артикул);
	Запрос.УстановитьПараметр("Бренд",			Бренд);
	Запрос.УстановитьПараметр("Номенклатура",	НоменклатураСсылка);

	Результат = Запрос.Выполнить();

	Возврат НЕ Результат.Пустой();

КонецФункции

// возвращает номенклатуру, если есть только одна номенклатура с таким артикулом
// , игнорируя помеченные на удаление и временные
Функция ПолучитьНоменклатуруПоАртикулу(Артикул) Экспорт

	НайденнаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();

	Если НЕ ЗначениеЗаполнено(Артикул) Тогда
		Возврат НайденнаяНоменклатура;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура
		|КАК
		|	Номенклатура
		|
		|ГДЕ Артикул = &Артикул
		|  И НЕ Номенклатура.ПометкаУдаления
		|  И НЕ Номенклатура.Временная
		|  И НЕ Номенклатура.НаименованиеВременное
		|";

	Запрос.УстановитьПараметр("Артикул", Артикул);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 1 И ВыборкаДетальныеЗаписи.Следующий() Тогда
		НайденнаяНоменклатура = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат НайденнаяНоменклатура;

КонецФункции

Функция НайтиНоменклатуру(
	  Артикул
	, Наименование = NULL
	, Бренд = NULL
	, КодНоменклатуры = NULL
	, ИсключеннаяНоменклатура = NULL
	, ДопустимаНеуникальность = Ложь
) Экспорт

	НайденнаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();

	Если НЕ ЗначениеЗаполнено(Артикул) Тогда
		Возврат НайденнаяНоменклатура;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура
		|КАК
		|	Номенклатура
		|
		|ГДЕ Артикул = &Артикул
		|  И ВЫБОР
		|		КОГДА &Наименование IS NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ Номенклатура.Наименование = &Наименование
		|	КОНЕЦ
		|  И ВЫБОР
		|		КОГДА &Бренд IS NULL
		|			ТОГДА ИСТИНА
		|		КОГДА ТИПЗНАЧЕНИЯ(&Бренд) = ТИП(Справочник.СайтБренды)
		|			ТОГДА Номенклатура.Бренд = &Бренд
		|		ИНАЧЕ
		|			Номенклатура.Бренд.Наименование = &Бренд
		|	КОНЕЦ
		|  И ВЫБОР
		|		КОГДА &КодНоменклатуры IS NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ Номенклатура.Код = &КодНоменклатуры
		|	КОНЕЦ
		|  И ВЫБОР
		|		КОГДА &ИсключеннаяНоменклатура IS NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ Номенклатура.Ссылка <> &ИсключеннаяНоменклатура
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|  Номенклатура.ПометкаУдаления ВОЗР,
		|  Номенклатура.Временная ВОЗР,
		|  Номенклатура.НаименованиеВременное ВОЗР
		|";

	Запрос.УстановитьПараметр("Артикул"					, Артикул);
	Запрос.УстановитьПараметр("Наименование"			, Наименование);
	Запрос.УстановитьПараметр("Бренд"					, Бренд);
	Запрос.УстановитьПараметр("КодНоменклатуры"			, КодНоменклатуры);
	Запрос.УстановитьПараметр("ИсключеннаяНоменклатура"	, ИсключеннаяНоменклатура);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВсегоРезультатов = ВыборкаДетальныеЗаписи.Количество();

	Если ВыборкаДетальныеЗаписи.Следующий()
	   И (ВсегоРезультатов = 1 ИЛИ ДопустимаНеуникальность)
	Тогда
		НайденнаяНоменклатура = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат НайденнаяНоменклатура;

КонецФункции
#КонецОбласти

Функция ЗначениеВалютаРоссийскийРубль() Экспорт
	Возврат Справочники.Валюты.НайтиПоКоду("643");
КонецФункции

Функция ЗначениеВалютаДолларСША() Экспорт
	Возврат Справочники.Валюты.НайтиПоКоду("840");
КонецФункции

Функция ЗначениеВалютаЕвро() Экспорт
	Возврат Справочники.Валюты.НайтиПоКоду("978");
КонецФункции

#Область ЗагрузкаТаблицыЗначенийИзФайлов
Функция ЗагрузитьТаблицуЗначенийИзФайлаЦСВ(ПутьФайлаЦСВ, КодировкаЦСВ = Неопределено, РазделительЦСВ = ";") Экспорт

	ЗагружаемыйФайл = Новый ТекстовыйДокумент;

	КодировкаТекстаЦСВ = Неопределено;

	Если ТипЗнч(КодировкаЦСВ) = Тип("КодировкаТекста") Тогда
		 КодировкаТекстаЦСВ = КодировкаЦСВ;
	ИначеЕсли КодировкаЦСВ = "ANSI"      Тогда
		 КодировкаТекстаЦСВ = КодировкаТекста.ANSI;
	ИначеЕсли КодировкаЦСВ = "OEM"       Тогда
		 КодировкаТекстаЦСВ = КодировкаТекста.OEM;
	ИначеЕсли КодировкаЦСВ = "UTF8"      Тогда
		 КодировкаТекстаЦСВ = КодировкаТекста.UTF8;
	ИначеЕсли КодировкаЦСВ = "UTF16"     Тогда
		 КодировкаТекстаЦСВ = КодировкаТекста.UTF16;
	ИначеЕсли КодировкаЦСВ = "Системная" Тогда
		 КодировкаТекстаЦСВ = КодировкаТекста.Системная;
	КонецЕсли;

	Если КодировкаТекстаЦСВ = Неопределено Тогда
		ЗагружаемыйФайл.Прочитать(ПутьФайлаЦСВ);
	Иначе
		ЗагружаемыйФайл.Прочитать(ПутьФайлаЦСВ, КодировкаТекстаЦСВ);
	КонецЕсли;

	Поля = ЗаполнитьШапку(ЗагружаемыйФайл, РазделительЦСВ);
	МассивСтрок = ЗаполнитьСтроки(Поля, ЗагружаемыйФайл, РазделительЦСВ);
	ТабЗначений = ЗаполнитьТаблицу(Поля, МассивСтрок);

	Возврат ТабЗначений;

КонецФункции

Функция ЗаполнитьШапку(ЗагружаемыйФайл, Знач Разделитель)

	БезымяннаяКолонка = "Столбец";

	Поля = Новый Массив;

	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	РазбитаяШапка = РазложитьСтрокуВМассивПодстрок(Шапка, Разделитель);
	Колонок = РазбитаяШапка.Количество()-1;

	Для Номер=0 По Колонок Цикл
		ИмяКолонки = ПолучитьИмяКолонки(РазбитаяШапка[Номер], Поля);
		Если ПустаяСтрока(ИмяКолонки) Тогда
			ИмяКолонки = БезымяннаяКолонка + Номер;
		КонецЕсли;
		Поля.Добавить(ИмяКолонки);
	КонецЦикла;

	Возврат Поля;

КонецФункции

Функция ЗаполнитьСтроки(Поля, ЗагружаемыйФайл, Знач Разделитель)

	БезымяннаяКолонка = "Столбец";
	ВсегоСтрок = ЗагружаемыйФайл.КоличествоСтрок();

	МассивСтрок = Новый Массив;

	МногострочнаяСтрока = Ложь;
	НоваяСтрока = Неопределено;
	ИндексСтолбца = -1;

	Для НомерСтроки=2 по ВсегоСтрок Цикл

		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКол = РазложитьСтрокуВМассивПодстрок(Строка, Разделитель);

		Предел = МассивКол.Количество();
		КолвоКолонок = Поля.Количество();

		Если Предел > КолвоКолонок Тогда
			Для Номер=КолвоКолонок По Предел Цикл
				ИмяКолонки = БезымяннаяКолонка + Номер;
				Поля.Добавить(ИмяКолонки);
			КонецЦикла;
		КонецЕсли;

		Если НЕ МногострочнаяСтрока Тогда
			ИндексСтолбца = -1;
			НоваяСтрока = Новый Структура;
			МассивСтрок.Добавить(НоваяСтрока);
		КонецЕсли;

		Для НомерСтолбца=1 по Предел Цикл

			ТекущееЗначение	= МассивКол[НомерСтолбца-1];

			НачалоСтроки = СтрДлина(ТекущееЗначение) > 0 И  Лев(ТекущееЗначение, 1) = """";
			КонецСтроки  = СтрДлина(ТекущееЗначение) > 1 И Прав(ТекущееЗначение, 1) = """";

			Если МногострочнаяСтрока Тогда

				ТекущееПоле = Поля[ИндексСтолбца];

				НоваяСтрока[ТекущееПоле]
					= НоваяСтрока[ТекущееПоле]
					+ ?(НомерСтолбца=1, Символы.ПС, Разделитель)
					+ ТекущееЗначение
				;

				Если КонецСтроки Тогда
					МногострочнаяСтрока = Ложь;
				КонецЕсли;

				Продолжить;

			КонецЕсли;

			Если НачалоСтроки И НЕ КонецСтроки Тогда
				МногострочнаяСтрока = Истина;
			КонецЕсли;

			ИндексСтолбца	= ИндексСтолбца + 1;
			ТекущееПоле		= Поля[ИндексСтолбца];
			НоваяСтрока.Вставить(ТекущееПоле, ТекущееЗначение);

		КонецЦикла;

	КонецЦикла;

	Возврат МассивСтрок;

КонецФункции

Функция ЗаполнитьТаблицу(Поля, МассивСтрок)

	ТабЗначений = Новый ТаблицаЗначений;

	Если ТипЗнч(Поля) = Тип("Соответствие") Тогда
		Для Каждого Поле Из Поля Цикл
			ТабЗначений.Колонки.Добавить(Поле.Ключ);
		КонецЦикла;
	Иначе
		Для Каждого Поле Из Поля Цикл
			ТабЗначений.Колонки.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;

	ВсегоЗаписей = МассивСтрок.Количество();

	Для Каждого Строчка Из МассивСтрок Цикл
		СтрокаТЗ = ТабЗначений.Добавить();
		Для Каждого Элемент Из Строчка Цикл
			СтрокаТЗ[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
	КонецЦикла;

	Возврат ТабЗначений;

КонецФункции

Функция ПолучитьИмяКолонки(ИмяСтолбца, Поля)

	ИмяКолонки = СтрЗаменить(ИмяСтолбца, " ", "_");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "(", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, ")", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "-", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "/", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "\", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "%", "Процент");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "№", "Номер");

	Попытка
		Результ = Число(Лев(ИмяКолонки, 1));
		ИмяКолонки = "_" + ИмяКолонки;
	Исключение
	КонецПопытки;

	ИДХ = 0;
	УникальноеИмяКолонки = ИмяКолонки;
	Пока Поля.Найти(УникальноеИмяКолонки) <> Неопределено Цикл
		ИДХ = ИДХ + 1;
		УникальноеИмяКолонки = ИмяКолонки + ИДХ;
	КонецЦикла;
	ИмяКолонки = УникальноеИмяКолонки;

	Возврат ИмяКолонки;

КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(
	Знач Строка,
	Знач Разделитель = ",",
    Знач ПропускатьПустыеСтроки = Неопределено
)

    Результат = Новый Массив;

    // для обеспечения обратной совместимости
    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
    //

    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
 
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;

    Возврат Результат;

КонецФункции
#КонецОбласти

Процедура ПроставитьИндексыЧередующейсяПодсветки(ТаблицаДанных, Знач ИмяКолонки = Неопределено, ВариантовПодсветки = 2, ЗамещатьОтрицательные = Ложь, ЗамещатьИзбыточные = Ложь) Экспорт

	ВсегоСтрок = ТаблицаДанных.Количество();

	Если ВсегоСтрок < 1 Тогда
		Возврат;
	КонецЕсли;

	ЛимитСтрок = ВсегоСтрок - 1;

	ИмяКолонки = ?(ИмяКолонки = Неопределено, "ИдПодсветки", ИмяКолонки);

	Для ИДХ=0 По ЛимитСтрок Цикл

		СтрокаТД = ТаблицаДанных[ИДХ];
		ТекИд = СтрокаТД[ИмяКолонки];

		Если (НЕ ЗамещатьОтрицательные И (ТекИд < 0))
		 ИЛИ (НЕ ЗамещатьИзбыточные И (ТекИд >= ВариантовПодсветки))
		Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТД[ИмяКолонки] = ИДХ % ВариантовПодсветки;

	КонецЦикла;

КонецПроцедуры

Функция СфСоотвВебЦветовНаименованиям() Экспорт

	СоотвВебЦветов = Новый Соответствие;

	Для Каждого ВебЦвет Из СоотвВебЦветов Цикл
		СоотвВебЦветов.Вставить(Строка(ВебЦвет), ВебЦвет);
	КонецЦикла;

	Возврат СоотвВебЦветов;

КонецФункции
// - ДДГ

// 51133 ДДГ 11 апр 2022 скопировал из других модулей для переиспользования
#Область Применяемость
Процедура УдалитьПрименяемостьМодели(ГруппаКроссов, Модель = Неопределено) Экспорт

	Набор = РегистрыСведений.ПрименяемостьМодели.СоздатьНаборЗаписей();

	Набор.Отбор.ГруппаКроссов.Установить(ГруппаКроссов);

	Если ЗначениеЗаполнено(Модель) Тогда
		Набор.Отбор.Модель.Установить(Модель);
	КонецЕсли;

	Набор.Записать();

КонецПроцедуры

Процедура УдалитьПрименяемостьУзла(ГруппаКроссов, Узел = Неопределено) Экспорт

	Набор = РегистрыСведений.ПрименяемостьУзлы.СоздатьНаборЗаписей();

	Набор.Отбор.ГруппаКроссов.Установить(ГруппаКроссов);

	Если ЗначениеЗаполнено(Узел) Тогда
		Набор.Отбор.Узел.Установить(Узел);
	КонецЕсли;

	Набор.Записать();

КонецПроцедуры

Функция ПодтвердитьПрименяемостьМодели(ГруппаКроссов, Модель) Экспорт

	МенеджерЗаписи = РегистрыСведений.ПрименяемостьМодели.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.ГруппаКроссов = ГруппаКроссов;
	МенеджерЗаписи.Модель = Модель;

	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;

	МенеджерЗаписи.Временная = Ложь;

	МенеджерЗаписи.Записать(Истина);

	Возврат Истина;

КонецФункции

Процедура СоздатьЗаписьПрименяемостьМодели(ГруппаКроссов, Модель, Временная = Ложь) Экспорт
	МенеджерЗаписи = РегистрыСведений.ПрименяемостьМодели.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность		= Истина;
	МенеджерЗаписи.ГруппаКроссов	= ГруппаКроссов;
	МенеджерЗаписи.Модель			= Модель;
	МенеджерЗаписи.Временная		= Временная;
	МенеджерЗаписи.ДатаДобавления	= ТекущаяДатаСеанса();
	МенеджерЗаписи.Добавил			= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

Процедура СоздатьЗаписьПрименяемостьУзла(ГруппаКроссов, Узел) Экспорт
	МенеджерЗаписи               = РегистрыСведений.ПрименяемостьУзлы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность    = Истина;
	МенеджерЗаписи.ГруппаКроссов = ГруппаКроссов;
	МенеджерЗаписи.Узел       	 = Узел;
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

Процедура ОчиститьУдаленнуюПрименяемостьМодели(ГруппаКроссов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	ПрименяемостьМодели.ГруппаКроссов,
		|	ПрименяемостьМодели.Модель
		|ИЗ
		|	РегистрСведений.ПрименяемостьМодели
		|КАК
		|	ПрименяемостьМодели
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СайтГруппыКроссов.Модели
		|КАК ТаблицаПрименяемости
		| ПО ПрименяемостьМодели.ГруппаКроссов = ТаблицаПрименяемости.Ссылка
		|  И ПрименяемостьМодели.Модель = ТаблицаПрименяемости.Модель
		|
		|ГДЕ ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов
		|  И ТаблицаПрименяемости.Ссылка IS NULL
		|";

	Запрос.УстановитьПараметр("ГруппаКроссов",			ГруппаКроссов);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		УдалитьПрименяемостьМодели(Выборка.ГруппаКроссов, Выборка.Модель);
	КонецЦикла;

КонецПроцедуры

Процедура ОчиститьУдаленнуюПрименяемостьУзлы(ГруппаКроссов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	ПрименяемостьУзлы.ГруппаКроссов,
		|	ПрименяемостьУзлы.Узел
		|ИЗ
		|	РегистрСведений.ПрименяемостьУзлы
		|КАК
		|	ПрименяемостьУзлы
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СайтГруппыКроссов.Узлы
		|КАК ТаблицаПрименяемости
		| ПО ПрименяемостьУзлы.ГруппаКроссов = ТаблицаПрименяемости.Ссылка
		|  И ПрименяемостьУзлы.Узел = ТаблицаПрименяемости.Узел
		|
		|ГДЕ ПрименяемостьУзлы.ГруппаКроссов = &ГруппаКроссов
		|  И ТаблицаПрименяемости.Ссылка IS NULL
		|";

	Запрос.УстановитьПараметр("ГруппаКроссов",			ГруппаКроссов);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		УдалитьПрименяемостьМодели(Выборка.ГруппаКроссов, Выборка.Узел);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьМассивПрименяемостиМодели(ГруппаКроссов, Временная = NULL) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрименяемостьМодели.Модель
		|ИЗ
		|	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
		|ГДЕ
		|	ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов
		|И
		|	ВЫБОР
		|		КОГДА &Временная IS NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ Временная = &Временная
		|	КОНЕЦ
		|";

	Запрос.УстановитьПараметр("ГруппаКроссов", ГруппаКроссов);
	Запрос.УстановитьПараметр("Временная", Временная);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	МассивРезультата = ТаблицаРезультата.ВыгрузитьКолонку("Модель");

	Возврат МассивРезультата;

КонецФункции

Функция ПолучитьМассивПрименяемостиУзлы(ГруппаКроссов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрименяемостьУзлы.Узел
		|ИЗ
		|	РегистрСведений.ПрименяемостьУзлы КАК ПрименяемостьУзлы
		|ГДЕ
		|	ПрименяемостьУзлы.ГруппаКроссов = &ГруппаКроссов";

	Запрос.УстановитьПараметр("ГруппаКроссов", ГруппаКроссов);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	МассивРезультата = ТаблицаРезультата.ВыгрузитьКолонку("Узел");

	Возврат МассивРезультата;

КонецФункции

Функция РазницаПрименяемостиМодели(ГруппаКроссов, ТаблицаПрименяемости) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	ПрименяемостьМодели.ГруппаКроссов,
		|	ПрименяемостьМодели.Модель,
		|	ПрименяемостьМодели.Временная
		|ПОМЕСТИТЬ
		|	ПрименяемостьМодели
		|ИЗ
		|	РегистрСведений.ПрименяемостьМодели
		|КАК
		|	ПрименяемостьМодели
		|
		|ГДЕ ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаПрименяемости.ГруппаКроссов,
		|	ТаблицаПрименяемости.Модель,
		|	ТаблицаПрименяемости.Временная
		|ПОМЕСТИТЬ
		|	ТаблицаПрименяемости
		|ИЗ
		|	&ТаблицаПрименяемости
		|КАК
		|	ТаблицаПрименяемости
		|
		|ГДЕ ТаблицаПрименяемости.ГруппаКроссов = &ГруппаКроссов
		|;
		|
		|ВЫБРАТЬ
		|	ISNULL(ПрименяемостьМодели.ГруппаКроссов, ТаблицаПрименяемости.ГруппаКроссов) КАК ГруппаКроссов,
		|	ISNULL(ПрименяемостьМодели.Модель, ТаблицаПрименяемости.Модель) КАК Модель,
		|	ТаблицаПрименяемости.Временная,
		|	ПрименяемостьМодели.ГруппаКроссов IS NULL КАК НетВРегистре,
		|	ТаблицаПрименяемости.ГруппаКроссов IS NULL КАК НетВТаблице,
		|	(ПрименяемостьМодели.Временная = ИСТИНА) И (ТаблицаПрименяемости.Временная = ЛОЖЬ) КАК Подтвердить
		|ИЗ
		|	ТаблицаПрименяемости
		|
		|ПОЛНОЕ СОЕДИНЕНИЕ ПрименяемостьМодели
		| ПО ПрименяемостьМодели.ГруппаКроссов = ТаблицаПрименяемости.ГруппаКроссов
		|  И ПрименяемостьМодели.Модель = ТаблицаПрименяемости.Модель
		|
		|";

	Запрос.УстановитьПараметр("ГруппаКроссов",			ГруппаКроссов);
	Запрос.УстановитьПараметр("ТаблицаПрименяемости",	ТаблицаПрименяемости);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции

Функция РазницаПрименяемостиУзлы(ГруппаКроссов, ТаблицаПрименяемости) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	ПрименяемостьУзлы.ГруппаКроссов,
		|	ПрименяемостьУзлы.Узел
		|ПОМЕСТИТЬ
		|	ПрименяемостьУзлы
		|ИЗ
		|	РегистрСведений.ПрименяемостьУзлы
		|КАК
		|	ПрименяемостьУзлы
		|
		|ГДЕ ПрименяемостьУзлы.ГруппаКроссов = &ГруппаКроссов
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаПрименяемости.ГруппаКроссов,
		|	ТаблицаПрименяемости.Узел
		|ПОМЕСТИТЬ
		|	ТаблицаПрименяемости
		|ИЗ
		|	&ТаблицаПрименяемости
		|КАК
		|	ТаблицаПрименяемости
		|
		|ГДЕ ТаблицаПрименяемости.ГруппаКроссов = &ГруппаКроссов
		|;
		|
		|ВЫБРАТЬ
		|	ISNULL(ПрименяемостьУзлы.ГруппаКроссов, ТаблицаПрименяемости.ГруппаКроссов) КАК ГруппаКроссов,
		|	ISNULL(ПрименяемостьУзлы.Узел, ТаблицаПрименяемости.Узел) КАК Узел,
		|	ПрименяемостьУзлы.ГруппаКроссов IS NULL КАК НетВРегистре,
		|	ТаблицаПрименяемости.ГруппаКроссов IS NULL КАК НетВТаблице
		|ИЗ
		|	ТаблицаПрименяемости
		|
		|ПОЛНОЕ СОЕДИНЕНИЕ ПрименяемостьУзлы
		| ПО ПрименяемостьУзлы.ГруппаКроссов = ТаблицаПрименяемости.ГруппаКроссов
		|  И ПрименяемостьУзлы.Узел = ТаблицаПрименяемости.Узел
		|
		|";

	Запрос.УстановитьПараметр("ГруппаКроссов",			ГруппаКроссов);
	Запрос.УстановитьПараметр("ТаблицаПрименяемости",	ТаблицаПрименяемости);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции

Функция ПроверитьЕстьЛиМодельВПрименяемости(ГруппаКроссов, Модель) Экспорт
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПрименяемостьМодели.Модель
	               |ИЗ
	               |	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
	               |ГДЕ
	               |	ПрименяемостьМодели.Модель = &Модель
	               |	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ГруппаКроссов", ГруппаКроссов);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ВыбратьПрименяемостьМодели(ГруппаКроссов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрименяемостьМодели.Модель,
		|	ПрименяемостьМодели.Временная,
		|	ПрименяемостьМодели.ДатаДобавления,
		|	ПрименяемостьМодели.Добавил
		|ИЗ
		|	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
		|ГДЕ
		|	ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";

	Запрос.УстановитьПараметр("ГруппаКроссов", ГруппаКроссов);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Возврат ВыборкаРезультата;

КонецФункции

Функция ПолучитьМассивНаименованийНоменклатурыПоПрименяемостиУзла(УзелАвтомобиля) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрименяемостьУзлы.ГруппаКроссов.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры
		|ИЗ
		|	РегистрСведений.ПрименяемостьУзлы КАК ПрименяемостьУзлы
		|ГДЕ
		|	ПрименяемостьУзлы.Узел = &УзелАвтомобиля";

	Запрос.УстановитьПараметр("УзелАвтомобиля", УзелАвтомобиля);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	МассивРезультата = ТаблицаРезультата.ВыгрузитьКолонку("НаименованиеНоменклатуры");

	Возврат МассивРезультата;

КонецФункции

Функция ПолучитьМассивУзловПоНаименованиюНоменклатуры(НаименованиеНоменклатуры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрименяемостьУзлы.Узел
		|ИЗ
		|	РегистрСведений.ПрименяемостьУзлы КАК ПрименяемостьУзлы
		|ГДЕ
		|	ПрименяемостьУзлы.ГруппаКроссов.НаименованиеНоменклатуры = &НаименованиеНоменклатуры";

	Запрос.УстановитьПараметр("НаименованиеНоменклатуры", НаименованиеНоменклатуры);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	МассивРезультата = ТаблицаРезультата.ВыгрузитьКолонку("Узел");

	Возврат МассивРезультата;

КонецФункции
#КонецОбласти

Функция ОпределитьРасширениеФайлаДанныхПоСигнатуре(ДвоичныеДанныеФайла) Экспорт

	Если ДвоичныеДанныеФайла = Неопределено Тогда
		 Возврат Неопределено;
	КонецЕсли;	

	ПотокДанных = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	ЧтениеДанных = Новый ЧтениеДанных(ПотокДанных);

	Символ1 = ЧтениеДанных.ПрочитатьБайт();
	Символ2 = ЧтениеДанных.ПрочитатьБайт();
	Символ3 = ЧтениеДанных.ПрочитатьБайт();
	Символ4 = ЧтениеДанных.ПрочитатьБайт();
	//Символ5 = ЧтениеДанных.ПрочитатьБайт();
	//Символ6 = ЧтениеДанных.ПрочитатьБайт();
	//Символ7 = ЧтениеДанных.ПрочитатьБайт();
	//Символ8 = ЧтениеДанных.ПрочитатьБайт();

	ПотокДанных.Закрыть();

	Если Символ1 = 56 И Символ2 = 66 И Символ3 = 80 И Символ4 = 83  Тогда
		Возврат "psd";
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура УпаковатьКаталогФайловВАрхив(
	  ПутьИмяАрхиваИлиПоток
	, КаталогФайлов
	, МаскаАрхивируемыхФайлов	= Неопределено
	, ВключаяПодкаталоги		= Истина
	, ПарольАрхива				= Неопределено
	, КомментарийАрхива			= Неопределено
	, МетодСжатия				= Неопределено
	, УровеньСжатия				= Неопределено
	, МетодШифрования			= Неопределено
) Экспорт

	МассивФайлов	= НайтиФайлы(КаталогФайлов, МаскаАрхивируемыхФайлов, Ложь);

	Если МетодСжатия = Неопределено Тогда
		МетодСжатия = МетодСжатияZIP.Сжатие;
	КонецЕсли;

	Если УровеньСжатия = Неопределено Тогда
		УровеньСжатия = УровеньСжатияZIP.Максимальный;
	КонецЕсли;

	Если МетодШифрования = Неопределено Тогда
		МетодШифрования = МетодШифрованияZIP.Zip20;
	КонецЕсли;

	//

	Если ВключаяПодкаталоги Тогда
		СохранятьОтносительныеПути	= РежимСохраненияПутейZIP.СохранятьОтносительныеПути;
		ОбрабатыватьРекурсивно		= РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно;
	Иначе
		СохранятьОтносительныеПути	= РежимСохраненияПутейZIP.НеСохранятьПути;
		ОбрабатыватьРекурсивно		= РежимОбработкиПодкаталоговZIP.НеОбрабатывать;
	КонецЕсли;

	ЗаписьZIP = Новый ЗаписьZipФайла(
		  ПутьИмяАрхиваИлиПоток
		, ПарольАрхива
		, КомментарийАрхива
		, МетодСжатия
		, УровеньСжатия
		, МетодШифрования
	);

	Для Каждого Файл Из МассивФайлов Цикл
		ЗаписьZIP.Добавить(Файл.ПолноеИмя, СохранятьОтносительныеПути, ОбрабатыватьРекурсивно);	
	КонецЦикла;

	ЗаписьZIP.Записать();

КонецПроцедуры

// https://infostart.ru/1c/articles/341855/
#Область ЗагрузкаExcel
Функция ПолучитьСписокЛистов_EXCEL1C(Знач ФайлEXCEL)
	Перем ТабличныйДокумент, ОбластьТД;
	Перем СписокЛистов;

	СписокЛистов = Новый СписокЗначений;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		// Выполняется долго на больших файлах.
		ТабличныйДокумент.Прочитать(ФайлEXCEL);
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат Новый СписокЗначений;
	КонецПопытки;
	
	Для Каждого ОбластьТД ИЗ ТабличныйДокумент.Области Цикл
		СписокЛистов.Добавить(ОбластьТД.Имя);
	КонецЦикла;
	
	Возврат СписокЛистов;
	
КонецФункции

// Метод "EXCEL1C" для файлов EXCEL с расширениями: xlsx, xls, ods.
//
// Параметры:
//		ФайлEXCEL - Полное имя файла (путь к файлу с именем файла и расширением).
//      ИмяЛиста - Имя листа файла (платформа 8.3.10).
//		СтрокаЗаголовка (по умолчанию = 1) - Номер строки файла типа MXL, в которой расположены заголовки колонок.
//		Не используется. 
//		В обработке 1-я строка анализируется для сопоставления колонок файла с реквизитами объектов 1С.
//		НачСтрока (по-умолчанию = 0) - Номер начальной строки, начиная с которой считываются данные из файла.
//		КонСтрока (по-умолчанию = 0) - Номер конечной строки, которой заканчиваются считываемые данные из файла.
//		Если НачСтрока=0 и КонСтрока=0, то считывается вся таблица, находящаяся в файле.
//		КолвоСтрокФайла - Количество строк в файле. Возвращается в вызвавшую процедуру.
//
// Возвращаемые значения:
//         ТаблицаРезультат - Результат считывания данных из файла.
//
Функция ЗагрузитьМетодом_EXCEL1C(Знач ФайлEXCEL, Знач ИмяЛиста = "", Знач СтрокаЗаголовка = 1, НачСтрока = 0, КонСтрока = 0, КолвоСтрокФайла = 0) Экспорт
	Перем ТабличныйДокумент, ОбластьФайла, КолВоКолонокФайла, ИмяКолонки, Область, ТекущаяОбласть, нСтрока, нКолонка, НоваяСтрокаТФ, ЗначениеЯчейки;
	Перем ТаблицаРезультат;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		// Выполняется долго на больших файлах.
		ТабличныйДокумент.Прочитать(ФайлEXCEL, СпособЧтенияЗначенийТабличногоДокумента.Значение);    // СпособЧтенияЗначенийТабличногоДокумента - новый параметр платформы 8.3.6. Второе значение "Текст".
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;
	КонецПопытки;
	
	ОбластьФайла = ТабличныйДокумент;
	Если ВерсияПриложенияМеньше8310()
	 ИЛИ НЕ ЗначениеЗаполнено(ИмяЛиста)
	Тогда
		// Платформа 8.3.9 и более ранние (Файл EXCEL как 1 лист).
		КолвоСтрокФайла = ОбластьФайла.ВысотаТаблицы;
		КолВоКолонокФайла = ОбластьФайла.ШиринаТаблицы;
	Иначе
		// Платформа 8.3.10 (Облать = Лист данных).
		ОбластьФайла = ТабличныйДокумент.ПолучитьОбласть(ИмяЛиста);
		КолВоСтрокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
		КолВоКолонокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	КонецЕсли;
	
	// Проверка заполненности листа.
	Если КолвоСтрокФайла = 0 Тогда
		// Завершение работы.
		// Закрытие Объектов.
		ТабличныйДокумент = Неопределено;
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из файла данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла.
	ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолВоКолонокФайла Цикл
		нКолонка = СтрЗаменить(ит, Символы.НПП, "");
		ИмяКолонки = "N" + нКолонка;
		ТаблицаРезультат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	// 1-я строка. Заголовки.
	НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
	НоваяСтрокаТФ.НомерСтроки = 1;
	Для ит=1 ПО КолВоКолонокФайла Цикл
		нКолонка = СтрЗаменить(ит, Символы.НПП, "");
		ИмяКолонки = "N" + нКолонка;
		НоваяСтрокаТФ[ИмяКолонки] = ОбластьФайла.ПолучитьОбласть("R1" + "C"+нКолонка).ТекущаяОбласть.Текст;
		
		// Используется при формировании таблицы на форме обработки.
		ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
		ДлинаСтроки    = СтрДлина(СокрЛП(НоваяСтрокаТФ[ИмяКолонки]));
		ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
	КонецЦикла;
	
	НачСтрока = ?(НачСтрока = 0, 2, НачСтрока);
	КонСтрока = ?(КонСтрока = 0, КолвоСтрокФайла, КонСтрока);
	
	Для нСтрокаТФ = НачСтрока ПО КонСтрока Цикл
		НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
		НоваяСтрокаТФ[0] = нСтрокаТФ;
		нСтрока = СтрЗаменить(нСтрокаТФ, Символы.НПП, "");
		Для нКолонкаТФ = 1 ПО КолВоКолонокФайла Цикл
			нКолонка = СтрЗаменить(нКолонкаТФ, Символы.НПП, "");
			Область = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+нКолонка);
			ТекущаяОбласть = Область.ТекущаяОбласть;
			Попытка
				ЗначениеЯчейки = ТекущаяОбласть.Значение;        // Число, Дата.
			Исключение
				ЗначениеЯчейки = СокрЛП(ТекущаяОбласть.Текст);    // Строка, Булево. (Булево как строка "ИСТИНА"/"ЛОЖЬ")
				Если ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
					ЗначениеЯчейки = ПреобразоватьПростоеЗначениеИзСтрокиВТипизованноеЗначение1С(ЗначениеЯчейки);
					Если ТипЗнч(ЗначениеЯчейки) = Тип("Строка") Тогда
						ЗначениеЯчейки = СокрЛП(ЗначениеЯчейки);
					КонецЕсли;
				Иначе
					ЗначениеЯчейки = Неопределено;
					Если Область.Рисунки.Количество() > 0 Тогда    // Изображение.
						ЗначениеЯчейки = ПолучитьЗначениеЯчейкиОбластиТабличногоДокументаСКартинками(Область, нСтрока, нКолонка, "УИД");
					КонецЕсли;
				КонецЕсли;
			КонецПопытки;
			
			ИмяКолонки = "N" + нКолонка;
			НоваяСтрокаТФ[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			ДлинаСтроки    = СтрДлина(СокрЛП(НоваяСтрокаТФ[ИмяКолонки]));
			ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
		КонецЦикла;
	КонецЦикла;
	
	// Юзабилити. Удалить пустые колонки.
	УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура УдалитьКолонкиСНулевойШириной(ТаблицаРезультат)
	Перем МассивПустыхКолонок;
	
	// Найдем пустые колонки.
	МассивПустыхКолонок = Новый Массив;
	Для Каждого Колонка ИЗ ТаблицаРезультат.Колонки Цикл
		Если Колонка.Ширина = 0 Тогда
			МассивПустыхКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим пустые колонки.
	Для Каждого ПустаяКолонка ИЗ МассивПустыхКолонок Цикл
		ТаблицаРезультат.Колонки.Удалить(ПустаяКолонка);
	КонецЦикла;
	
КонецПроцедуры

// ПРЕОБРАЗОВАНИЕ СТРОКИ К ТИПИЗОВАННОМУ ЗНАЧЕНИЮ 1С.

Функция ПреобразоватьПростоеЗначениеИзСтрокиВТипизованноеЗначение1С(Знач ИсходноеЗначение)
	
	Если НЕ ИсходноеЗначение = "" Тогда
		Если ТолькоЦифрыИЗапятаяВСтроке(ИсходноеЗначение, Истина, Ложь) Тогда
			Попытка
				Возврат Число(ИсходноеЗначение);
			Исключение
				Возврат ИсходноеЗначение
			КонецПопытки;
		Иначе
			Если ВРег(ИсходноеЗначение) = "ИСТИНА" ИЛИ ВРег(ИсходноеЗначение) = ("ИСТИНА"+Символы.ПС) ИЛИ ВРег(ИсходноеЗначение) = "TRUE" ИЛИ ВРег(ИсходноеЗначение) = ("TRUE"+Символы.ПС) Тогда
				Возврат Истина;
			ИначеЕсли ВРег(ИсходноеЗначение) = "ЛОЖЬ" ИЛИ  ВРег(ИсходноеЗначение) = ("ЛОЖЬ"+Символы.ПС) ИЛИ ВРег(ИсходноеЗначение) = "FALSE" ИЛИ ВРег(ИсходноеЗначение) = ("FALSE"+Символы.ПС) Тогда
				Возврат Ложь;
			Иначе
				Возврат ПреобразоватьИзСтрокиВДату(ИсходноеЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИсходноеЗначение
	
КонецФункции

// Проверяет, содержит ли строка только цифры и запятую.
//
// Параметры:
//  СтрокаПроверки          - Строка - Строка для проверки
//  УчитыватьЛидирующиеНули - Булево - Флаг учета лидирующих нулей, если Истина, то ведущие нули пропускаются
//  УчитыватьПробелы        - Булево - Флаг учета пробелов, если Истина, то пробелы при проверке игнорируются
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
Функция ТолькоЦифрыИЗапятаяВСтроке(Знач СтрокаПроверки, Знач УчитыватьЛидирующиеНули = Истина, Знач УчитыватьПробелы = Истина)
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если Сред(СтрокаПроверки, 1, 1) = "-" Тогда
		СтрокаПроверки = Сред(СтрокаПроверки, 2, СтрДлина(СтрокаПроверки));
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		Позиция = 1;
		// Взятие символа за границей строки возвращает пустую строку
		Пока Сред(СтрокаПроверки, Позиция, 1) = "0" Цикл
			Позиция = Позиция + 1;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, Позиция);
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы
	Возврат СтрДлина(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
	СтрокаПроверки, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", ""), ",", "")
	) = 0;
	
КонецФункции

// Преобразование строки вида "01.01.13" или "01.01.2013" к значению типа "дата".
// Возможны друние форматы даты в файле EXCEL.
Функция ПреобразоватьИзСтрокиВДату(Знач СтрокаДаты)
	Перем ScrptCtrl, OutDate;
	
	Попытка
		ScrptCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
		ScrptCtrl.Language="vbscript";
		OutDate = ScrptCtrl.Eval("CDate(""" + СтрокаДаты + """)");
		Возврат OutDate;
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат СтрокаДаты;
	
КонецФункции 

// ПОЛУЧЕНИЕ ЗНАЧЕНИЯ ДЛЯ РЕКВИЗИТА ТИПА "ФАЙЛ КАРТИНКИ".

Функция ПолучитьЗначениеЯчейкиОбластиТабличногоДокументаСКартинками(Знач Область, Знач нСтрока, Знач нКолонка, Знач ПравилоИмяФайлаКартинки = "УИД")
	Перем Рисунок, ит, ИмяФайлаРисунка;
	Перем ЗначениеЯчейки;
	
	ит = 0;
	ЗначениеЯчейки = "";
	Для Каждого Рисунок ИЗ Область.Рисунки Цикл
		ит = ит + 1;
		Если ПравилоИмяФайлаКартинки = "УИД" Тогда
			ИмяФайлаРисунка = КаталогВременныхФайлов() + Новый УникальныйИдентификатор() + ".jpg";
		Иначе
			ИмяФайлаРисунка = КаталогВременныхФайлов() + "С" + нСтрока + "К" + нКолонка + ".jpg";
		КонецЕсли;
		Попытка
			Рисунок.Картинка.Записать(ИмяФайлаРисунка);
			ЗначениеЯчейки = ЗначениеЯчейки + ИмяФайлаРисунка + ?(ит < Область.Рисунки.Количество(), Символы.ПС, "");
		Исключение
			// Поле картинки недоступно для чтения.
		КонецПопытки;
	КонецЦикла;
	
	Возврат ЗначениеЯчейки;
	
КонецФункции

// ОБЩЕГО НАЗНАЧЕНИЯ.

Функция ВерсияБезНомераСборки(Знач Версия)
	Перем Массив, Результат;
	
	Массив = РазложитьСтрокуВМассивПодстрок_Стандартная(Версия, ".");
	
	Если Массив.Количество() < 3 Тогда
		Возврат Версия;
	КонецЕсли;
	
	Результат = "[Редакция].[Подредакция].[Релиз]";
	Результат = СтрЗаменить(Результат, "[Редакция]",    Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	Результат = СтрЗаменить(Результат, "[Релиз]",       Массив[2]);
	
	Возврат Результат;
КонецФункции

Функция ВерсияПриложенияМеньше8310()
	Перем Версия, ВерсияПриложенияБезНомераСборки, СисИнфо;
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПриложенияБезНомераСборки = ВерсияБезНомераСборки(СисИнфо.ВерсияПриложения);
	Версия = СтрЗаменить(ВерсияПриложенияБезНомераСборки, ".", "");
	Версия = Число(Версия);
	Возврат Версия <= 839;
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок_Стандартная(Знач Стр, Разделитель = ",")
	Перем МассивСтрок;
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(СокрЛП(Стр));
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(СокрЛП(Лев(Стр, Поз - 1)));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				Если (СокрЛП(Стр) <> "") Тогда
					МассивСтрок.Добавить(СокрЛП(Стр));
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(СокрЛП(Лев(Стр,Поз - 1)));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции
#КонецОбласти

// https://codernote.ru/1c/vyvod-tablicy-znachenij-v-tablichnyj-dokument/
Функция ПолучитьТабличныйДокументИзТаблицыЗначений(ТаблицаЗначений) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаЗначений);       
	Построитель.Вывести(ТабличныйДокумент);

	Возврат ТабличныйДокумент;

КонецФункции

// принимает элемент формы (динамический список), возвращает таблицу значений
Функция ДинамическийСписокВТаблицуЗначений(ЭлементыДинамическийСписок) Экспорт

	//Получаем схема компановки данных (здесь хранится текст запроса)
	Схема = ЭлементыДинамическийСписок.ПолучитьИсполняемуюСхемуКомпоновкиДанных();

	//Получаем настройки пользователя (отборы, сортировки и т.п.)
	Настройки = ЭлементыДинамическийСписок.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	//Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	//Возвращаем полученную таблицу значений
	Возврат Результат;

КонецФункции

Функция ОбъединитьТаблицыЗначений(Таблица1, Таблица2) Экспорт

	ИмяТаблицы1 = "Таблица1";
	ИмяТаблицы2 = "Таблица2";

	КолонкиТаблицы = Таблица1.Колонки;

	МассивПолей1 = Новый Массив;
	МассивПолей2 = Новый Массив;

	Для Каждого КолонкаТаблицы Из КолонкиТаблицы Цикл

		ИмяКолонки = КолонкаТаблицы.Имя;

		СтрокаПоля1 = Символы.Таб + ИмяТаблицы1 + "." + ИмяКолонки;
		СтрокаПоля2 = Символы.Таб + ИмяТаблицы2 + "." + ИмяКолонки;

		МассивПолей1.Добавить(СтрокаПоля1);
		МассивПолей2.Добавить(СтрокаПоля2);

	КонецЦикла;

	РазделительПолей = "," + Символы.ПС;

	ВыбранныеПоля1 = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивПолей1, РазделительПолей);
	ВыбранныеПоля2 = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивПолей2, РазделительПолей);

	МассивПодЗапроса1 = Новый Массив;
	МассивПодЗапроса1.Добавить("ВЫБРАТЬ");
	МассивПодЗапроса1.Добавить(ВыбранныеПоля1);
	МассивПодЗапроса1.Добавить("ПОМЕСТИТЬ " + ИмяТаблицы1);
	МассивПодЗапроса1.Добавить(" ИЗ &" + ИмяТаблицы1);
	МассивПодЗапроса1.Добавить("КАК " + ИмяТаблицы1);
	МассивПодЗапроса1.Добавить(";");

	МассивПодЗапроса2 = Новый Массив;
	МассивПодЗапроса2.Добавить("ВЫБРАТЬ");
	МассивПодЗапроса2.Добавить(ВыбранныеПоля2);
	МассивПодЗапроса2.Добавить("ПОМЕСТИТЬ " + ИмяТаблицы2);
	МассивПодЗапроса2.Добавить(" ИЗ &" + ИмяТаблицы2);
	МассивПодЗапроса2.Добавить("КАК " + ИмяТаблицы2);
	МассивПодЗапроса2.Добавить(";");

	МассивОбъединения1 = Новый Массив;
	МассивОбъединения1.Добавить("ВЫБРАТЬ");
	МассивОбъединения1.Добавить(ВыбранныеПоля1);
	МассивОбъединения1.Добавить(" ИЗ " + ИмяТаблицы1);

	МассивОбъединения2 = Новый Массив;
	МассивОбъединения2.Добавить("ВЫБРАТЬ");
	МассивОбъединения2.Добавить(ВыбранныеПоля2);
	МассивОбъединения2.Добавить(" ИЗ " + ИмяТаблицы2);

	Разделитель = Символы.ПС;

	ПодЗапрос1 = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивПодЗапроса1, Разделитель);
	ПодЗапрос2 = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивПодЗапроса2, Разделитель);
	Объединение1 = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивОбъединения1, Разделитель);
	Объединение2 = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивОбъединения2, Разделитель);

	МассивЗапроса = Новый Массив;

	МассивЗапроса.Добавить(ПодЗапрос1);
	МассивЗапроса.Добавить("");
	МассивЗапроса.Добавить(ПодЗапрос2);
	МассивЗапроса.Добавить("");

	МассивЗапроса.Добавить(Объединение1);
	МассивЗапроса.Добавить("");
	МассивЗапроса.Добавить("ОБЪЕДИНИТЬ");
	МассивЗапроса.Добавить(Объединение2);
	МассивЗапроса.Добавить("");

	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивЗапроса, Разделитель);

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр(ИмяТаблицы1, Таблица1);
	Запрос.УстановитьПараметр(ИмяТаблицы2, Таблица2);
	РезультатЗапроса  = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции

Функция ПолучитьАдресФайлаТабличногоДокумента(ТабДок, ТипФайла) Экспорт

	ПотокФайла = Новый ПотокВПамяти();
	ТабДок.Записать(ПотокФайла, ТипФайла);
	ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);

	Возврат Адрес;

КонецФункции

Процедура ВыгрузитьДанныеPowerBI() Экспорт
	ОбработкаВыгрузкаДанныхВSQL	= Обработки.ВыгрузкаДанныхВSQL.Создать();
	ОбработкаВыгрузкаДанныхВSQL.ВыгрузитьДанныеPowerBI();	
КонецПроцедуры

Процедура ЗагрузкаАбонентовАбилс() Экспорт
	стрПодключения = ПолучитьСтруктуруПодключения();
	ПолучитьАбонентовАбилс(стрПодключения);
КонецПроцедуры

Процедура ПолучитьАбонентовАбилс(стрПодключения) Экспорт 
	КолвоЗаписейНаСтранице = "1000";
	НомерСтраницы 		   = 0;
	сч            		   = 1;
	Пока Истина Цикл
		
		ТаблицаПользователей = ПолучитьМассивПользователей(НомерСтраницы,стрПодключения,КолвоЗаписейНаСтранице);
	
		Если ТаблицаПользователей.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
	
		Для Каждого стрПлатеж из ТаблицаПользователей Цикл
					
			ID 			= СтрЗаменить(Строка(стрПлатеж.uid),Символы.НПП, "");					
			ППК 		= НайтиППК(ID, стрПодключения);
										
			сч = сч + 1;
			
		КонецЦикла;
		НомерСтраницы = Число(НомерСтраницы) + 1;
	КонецЦикла;
	
КонецПроцедуры



Функция НайтиКонтрагентаПоUID(ID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.ID = &ID";
	
	Запрос.УстановитьПараметр("ID", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоздатьКонтрагента(СтрЗаменить(ID, Символы.НПП, ""));
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НайтиППК(ID, стрПодключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ППК.Ссылка
		|ИЗ
		|	Справочник.ППК КАК ППК
		|ГДЕ
		|	ППК.Наименование = &ППК";
	
	Запрос.УстановитьПараметр("ППК", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Контрагент 	= НайтиКонтрагентаПоUID(ID);

		Возврат СоздатьППК(Контрагент,ID,,,стрПодключения);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции

Функция СоздатьКонтрагента(ID)
	
	стрПодключения = ПолучитьСтруктуруПодключения();
	
	Соединение = Новый HTTPСоединение(стрПодключения.Сервер, стрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("KEY", стрПодключения.Ключ);	
	
	Запрос = Новый HTTPЗапрос("/api.cgi/users/" + ID + "/pi", Заголовки);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		стрJSON = Ответ.ПолучитьТелоКакСтроку();
		стрJSON = СтрЗаменить(стрJSON,"\", "");
		ЧтениеJSON.УстановитьСтроку(стрJSON);
		Попытка
			СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			ЗаписатьОшибкуЖР("Не удалось прочитать JSON, создание контрагента", 1);
			Сообщить(ОписаниеОшибки());
			СтруктураJSON = Неопределено;
			//Возврат Неопределено;
		КонецПопытки;
		ЧтениеJSON.Закрыть();
		Если ТипЗнч(СтруктураJSON) = Тип("Массив") И СтруктураJSON.Количество() = 0 Тогда
			ЗаписатьОшибкуЖР("Не удалось найти контрагента в ABILLS", 2, "ID = " + ID);
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
		Возврат Неопределено;
	КонецЕсли;
	
	КонтрОб 					= Справочники.Контрагенты.СоздатьЭлемент();
	КонтрОб.Родитель 			= Справочники.Контрагенты.НайтиПоНаименованию("Абоненти");
	КонтрОб.Наименование 		= ?(СтруктураJSON = Неопределено,"Проблемный контрагент "+ ID +" ",СтруктураJSON.fio);
	КонтрОб.НаименованиеПолное 	= ?(СтруктураJSON = Неопределено,"Проблемный контрагент "+ ID +" ",СтруктураJSON.fio); 
	КонтрОб.ID 					= ID;
	КонтрОб.Покупатель			= Истина;
	КонтрОб.ЮрФизЛицо			= Перечисления.ЮрФизЛицо.ФизЛицо;
	КонтрОб.КодПоЕДРПОУ         = ?(СтруктураJSON = Неопределено,"Проблемный контрагент "+ ID +" ",СтруктураJSON.edrpou);
	Попытка
		КонтрОб.Записать();
	Исключение
		ЗаписатьОшибкуЖР("Не удалось записать контрагента в базу 1с " + ОписаниеОшибки() , 1 , ID);
		Возврат Неопределено;	
	КонецПопытки;
	
	Договор = ПолучитьДоговор(КонтрОб.Ссылка);
	Если Договор = Неопределено Тогда
		Договор = СоздатьДоговор(КонтрОб.Ссылка);
	КонецЕсли;
	
	Если Договор = Неопределено Тогда
		ЗаписатьОшибкуЖР("Не удалось записать договор контрагента в базу 1с " + ОписаниеОшибки() , 1 , ID);
		Возврат КонтрОб.Ссылка;
	КонецЕсли;
		
	Попытка
		КонтрОб.Записать();
	Исключение
		ЗаписатьОшибкуЖР("Не удалось записать контрагента в базу 1с " + ОписаниеОшибки() , 1 , ID);
	КонецПопытки;
	
	Возврат КонтрОб.Ссылка;
	
КонецФункции

Функция ПолучитьДоговор(Контрагент) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";
	
	//Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоздатьДоговор(Контрагент);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
КонецФункции


Функция СоздатьДоговор(Контрагент)
	
	ДоговорОб 						= Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	ДоговорОб.ВидДоговора 			= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ДоговорОб.Наименование 			= Контрагент.ID;
	ДоговорОб.Номер 				= Контрагент.ID;
	ДоговорОб.Владелец 				= Контрагент;
	ДоговорОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	ДоговорОб.ВалютаВзаиморасчетов 	= глЗначениеПеременной("ВалютаРегламентированногоУчета");
	ДоговорОб.Организация 			= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9"));
	ДоговорОб.ВидУсловийДоговора 	= Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	ДоговорОб.ТипЦен 				= Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	ДоговорОб.ВыводитьИнформациюОСделкеПриПечатиДокументов = Истина;
	ДоговорОб.УстановитьСхемуНалогообложения();
	
	ДоговорОб.ВидДоговораПоГК 	= Справочники.ВидыДоговоровПоГК.Поставка;
	ДоговорОб.ФормаРасчетов 	= "Оплата з поточного рахунку";
	//Контрагент = Справочники.Контрагенты.СоздатьЭлемент().Ссылка;
	
	Если не Контрагент.Покупатель Тогда 
		КонтрагентОб = Контрагент.ПолучитьОбъект();
		КонтрагентОб.Покупатель = Истина;
		КонтрагентОб.Записать();
	КонецЕсли;
	
	
	Попытка
		ДоговорОб.Записать();
		Возврат ДоговорОб.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

Функция СоздатьППК(Контрагент, ID, Договор = Неопределено, Адрес = "", СтрПодключения)
		
	СоединениеППК = Новый HTTPСоединение(СтрПодключения.Сервер, СтрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("KEY", стрПодключения.Ключ);	
	
	Запрос = Новый HTTPЗапрос("/api.cgi/users/" + ID, Заголовки);
	
	Ответ = СоединениеППК.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураJSONППК = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		Если ТипЗнч(СтруктураJSONППК) = Тип("Массив") И СтруктураJSONППК.Количество() = 0 Тогда
			ЗаписатьОшибкуЖР("Не удалось найти контрагента в ABILLS", 2, "ID = " + ID);
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ЗаписатьОшибкуЖР("Не удалось подключиться к users/ID ; код ошибки " + Ответ.КодСостояния , 1 ,  ID = "");
		Возврат Неопределено;
	КонецЕсли;
	
	ППКОБ 					= Справочники.ППК.СоздатьЭлемент();
	ППКОБ.Код 				= ID;
	ППКОБ.Наименование 		= ID;
	ППКОБ.СпособОтправки 	= Перечисления.vr_СпособОтправки.Почта;
	ППКОБ.Контрагент 		= Контрагент;
	ППКОБ.Владелец 			= ?(Договор = Неопределено, ПолучитьДоговор(Контрагент), Договор);
	ППКОБ.UID_Билинг 		= ID;
	ППКОБ.billId 			= СтрЗаменить(Строка(СтруктураJSONППК.billId), Символы.НПП, "");
	ППКОБ.Адрес 			= Адрес;
	ППКОБ.Тариф 			= Справочники.Тарифы.НайтиПоКоду("000000001");
	ППКОБ.Активный			= Истина;
	
	Попытка
		ППКОБ.Записать();
		Возврат ППКОБ.Ссылка;
	Исключение
		ЗаписатьОшибкуЖР("Не удалось записать ППК ", 1 , ID + " ошибка " +ОписаниеОшибки());
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьСтруктуруПодключения() Экспорт 
	
	стрПодключения = Новый Структура;
	стрПодключения.Вставить("Ключ");
	стрПодключения.Вставить("Сервер");
	стрПодключения.Вставить("Порт");
	стрПодключения.Вставить("Настройка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.АдресRestAPI КАК Сервер,
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.APIKey КАК Ключ,
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.ПортRestAPI КАК Порт,
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка КАК Настройка
		|ИЗ
		|	Справочник.НастройкиПодключенияКБилингу.ДанныеЭквайрера КАК НастройкиПодключенияКБилингуДанныеЭквайрера
		|ГДЕ
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", "i.novash");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стрПодключения, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат стрПодключения;
	
КонецФункции

Функция ПолучитьДоговорПоОрганизации(Организация,НомерППК,Контрагент)
	

	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДоговорыКонтрагентов.Ссылка
	                |ИЗ
	                |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                |ГДЕ
	                |	ДоговорыКонтрагентов.Владелец = &Владелец
	                |	И ДоговорыКонтрагентов.Организация = &Организация
	                |	И ДоговорыКонтрагентов.Наименование = &Наименование
	                |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)" ;
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Наименование",НомерППК);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Ссылка;
	Иначе
		Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Договор.Наименование 		  = НомерППК;
		Договор.ВидДоговора			  = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		Договор.Организация			  = Организация;
		Договор.Владелец			  = Контрагент;
		Договор.Номер				  = НомерППК;
		Договор.ВалютаВзаиморасчетов  = Константы.ВалютаРегламентированногоУчета.Получить();
		Договор.Записать();
		Договор.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
		Возврат Договор.Ссылка;
		
		
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции


Функция ПолучитьМассивПользователей(НомерСтраницы,стрПодключения,КолвоЗаписейНаСтранице)
	
		Соединение = Новый HTTPСоединение(стрПодключения.Сервер, стрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("KEY", стрПодключения.Ключ);	
			
		
		НомерСтраницы 			= СтрЗаменить(Строка(НомерСтраницы), Символы.НПП, "");

		
		Запрос = Новый HTTPЗапрос("/api.cgi/users/all?"+"pageRows=" + КолвоЗаписейНаСтранице+"&pg=" + НомерСтраницы, Заголовки);
		
		Ответ = Соединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON 	= Новый ЧтениеJSON;
			стрJSON 	= Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON.УстановитьСтроку(стрJSON);
			Попытка
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
			Исключение
				ЗаписатьОшибкуЖР("Не прочитать json", 1, стрJSON);
				Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
				ЧтениеJSON.Закрыть();
			КонецПопытки;
			ЧтениеJSON.Закрыть();
			Возврат СтруктураJSON; 
		Иначе
			ЗаписатьОшибкуЖР("Не удалось подключиться к методу users", 1);
			Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
	
	
КонецФункции

Процедура ЗаписатьОшибкуЖР(Ошибка, Статус, ДопИнфа = Неопределено) Экспорт
	
	Если ДопИнфа <> Неопределено Тогда
		Ошибка = Ошибка + "----" + ДопИнфа
	КонецЕсли;
	
	Если Статус = 1 Тогда
		УровеньЖР = УровеньЖурналаРегистрации.Ошибка; 
	Иначе
		УровеньЖР = УровеньЖурналаРегистрации.Предупреждение;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Получение пользователей ABILLS", УровеньЖР,,, Ошибка);
	
КонецПроцедуры














