// Обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)

	Если Не ОбменДанными.Загрузка Тогда
		Если НЕ ЗначениеЗаполнено(Эквайрер) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "Эквайрер");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "ДоговорВзаиморасчетов");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;

		Заголовок = НСтр("ru='Справочник ""Договоры эквайринга"": ';uk='Довідник ""Договори еквайрингу"": '");

		СтруктураОбязательныхПолей = Новый Структура("ВидОплаты");
		ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ТарифыЗаРасчетноеОбслуживание", СтруктураОбязательныхПолей, Отказ, Заголовок);

		ПредставлениеТабличнойЧасти = Метаданные().ТабличныеЧасти["ТарифыЗаРасчетноеОбслуживание"].Представление();

		СтрокаОкончанияСообщенияОбОшибке = НСтр("ru='Выбран вид оплаты неверного типа!';uk='Обраний вид оплати неправильного типу!'");

		Для Каждого СтрокаТарифа Из ТарифыЗаРасчетноеОбслуживание Цикл
			Если СтрокаТарифа.ВидОплаты.ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
				СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(СтрокаТарифа.НомерСтроки)
				   + НСтр("ru='"" табличной части ""';uk='"" табличної частини ""'") + ПредставлениеТабличнойЧасти + """: ";
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаОкончанияСообщенияОбОшибке,
				                    Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

