
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыСведений.БюджетПоСтатьям.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	БДДСДляРегистра = БДДС.Выгрузить();
	БДДСДляРегистра.Свернуть("СтатьяДДС,Проект,VatNoVat,Период","Сумма");
	
	Для Каждого стр ИЗ БДДСДляРегистра Цикл 
	
		НоваяЗапись = НаборЗаписей.Добавить();
	    НоваяЗапись.Регистратор = Ссылка;
	    НоваяЗапись.Период      = Стр.Период;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Подразделение = ЦФО;
		НоваяЗапись.Статья      = стр.СтатьяДДС;
		НоваяЗапись.Проект      = стр.Проект;
		НоваяЗапись.Сумма       = стр.Сумма;
		НоваяЗапись.VatNoVat    = стр.VatNoVat;
		//НоваяЗапись.Комментарий = стр.Комментарий;
     
	КонецЦикла;
	
    НаборЗаписей.Записать(); 	
	
	Движения.ПланБюджетированияПоСтатьям.Записывать = Истина;
	Движения.ПланБюджетированияПоСтатьям.Очистить();
	
	Для Каждого стр Из БДДСДляРегистра Цикл
		
		НоваяЗапись = Движения.ПланБюджетированияПоСтатьям.Добавить();
	    НоваяЗапись.Регистратор = Ссылка;
	    НоваяЗапись.Период = Стр.Период;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Подразделение = ЦФО;
		НоваяЗапись.Статья = стр.СтатьяДДС;
		НоваяЗапись.Проект = стр.Проект;
		НоваяЗапись.Сумма = стр.Сумма;
		НоваяЗапись.VatNoVat = стр.VatNoVat;
		//НоваяЗапись.Комментарий = стр.Комментарий;
		
	КонецЦикла;

КонецПроцедуры
