
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура СоздатьНачисления(Организация, флОбменДанным = Ложь) Экспорт
	
	Организация = Справочники.Организации.НайтиПоНаименованию("VechirTelecom (упр.)");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводноеНачислениетчДанные.ППК КАК ППК,
		|	СводноеНачислениетчДанные.ППК.Владелец КАК ДоговорКонтрагента,
		|	СводноеНачислениетчДанные.ППК.Контрагент КАК Контрагент,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК Сумма,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК Цена,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК СуммаПлатежа,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК СуммаВзаиморасчетов,
		|	СводноеНачислениетчДанные.Ссылка.Организация КАК Организация,
		|	&Валюта КАК ВалютаДокумента,
		|	1 КАК Количество,
		|	&СтавкаНДС КАК СтавкаНДС,
		|	&ВидОперации КАК ВидОперации,
		|	&ВидПередачи,
		|	&КурсВзаиморасчетов,
		|	&КратностьВзаиморасчетов,
		|	&СчетУчетаРасчетовСКонтрагентом,
		|	&СчетРасчетовНдс КАК СчетУчетаНДС,
		|	&СчетУчетаНДСПодтвержденный,
		|	&СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом1,
		|	&СчетУчетаРасчетовПоАвансам,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.СхемаРеализации,
		|	&Склад,
		|	&Организация КАК Организация1,
		|	СводноеНачислениетчДанные.ДатаПлатежки,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Номенклатура КАК Номенклатура,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Номенклатура КАК Содержание,
		|	СводноеНачислениетчДанные.ID
		|ИЗ
		|	Документ.СводноеНачисление.тчДанные КАК СводноеНачислениетчДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиПодключенияКБилингу.СоответвиеМетодовИНоменклатуры КАК НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры
		|		ПО СводноеНачислениетчДанные.Метод = НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Метод
		|ГДЕ
		|	СводноеНачислениетчДанные.Ссылка = &Ссылка
		|	И СводноеНачислениетчДанные.ДокументОплаты = ЗНАЧЕНИЕ(Документ.РеализациятоваровУслуг.ПустаяСсылка)
		|	И НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Ссылка.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", "i.novash");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Валюта", мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия);
	Запрос.УстановитьПараметр("ВидПередачи", Перечисления.ВидыПередачиТоваров.СоСклада);
	Запрос.УстановитьПараметр("КурсВзаиморасчетов", 1);
	Запрос.УстановитьПараметр("КратностьВзаиморасчетов", 1);
	Запрос.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте);//333
	Запрос.УстановитьПараметр("СчетРасчетовНдс", ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные);//6432
	Запрос.УстановитьПараметр("СчетУчетаНДСПодтвержденный", ПланыСчетов.Хозрасчетный.НалоговыеОбязательства);//6431
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ПланыСчетов.Хозрасчетный.ВзаиморасчетыСАбонентами);//3611
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПоАвансам", ПланыСчетов.Хозрасчетный.ВзаиморасчетыСАбонентами);//361
	Запрос.УстановитьПараметр("СхемаРеализации", Справочники.СхемыРеализации.Услуги);
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	сч = 0;
	счДок = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		сч = сч + 1;
		
		ДокОб 								= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокОб.ОбменДанными.Загрузка			= флОбменДанным;
		ДокОб.Дата 							= Дата;
		ДокОб.Ответственный 				= Ответственный;
		ДокОб.ДокументОснование				= Ссылка;
		ДокОб.ОтражатьВУправленческомУчете 	= Истина;
		ДокОб.ОтражатьВБухгалтерскомУчете 	= Истина;
		
		ДокОб.Комментарий = "#Создано автоматический";
		
		ЗаполнитьЗначенияСвойств(ДокОб, ВыборкаДетальныеЗаписи);
		
		НовСтр = ДокОб.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Если счДок >100 Тогда
				Записать();
				счДок = 0;
			КонецЕсли;
			счДок = счДок+1;
		Исключение
			Сообщить(ОписаниеОшибки());
			сч = сч -1;
			Продолжить;
		КонецПопытки;
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("ППК", ВыборкаДетальныеЗаписи.ППК);
		СтрПоиска.Вставить("СуммаОплаты", ВыборкаДетальныеЗаписи.СуммаПлатежа);
		СтрПоиска.Вставить("ID", ВыборкаДетальныеЗаписи.ID);
		
		
		НайденныеСтроки = тчДанные.НайтиСтроки(СтрПоиска);
		НайденныеСтроки[0].ДокументОплаты = ДокОб.Ссылка;
		
	КонецЦикла;
		
	Записать();
	
	Сообщить(НСТР("ru='Создано " + сч+ " " + "документов'; uk = 'Створено " + сч+ " " + "докумнтів""'"));
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета")

