////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит структуру многостраничных разделов.
Перем мСтруктураМногостраничныхРазделов Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов.
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);

ОписаниеТиповСтрока254 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока254);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);

// Таблица значений хранит данные дополнительной страницы многостраничных разделов отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя дополнительной страницы (отображается в списке дополнительных страниц);
//    - булево, признак текущей страницы (отображенной в поле табличного документа);
//    - структура, содержащая имена и значения редактируемых ячеек дополнительной страницы.
//
ТаблицаСтраницыРаздела            = Новый ТаблицаЗначений;
ТаблицаСтраницыРаздела.Колонки.Добавить("Представление",              ОписаниеТиповСтрока254, НСтр("ru='Наименование';uk='Найменування'"));
ТаблицаСтраницыРаздела.Колонки.Добавить("АктивнаяСтраница",           ОписаниеТиповБулево);
ТаблицаСтраницыРаздела.Колонки.Добавить("Данные");

мСтруктураВариантыЗаполнения      = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Кв4";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Приложение 5 к Порядку заполнения и подачи налоговой декларации по налогу на добавленную стоимость';uk='Додаток 5 до Порядку заповнення й подачі податкової декларації по податку на додану вартість'");
НоваяФорма.ДатаНачалоДействия = '19990331';
НоваяФорма.ДатаКонецДействия  = '20110228';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв4";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Форма уточняющего расчета налоговых обязательств из НДС в связи с исправлением самостоятельно обнаруженной ошибки, утвержденная указом ГНА Украины №41 от 25.01.2011';uk='Форма уточнюючого розрахунку податкових зобов''язань з ПДВ у зв''язку з виправленням самостійно виявлених помилок, затверджена наказом ДПА України №41 від 25.01.2011'");
НоваяФорма.ДатаНачалоДействия = '20110301';
НоваяФорма.ДатаКонецДействия  = '20111231';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Форма уточняющего расчета налоговых обязательств из НДС в связи с исправлением самостоятельно обнаруженной ошибки, утвержденная указом ГНА Украины №41 от 25.01.2011';uk='Форма уточнюючого розрахунку податкових зобов''язань з ПДВ у зв''язку з виправленням самостійно виявлених помилок, затверджена наказом ДПА України №41 від 25.01.2011'");
НоваяФорма.ДатаНачалоДействия = '20110301';
НоваяФорма.ДатаКонецДействия  = '20111231';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Министерства финансов Украины 25.11.11  № 1492'; uk = 'Затверджено Наказом Міністерства фінансів України 25.11.2011 p. № 1492'");
НоваяФорма.ДатаНачалоДействия = '20120101';
НоваяФорма.ДатаКонецДействия  = '2013-02-28';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 25.11.11  № 1492 в редакции Приказа Минфина Украины от 17.12.2012 N 1342'; uk = 'Затверджено Наказом Мінфіна України від 25.11.2011 № 1492 у редакції Наказу Мінфіну  України від 17.12.2012 N 1342'");
НоваяФорма.ДатаНачалоДействия = '2013-03-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Министерства доходов и сборов Украины от 13.11.13  № 678'; uk = 'Затверджено Наказом Міністерства доходів і сборів України від 13.11.2011 № 678'");
НоваяФорма.ДатаНачалоДействия = '2014-01-01';
НоваяФорма.ДатаКонецДействия  = '2014-11-30';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Мес12";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 23.09.2014 № 966'; uk = 'Затверджено Наказом Міністерства фінансів від 23.09.2014 № 966'");
НоваяФорма.ДатаНачалоДействия = '2014-12-01';
НоваяФорма.ДатаКонецДействия  = '2015-01-31';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 23.09.2014 № 966 (в редакции Приказа от 23.01.2015 г. N 13)'; uk = 'Затверджено Наказом Міністерства фінансів від 23.09.2014 № 966 (у редакції Наказу від 23.01.2015 р. N 13'");
НоваяФорма.ДатаНачалоДействия = '2015-02-01';
НоваяФорма.ДатаКонецДействия  = '2015-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 28.01.2016 № 21'; uk = 'Затверджено Наказом Міністерства фінансів від 28.01.2016 № 21'");
НоваяФорма.ДатаНачалоДействия = '2016-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-07-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Мес8";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 28.01.2016 № 21 (с изменениями внесенными Приказом Минфина от 25.05.2016 № 503)'; uk = 'Затверджено Наказом Міністерства фінансів від 28.01.2016 № 21 (зі змінами,  що внесені Наказом Мінфіна від 25.05.2016 № 503)'");
НоваяФорма.ДатаНачалоДействия = '2016-08-01';
НоваяФорма.ДатаКонецДействия  = '2017-02-28';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 28.01.2016 № 21 (в редакции Приказа Минфина от 23.02.2017 № 276)'; uk = 'Затверджено Наказом Міністерства фінансів від 28.01.2016 № 21 (в редакції Наказу Мінфіна від 23.02.2017 № 276)'");
НоваяФорма.ДатаНачалоДействия = '2017-03-01';
НоваяФорма.ДатаКонецДействия  = '2018-05-31';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 28.01.2016 № 21 (в редакции Приказа Минфина от 23.02.2017 № 276, с изменениями от 23.03.2018 согласно Приказа Минфина № 381)'; uk = 'Затверджено Наказом Міністерства фінансів від 28.01.2016 № 21 (в редакції Наказу Мінфіна від 23.02.2017 № 276, зі змінами від 23.03.2018 згідно Наказу Мінфіна № 381)'");
НоваяФорма.ДатаНачалоДействия = '2018-06-01';
НоваяФорма.ДатаКонецДействия  = '2019-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2020";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 28.01.2016 № 21 (в редакции Приказа от 23.02.2017 № 276, с изменениями от 23.03.2018 №381 и от 20.11.2019 №488)'; uk = 'Затверджено Наказом Міністерства фінансів від 28.01.2016 № 21 (в редакції Наказу від 23.02.2017 № 276, зі змінами від 23.03.2018 №381 та від 20.11.2019 №488)'");
НоваяФорма.ДатаНачалоДействия = '2020-01-01';
НоваяФорма.ДатаКонецДействия  = '2021-02-28';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2021";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена Приказом Минфина Украины от 28.01.2016 № 21 (в редакции Приказа Минфина от 01.03.2021 № 131)'; uk = 'Затверджено Наказом Міністерства фінансів від 28.01.2016 № 21 (в редакції Наказу Мінфіна від 01.03.2021 № 131)'");
НоваяФорма.ДатаНачалоДействия = '2021-03-01';
НоваяФорма.ДатаКонецДействия  = Неопределено;
