////////////////////////////////////////////////////////////////////////////////
//СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//
# Если Клиент Тогда
// Функция управляет выпадающим списком полей дат
//
Функция ВыборДатыВремениИзВыпадающегоСписка(Элемент, СтандартнаяОбработка, Форма) Экспорт

	СтандартнаяОбработка = Ложь;

	СписокВремен = Новый СписокЗначений;

	Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		Элемент.Значение = НачалоМинуты(ТекущаяДата());
	КонецЕсли;

	Если ДеньГода(Элемент.Значение) = ДеньГода(ТекущаяДата()) Тогда

		Если Минута(ТекущаяДата()) > 30 Тогда
			ВремяСписка = НачалоМинуты(КонецЧаса(ТекущаяДата()) + 60);
		Иначе
			ВремяСписка = НачалоМинуты(КонецЧаса(ТекущаяДата()) - 29*60);
		КонецЕсли;

	Иначе
		ВремяСписка = НачалоДня(Элемент.Значение);
	КонецЕсли;

	Пока НачалоЧаса(ВремяСписка) < КонецДня(Элемент.Значение) Цикл

		СписокВремен.Добавить(ВремяСписка, Формат(ВремяСписка,"ДФ='дд.ММ.гггг ЧЧ:мм'"));
		ВремяСписка = ВремяСписка + 30*60;

	КонецЦикла;

	ВыбранноеВремя = Форма.ВыбратьИзСписка(СписокВремен, Элемент);

	Возврат ВыбранноеВремя;

КонецФункции // ВыборДатыВремениИзВыпадающегоСписка()
# КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА
//

// Процедура снимает флаг оповещения перед записью завершенной задачи
// или задачи, в которой дата оповещения не определена.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СрокОповещения)
		Или  Выполнена Тогда
		Оповещение = ЛОЖЬ;
	КонецЕсли;
	
	//Дандали В. 15.04.2026 +
	Если Выполнена И НЕ ЗначениеЗаполнено(ДатаИсполнения) Тогда
		ДатаИсполнения = ТекущаяДата();
	КонецЕсли;
	//Дандали В. 15.04.2026 -
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ПриВыполнении".
//
Процедура ПриВыполнении(Отказ)

	ДатаИсполнения = ТекущаяДата();
	Исполнитель    = ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь");

КонецПроцедуры // ПриВыполнении()

// Процедура - обработчик события "ПередВыполнением".
//
Процедура ПередВыполнением(Отказ)

	РаботаСБизнесПроцессами.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);

КонецПроцедуры // ПередВыполнением()

Функция ПолучитьПоследнийНомер() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗадачиПользователя.НомерЗадачи
		|ИЗ
		|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
		|ГДЕ
		|	КОНЕЦПЕРИОДА(ЗадачиПользователя.Дата, ГОД) = &Дата
		|	И ЗадачиПользователя.НомерЗадачи <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачиПользователя.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", КонецГода(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Число(ВыборкаДетальныеЗаписи.НомерЗадачи);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции