
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Элемент справочника ""Банки"" %1 не записан!';uk='Елемент довідника ""Банки"" %1 не записаний!'"), Наименование);
        
		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда

			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В составе Корр.счета банка должны быть только цифры.';uk='У складі Корр.рахунку банку повинні бути тільки цифри.'"),, СтрокаОшибки);
			Отказ = Истина;

		КонецЕсли;

		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда

			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В составе МФО банка должны быть только цифры.';uk='У складі МФО банку повинні бути тільки цифри.'"),, СтрокаОшибки);
			Отказ = Истина;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

