//выполнить запрос и возвратить RecordSet - COMОбъект("ADODB.Recordset")
//Соединение - ComОбъект("ADODB.Connection")
Функция ВыполнитьSQLЗапрос(ТекстЗапрос, Соединение = Неопределено) Экспорт
	
	СоединениеСБазой = ?(Соединение = Неопределено, ПолучитьСоединениеСБазойSQL(), Соединение);
    ЗапросАДО=Новый COMОбъект("ADODB.Command");
    ЗапросАДО.ActiveConnection=СоединениеСБазой;
	
	//добавить новые записи
	ЗапросАДО.CommandText = ТекстЗапрос;
	
	RecordSet = Неопределено;
	
	Попытка
		RecordSet = ЗапросАДО.Execute();
	Исключение
		Ошибка = ОписаниеОшибки();
		#Если Клиент Тогда
		Сообщить(Ошибка, СтатусСообщения.Внимание);
		#КонецЕсли
	    ЗаписьЖурналаРегистрации("РаботаСSQL.ВыполнитьSQLЗапрос", УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;	
	
	Если Соединение = Неопределено Тогда
        ЗакрытьСоединениеСБазой(СоединениеСБазой);
	КонецЕсли;
	
	Возврат RecordSet;
	
КонецФункции

//соединиться с базой по строке соединения
//возвращает ComОбъект("ADODB.Connection")
Функция ПолучитьСоединениеСБазойSQL() Экспорт
    extConnSQL = Новый ComОбъект("ADODB.Connection");
    extConnSQL.ConnectionString = СтрокаСоединения;
	
	Попытка
		extConnSQL.Open();
	Исключение
		Ошибка = ОписаниеОшибки();
		#Если Клиент Тогда
	    Сообщить(Ошибка);
		#КонецЕсли
		ЗаписьЖурналаРегистрации("РаботаСSQL.ПолучитьСоединениеСБазойSQL", УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
    
    Возврат extConnSQL;
КонецФункции

//закрыть соединение с базой 
Процедура ЗакрытьСоединениеСБазой(Соединение) Экспорт 
	
	СоединениеСБазой = ?(Соединение = Неопределено, ADOСоединение, Соединение);
	
	Попытка
		СоединениеСБазой.close();	
	Исключение
		//ничего не надо сообщать //ОписаниеОшибки()
	КонецПопытки;
	
	СоединениеСБазой = Неопределено;
КонецПроцедуры

//прочитать набор данных из таблицы в базе SQL
//Таблица - Имя таблицы в БД
//СтруктураДанных - Структура вида (Имя колонки в базе, имя колонки в 1с), пропустить для чтения всех
//Соединение - ComОбъект("ADODB.Connection"), необязательно
//Условие - Строка с доп. условием вида "where ...
Функция ПрочитатьДанныеSQL(Таблица, СтруктураДанных = Неопределено, Соединение = Неопределено, Условие = Неопределено) Экспорт 
	
	Результат = Новый ТаблицаЗначений;
	ПоВсемПолям = НЕ ЗначениеЗаполнено(СтруктураДанных) ИЛИ ТипЗнч(СтруктураДанных) <> Тип("Структура");
	
	Если Не ЗначениеЗаполнено(Таблица) Тогда
		Возврат Результат;
	КонецЕсли;
	
	//заполнение запроса
	ТекстЗапроса  = "select ";
	
	Если ПоВсемПолям Тогда
		//запрос по всем полям
		ТекстЗапроса = ТекстЗапроса + "* from " + Таблица;
	Иначе
		Первый = Истина;
		Для каждого КИЗ Из СтруктураДанных Цикл
			ТекстЗапроса = ТекстЗапроса + ?(Первый, "", ",") + КИЗ.Ключ;
			Первый = Ложь;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + " from " + Таблица;
	КонецЕсли;
	
	//условие
	ТекстЗапроса = ТекстЗапроса + " " + Условие;
	
	//выполнение запроса
	RecordSet = ВыполнитьSQLЗапрос(ТекстЗапроса, Соединение);
	Попытка
	 
		Если RecordSet = Неопределено ИЛИ RecordSet.Fields.Count = 0 Тогда
			Возврат Результат;	
		КонецЕсли;
		
		//чтение в рез таблицу
		
		КоличествоПолейТаблицы = RecordSet.fields.Count;
		
		//заполним колонки
		Для сч = 0 По КоличествоПолейТаблицы - 1 Цикл
			ИмяКолонкиВБД = RecordSet.fields.item(сч).name;
			
			Если ПоВсемПолям Тогда
				Результат.Колонки.Добавить(ИмяКолонкиВБД);	
			Иначе
				ИмяКолонкиВ1С = Неопределено;
				Если СтруктураДанных.Свойство(ИмяКолонкиВБД, ИмяКолонкиВ1С) Тогда
					Результат.Колонки.Добавить(ИмяКолонкиВ1С);	
				КонецЕсли;	
			КонецЕсли; 
			 
	    КонецЦикла;

		RecordSet.MoveFirst();
		
		Пока RecordSet.EOF() = 0 Цикл
			НоваяСтрока = Результат.Добавить();
			
			//перебор полей RecordSet и запись в соответствующие колонки резульирующей тз
			Для НомерКолонки = 0 По КоличествоПолейТаблицы - 1 Цикл
				ИмяКолонкиВ1С = Неопределено;
				ИмяКолонкиВБД = RecordSet.Fields.Item(НомерКолонки).Name;
				Если ПоВсемПолям Тогда
					НоваяСтрока[ИмяКолонкиВБД] = RecordSet.Fields(ИмяКолонкиВБД).Value;
				Иначе
					Если СтруктураДанных.Свойство(ИмяКолонкиВБД, ИмяКолонкиВ1С) Тогда
						НоваяСтрока[ИмяКолонкиВ1С] = RecordSet.Fields(ИмяКолонкиВБД).Value;
					КонецЕсли;	
				КонецЕсли; 
			КонецЦикла;
			RecordSet.MoveNext();  
		КонецЦикла;
		RecordSet.Close();
	Исключение
		Ошибка = ОписаниеОшибки();
		#Если Клиент Тогда
	    Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЗаписьЖурналаРегистрации("РаботаСSQL.ПрочитатьДанныеSQL", УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//записать данные из таблицы значенией в БД
//Таблица - Имя таблицы в БД
//ТаблицаДанных - ТаблицаЗначений с данными
//СтруктураДанных - Структура вида (Имя колонки в базе, имя колонки в 1с), если пропущено,
//то имена колонок в ТаблицаДанных и в таблице БД должны совпадать
//Соединение - ComОбъект("ADODB.Connection"), необязательно
Функция ЗаписатьДанныеSQL(Таблица, ТаблицаДанных, СтруктураДанных = Неопределено, Соединение = Неопределено) Экспорт

	БезПеревода = НЕ ЗначениеЗаполнено(СтруктураДанных) ИЛИ ТипЗнч(СтруктураДанных) <> Тип("Структура");
	
	Если Не ЗначениеЗаполнено(Таблица) ИЛИ Не ЗначениеЗаполнено(ТаблицаДанных) ИЛИ ТаблицаДанных.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//транспонирование СтруктураДанных
	Если НЕ БезПеревода Тогда
		СтруктураПолей = Новый Структура;
		Для каждого КиЗ Из СтруктураДанных Цикл
			СтруктураПолей.Вставить(КиЗ.Значение, КиЗ.Ключ);		
		КонецЦикла; 
	КонецЕсли;
	
	//заполнение запроса
	ТекстЗапроса = "";
	
	//собрать строку полей
	СтрокаПолей = "";
	Первый = Истина;
	Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
		//если с переводом
		Если БезПеревода Тогда
			СтрокаПолей = СтрокаПолей + ?(Первый, "", ",") + Колонка.Имя;
			Первый = Ложь;
		Иначе
			ИмяПолявБД = Неопределено;
			Если СтруктураПолей.Свойство(Колонка.Имя, ИмяПолявБД) Тогда
				СтрокаПолей = СтрокаПолей + ?(Первый, "", ",") + ИмяПолявБД;
				Первый = Ложь;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого стр Из ТаблицаДанных Цикл
		
		//собрать строку значений
		Первый = Истина;
		СтрокаЗначений = "";
		Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
			Значение = стр[Колонка.Имя];
			ТипЗначения = ТипЗнч(Значение);
			
			Если ТипЗначения = Тип("Число") Тогда
				Значение = Формат(Значение, "ЧРД=.;ЧН=; ЧГ=0");
			ИначеЕсли ТипЗначения = Тип("Дата") Тогда 
				Значение = "'" + Формат(Значение, "ДЛФ=DT") + "'";
			ИначеЕсли ТипЗначения = Тип("Булево") Тогда
				Значение = Число(Значение);
			Иначе
				//все в строку, заэкранировать апостроф
				Значение = "'" + СтрЗаменить("" + Значение, "'","''") + "'";
			КонецЕсли;
			
			Если БезПеревода Тогда
				СтрокаЗначений = СтрокаЗначений + ?(Первый, "", ",") + Значение;
				Первый = Ложь;
			Иначе
				Если СтруктураПолей.Свойство(Колонка.Имя) Тогда
					СтрокаЗначений = СтрокаЗначений + ?(Первый, "", ",") + Значение;
					Первый = Ложь;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "INSERT INTO " + Таблица + " (" + СтрокаПолей + ") VALUES(" + СтрокаЗначений + ");" + Символы.ПС;	
	КонецЦикла;
	
	//выполнение запроса
	RecordSet = ВыполнитьSQLЗапрос(ТекстЗапроса, Соединение);
	
	Если RecordSet <> Неопределено Тогда
		#Если Клиент Тогда
		Сообщить("Данные успешно записаны.");
		#КонецЕсли
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции

//удаляет строки из таблицы в БД
//Таблица - Имя таблицы в БД
//Соединение - ComОбъект("ADODB.Connection"), необязательно
//Условие - Строка с доп. условием вида "where ... , Если пустая, то удаляются ВСЕ СТРОКИ В ТАБЛИЦЕ!!!!!!!
Функция УдалитьСтрокиSQL(Таблица, Соединение = Неопределено, Условие = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Таблица) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//заполнение запроса
	ТекстЗапроса  = "delete from " + Таблица + " " + Условие;
	
	//выполнение запроса
	RecordSet = ВыполнитьSQLЗапрос(ТекстЗапроса, Соединение);
	
	Если RecordSet <> Неопределено Тогда
		#Если Клиент Тогда
		Сообщить("Данные успешно удалены.");
		#КонецЕсли
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 

КонецФункции
 
//дозаполняет ТЗ колонками с гуидами, имена колонок в списке гуидов
Процедура ДополнитьГуидами(ТаблицаДанных, СписокГуидов) Экспорт
	//добавить колонки
	КС = Новый КвалификаторыСтроки(36);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));

	ОписаниеСтрока = Новый ОписаниеТипов(Массив,,,,КС);
	Для каждого Колонка Из СписокГуидов Цикл
		ТаблицаДанных.Колонки.Добавить(Колонка.Значение + "Гуид", ОписаниеСтрока);	
	КонецЦикла;
	
	//дополнить гуидами
	Для каждого стр Из ТаблицаДанных Цикл
		Для каждого Колонка Из СписокГуидов Цикл
			ИмяКолонкиГуид = Колонка.Значение + "Гуид";
			ИмяКолонки = Колонка.Значение;
			Если ЗначениеЗаполнено(стр[ИмяКолонки]) Тогда
				стр[ИмяКолонкиГуид] = стр[ИмяКолонки].Ссылка.УникальныйИдентификатор();	
			КонецЕсли; 
		КонецЦикла;		
	КонецЦикла;		
КонецПроцедуры
