// Возвращает код языка интерфейса в формате ru/uk
Функция КодЯзыкаИнтерфейса() Экспорт
	
	Возврат ТекущийЯзык().КодЯзыка;
	
КонецФункции // КодЯзыкаИнтерфейса()

//По коду языка возвращает строку параметров прописи из справочника Валюты 
//(ПараметрыПрописиНаРусском или ПараметрыПрописиНаУкраинском).
Функция ПараметрыПрописи(Валюта, КодЯзыка) Экспорт
	
	Рез = ?(КодЯзыка = "uk",Валюта.ПараметрыПрописиНаУкраинском,Валюта.ПараметрыПрописиНаРусском);
	Если Рез = "" Тогда
		ОбщегоНазначения.СообщитьСлужебнуюИнформацию(НСтр("ru='Для валюты ';uk='Для валюти '") + Валюта + НСтр("ru=' не установлены параметры прописи для кода языка ';uk=' не встановлені параметри пропису для коду мови '") + КодЯзыка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ПараметрыПрописи()

// Возвращает код языка информационной базы, который указан 
// в региональных настройках (в конфигураторе)
Функция КодЯзыкаИнформационнойБазы() Экспорт
	
	// любой язык кроме украинского будем считать русским
	КодЛокализацииИБ = КодЛокализации();
	Возврат ?((КодЛокализацииИБ = "uk_UA") или (КодЛокализацииИБ = "uk"),"uk","ru");
	
КонецФункции // КодЯзыкаИнформационнойБазы()

// Возвращает код языка локализации текущего сеанса
Функция КодЯзыкаЛокализации() Экспорт
	
	// любой язык кроме украинского будем считать русским
	КодЛокализацииСеанса = ТекущийКодЛокализации();
	Возврат ?((КодЛокализацииСеанса = "uk_UA") или (КодЛокализацииСеанса = "uk"),"uk","ru");
	
КонецФункции // КодЯзыкаЛокализации()

// Возвращает код языка системы
Функция КодЯзыкаСистемы() Экспорт
	
	// любой язык кроме украинского будем считать русским
	КодЯзыкаСистемы = ТекущийЯзыкСистемы();
	Возврат ?((КодЯзыкаСистемы = "uk_UA") или (КодЯзыкаСистемы = "uk"),"uk","ru");
	
КонецФункции // КодЯзыкаСистемы()

// Функция возвращает имя языка для формирования нерегламентых печатных форм
// документов и некоторых справочников с учетом установленного режима в настройках
// пользователя. По умолчанию это язык информционной базы.
//
// Параметры
//     	РежимПользователя - Установленное значение в настройках пользователя
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФорм(РежимПользователя = Неопределено) Экспорт

	
	Если РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
		
	Иначе// РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		 // или по - умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФорм()

// Функция возвращает имя языка для формирования печатных форм документов
// с учетом установленного режима в настройках текущего пользователя. 
// По умолчанию - это язык информационной базы.
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФормДокументов() Экспорт

	РежимФормированияПечатныхФормДокументов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм");
	
	Если РежимФормированияПечатныхФормДокументов = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимФормированияПечатныхФормДокументов = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимФормированияПечатныхФормДокументов = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
		
	Иначе // РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		  // или по умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФормДокументов()

// Функция возвращает имя языка для формирования печатных форм отчетов
// с учетом установленного режима в настройках текущего пользователя. 
// По умолчанию - это язык информационной базы.
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФормОтчетов() Экспорт

	РежимФормированияПечатныхФормОтчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм");
	
	Если РежимФормированияПечатныхФормОтчетов = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимФормированияПечатныхФормОтчетов = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимФормированияПечатныхФормОтчетов = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
		
	Иначе // РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		  // или по умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФормОтчетов()

//Преобразует код языка в формат понятный системной фунции Формат()
// Параметры
//  КодЯзыка  	 – Строка – код языка в формате uk/ru
//
// Возвращаемое значение:
//   Строка   	 – код языка в формате ru_RU/uk_UA
//
Функция ОпределитьКодЯзыкаДляФормат(КодЯзыка) Экспорт
	
	Возврат ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
КонецФункции // ОпределитьКодЯзыкаДляФормат()

Функция ОбработатьПереводы(ПолноеИмяОбъектаМетаданных, ИмяДляПеревода, КодЯзыка) Экспорт
	    
		Если ПолноеИмяОбъектаМетаданных = "Документ.АвансовыйОтчет" Тогда 
			Возврат НСтр("ru='Авансовый отчет';uk='Авансовий звіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктОбОказанииПроизводственныхУслуг" Тогда 
			Возврат НСтр("ru='Акт об оказании производственных услуг';uk='Акт про надання виробничих послуг'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводНачальныхОстатковОС" Тогда 
			Возврат НСтр("ru='Ввод начальных остатков ОС';uk='Введення початкових залишків ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВнутреннийЗаказ" Тогда 
			Возврат НСтр("ru='Внутренний заказ';uk='Внутрішнє замовлення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтПокупателя" Тогда 
			Возврат НСтр("ru='Возврат товаров от покупателя';uk='Повернення товарів від покупця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровПоставщику" Тогда 
			Возврат НСтр("ru='Возврат товаров поставщику';uk='Повернення товарів постачальнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровПоставщикуИзНТТ" Тогда 
			Возврат НСтр("ru='Возврат товаров поставщику из НТТ';uk='Повернення товарів постачальнику з НТТ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДокументРасчетовСКонтрагентом" Тогда 
			Возврат НСтр("ru='Документ расчетов с контрагентом (ручной учет)';uk='Документ розрахунків з контрагентом (ручний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПокупателя" Тогда 
			Возврат НСтр("ru='Заказ покупателя';uk='Замовлення покупця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику" Тогда 
			Возврат НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияТоваровНаСкладе" Тогда 
			Возврат НСтр("ru='Инвентаризация товаров на складе';uk='Інвентаризація товарів на складі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияТоваровОтданныхНаКомиссию" Тогда 
			Возврат НСтр("ru='Инвентаризация товаров отданных на комиссию';uk='Інвентаризація товарів, переданих на комісію'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаДолга" Тогда 
			Возврат НСтр("ru='Корректировка долга';uk='Коригування боргу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаДолгаПоВозвратнойТаре" Тогда 
			Возврат НСтр("ru='Корректировка долга по возвратной таре';uk='Коригування боргу по зворотній тарі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомиссионераОПродажах" Тогда 
			Возврат НСтр("ru='Отчет комиссионера о продажах';uk='Звіт комісіонера про продажі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомитентуОПродажах" Тогда 
			Возврат НСтр("ru='Отчет комитенту о продажах товаров';uk='Звіт комітенту про продажі товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетОРозничныхПродажах" Тогда 
			Возврат НСтр("ru='Отчет о розничных продажах';uk='Звіт про роздрібні продажі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОприходованиеТоваров" Тогда 
			Возврат НСтр("ru='Оприходование товаров';uk='Оприбуткування товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетПроизводстваЗаСмену" Тогда 
			Возврат НСтр("ru='Отчет производства за смену';uk='Звіт виробництва за зміну'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеТоваров" Тогда 
			Возврат НСтр("ru='Перемещение товаров';uk='Переміщення товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежноеПоручениеВходящее" Тогда 
			Возврат НСтр("ru='Платежное поручение входящее';uk='Платіжне доручення вхідне'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежноеПоручениеИсходящее" Тогда 
			Возврат НСтр("ru='Платежное поручение исходящее';uk='Платіжне доручення вихідне'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежныйОрдерПоступлениеДенежныхСредств" Тогда 
			Возврат НСтр("ru='Платежный ордер, поступление денежных средств';uk='Платіжний ордер, надходження коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежныйОрдерСписаниеДенежныхСредств" Тогда 
			Возврат НСтр("ru='Платежный ордер, списание денежных средств';uk='Платіжний ордер, списання коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеДопРасходов" Тогда 
			Возврат НСтр("ru='Поступление доп. расходов';uk='Надходження дод. витрат'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Партия" Тогда 
			Возврат НСтр("ru='Партия (ручной учет)';uk='Партія (ручний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПартияМалоценкиВЭксплуатации" Тогда 
			Возврат НСтр("ru='Партия малоценки в эксплуатации (ручной учет)';uk='Партія малоцінки в експлуатації (ручний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаМалоценкиВЭксплуатацию" Тогда 
			Возврат НСтр("ru='Передача малоценки в эксплуатацию';uk='Передача малоцінки в експлуатацію'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаОС" Тогда 
			Возврат НСтр("ru='Передача ОС';uk='Передача ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеТоваровУслуг" Тогда 
			Возврат НСтр("ru='Поступление товаров и услуг';uk='Надходження товарів і послуг'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеТоваровУслугВНТТ" Тогда 
			Возврат НСтр("ru='Поступление товаров и услуг в НТТ';uk='Надходження товарів і послуг в НТТ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйОрдерНаТовары" Тогда 
			Возврат НСтр("ru='Приходный ордер на товары';uk='Прибутковий ордер на товари'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйКассовыйОрдер" Тогда 
			Возврат НСтр("ru='Приходный кассовый ордер';uk='Прибутковий касовий ордер'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасходныйКассовыйОрдер" Тогда 
			Возврат НСтр("ru='Расходный кассовый ордер';uk='Видатковий касовий ордер'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияТоваровУслуг" Тогда 
			Возврат НСтр("ru='Реализация товаров и услуг';uk='Реалізація товарів і послуг'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуПокупателю" Тогда 
			Возврат НСтр("ru='Счет на оплату покупателю';uk='Рахунок на оплату покупцю'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуПоставщика" Тогда 
			Возврат НСтр("ru='Счет на оплату поставщика';uk='Рахунок на оплату постачальника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияУслугПоПереработке" Тогда 
			Возврат НСтр("ru='Реализация услуг по переработке';uk='Реалізація послуг з переробки'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЧекККМ" Тогда 
			Возврат НСтр("ru='Чек ККМ';uk='Чек ККМ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланируемоеПоступлениеДенежныхСредств" Тогда 
			Возврат НСтр("ru='Планируемое поступление денежных средств';uk='Плановане надходження грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктСверкиВзаиморасчетов" Тогда 
			Возврат НСтр("ru='Акт сверки взаиморасчетов';uk='Акт звірки взаєморозрахунків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводВЭксплуатациюОС" Тогда 
			Возврат НСтр("ru='Ввод в эксплуатацию ОС';uk='Введення в експлуатацію ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации" Тогда 
			Возврат НСтр("ru='Ввод начальных остатков малоценки в эксплуатации';uk='Введення початкових залишків малоцінки в експлуатації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводНачальныхОстатковПоЗарплате" Тогда 
			Возврат НСтр("ru='Ввод начальных остатков по зарплате';uk='Введення початкових залишків по зарплаті'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводСведенийОбИндексированномДоходе" Тогда 
			Возврат НСтр("ru='Ввод сведений об индексированном доходе';uk='Введення відомостей про індексований дохід'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыгрузкаРегламентированныхОтчетов" Тогда 
			Возврат НСтр("ru='Выгрузка регламентированных отчетов';uk='Вивантаження регламентованих звітів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыработкаНМА" Тогда 
			Возврат НСтр("ru='Выработка для расчета амортизации НМА';uk='Виробіток для розрахунку амортизації НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыработкаОС" Тогда 
			Возврат НСтр("ru='Выработка ОС';uk='Виробіток ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ГТДИмпорт" Тогда 
			Возврат НСтр("ru='ГТД по импорту';uk='ВМД по імпорту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Доверенность" Тогда 
			Возврат НСтр("ru='Доверенность';uk='Довіреність'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗакрытиеМесяца" Тогда 
			Возврат НСтр("ru='Закрытие месяца';uk='Закриття місяця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗарплатаКВыплатеОрганизаций" Тогда 
			Возврат НСтр("ru='Зарплата к выплате организаций';uk='Зарплата до виплати організацій'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявкаНаПокупкуПродажуВалюты" Тогда 
			Возврат НСтр("ru='Заявка на покупку-продажу валюты';uk='Заявка на покупку-продаж валюти'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявлениеНаПрименениеЛьготы" Тогда 
			Возврат НСтр("ru='Заявление на применение льготы НДФЛ';uk='Заява на застосування пільги ПДФО'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеГрафиковАмортизацииОС" Тогда 
			Возврат НСтр("ru='Изменение графиков амортизации ОС';uk='Зміна графіків амортизації ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеНалоговогоНазначенияЗапасов" Тогда 
			Возврат НСтр("ru='Изменение налогового назначения запасов';uk='Зміна податкового призначення запасів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеНалоговогоНазначенияТЗР" Тогда 
			Возврат НСтр("ru='Изменение налогового назначения ТЗР';uk='Зміна податкового призначення ТЗВ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеНалоговогоНазначенияОС" Тогда 
			Возврат НСтр("ru='Изменение налогового назначения ОС';uk='Зміна податкового призначення ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеПараметровНачисленияАмортизацииОС" Тогда 
			Возврат НСтр("ru='Изменение параметров начисления амортизации ОС';uk='Зміна параметрів нарахування амортизації ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеСостоянияОС" Тогда 
			Возврат НСтр("ru='Изменение состояния ОС';uk='Зміна стану ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА" Тогда 
			Возврат НСтр("ru='Изменение способа отражения расходов по амортизации НМА';uk='Зміна способу відображення витрат по амортизації НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС" Тогда 
			Возврат НСтр("ru='Изменение способа отражения расходов по амортизации ОС';uk='Зміна способу відображення витрат по амортизації ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияНЗП" Тогда 
			Возврат НСтр("ru='Инвентаризация незавершенного производства';uk='Інвентаризація незавершеного виробництва'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияОС" Тогда 
			Возврат НСтр("ru='Инвентаризация ОС';uk='Інвентаризація ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КадровоеПеремещениеОрганизаций" Тогда 
			Возврат НСтр("ru='Кадровое перемещение организаций';uk='Кадрове переміщення організацій'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КомандировкиОрганизаций" Тогда 
			Возврат НСтр("ru='Командировки организаций';uk='Відрядження організацій'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаЗаписейРегистров" Тогда 
			Возврат НСтр("ru='Корректировка записей регистров';uk='Коригування записів регістрів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаОжидаемогоИПодтвержденногоНДС" Тогда 
			Возврат НСтр("ru='Корректировка ожидаемого и подтвержденного НДС';uk='Коригування очікуваного й підтвердженого ПДВ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.МодернизацияОС" Тогда 
			Возврат НСтр("ru='Модернизация ОС';uk='Модернізація ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НалоговаяНакладная" Тогда 
			Возврат НСтр("ru='Налоговая накладная';uk='Податкова накладна'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеЗарплатыРаботникамОрганизаций" Тогда 
			Возврат НСтр("ru='Начисление зарплаты работникам организаций';uk='Нарахування зарплати працівникам організацій'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеКоммунальногоНалога" Тогда 
			Возврат НСтр("ru='Начисление коммунального налога';uk='Нарахування комунального податку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияБух" Тогда 
			Возврат НСтр("ru='Операция (бухгалтерский и налоговый учет)';uk='Операція (бухгалтерський і податковий облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОпределениеФинансовыхРезультатов" Тогда 
			Возврат НСтр("ru='Определение финансовых результатов';uk='Визначення фінансових результатів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтражениеВзаиморасчетовСКонтрагентамиВ1ДФ" Тогда 
			Возврат НСтр("ru='Отражение взаиморасчетов с контрагентами в 1-ДФ';uk='Відображення взаєморозрахунків з контрагентами в 1-ДФ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтражениеЗарплатыВРеглУчете" Тогда 
			Возврат НСтр("ru='Отражение зарплаты в регл учете';uk='Відображення зарплати в регл обліку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаНМА" Тогда 
			Возврат НСтр("ru='Передача НМА';uk='Передача НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаОборудованияВМонтаж" Тогда 
			Возврат НСтр("ru='Передача оборудования в монтаж';uk='Передача устаткування в монтаж'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаТоваров" Тогда 
			Возврат НСтр("ru='Передача товаров';uk='Передача товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеМалоценкиВЭксплуатации" Тогда 
			Возврат НСтр("ru='Перемещение малоценки в эксплуатации';uk='Переміщення малоценки в експлуатації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеОС" Тогда 
			Возврат НСтр("ru='Перемещение ОС';uk='Переміщення ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереоценкаТоваровВРознице" Тогда 
			Возврат НСтр("ru='Переоценка товаров в рознице';uk='Переоцінка товарів у роздробі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодготовкаКПередачеОС" Тогда 
			Возврат НСтр("ru='Подготовка к передаче ОС';uk='Підготовка до передачі ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодтверждениеУплатыНалоговПоЗарплате" Тогда 
			Возврат НСтр("ru='Подтверждение уплаты налогов по зарплате';uk='Підтвердження сплати податків по зарплаті'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПокупкаПродажаВалюты" Тогда 
			Возврат НСтр("ru='Покупка-продажа валюты';uk='Покупка-продаж валюти'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеИзПереработки" Тогда 
			Возврат НСтр("ru='Поступление из переработки';uk='Надходження з переробки'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеНМА" Тогда 
			Возврат НСтр("ru='Поступление НМА';uk='Надходження НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриемНаРаботуВОрганизацию" Тогда 
			Возврат НСтр("ru='Прием на работу в организацию';uk='Прийом на роботу в організацію '" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Приложение1КНалоговойНакладной" Тогда 
			Возврат НСтр("ru='Приложение 1 к налоговой накладной';uk='Додаток 1 до податкової накладної'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Приложение2КНалоговойНакладной" Тогда 
			Возврат НСтр("ru='Приложение 2 к налоговой накладной';uk='Додаток 2 до податкової накладної'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПринятиеКУчетуНМА" Тогда 
			Возврат НСтр("ru='Принятие к учету НМА';uk='Прийняття до обліку НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасчетыПоНалогуНаПрибыль" Тогда 
			Возврат НСтр("ru='Расчеты по налогу на прибыль';uk='Розрахунки за податком на прибуток'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияАвансовВНалоговомУчете" Тогда 
			Возврат НСтр("ru='Регистрация авансов в налоговом учете';uk='Реєстрація авансів у податковому обліку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияВходящегоНалоговогоДокумента" Тогда 
			Возврат НСтр("ru='Регистрация входящего налогового документа';uk='Реєстрація вхідного податкового документа'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегламентированныйОтчет" Тогда 
			Возврат НСтр("ru='Регламентированный отчет';uk='Регламентований звіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РемонтОС" Тогда 
			Возврат НСтр("ru='Ремонт ОС';uk='Ремонт ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеМалоценкиИзЭксплуатации" Тогда 
			Возврат НСтр("ru='Списание малоценки из эксплуатации';uk='Списання малоцінки з експлуатації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеНМА" Тогда 
			Возврат НСтр("ru='Списание НМА';uk='Списання НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеОС" Тогда 
			Возврат НСтр("ru='Списание ОС';uk='Списання ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеТоваров" Тогда 
			Возврат НСтр("ru='Списание товаров';uk='Списання товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ТребованиеНакладная" Тогда 
			Возврат НСтр("ru='Требование-накладная';uk='Вимога-накладна'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УвольнениеИзОрганизаций" Тогда 
			Возврат НСтр("ru='Увольнение из организации';uk='Звільнення з організації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаГарантийныхСроковНалоговыйУчет" Тогда 
			Возврат НСтр("ru='Установка гарантийных сроков (налоговый учет)';uk='Встановлення гарантійних строків (податковий облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаПорядкаЗакрытияПодразделений" Тогда 
			Возврат НСтр("ru='Установка порядка подразделений для закрытия счетов';uk='Встановлення порядку підрозділів для закриття рахунків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаЦенНоменклатуры" Тогда 
			Возврат НСтр("ru='Установка цен номенклатуры';uk='Встановлення цін номенклатури'" ,КодЯзыка)			
		КонецЕсли;	

		Если ПолноеИмяОбъектаМетаданных = "Перечисление.ABCКлассификация" Тогда 
			Если ИмяДляПеревода = "AКласс" Тогда 
				Возврат НСтр("ru='A - класс';uk='A - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "BКласс" Тогда 
				Возврат НСтр("ru='B - класс';uk='B - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "CКласс" Тогда 
				Возврат НСтр("ru='C - класс';uk='C - клас'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.XYZКлассификация" Тогда 
			Если ИмяДляПеревода = "XКласс" Тогда 
				Возврат НСтр("ru='X - класс';uk='X - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "YКласс" Тогда 
				Возврат НСтр("ru='Y - класс';uk='Y - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ZКласс" Тогда 
				Возврат НСтр("ru='Z - класс';uk='Z - клас'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.БазаРаспределенияВнутреннихУслуг" Тогда 
			Если ИмяДляПеревода = "НатуральныеПоказатели" Тогда 
				Возврат НСтр("ru='Натуральные показатели';uk='Натуральні показники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлановаяСебестоимость" Тогда 
				Возврат НСтр("ru='Плановая себестоимость';uk='Планова собівартість'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Важность" Тогда 
			Если ИмяДляПеревода = "Высокая" Тогда 
				Возврат НСтр("ru='Высокая';uk='Висока'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Низкая" Тогда 
				Возврат НСтр("ru='Низкая';uk='Низька'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Средняя" Тогда 
				Возврат НСтр("ru='Средняя';uk='Середня'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантВыраженияВнутреннихУслуг" Тогда 
			Если ИмяДляПеревода = "ВКоличественныхПоказателях" Тогда 
				Возврат НСтр("ru='В количественных показателях';uk='У кількісних показниках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПлановыхЦенах" Тогда 
				Возврат НСтр("ru='В плановых ценах';uk='У планових цінах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыАлгоритмовРасчетНДФЛ17" Тогда 
			Если ИмяДляПеревода = "ДоначислениеНаСуммуПревышения" Тогда 
				Возврат НСтр("ru='Доначисление на сумму превышения';uk='Донарахування на суму перевищення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтдельныйРасчетБазы" Тогда 
				Возврат НСтр("ru='Устарело - Отдельный расчет базы для 17%';uk='Застаріло - Окремий розрахунок бази для 17%'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВерсионированияОбъектов" Тогда 
			Если ИмяДляПеревода = "ВерсионироватьВсегда" Тогда 
				Возврат НСтр("ru='Версионировать';uk='Версіювати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВерсионироватьПриПроведении" Тогда 
				Возврат НСтр("ru='Версионировать при проведении';uk='Версіонувати при проведенні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВерсионировать" Тогда 
				Возврат НСтр("ru='Не версионировать';uk='Не версіонувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтображенияОтчетов" Тогда 
			Если ИмяДляПеревода = "Диаграмма" Тогда 
				Возврат НСтр("ru='Диаграмма';uk='Діаграма'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СводнаяТаблица" Тогда 
				Возврат НСтр("ru='Сводная таблица';uk='Зведена таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Таблица" Тогда 
				Возврат НСтр("ru='Таблица';uk='Таблиця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыУказанияЗаказовВТабличнойЧастиДокументов" Тогда 
			Если ИмяДляПеревода = "ДляДокументовПоступления" Тогда 
				Возврат НСтр("ru='Для документов поступления';uk='Для документів надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляДокументовПоступленияРеализации" Тогда 
				Возврат НСтр("ru='Для документов поступления и реализации';uk='Для документів надходження й реалізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляДокументовРеализации" Тогда 
				Возврат НСтр("ru='Для документов реализации';uk='Для документів реалізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыУказанияСкладовВТабличнойЧастиДокументов" Тогда 
			Если ИмяДляПеревода = "ДляДокументовПоступления" Тогда 
				Возврат НСтр("ru='Для документов поступления';uk='Для документів надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляДокументовПоступленияРеализации" Тогда 
				Возврат НСтр("ru='Для документов поступления и реализации';uk='Для документів надходження й реалізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляДокументовРеализации" Тогда 
				Возврат НСтр("ru='Для документов реализации';uk='Для документів реалізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВедениеВзаиморасчетовПоДоговорам" Тогда 
			Если ИмяДляПеревода = "ПоДоговоруВЦелом" Тогда 
				Возврат НСтр("ru='По договору в целом';uk='За договором у цілому'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗаказам" Тогда 
				Возврат НСтр("ru='По заказам';uk='По замовленнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСчетам" Тогда 
				Возврат НСтр("ru='По счетам';uk='По рахунках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьПоРасчетнымДокументам" Тогда 
				Возврат НСтр("ru='По расчетным документам';uk='По розрахункових документах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидВыдачиДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "КассеККМ" Тогда 
				Возврат НСтр("ru='Кассе ККМ';uk='Касі ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НТТ" Тогда 
				Возврат НСтр("ru='НТТ';uk='НТТ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидПриемаРозничнойВыручки" Тогда 
			Если ИмяДляПеревода = "ИзКассы" Тогда 
				Возврат НСтр("ru='Из кассы';uk='З каси'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзНТТ" Тогда 
				Возврат НСтр("ru='Из НТТ';uk='Із НТТ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыАнкет" Тогда 
			Если ИмяДляПеревода = "Опрос" Тогда 
				Возврат НСтр("ru='Опрос';uk='Опитування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Тестирование" Тогда 
				Возврат НСтр("ru='Тестирование';uk='Тестування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыБизнесПроцессов" Тогда 
			Если ИмяДляПеревода = "ПереоценкаТоваровАТТ" Тогда 
				Возврат НСтр("ru='Переоценка товаров АТТ';uk='Переоцінка товарів АТТ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаТоваровРозница" Тогда 
				Возврат НСтр("ru='Переоценка товаров розница';uk='Переоцінка товарів роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СогласованиеЗаказаПокупателя" Тогда 
				Возврат НСтр("ru='Согласование заказа покупателя';uk='Погодження замовлення покупця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыВзаиморасчетовСРаботниками" Тогда 
			Если ИмяДляПеревода = "Дивиденды" Тогда 
				Возврат НСтр("ru='Дивиденды';uk='Дивіденди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаработнаяПлата" Тогда 
				Возврат НСтр("ru='ФОТ (заработная плата )';uk='ФОП (заробітна плата )'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаработнаяПлатаНеФОТ" Тогда 
				Возврат НСтр("ru='не ФОТ (заработная плата)';uk='не ФОП (заробітна плата)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыВнутреннегоЗаказа" Тогда 
			Если ИмяДляПеревода = "ВПодразделение" Тогда 
				Возврат НСтр("ru='В подразделение';uk='У підрозділ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаСклад" Тогда 
				Возврат НСтр("ru='На склад';uk='На склад'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыВремени" Тогда 
			Если ИмяДляПеревода = "ДополнительноОплачиваемоеВПределахНормы" Тогда 
				Возврат НСтр("ru='Дополнительно оплачиваемое время в пределах нормы времени';uk='Додатково оплачуваний час у межах норми часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтработанноеВПределахНормы" Тогда 
				Возврат НСтр("ru='Отработанное время в пределах нормы времени';uk='Відпрацьований час у межах норми часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтработанноеСверхНормы" Тогда 
				Возврат НСтр("ru='Отработанное время сверх нормы времени';uk='Відпрацьований час поверх норми часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЦелодневноеНеотработанное" Тогда 
				Возврат НСтр("ru='Целодневное неотработанное время и командировки';uk='Цілоденний невідпрацьований час і відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧасовоеНеотработанное" Тогда 
				Возврат НСтр("ru='Часовое неотработанное время и командировки';uk='Годинний невідпрацьований час і відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧасовоеОтработанноеВПределахНормы" Тогда 
				Возврат НСтр("ru='Часовое отработанное в пределах нормы';uk='Годинне відпрацьоване в межах норми'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДанныхДляПланФактногоАнализаДДС" Тогда 
			Если ИмяДляПеревода = "Сценарий" Тогда 
				Возврат НСтр("ru='Данные сценария';uk='Дані сценарію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФактическиеДанные" Тогда 
				Возврат НСтр("ru='Фактические данные';uk='Фактичні дані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФактическиеИПланируемые" Тогда 
				Возврат НСтр("ru='Фактические данные с учетом заявок и планируемых поступлений';uk='Фактичні дані з урахуванням заявок і планованих надходжень'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДвиженийПриходРасход" Тогда 
			Если ИмяДляПеревода = "Приход" Тогда 
				Возврат НСтр("ru='Приход';uk='Надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Расход" Тогда 
				Возврат НСтр("ru='Расход';uk='Видаток'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "Отправка" Тогда 
				Возврат НСтр("ru='Отправка';uk='Відправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Получение" Тогда 
				Возврат НСтр("ru='Получение';uk='Отримання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолучениеИОтправка" Тогда 
				Возврат НСтр("ru='Получение и отправка';uk='Отримання та відправлення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДействийПоЗаказамПокупателей" Тогда 
			Если ИмяДляПеревода = "ОплатаПоЗаказу" Тогда 
				Возврат НСтр("ru='Оплата по заказу';uk='Оплата по замовленню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаПоЗаказу" Тогда 
				Возврат НСтр("ru='Отгрузка по заказу';uk='Відвантаження по замовленню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДействийПоЗаказамПоставщикам" Тогда 
			Если ИмяДляПеревода = "ОплатаПоЗаказу" Тогда 
				Возврат НСтр("ru='Оплата по заказу';uk='Оплата по замовленню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеПоЗаказу" Тогда 
				Возврат НСтр("ru='Поступление по заказу';uk='Надходження по замовленню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДействийФильтровЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "ПоместитьПисьмоВПапку" Тогда 
				Возврат НСтр("ru='Поместить письмо в папку ...';uk='Помістити лист у папку ...'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродолжитьДальнейшуюОбработкуПравил" Тогда 
				Возврат НСтр("ru='Продолжить дальнейшую обработку правил';uk='Продовжити подальшу обробку листів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УстановитьПисьмуФлагРассмотрено" Тогда 
				Возврат НСтр("ru='Установить письму флаг ""Рассмотрено""';uk='Встановити листу флаг ""Розглянуто""'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДействияСНачислением" Тогда 
			Если ИмяДляПеревода = "Изменить" Тогда 
				Возврат НСтр("ru='Изменить';uk='Змінити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начать" Тогда 
				Возврат НСтр("ru='Начать';uk='Почати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИзменять" Тогда 
				Возврат НСтр("ru='Не изменять';uk='Не змінювати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прекратить" Тогда 
				Возврат НСтр("ru='Прекратить';uk='Припинити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "Безналичные" Тогда 
				Возврат НСтр("ru='Безналичные';uk='Безготівкові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Наличные" Тогда 
				Возврат НСтр("ru='Наличные';uk='Готівка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДеятельностиДляДДС" Тогда 
			Если ИмяДляПеревода = "Инвестиционная" Тогда 
				Возврат НСтр("ru='Инвестиционная';uk='Інвестиційна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Операционная" Тогда 
				Возврат НСтр("ru='Операционная';uk='Операційна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Финансовая" Тогда 
				Возврат НСтр("ru='Финансовая';uk='Фінансова'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДеятельностиНДС" Тогда 
			Если ИмяДляПеревода = "Необлагаемая" Тогда 
				Возврат НСтр("ru='Необлагаемая';uk='Неоподатковувана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Облагаемая" Тогда 
				Возврат НСтр("ru='Облагаемая';uk='Оподатковувана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноОблагаемая" Тогда 
				Возврат НСтр("ru='Пропорционально облагаемая';uk='Пропорційно оподатковувана'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДнейПроизводственногоКалендаря" Тогда 
			Если ИмяДляПеревода = "Воскресенье" Тогда 
				Возврат НСтр("ru='Воскресенье';uk='Неділя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Праздник" Тогда 
				Возврат НСтр("ru='Праздник';uk='Свято'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Предпраздничный" Тогда 
				Возврат НСтр("ru='Предпраздничный';uk='Передсвятковий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рабочий" Тогда 
				Возврат НСтр("ru='Рабочий';uk='Робочий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Суббота" Тогда 
				Возврат НСтр("ru='Суббота';uk='Субота'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДоговоровКонтрагентов" Тогда 
			Если ИмяДляПеревода = "Бартерный" Тогда 
				Возврат НСтр("ru='Бартерный';uk='Бартерний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СКомиссионером" Тогда 
				Возврат НСтр("ru='С комиссионером';uk='З комісіонером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СКомитентом" Тогда 
				Возврат НСтр("ru='С комитентом';uk='З комітентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СПокупателем" Тогда 
				Возврат НСтр("ru='С покупателем';uk='З покупцем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СПоставщиком" Тогда 
				Возврат НСтр("ru='С поставщиком';uk='З постачальником'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДоговоровСФизЛицами" Тогда 
			Если ИмяДляПеревода = "Авторский" Тогда 
				Возврат НСтр("ru='Авторский договор';uk='Авторський договір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорУправленческий" Тогда 
				Возврат НСтр("ru='Без договора';uk='Без договору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подряда" Тогда 
				Возврат НСтр("ru='Договор подряда (выполнение работ, оказание услуг)';uk='Договір підряду (виконання робіт, надання послуг)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТрудовойДоговор" Тогда 
				Возврат НСтр("ru='Трудовой договор';uk='Трудовий договір'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДокументаОтпуск" Тогда 
			Если ИмяДляПеревода = "ВозвратПриУвольнении" Тогда 
				Возврат НСтр("ru='Возврат отпускных при увольнении';uk='Повернення відпускних при звільненні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияОтпуска" Тогда 
				Возврат НСтр("ru='Компенсация отпуска';uk='Компенсація відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтзывИзОтпуска" Тогда 
				Возврат НСтр("ru='Отзыв из отпуска';uk='Відкликання з відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отпускные" Тогда 
				Возврат НСтр("ru='Отпускные';uk='Відпускні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДополнительнойИнформацииОбъектов" Тогда 
			Если ИмяДляПеревода = "Изображение" Тогда 
				Возврат НСтр("ru='Изображение';uk='Зображення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Файл" Тогда 
				Возврат НСтр("ru='Файл';uk='Файл'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДополнительныхВнешнихОбработок" Тогда 
			Если ИмяДляПеревода = "ЗаполнениеТабличныхЧастей" Тогда 
				Возврат НСтр("ru='Заполнение табличных частей';uk='Заповнення табличних частин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработка" Тогда 
				Возврат НСтр("ru='Обработка';uk='Обробка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отчет" Тогда 
				Возврат НСтр("ru='Отчет';uk='Звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПечатнаяФорма" Тогда 
				Возврат НСтр("ru='Печатная форма';uk='Друкована форма'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЗадолженности" Тогда 
			Если ИмяДляПеревода = "Дебиторская" Тогда 
				Возврат НСтр("ru='Дебиторская';uk='Дебіторська'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кредиторская" Тогда 
				Возврат НСтр("ru='Кредиторская';uk='Кредиторська'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЗанятостиВОрганизации" Тогда 
			Если ИмяДляПеревода = "ВнутреннееСовместительство" Тогда 
				Возврат НСтр("ru='Внутреннее совместительство';uk='Внутрішнє сумісництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновноеМестоРаботы" Тогда 
				Возврат НСтр("ru='Основное место работы';uk='Основне місце роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Совместительство" Тогда 
				Возврат НСтр("ru='Совместительство';uk='Сумісництво'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЗатрат" Тогда 
			Если ИмяДляПеревода = "Амортизация" Тогда 
				Возврат НСтр("ru='Амортизация';uk='Амортизація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Материальные" Тогда 
				Возврат НСтр("ru='Материальные';uk='Матеріальні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТруда" Тогда 
				Возврат НСтр("ru='Оплата труда';uk='Оплата праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчисленияНаСоциальныеНужды" Тогда 
				Возврат НСтр("ru='Отчисления на социальные нужды';uk='Відрахування на соціальні потреби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочие" Тогда 
				Возврат НСтр("ru='Прочие';uk='Інші'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыИзображенийИФайлов" Тогда 
			Если ИмяДляПеревода = "ОсновноеИзображение" Тогда 
				Возврат НСтр("ru='Основное изображение';uk='Основне зображення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееИзображение" Тогда 
				Возврат НСтр("ru='Прочее изображение';uk='Інше зображення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекстовыйФайлDOSкодировки" Тогда 
				Возврат НСтр("ru='Текстовый файл DOS кодировки';uk='Текстовий файл DOS кодування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыИнформационныхКарт" Тогда 
			Если ИмяДляПеревода = "Магнитная" Тогда 
				Возврат НСтр("ru='Магнитная';uk='Магнітна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Штриховая" Тогда 
				Возврат НСтр("ru='Штриховая';uk='Штрихова'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыИсполнителейЗадач" Тогда 
			Если ИмяДляПеревода = "Инициатор" Тогда 
				Возврат НСтр("ru='Инициатор';uk='Ініціатор'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пользователь" Тогда 
				Возврат НСтр("ru='Пользователь';uk='Користувач'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыИспользованияАмортизации" Тогда 
			Если ИмяДляПеревода = "ДругиеКапитальныеРаботы" Тогда 
				Возврат НСтр("ru='Другие капитальные работы';uk='Інші капітальні роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеПолученныхЗаймов" Тогда 
				Возврат НСтр("ru='Погашение полученных на капитальные инвестиции займов';uk='Погашення отриманих на капітальні інвестиції позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеНематериальныхАктивов" Тогда 
				Возврат НСтр("ru='Приобретение (изготовление) нематериальных активов';uk='Придбання (виготовлення) нематеріальних активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеОсновныхСредств" Тогда 
				Возврат НСтр("ru='Приобретение (изготовление) основных средств';uk='Придбання (виготовлення) основних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтроительствоОбъектов" Тогда 
				Возврат НСтр("ru='Строительство объектов';uk=""Будівництво об'єктів""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УлучшениеОсновныхСредств" Тогда 
				Возврат НСтр("ru='Улучшение основных средств';uk='Поліпшення основних засобів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыКонтактныхЛиц" Тогда 
			Если ИмяДляПеревода = "КонтактноеЛицоКонтрагента" Тогда 
				Возврат НСтр("ru='Контактное лицо контрагента';uk='Контактна особа контрагента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛичныйКонтакт" Тогда 
				Возврат НСтр("ru='Личный контакт';uk='Особистий контакт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееКонтактноеЛицо" Тогда 
				Возврат НСтр("ru='Прочее контактное лицо';uk='Інша контактна особа'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыКорректировокНалоговогоКредита" Тогда 
			Если ИмяДляПеревода = "ВосстановлениеПраваНаНалоговыйКредит" Тогда 
				Возврат НСтр("ru='Восстановление права на налоговый кредит';uk='Відновлення права на податковий кредит'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НетКорректировок" Тогда 
				Возврат НСтр("ru='Нет корректировок';uk='Немає коригувань'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПотеряПраваНаНалоговыйКредит" Тогда 
				Возврат НСтр("ru='Потеря права на налоговый кредит';uk='Втрата права на податковий кредит'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыМалоценки" Тогда 
			Если ИмяДляПеревода = "БиблиотечныеФонды" Тогда 
				Возврат НСтр("ru='Библиотечные фонды';uk='Бібліотечні фонди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МалоценныйБыстроизнашивающийсяПредмет" Тогда 
				Возврат НСтр("ru='Малоценный быстроизнашивающийся предмет';uk='Малоцінний швидкозношуваний предмет'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МалоценныйНеоборотныйАктив" Тогда 
				Возврат НСтр("ru='Малоценный необоротный актив';uk='Малоцінний необоротний актив'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыМонетарныхСтатейВВалюте" Тогда 
			Если ИмяДляПеревода = "НеоперационнаяДеятельность" Тогда 
				Возврат НСтр("ru='Неоперационная (финансовая, инвестиционная) деятельность';uk='Неопераційна (фінансова, інвестиційна) діяльність'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбязательстваУчредителей" Тогда 
				Возврат НСтр("ru='Обязательства учредителей при формировании уставного капитала';uk=""Зобов'язання засновників при формуванні статутного капіталу""" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНалоговыхГруппНА" Тогда 
			Если ИмяДляПеревода = "ДоНКУ" Тогда 
				Возврат НСтр("ru='до 01.04.2011 (устаревшие)';uk='до 01.04.2011 (застарілі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НМА" Тогда 
				Возврат НСтр("ru='НМА';uk='НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОС" Тогда 
				Возврат НСтр("ru='ОС';uk='ОЗ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНалоговыхДеклараций" Тогда 
			Если ИмяДляПеревода = "Безработица" Тогда 
				Возврат НСтр("ru='Отчет в ФСС на случай безработицы';uk='Звіт у ФСС на випадок безробіття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияОПрибыли" Тогда 
				Возврат НСтр("ru='(не используется) Декларация о прибыли (до 01.04.2011)';uk='(не викоритовується) Декларація про прибуток(до 01.04.2011)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияПоНалогуНаПрибыльНКУ" Тогда 
				Возврат НСтр("ru='Декларация по налогу на прибыль';uk='Декларація з податку на прибуток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияПоНДС" Тогда 
				Возврат НСтр("ru='Декларация по НДС';uk='Декларація з ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕдиныйНалог" Тогда 
				Возврат НСтр("ru='Отчет по Единому налогу';uk='Звіт по Єдиному податку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕСВ" Тогда 
				Возврат НСтр("ru='Отчет по ЕСВ';uk='Звіт по ЄСВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НесчастныйСлучай" Тогда 
				Возврат НСтр("ru='Отчет в ФСС от несчастных случаев';uk='Звіт у ФСС від нещасних випадків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетОбИспользованииРабочегоВремени" Тогда 
				Возврат НСтр("ru='Отчет об использовании рабочего времени';uk='Звіт про використання робочого часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетПоТруду" Тогда 
				Возврат НСтр("ru='Отчет по труду';uk='Звіт по праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пенсионный" Тогда 
				Возврат НСтр("ru='Отчет в ПФ';uk='Звіт у ПФ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УтратаТрудоспобности" Тогда 
				Возврат НСтр("ru='Отчет в ФСС в связи с утратой трудоспобности';uk=""Звіт у ФСС у зв'язку із втратою працездатності""" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНаследованияПравДоступаИерархическихСправочников" Тогда 
			Если ИмяДляПеревода = "НаследуетсяОтРодителя" Тогда 
				Возврат НСтр("ru='Наследуется от родителя';uk='Успадковується від батька'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспространитьНаПодчиненных" Тогда 
				Возврат НСтр("ru='Распространить на подчиненных';uk='Поширити на підпорядковані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоДляТекущегоПрава" Тогда 
				Возврат НСтр("ru='Только для текущего права';uk='Тільки для поточного права'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНачисленийРаботникаОрганизации" Тогда 
			Если ИмяДляПеревода = "Индивидуальное" Тогда 
				Возврат НСтр("ru='Индивидуальное';uk='Індивідуальне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Надбавка" Тогда 
				Возврат НСтр("ru='Надбавка по штатному расписанию';uk='Надбавка за штатним розкладом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Основное" Тогда 
				Возврат НСтр("ru='Основное начисление';uk='Основне нарахування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНовыхРабочихМест" Тогда 
			Если ИмяДляПеревода = "МодернизацияИлиИзменениеТехнологииПроизводства" Тогда 
				Возврат НСтр("ru='Модернизация или изменение технологии производства';uk='Модернізація або зміна технології виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СозданиеНовогоСубъектаХозяйствования" Тогда 
				Возврат НСтр("ru='Создание нового субъекта хозяйствования';uk=""Створення нового суб'єкта господарювання""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличениеШтатнойЧисленностиРаботников" Тогда 
				Возврат НСтр("ru='Увеличение штатной численности работников';uk='Збільшення штатної чисельності працівників'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОбъектовДоступа" Тогда 
			Если ИмяДляПеревода = "Контрагенты" Тогда 
				Возврат НСтр("ru='Контрагенты';uk='Контрагенти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Организации" Тогда 
				Возврат НСтр("ru='Организации';uk='Організації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОбъектовЗагружаемыхИзОпроса" Тогда 
			Если ИмяДляПеревода = "КонтактныеЛица" Тогда 
				Возврат НСтр("ru='Справочник ""Контактные лица""';uk='Довідник ""Контактні особи""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Контрагенты" Тогда 
				Возврат НСтр("ru='Справочник ""Контрагенты""';uk='Довідник ""Контрагенти""'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОбъектовКонтактнойИнформации" Тогда 
			Если ИмяДляПеревода = "КонтактныеЛица" Тогда 
				Возврат НСтр("ru='Справочник ""Контактные лица""';uk='Довідник ""Контактні особи""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтактныеЛицаКонтрагентов" Тогда 
				Возврат НСтр("ru='Справочник ""Контактные лица контрагентов""';uk='Довідник ""Контактні особи контрагентів""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Контрагенты" Тогда 
				Возврат НСтр("ru='Справочник ""Контрагенты""';uk='Довідник ""Контрагенти""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛичныеКонтакты" Тогда 
				Возврат НСтр("ru='Справочник ""Личные контакты""';uk='Довідник ""Особисті контакти""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Организации" Тогда 
				Возврат НСтр("ru='Справочник ""Организации""';uk='Довідник ""Організації""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пользователи" Тогда 
				Возврат НСтр("ru='Справочник ""Пользователи""';uk='Довідник ""Користувачі""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФизическиеЛица" Тогда 
				Возврат НСтр("ru='Справочник ""Физические лица""';uk='Довідник ""Фізичні особи""'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОбъектовСобытия" Тогда 
			Если ИмяДляПеревода = "Контрагент" Тогда 
				Возврат НСтр("ru='Контрагент';uk='Контрагент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеКонтактныеЛица" Тогда 
				Возврат НСтр("ru='Прочие контактные лица';uk='Інші контактні особи'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийВозвратТоваров" Тогда 
			Если ИмяДляПеревода = "ИзПереработки" Тогда 
				Возврат НСтр("ru='Материалы из переработки';uk='Матеріали з переробки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтЗаказчика" Тогда 
				Возврат НСтр("ru='Продукция от заказчика';uk='Продукція від замовника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийВозвратТоваровОтПокупателя" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаКомиссия" Тогда 
				Возврат НСтр("ru='Продажа, комиссия';uk='Продаж, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийВозвратТоваровПоставщику" Тогда 
			Если ИмяДляПеревода = "ИзПереработки" Тогда 
				Возврат НСтр("ru='Из переработки';uk='З переробки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаКомиссия" Тогда 
				Возврат НСтр("ru='Покупка, комиссия';uk='Покупка, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийДоверенность" Тогда 
			Если ИмяДляПеревода = "Доверенность" Тогда 
				Возврат НСтр("ru='Доверенность';uk='Довіреність'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоверенностьСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Доверенность строгого учета';uk='Довіреність суворого обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЗаказПокупателя" Тогда 
			Если ИмяДляПеревода = "Переработка" Тогда 
				Возврат НСтр("ru='Переработка';uk='Переробка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаКомиссия" Тогда 
				Возврат НСтр("ru='Продажа, комиссия';uk='Продаж, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЗаказПоставщику" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Переработка" Тогда 
				Возврат НСтр("ru='Переработка';uk='Переробка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаКомиссия" Тогда 
				Возврат НСтр("ru='Покупка, комиссия';uk='Покупка, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЗакрытиеВнутреннихЗаказов" Тогда 
			Если ИмяДляПеревода = "ЗакрытиеЗаказов" Тогда 
				Возврат НСтр("ru='Закрытие внутренних заказов';uk='Закриття внутрішніх замовлень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятиеРезервов" Тогда 
				Возврат НСтр("ru='Снятие резервов и размещения';uk='Зняття резервів і розміщення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЗакрытиеЗаказовПокупателей" Тогда 
			Если ИмяДляПеревода = "ЗакрытиеЗаказов" Тогда 
				Возврат НСтр("ru='Закрытие заказов от покупателей';uk='Закриття замовлень від покупців'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятиеРезервов" Тогда 
				Возврат НСтр("ru='Снятие резервов и размещения';uk='Зняття резервів і розміщення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЗаписьКнигиПриобретения" Тогда 
			Если ИмяДляПеревода = "BeксeльПpoшлoгoПepиoдa" Тогда 
				Возврат НСтр("ru='Beксeль пpoшлoгo пepиoдa';uk='Beксeль минулого періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИмпортВексель" Тогда 
				Возврат НСтр("ru='Импорт по векселю';uk='Імпорт за векселем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИмпортПрочее" Тогда 
				Возврат НСтр("ru='Импорт не товаров';uk='Імпорт не товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговаяНакладная" Тогда 
				Возврат НСтр("ru='Налоговая накладная';uk='Податкова накладна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеНалоговогоВекселя" Тогда 
				Возврат НСтр("ru='Погашение налогового векселя';uk='Погашення податкового векселя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидента" Тогда 
				Возврат НСтр("ru='Работы от нерезидента (только до 29/07/2005)';uk='Роботи від нерезидента (тільки до 29/07/2005)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидентаПрошлогоПериода" Тогда 
				Возврат НСтр("ru='Работы от нерезидента прошлого периода';uk='Роботи від нерезидента минулого періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКорректировкиВозврат" Тогда 
				Возврат НСтр("ru='Расчет корректировки (возврат)';uk='Розрахунок коригування (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКорректировкиКорректировка" Тогда 
				Возврат НСтр("ru='Расчет корректировки (изменение суммы компенсации)';uk='Розрахунок коригування (зміна суми компенсації)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаможенноеОформлениеТоваровКомитента" Тогда 
				Возврат НСтр("ru='Таможенное оформление товаров комитента (право на кредит)';uk='Митне оформлення товарів комітента (право на кредит)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварныйЧек" Тогда 
				Возврат НСтр("ru='Товарный чек';uk='Товарний чек'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЗаявкиНаРасходование" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПокупателю" Тогда 
				Возврат НСтр("ru='Возврат денежных средств покупателю';uk='Повернення грошових коштів покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствКассеККМ" Тогда 
				Возврат НСтр("ru='Выдача денежных средств в кассу ККМ';uk='Видача грошових коштів в касу ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствПодотчетнику" Тогда 
				Возврат НСтр("ru='Выдача денежных средств подотчетнику';uk='Видача грошових коштів підзвітній особі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереводНаДругойСчет" Тогда 
				Возврат НСтр("ru='Перевод на другой счет организации';uk='Переказ на інший рахунок організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеЗП" Тогда 
				Возврат НСтр("ru='Перечисление заработной платы';uk='Перерахування заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеНалога" Тогда 
				Возврат НСтр("ru='Перечисление налога';uk='Перерахування податку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Покупка продажа валюты';uk='Покупка продаж валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочийРасходДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочий расход денежных средств';uk='Інше витрачання грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймамСКонтрагентами" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийИзменениеЛимитовВозвратнойТары" Тогда 
			Если ИмяДляПеревода = "ЛимитПокупателю" Тогда 
				Возврат НСтр("ru='Лимит покупателю';uk='Ліміт покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛимитПоставщика" Тогда 
				Возврат НСтр("ru='Лимит поставщика';uk='Ліміт постачальника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийИзменениеНалоговогоНазначенияЗапасов" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товары" Тогда 
				Возврат НСтр("ru='Товары';uk='Товари'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКомплектацияНоменклатуры" Тогда 
			Если ИмяДляПеревода = "Комплектация" Тогда 
				Возврат НСтр("ru='Комплектация';uk='Комплектація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Разукомплектация" Тогда 
				Возврат НСтр("ru='Разукомплектация';uk='Розукомплектація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКорректировкаДолга" Тогда 
			Если ИмяДляПеревода = "ВводНачальныхОстатков" Тогда 
				Возврат НСтр("ru='Ввод начальных остатков';uk='Введення початкових залишків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзменениеЗадолженности" Тогда 
				Возврат НСтр("ru='Изменение (формирование) задолженности';uk='Зміна (формування) заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносЗадолженности" Тогда 
				Возврат НСтр("ru='Перенос задолженности';uk='Перенесення заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроведениеВзаимозачета" Тогда 
				Возврат НСтр("ru='Проведение взаимозачета';uk='Проведення взаємозаліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеЗадолженности" Тогда 
				Возврат НСтр("ru='Списание безнадежной задолженности';uk='Списання безнадійної заборгованості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКорректировкаДолгаПоВозвратнойТаре" Тогда 
			Если ИмяДляПеревода = "Поставщика" Тогда 
				Возврат НСтр("ru='Поставщика';uk='Постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УПокупателя" Тогда 
				Возврат НСтр("ru='У покупателя';uk='У покупця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКорректировкаКачества" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товары" Тогда 
				Возврат НСтр("ru='Товары';uk='Товари'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКорректировкаСерийИХарактеристик" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товары" Тогда 
				Возврат НСтр("ru='Товары';uk='Товари'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийНалоговаяНакладная" Тогда 
			Если ИмяДляПеревода = "ИтоговаяРозницаОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Итоговая в рознице по операциям, облагаемым НДС';uk='Підсумкова в роздробі по операціях, оподатковуваних ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИтоговаяРозницаОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Итоговая в рознице по операциям, освобожденным от  НДС';uk='Підсумкова в роздробі по операціях, звільнених від  ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДСОперации" Тогда 
				Возврат НСтр("ru='Операции, не являющиеся объектом налогообложения';uk=""Операції, що не є об'єктом оподатковування""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Операции, облагаемые НДС';uk='Операції, оподатковувані ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Операции, освобожденные от  НДС';uk='Операції, звільнені від ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидента" Тогда 
				Возврат НСтр("ru='Работы от нерезидента';uk='Роботи від нерезидента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаКонрагентуОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Реализация в розницу плательщику НДС по облагаемому НДС';uk='Реалізація в роздріб платнику ПДВ по оподатковуваному ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаКонрагентуОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Реализация в розницу плательщику НДС по освобожденному НДС';uk='Реалізація в роздріб платнику ПДВ по звільненому ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Условная продажа';uk='Умовний продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажаСписаниеОС" Тогда 
				Возврат НСтр("ru='Условная продажа при списании ОС';uk='Умовний продаж при списанні ОЗ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПокупателю" Тогда 
				Возврат НСтр("ru='Возврат денежных средств покупателю';uk='Повернення грошових коштів покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПокупателя" Тогда 
				Возврат НСтр("ru='Оплата от покупателя';uk='Оплата від покупця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийОприходованиеТоваров" Тогда 
			Если ИмяДляПеревода = "БланкиСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Бланки строгого учета';uk='Бланки суворого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПродукция" Тогда 
				Возврат НСтр("ru='Товары, продукция';uk='Товари, продукція'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийОтчетОРозничныхПродажах" Тогда 
			Если ИмяДляПеревода = "ОтчетККМОПродажах" Тогда 
				Возврат НСтр("ru='ККМ';uk='ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетНТТОПродажах" Тогда 
				Возврат НСтр("ru='НТТ';uk='НТТ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПередачаТоваров" Тогда 
			Если ИмяДляПеревода = "ВПереработку" Тогда 
				Возврат НСтр("ru='Передача сырья в переработку';uk='Передача сировини в переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзПереработки" Тогда 
				Возврат НСтр("ru='Передача продукции заказчику';uk='Передача продукції замовнику'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПеремещениеТоваров" Тогда 
			Если ИмяДляПеревода = "БланкиСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Бланки строгого учета';uk='Бланки суворого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПродукция" Тогда 
				Возврат НСтр("ru='Товары';uk='Товари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПродукцияПоОрдерам" Тогда 
				Возврат НСтр("ru='Товары по ордерам';uk='Товари по ордерах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПереоценкаТоваровВРознице" Тогда 
			Если ИмяДляПеревода = "ПереоценкаВНТТ" Тогда 
				Возврат НСтр("ru='Переоценка в НТТ';uk='Переоцінка в НТТ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаВРознице" Тогда 
				Возврат НСтр("ru='Переоценка в рознице';uk='Переоцінка в роздробі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПКО" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПодотчетником" Тогда 
				Возврат НСтр("ru='Возврат денежных средств подотчетником';uk='Повернення грошових коштів підзвітною особою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствПоставщиком" Тогда 
				Возврат НСтр("ru='Возврат денежных средств поставщиком';uk='Повернення грошових коштів постачальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПокупателя" Тогда 
				Возврат НСтр("ru='Оплата от покупателя';uk='Оплата від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолучениеНаличныхДенежныхСредствВБанке" Тогда 
				Возврат НСтр("ru='Получение наличных денежных средств в банке';uk='Одержання готівки у банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриходДенежныхСредствПрочее" Тогда 
				Возврат НСтр("ru='Прочий приход денежных средств';uk='Інший прибуток грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриходДенежныхСредствРозничнаяВыручка" Тогда 
				Возврат НСтр("ru='Прием розничной выручки';uk='Прийом роздрібного виторгу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймамСКонтрагентами" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПланируемоеПоступлениеДС" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПоставщиком" Тогда 
				Возврат НСтр("ru='Возврат денежных средств поставщиком';uk='Повернення грошових коштів постачальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПокупателя" Тогда 
				Возврат НСтр("ru='Оплата от покупателя';uk='Оплата від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Покупка продажа валюты';uk='Покупка продаж валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриходДенежныхСредствРозничнаяВыручка" Тогда 
				Возврат НСтр("ru='Прием розничной выручки';uk='Прийом роздрібного виторгу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееПоступлениеДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочее поступление денежных средств';uk='Інше надходження грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймам" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПокупкаПродажаВалюты" Тогда 
			Если ИмяДляПеревода = "ПокупкаВалюты" Тогда 
				Возврат НСтр("ru='Покупка валюты';uk='Купівля валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаВалюты" Тогда 
				Возврат НСтр("ru='Продажа валюты';uk='Продаж валюти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПоступлениеБезналичныхДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПоставщиком" Тогда 
				Возврат НСтр("ru='Возврат денежных средств поставщиком';uk='Повернення грошових коштів постачальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнкассацияДенежныхСредств" Тогда 
				Возврат НСтр("ru='Инкассация денежных средств';uk='Інкасація грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПокупателя" Тогда 
				Возврат НСтр("ru='Оплата от покупателя';uk='Оплата від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Покупка продажа валюты';uk='Покупка продаж валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОплатыПоБанковскимКредитам" Тогда 
				Возврат НСтр("ru='Поступление оплаты по банковским кредитам';uk='Надходження оплати по банківських кредитах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОплатыПоПлатежнымКартам" Тогда 
				Возврат НСтр("ru='Поступление оплаты по платежным картам';uk='Надходження оплати по платіжних картах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеСредствОтФСС" Тогда 
				Возврат НСтр("ru='Поступление средств от ФСС';uk='Надходження коштів від ФСС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееПоступлениеБезналичныхДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочее поступление безналичных денежных средств';uk='Інше надходження безготівкових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймам" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПоступлениеТоваровУслуг" Тогда 
			Если ИмяДляПеревода = "БланкиСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Бланки строгого учета';uk='Бланки суворого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПереработку" Тогда 
				Возврат НСтр("ru='В переработку';uk='У переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектыСтроительства" Тогда 
				Возврат НСтр("ru='Объекты строительства';uk=""Об'єкти будівництва""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаКомиссия" Тогда 
				Возврат НСтр("ru='Покупка, комиссия';uk='Покупка, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПоступлениеТоваровУслугВНТТ" Тогда 
			Если ИмяДляПеревода = "ВнутреннееПеремещение" Тогда 
				Возврат НСтр("ru='Внутреннее перемещение';uk='Внутрішнє переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтПоставщика" Тогда 
				Возврат НСтр("ru='От поставщика';uk='Від постачальника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийППИсходящее" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПокупателю" Тогда 
				Возврат НСтр("ru='Возврат денежных средств покупателю';uk='Повернення грошових коштів покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереводНаДругойСчет" Тогда 
				Возврат НСтр("ru='Перевод на другой счет';uk='Переведення на інший рахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеДенежныхСредствПодотчетнику" Тогда 
				Возврат НСтр("ru='Перечисление денежных средств подотчетнику';uk='Перерахування грошових коштів підзвітній особі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеЗП" Тогда 
				Возврат НСтр("ru='Перечисление заработной платы';uk='Перерахування заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеНалога" Тогда 
				Возврат НСтр("ru='Перечисление налогов/взносов по заработной плате';uk='Перерахування податків/внесків по заробітній платі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Покупка продажа валюты';uk='Покупка продаж валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееСписаниеБезналичныхДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочее списание безналичных денежных средств';uk='Інше списання безготівкових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймамСКонтрагентами" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПриложение1КНалоговойНакладной" Тогда 
			Если ИмяДляПеревода = "НеНДСОперации" Тогда 
				Возврат НСтр("ru='Операции, не являющиеся объектом налогообложения';uk=""Операції, що не є об'єктом оподатковування""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Операции, облагаемые НДС';uk='Операції, оподатковувані ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Операции, освобожденные от  НДС';uk='Операції, звільнені від ПДВ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПриложение2КНалоговойНакладной" Тогда 
			Если ИмяДляПеревода = "ИтоговаяРозницаОблагаемыеОперацииВозврат" Тогда 
				Возврат НСтр("ru='Итоговая в рознице по облагаемому НДС (возврат)';uk='Підсумкова в роздробі по оподатковуваному ПДВ (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИтоговаяРозницаОсвобожденныеОперацииВозврат" Тогда 
				Возврат НСтр("ru='Итоговая в рознице по освобожденному НДС  (возврат)';uk='Підсумкова в роздробі по звільненому ПДВ  (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДСОперацииВозврат" Тогда 
				Возврат НСтр("ru='Операции, не являющиеся объектом налогообложения (возврат)';uk=""Операції, що не є об'єктом оподатковування (повернення)""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДСОперацииКорректировка" Тогда 
				Возврат НСтр("ru='Операции, не являющиеся объектом налогообложения (корректировка)';uk=""Операції, що не є об'єктом оподатковування (коригування)""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыеОперацииВозврат" Тогда 
				Возврат НСтр("ru='Операции, облагаемые НДС (возврат)';uk='Операції, оподатковувані ПДВ (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыеОперацииКорректировка" Тогда 
				Возврат НСтр("ru='Операции, облагаемые НДС (корректировка)';uk='Операції, оподатковувані ПДВ (коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныеОперацииВозврат" Тогда 
				Возврат НСтр("ru='Операции, освобожденные от  НДС (возврат)';uk='Операції, звільнені від ПДВ (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныеОперацииКорректировка" Тогда 
				Возврат НСтр("ru='Операции, освобожденные от  НДС (корректировка)';uk='Операції, звільнені від ПДВ (коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидентаКорректировка" Тогда 
				Возврат НСтр("ru='Работы от нерезидента корректировка';uk='Роботи від нерезидента коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаКонрагентуОблагаемыеОперацииВозврат" Тогда 
				Возврат НСтр("ru='Возврат в розницу плательщику НДС по облагаемому НДС';uk='Повернення в роздріб платнику ПДВ по оподатковуваному ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаКонрагентуОсвобожденныеОперацииВозврат" Тогда 
				Возврат НСтр("ru='Возврат в розницу плательщику НДС по освобожденному НДС';uk='Повернення в роздріб платнику ПДВ по звільненому ПДВ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПринятияКУчетуНМА" Тогда 
			Если ИмяДляПеревода = "ВводНачальныхОстатков" Тогда 
				Возврат НСтр("ru='Ввод начальных остатков';uk='Введення початкових залишків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НематериальныеАктивы" Тогда 
				Возврат НСтр("ru='Нематериальные активы';uk='Нематеріальні активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектыСтроительства" Тогда 
				Возврат НСтр("ru='Объекты строительства';uk=""Об'єкти будівництва""" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПринятияКУчетуОсновныхСредств" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектыСтроительства" Тогда 
				Возврат НСтр("ru='Объекты строительства';uk=""Об'єкти будівництва""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРезультатамИнвентаризации" Тогда 
				Возврат НСтр("ru='По результатам инвентаризации';uk='За результатами інвентаризації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПриходныйОрдер" Тогда 
			Если ИмяДляПеревода = "ОтПодотчетника" Тогда 
				Возврат НСтр("ru='От подотчетника';uk='Від підзвітної особи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтПокупателя" Тогда 
				Возврат НСтр("ru='От покупателя';uk='Від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтПоставщика" Тогда 
				Возврат НСтр("ru='От поставщика';uk='Від постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Перемещение" Тогда 
				Возврат НСтр("ru='Перемещение';uk='Переміщення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРасходныйОрдер" Тогда 
			Если ИмяДляПеревода = "ВозвратПоПриходномуОрдеру" Тогда 
				Возврат НСтр("ru='Возврат по приходному ордеру';uk='Повернення по прибутковому ордеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Возврат поставщику';uk='Повернення постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Перемещение" Тогда 
				Возврат НСтр("ru='Перемещение';uk='Переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходПоНакладной" Тогда 
				Возврат НСтр("ru='Расход по накладной';uk='Видаток по накладній'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРасчетаКосвенныхРасходов" Тогда 
			Если ИмяДляПеревода = "ВыпускПродукцииИУслуг" Тогда 
				Возврат НСтр("ru='Выпуск продукции и услуг';uk='Випуск продукції й послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспределениеОбщепроизводственныхРасходов" Тогда 
				Возврат НСтр("ru='Распределение общепроизводственных расходов';uk='Розподіл загальновиробничих витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспределениеОбщехозяйственныхРасходов" Тогда 
				Возврат НСтр("ru='Распределение общехозяйственных расходов';uk='Розподіл загальногосподарських витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УслугиБезИспользованияПлановыхЦен" Тогда 
				Возврат НСтр("ru='Услуги без использования плановых цен';uk='Послуги без використання планових цін'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРасчетаСебестоимости" Тогда 
			Если ИмяДляПеревода = "ВыпускПродукцииИУслуг" Тогда 
				Возврат НСтр("ru='Выпуск продукции и услуг';uk='Випуск продукції й послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыНаПроизводствоПродукцииИУслуг" Тогда 
				Возврат НСтр("ru='Расходы на производство продукции и услуг';uk='Витрати на виробництво продукції й послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УслугиБезИспользованияПлановыхЦен" Тогда 
				Возврат НСтр("ru='Услуги без использования плановых цен';uk='Послуги без використання планових цін'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРеализацияТоваров" Тогда 
			Если ИмяДляПеревода = "Брак" Тогда 
				Возврат НСтр("ru='Брак';uk='Брак'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаКомиссия" Тогда 
				Возврат НСтр("ru='Продажа, комиссия';uk='Продаж, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРегистрацияАвансовВНалоговомУчете" Тогда 
			Если ИмяДляПеревода = "АвансВозвратОпределениеПараметровНУ" Тогда 
				Возврат НСтр("ru='Аванс (возврат): определение параметров НУ';uk='Аванс (повернення): визначення параметрів ПО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АвансОпределениеПараметровНУ" Тогда 
				Возврат НСтр("ru='Аванс: определение параметров НУ';uk='Аванс: визначення параметрів ПО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаВозвратОтменаРегистрацииВНУ" Тогда 
				Возврат НСтр("ru='Отгрузка (возврат): отмена регистрации в НУ';uk='Відвантаження (повернення): скасування реєстрації в ПО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаОтменаРегистрацииВНУ" Тогда 
				Возврат НСтр("ru='Отгрузка: отмена регистрации в НУ';uk='Відвантаження: скасування реєстрації в ПО'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента" Тогда 
			Если ИмяДляПеревода = "BeксeльПpoшлoгoПepиoдa" Тогда 
				Возврат НСтр("ru='Вeксeль, погашенный  в пpoшлoм пepиoде или досрочно';uk='Вeксeль, погашений  в попередньому періоді або достроково'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВосстановлениеНалоговогоКредита" Тогда 
				Возврат НСтр("ru='Восстановление налогового кредита';uk='Відновлення податкового кредиту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсправлениеОшибки" Тогда 
				Возврат НСтр("ru='Исправление ошибки';uk='Виправлення помилки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговаяНакладная" Тогда 
				Возврат НСтр("ru='Налоговая накладная';uk='Податкова накладна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеНалоговогоВекселя" Тогда 
				Возврат НСтр("ru='Погашение налогового векселя';uk='Погашення податкового векселя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидентаПрошлогоПериода" Тогда 
				Возврат НСтр("ru='Работы от нерезидента прошлого периода';uk='Роботи від нерезидента минулого періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКорректировкиВозврат" Тогда 
				Возврат НСтр("ru='Расчет корректировки (возврат)';uk='Розрахунок коригування (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКорректировкиКорректировка" Тогда 
				Возврат НСтр("ru='Расчет корректировки (изменение суммы компенсации)';uk='Розрахунок коригування (зміна суми компенсації)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаможенноеОформлениеТоваровКомитента" Тогда 
				Возврат НСтр("ru='Таможенное оформление товаров комитента (право на кредит)';uk='Митне оформлення товарів комітента (право на кредит)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварныйЧек" Тогда 
				Возврат НСтр("ru='Прочее (товарный чек и т. п.)';uk='Інше (товарний чек і т.п.)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРезервированиеТоваров" Тогда 
			Если ИмяДляПеревода = "ПоЗаказам" Тогда 
				Возврат НСтр("ru='По заказам';uk='По замовленнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСкладам" Тогда 
				Возврат НСтр("ru='По складам';uk='По складах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСкладамИЗаказам" Тогда 
				Возврат НСтр("ru='По складам и заказам';uk='По складах і замовленням'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРКО" Тогда 
			Если ИмяДляПеревода = "ВзносНаличнымиВБанк" Тогда 
				Возврат НСтр("ru='Взнос наличными в банк';uk='Внесок готівкою в банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствПокупателю" Тогда 
				Возврат НСтр("ru='Возврат денежных средств покупателю';uk='Повернення грошових коштів покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствКассеККМ" Тогда 
				Возврат НСтр("ru='Выдача денежных средств в кассу ККМ';uk='Видача грошових коштів в касу ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствПодотчетнику" Тогда 
				Возврат НСтр("ru='Выдача денежных средств подотчетнику';uk='Видача грошових коштів підзвітній особі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗаработнойПлатыПоВедомостям" Тогда 
				Возврат НСтр("ru='Выплата заработной платы по ведомостям';uk='Виплата заробітної плати по відомостях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗаработнойПлатыРаботнику" Тогда 
				Возврат НСтр("ru='Выплата заработной платы работнику';uk='Виплата заробітної плати працівнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнкассацияДенежныхСредств" Тогда 
				Возврат НСтр("ru='Инкассация денежных средств';uk='Інкасація грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходДенежныхСредствПрочее" Тогда 
				Возврат НСтр("ru='Прочий расход денежных средств';uk='Інше витрачання грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймамСКонтрагентами" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийСписаниеБезналичныхДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "ВозвратДенежныхСредствПокупателю" Тогда 
				Возврат НСтр("ru='Возврат денежных средств покупателю';uk='Повернення грошових коштів покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереводНаДругойСчет" Тогда 
				Возврат НСтр("ru='Перевод на другой счет';uk='Переведення на інший рахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеДенежныхСредствПодотчетнику" Тогда 
				Возврат НСтр("ru='Перечисление денежных средств подотчетнику';uk='Перерахування грошових коштів підзвітній особі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеЗП" Тогда 
				Возврат НСтр("ru='Перечисление заработной платы';uk='Перерахування заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеНалога" Тогда 
				Возврат НСтр("ru='Перечисление налогов/взносов по заработной плате';uk='Перерахування податків/внесків по заробітній платі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Покупка продажа валюты';uk='Покупка продаж валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееСписаниеБезналичныхДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочее списание безналичных денежных средств';uk='Інше списання безготівкових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Прочие расчеты с контрагентами';uk='Інші розрахунки з контрагентами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоКредитамИЗаймам" Тогда 
				Возврат НСтр("ru='Расчеты по кредитам и займам с контрагентами';uk='Розрахунки за кредитами і позиками з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийСписаниеТоваров" Тогда 
			Если ИмяДляПеревода = "БланкиСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Бланки строгого учета';uk='Бланки суворого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПродукция" Тогда 
				Возврат НСтр("ru='Товары, продукция';uk='Товари, продукція'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийСчетНаОплатуПоставщика" Тогда 
			Если ИмяДляПеревода = "БланкиСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Бланки строгого учета';uk='Бланки суворого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектыСтроительства" Тогда 
				Возврат НСтр("ru='Объекты строительства';uk=""Об'єкти будівництва""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаКомиссия" Тогда 
				Возврат НСтр("ru='Покупка, комиссия';uk='Покупка, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийТребованиеНакладная" Тогда 
			Если ИмяДляПеревода = "Материалы" Тогда 
				Возврат НСтр("ru='Материалы';uk='Матеріали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийУстановкаНаценокПоУсловиямПродаж" Тогда 
			Если ИмяДляПеревода = "ПоНоменклатурнымГруппам" Тогда 
				Возврат НСтр("ru='По номенклатурным группам';uk='По номенклатурних групах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЦеновымГруппам" Тогда 
				Возврат НСтр("ru='По ценовым группам';uk='По цінових групах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийУстановкаСкидокНоменклатуры" Тогда 
			Если ИмяДляПеревода = "НатуральныеСкидки" Тогда 
				Возврат НСтр("ru='Натуральные скидки';uk='Натуральні знижки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНоменклатуре" Тогда 
				Возврат НСтр("ru='По номенклатуре';uk='По номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЦеновымГруппам" Тогда 
				Возврат НСтр("ru='По ценовым группам';uk='По цінових групах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей" Тогда 
			Если ИмяДляПеревода = "ПоНоменклатурнымГруппам" Тогда 
				Возврат НСтр("ru='По номенклатурным группам';uk='По номенклатурних групах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЦеновымГруппам" Тогда 
				Возврат НСтр("ru='По ценовым группам';uk='По цінових групах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЧекККМ" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Чек на возврат';uk='Чек на повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продажа" Тогда 
				Возврат НСтр("ru='Продажа';uk='Продаж'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОстатковНДСПриобретенийОжидаемый" Тогда 
			Если ИмяДляПеревода = "ЕщеНеПолучены" Тогда 
				Возврат НСтр("ru='Еще не полученные нал. док-ты (не требуется корректировка)';uk='Ще не отримані под. док-ти (не потрібне коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеБудутПолучены" Тогда 
				Возврат НСтр("ru='Нал. док-ты не будут получены (требуется корректировка)';uk='Под.док-ти не будуть отримані (потрібне коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПравильнаяРегистрация" Тогда 
				Возврат НСтр("ru='Правильное оформление нал. док-тов (корректируют неправильно оформленные)';uk='Правильне оформлення под. док-тів (коригують неправильно оформлені)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОстатковНДСПриобретенийПодтвержденный" Тогда 
			Если ИмяДляПеревода = "НеправильноЗарегистрированы" Тогда 
				Возврат НСтр("ru='Неправильно оформленные нал. док-ты (требуется корректировка)';uk='Неправильно оформлені под. док-ти (потрібне коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученыЗаранее" Тогда 
				Возврат НСтр("ru='Полученные заранее нал. док-ты (не требуется корректировка)';uk='Отримані заздалегідь под. док-ти (коригування не потрібне)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученыИзлишне" Тогда 
				Возврат НСтр("ru='Излишне полученные нал. док-ты (требуется корректировка)';uk='Зайво отримані под. док-ти (потрібне коригування)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОстатковНДСПродажОжидаемый" Тогда 
			Если ИмяДляПеревода = "ЕщеНеВыписаны" Тогда 
				Возврат НСтр("ru='Еще не выписанные нал. док-ты (не требуется корректировки)';uk='Ще не виписані под. док-ти (не потрібне коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПравильнаяРегистрация" Тогда 
				Возврат НСтр("ru='Правильное оформление нал. док-тов (корректируют неправильно оформленные)';uk='Правильне оформлення под. док-тів (коригують неправильно оформлені)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОстатковНДСПродажПодтвержденный" Тогда 
			Если ИмяДляПеревода = "ВыписаныЗаранее" Тогда 
				Возврат НСтр("ru='Заранее выписанные нал. док-ты (не требуется корректировка)';uk='Заздалегідь виписані под. док-ти (не потрібне коригування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеправильноЗарегистрированы" Тогда 
				Возврат НСтр("ru='Неправильно оформленные нал. док-ты (требуется корректировка)';uk='Неправильно оформлені под. док-ти (потрібне коригування)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОтраженияВУчете" Тогда 
			Если ИмяДляПеревода = "ОтражатьВБухгалтерскомУчете" Тогда 
				Возврат НСтр("ru='Отражать в бухгалтерском учете';uk='Відображати в бухгалтерському обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражатьВУправленческомУчете" Тогда 
				Возврат НСтр("ru='Отражать в управленческом учете';uk='Відображати в управлінському обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОтчетности" Тогда 
			Если ИмяДляПеревода = "ОтчетностьПоМСФО" Тогда 
				Возврат НСтр("ru='Отчетность по МСФО';uk='Звітність по МСФЗ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегламентированнаяОтчетность" Тогда 
				Возврат НСтр("ru='Регламентированная отчетность';uk='Регламентована звітність'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОтчетовПоПлатежамКомиссия" Тогда 
			Если ИмяДляПеревода = "Аванс" Тогда 
				Возврат НСтр("ru='Аванс';uk='Аванс'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетАванса" Тогда 
				Возврат НСтр("ru='Зачет аванса';uk='Залік авансу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оплата" Тогда 
				Возврат НСтр("ru='Оплата';uk='Оплата'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПередачиТоваров" Тогда 
			Если ИмяДляПеревода = "ПоОрдеру" Тогда 
				Возврат НСтр("ru='По ордеру';uk='По ордеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоСклада" Тогда 
				Возврат НСтр("ru='Со склада';uk='Зі складу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПланирования" Тогда 
			Если ИмяДляПеревода = "Закупки" Тогда 
				Возврат НСтр("ru='Закупки';uk='Купівлі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продажи" Тогда 
				Возврат НСтр("ru='Продажи';uk='Продажі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПоказателейСхемМотивации" Тогда 
			Если ИмяДляПеревода = "Индивидуальный" Тогда 
				Возврат НСтр("ru='Для сотрудника';uk='Для співробітника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Общий" Тогда 
				Возврат НСтр("ru='Для всей компании (организации)';uk='Для всієї компанії (організації)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПодразделению" Тогда 
				Возврат НСтр("ru='Для подразделения';uk='Для підрозділу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПоступленияТоваров" Тогда 
			Если ИмяДляПеревода = "НаСклад" Тогда 
				Возврат НСтр("ru='На склад';uk='На склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОрдеру" Тогда 
				Возврат НСтр("ru='По ордеру';uk='По ордеру'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПремии" Тогда 
			Если ИмяДляПеревода = "ГодоваяПремия" Тогда 
				Возврат НСтр("ru='Является годовой премией';uk='Є річною премією'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПремия" Тогда 
				Возврат НСтр("ru='Не является премией';uk='Не є премією'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Премия" Тогда 
				Возврат НСтр("ru='Является премией';uk='Є премією'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияЗаТекущийМесяц" Тогда 
				Возврат НСтр("ru='Является премией (за текущий месяц)';uk='Є премією (за поточний місяць)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияПропорционально" Тогда 
				Возврат НСтр("ru='Является премией, которая учитывается пропорционально';uk='Є премією, яка враховується пропорційно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияПропорциональноЗаТекущийМесяц" Тогда 
				Возврат НСтр("ru='Является премией (за текущий месяц), которая учитывается пропорционально';uk='Є премією (за поточний місяць), яка враховується пропорційно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПроизвольныхОтчетов" Тогда 
			Если ИмяДляПеревода = "ПоказательМонитораЭффективности" Тогда 
				Возврат НСтр("ru='Показатель монитора эффективности';uk='Показник монітора ефективності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоказательМонитораЭффективностиПланФакт" Тогда 
				Возврат НСтр("ru='Показатель монитора эффективности (план-факт)';uk='Показник монітора ефективності ( план-факт)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоказательМонитораЭффективностиПрогноз" Тогда 
				Возврат НСтр("ru='Показатель монитора эффективности (прогноз)';uk='Показник монітора ефективності (прогноз)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольныйОтчет" Тогда 
				Возврат НСтр("ru='Произвольный отчет';uk='Довільний звіт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПрочихСчетовУчета" Тогда 
			Если ИмяДляПеревода = "СчетДоходовВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Счет доходов при возврате поставщику';uk='Рахунок доходів при поверненні постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетДоходовКурсоваяРазницаПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Счет доходов по разнице курсов при продаже валюты';uk='Рахунок доходів по різниці курсів при продажу валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетДоходовСебестоимостьПродажаВалюты" Тогда 
				Возврат НСтр("ru='Счет доходов при покупке/продаже валюты';uk='Рахунок доходів при покупці/продажу валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетДтСписаниеЗадолженностиКорректировкаДолга" Тогда 
				Возврат НСтр("ru='Счет списания безнадежной дебиторской задолженности';uk='Рахунок списання безнадійної дебіторської заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Счет затрат при возврате поставщику';uk='Рахунок витрат при поверненні постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратКомиссионныеПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Счет затрат по комиссионным банка при покупке/продаже валюты';uk='Рахунок витрат по комисійним банку при покупці/продажу валюти '" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратКурсоваяРазницаПокупкаПродажаВалюты" Тогда 
				Возврат НСтр("ru='Счет затрат по разнице курсов при продаже валюты';uk='Рахунок витрат по різниці курсів при продажу валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратОтчетКомиссионераОПродажах" Тогда 
				Возврат НСтр("ru='Счет расходов по вознагражению в отчете комиссионера о продажах';uk='Рахунок витрат по винагророді в звіті комісіонера про продажі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратПенсионныйПродажаВалюты" Тогда 
				Возврат НСтр("ru='Счет затрат пенсионный при продаже валюты';uk='Рахунок витрат пенсійний при продажу валюти '" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратПоНДСПриСписанииВозвратнойТарыПоставщика" Тогда 
				Возврат НСтр("ru='Счет затрат по НДС при списании возвратной тары поставщика';uk='Рахунок витрат по ПДВ при списанню зворотної тари постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗатратСебестоимостьПродажаВалюты" Тогда 
				Возврат НСтр("ru='Счет затрат при покупке/продаже валюты';uk='Рахунок витрат при покупці/продажу валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетКтСписаниеЗадолженностиКорректировкаДолга" Тогда 
				Возврат НСтр("ru='Счет списания безнадежной кредиторской  задолженности';uk='Рахунок списання безнадійної кредиторської заборгованості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРабочихГрафиков" Тогда 
			Если ИмяДляПеревода = "Пятидневка" Тогда 
				Возврат НСтр("ru='Пятидневка';uk=""П'ятиденка""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сменный" Тогда 
				Возврат НСтр("ru='Сменный';uk='Змінний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Шестидневка" Тогда 
				Возврат НСтр("ru='Шестидневка';uk='Шестиденка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРасчетовПоДоговорам" Тогда 
			Если ИмяДляПеревода = "РасчетыВВалютеРегламентированногоУчета" Тогда 
				Возврат НСтр("ru='Расчеты в валюте регламентированного учета (с резидентами)';uk='Розрахунки у валюті регламентованого обліку (з резидентами)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыВИностраннойВалюте" Тогда 
				Возврат НСтр("ru='Расчеты в иностранной валюте (с нерезидентами)';uk='Розрахунки в іноземній валюті (з нерезидентами)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРасчетовПоСредствамФСС" Тогда 
			Если ИмяДляПеревода = "НеПринято" Тогда 
				Возврат НСтр("ru='Не принято к зачету';uk='Не прийнято до зарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречисленоСтрахователем" Тогда 
				Возврат НСтр("ru='Перечислено страхователем';uk='Перераховано страхувальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованию" Тогда 
				Возврат НСтр("ru='Расходы по страхованию';uk='Витрати по страхуванню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРасчетовСКонтрагентами" Тогда 
			Если ИмяДляПеревода = "ПоПриобретению" Тогда 
				Возврат НСтр("ru='По приобретению';uk='По придбанню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРеализации" Тогда 
				Возврат НСтр("ru='По реализации';uk='По реалізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРасчетовСКонтрагентамиНалоговыйУчет" Тогда 
			Если ИмяДляПеревода = "НеПодлежатПереоценке" Тогда 
				Возврат НСтр("ru='Не подлежат переоценке';uk='Не підлягають переоцінці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодлежатПереоценке" Тогда 
				Возврат НСтр("ru='Подлежат переоценке';uk='Підлягають переоцінці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРозничнойВыручки" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаБанковскимиКредитами" Тогда 
				Возврат НСтр("ru='Оплата банковскими кредитами';uk='Оплата банківськими кредитами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПлатежнымиКартами" Тогда 
				Возврат НСтр("ru='Оплата платежными картами';uk='Оплата платіжними картами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продажа" Тогда 
				Возврат НСтр("ru='Продажа';uk='Продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазменнаяМонета" Тогда 
				Возврат НСтр("ru='Разменная монета';uk='Розмінна монета'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСкидок" Тогда 
			Если ИмяДляПеревода = "Оптовая" Тогда 
				Возврат НСтр("ru='Оптовая';uk='Оптова'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Розничная" Тогда 
				Возврат НСтр("ru='Розничная';uk='Роздрібна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСкладов" Тогда 
			Если ИмяДляПеревода = "НТТ" Тогда 
				Возврат НСтр("ru='НТТ';uk='НТТ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оптовый" Тогда 
				Возврат НСтр("ru='Оптовый';uk='Гуртовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Розничный" Тогда 
				Возврат НСтр("ru='Розничный';uk='Роздрібний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСобственныхКонтрагентов" Тогда 
			Если ИмяДляПеревода = "Организация" Тогда 
				Возврат НСтр("ru='Организация';uk='Організація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФизЛицо" Тогда 
				Возврат НСтр("ru='Физ. лицо';uk='Фіз. особа'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСобытий" Тогда 
			Если ИмяДляПеревода = "ЛичнаяВстреча" Тогда 
				Возврат НСтр("ru='Личная встреча';uk='Особиста зустріч'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПочтовоеПисьмо" Тогда 
				Возврат НСтр("ru='Почтовое письмо';uk='Поштовий лист'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТелефонныйЗвонок" Тогда 
				Возврат НСтр("ru='Телефонный звонок';uk='Телефонний дзвінок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлектронноеПисьмо" Тогда 
				Возврат НСтр("ru='Электронное письмо';uk='Електронний лист'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСобытийОС" Тогда 
			Если ИмяДляПеревода = "ВводВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Ввод в эксплуатацию';uk='Введення в експлуатацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутреннееПеремещение" Тогда 
				Возврат НСтр("ru='Внутреннее перемещение';uk='Внутрішнє переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Модернизация" Тогда 
				Возврат НСтр("ru='Модернизация';uk='Модернізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеАмортизации" Тогда 
				Возврат НСтр("ru='Начисление амортизации';uk='Нарахування амортизації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Передача" Тогда 
				Возврат НСтр("ru='Передача';uk='Передача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодготовкаКПередаче" Тогда 
				Возврат НСтр("ru='Подготовка к передаче';uk='Підготовка до передачі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ремонт" Тогда 
				Возврат НСтр("ru='Ремонт';uk='Ремонт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Списание" Тогда 
				Возврат НСтр("ru='Списание';uk='Списання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичнаяЛиквидация" Тогда 
				Возврат НСтр("ru='Частичная ликвидация';uk='Часткова ліквідація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСообщений" Тогда 
			Если ИмяДляПеревода = "ВажнаяИнформация" Тогда 
				Возврат НСтр("ru='Важная информация';uk='Важлива інформація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Информация" Тогда 
				Возврат НСтр("ru='Информация';uk='Інформація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ошибка" Тогда 
				Возврат НСтр("ru='Ошибка';uk='Помилка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Раздел" Тогда 
				Возврат НСтр("ru='Раздел';uk='Розділ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСостоянийНМА" Тогда 
			Если ИмяДляПеревода = "Поступил" Тогда 
				Возврат НСтр("ru='Поступил';uk='Надійшов'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятКУчету" Тогда 
				Возврат НСтр("ru='Принят к учету';uk='Прийнятий до обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Списан" Тогда 
				Возврат НСтр("ru='Списан';uk='Списаний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСправокОДоходах" Тогда 
			Если ИмяДляПеревода = "Безработица" Тогда 
				Возврат НСтр("ru='Для расчета выплат по безработице';uk='Для розрахунку виплат по безробіттю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходыИНалоги" Тогда 
				Возврат НСтр("ru='Справка о начисленных доходах и налогах';uk='Довідка про нараховані доходи та податки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пенсия" Тогда 
				Возврат НСтр("ru='Для расчета пенсии';uk='Для розрахунку пенсії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Произвольная" Тогда 
				Возврат НСтр("ru='Справка в свободной форме';uk='Довідка у вільній формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Соцстрах" Тогда 
				Возврат НСтр("ru='Для назначения помощи по нетрудоспособности';uk='Для призначення допомоги по непрацездатності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Субсидия" Тогда 
				Возврат НСтр("ru='Для оформления субсидии';uk='Для оформлення субсидії'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтавокНДФЛ" Тогда 
			Если ИмяДляПеревода = "Двойная" Тогда 
				Возврат НСтр("ru='Двойная';uk='Подвійна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОблагается" Тогда 
				Возврат НСтр("ru='Не облагается';uk='Не оподатковується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Основная" Тогда 
				Возврат НСтр("ru='Основная';uk='Основна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтавкаШахтеров" Тогда 
				Возврат НСтр("ru='Ставка шахтеров';uk='Ставка шахтарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увеличенная" Тогда 
				Возврат НСтр("ru='Увеличенная';uk='Збільшена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Уменьшенная" Тогда 
				Возврат НСтр("ru='Уменьшенная';uk='Зменшена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтоимости" Тогда 
			Если ИмяДляПеревода = "Отклонение" Тогда 
				Возврат НСтр("ru='Отклонение';uk='Відхилення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Плановая" Тогда 
				Возврат НСтр("ru='Выпуск по плановой стоимости';uk='Випуск по плановій вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Фактическая" Тогда 
				Возврат НСтр("ru='Выпуск по фактической стоимости';uk='Випуск по фактичній вартості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТабличныхЧастей" Тогда 
			Если ИмяДляПеревода = "БланкиСтрогогоУчета" Тогда 
				Возврат НСтр("ru='Бланки строгого учета';uk='Бланки суворого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Материалы" Тогда 
				Возврат НСтр("ru='Материалы';uk='Матеріали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериалыЗаказчика" Тогда 
				Возврат НСтр("ru='Материалы заказчика';uk='Матеріали замовника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Тара" Тогда 
				Возврат НСтр("ru='Тара';uk='Тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товары" Тогда 
				Возврат НСтр("ru='Товары';uk='Товари'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТарифныхСтавок" Тогда 
			Если ИмяДляПеревода = "Дневная" Тогда 
				Возврат НСтр("ru='Дневная';uk='Денна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месячная" Тогда 
				Возврат НСтр("ru='Месячная';uk='Місячна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Часовая" Тогда 
				Возврат НСтр("ru='Часовая';uk='Годинна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТекстовЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "HTML" Тогда 
				Возврат НСтр("ru='HTML';uk='HTML'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "HTMLСКартинками" Тогда 
				Возврат НСтр("ru='HTML с картинками';uk='HTML з картинками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Текст" Тогда 
				Возврат НСтр("ru='Простой текст';uk='Простий текст'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТорговогоОборудования" Тогда 
			Если ИмяДляПеревода = "ДисплейПокупателя" Тогда 
				Возврат НСтр("ru='Дисплей покупателя';uk='Дисплей покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ККМOffLine" Тогда 
				Возврат НСтр("ru='ККМ Offline';uk='ККМ Offlіne'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ККМOnLine" Тогда 
				Возврат НСтр("ru='ККМ Online';uk='ККМ Onlіne'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СканерШтрихКода" Тогда 
				Возврат НСтр("ru='Сканер штрихкода';uk='Сканер штрихкода'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчитывательRFIDМеток" Тогда 
				Возврат НСтр("ru='Считыватель RFID меток';uk='Зчитувач RFІD міток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчитывательМагнитныхКарт" Тогда 
				Возврат НСтр("ru='Считыватель магнитных карт';uk='Зчитувач магнітних карт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТерминалСбораДанных" Тогда 
				Возврат НСтр("ru='Терминал сбора данных';uk='Термінал збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФискальныйРегистратор" Тогда 
				Возврат НСтр("ru='Фискальный регистратор';uk='Фіскальний реєстратор'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭквайринговаяСистема" Тогда 
				Возврат НСтр("ru='Эквайринговая система';uk='Еквайрингова система'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлектронныеВесы" Тогда 
				Возврат НСтр("ru='Электронные весы';uk='Електронні ваги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлектронныеВесыOffline" Тогда 
				Возврат НСтр("ru='Электронные весы Offline';uk='Електронні ваги Offlіne'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУлучшения" Тогда 
			Если ИмяДляПеревода = "Модернизация" Тогда 
				Возврат НСтр("ru='Модернизация';uk='Модернізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ремонт" Тогда 
				Возврат НСтр("ru='Ремонт';uk='Ремонт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУсловийДоговоровВзаиморасчетов" Тогда 
			Если ИмяДляПеревода = "БезДополнительныхУсловий" Тогда 
				Возврат НСтр("ru='Без дополнительных условий';uk='Без додаткових умов'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СДополнительнымиУсловиями" Тогда 
				Возврат НСтр("ru='С дополнительными условиями';uk='З додатковими умовами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУсловийОбязательныхОтветов" Тогда 
			Если ИмяДляПеревода = "Больше" Тогда 
				Возврат НСтр("ru='Больше';uk='Більше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БольшеИлиРавно" Тогда 
				Возврат НСтр("ru='Больше или равно';uk='Більше або дорівнює'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВСписке" Тогда 
				Возврат НСтр("ru='В списке';uk='У списку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛюбоеЗначение" Тогда 
				Возврат НСтр("ru='Любое значение';uk='Будь-яке значення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Меньше" Тогда 
				Возврат НСтр("ru='Меньше';uk='Менше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МеньшеИлиРавно" Тогда 
				Возврат НСтр("ru='Меньше или равно';uk='Менше або дорівнює'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВСписке" Тогда 
				Возврат НСтр("ru='Не в списке';uk='Не в списку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеРавно" Тогда 
				Возврат НСтр("ru='Не равно';uk='Не дорівнює'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПустоеЗначение" Тогда 
				Возврат НСтр("ru='Пустое значение';uk='Порожнє значення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Равно" Тогда 
				Возврат НСтр("ru='Равно';uk='Дорівнює'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУчетаВремени" Тогда 
			Если ИмяДляПеревода = "ПоВечернимЧасам" Тогда 
				Возврат НСтр("ru='По вечерним часам';uk='По вечірнім годинам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДням" Тогда 
				Возврат НСтр("ru='По дням';uk='По днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНочнымЧасам" Тогда 
				Возврат НСтр("ru='По ночным часам';uk='По нічним годинам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЧасам" Тогда 
				Возврат НСтр("ru='По часам';uk='По годинам'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУчетаВремениДляСредней" Тогда 
			Если ИмяДляПеревода = "ПоКалендарнымДням" Тогда 
				Возврат НСтр("ru='По кал. дн. с вычетом праздников';uk='По кал. дн. з відрахуванням свят'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоКалендарнымДнямСПраздниками" Тогда 
				Возврат НСтр("ru='По кал. дн. без вычета пр.';uk='По кал. дн. без відрахування ін.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРабочимДням" Тогда 
				Возврат НСтр("ru='По рабочим дням';uk='По робочих днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРабочимЧасам" Тогда 
				Возврат НСтр("ru='По рабочим часам';uk='По робочим годинам'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВходящееИсходящееСобытие" Тогда 
			Если ИмяДляПеревода = "Входящее" Тогда 
				Возврат НСтр("ru='Входящее';uk='Вхідне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Исходящее" Тогда 
				Возврат НСтр("ru='Исходящее';uk='Вихідне'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВыплаченностьЗарплаты" Тогда 
			Если ИмяДляПеревода = "Выплачено" Тогда 
				Возврат НСтр("ru='Выплачено';uk='Виплачено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Задепонировано" Тогда 
				Возврат НСтр("ru='Задепонировано';uk='Задепоновано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыплачено" Тогда 
				Возврат НСтр("ru='Не выплачено';uk='Не виплачено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГодностьКВоеннойСлужбе" Тогда 
			Если ИмяДляПеревода = "Годен" Тогда 
				Возврат НСтр("ru='Годен к военной службе';uk='Придатний до військової служби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГоденКНестроевой" Тогда 
				Возврат НСтр("ru='Не годен в мирное время, ограниченно годен в военное время';uk='Непридатний у мирний час, обмежено придатний у воєнний час'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВременноНегоден" Тогда 
				Возврат НСтр("ru='Временно негоден';uk='Тимчасово непридатний'" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыВоинскогоУчета" Тогда 
			Если ИмяДляПеревода = "ВМС" Тогда 
				Возврат НСтр("ru='ВМС';uk='ВМС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГПС" Тогда 
				Возврат НСтр("ru='ГПС';uk='ГПС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МВД" Тогда 
				Возврат НСтр("ru='МВД';uk='МВС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НВО" Тогда 
				Возврат НСтр("ru='НВО';uk='НПО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СБУ" Тогда 
				Возврат НСтр("ru='СБУ';uk='СБУ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыИнвалидности" Тогда 
			Если ИмяДляПеревода = "ВтораяГруппа" Тогда 
				Возврат НСтр("ru='Вторая (II)';uk='Друга (ІІ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерваяГруппа" Тогда 
				Возврат НСтр("ru='Первая (I)';uk='Перша (І)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТретьяГруппа" Тогда 
				Возврат НСтр("ru='Третья (III)';uk='Третя (ІІІ)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыНалоговыхНазначений" Тогда 
			Если ИмяДляПеревода = "НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС" Тогда 
				Возврат НСтр("ru='Активов и взаиморасчетов по НДС';uk='Активів і взаєморозрахунків по ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеНазначенияДоНКУ" Тогда 
				Возврат НСтр("ru='до 01.04.2011 (устаревшие)';uk='до 01.04.2011 (застарілі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеНазначенияДоходовИЗатрат" Тогда 
				Возврат НСтр("ru='Доходов и затрат';uk='Доходів і витрат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыПлательщиковЕдиногоНалога" Тогда 
			Если ИмяДляПеревода = "ВтораяГруппа" Тогда 
				Возврат НСтр("ru='Вторая группа';uk='Друга група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерваяГруппа" Тогда 
				Возврат НСтр("ru='Первая группа';uk='Перша група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПятаяГруппа" Тогда 
				Возврат НСтр("ru='Пятая группа';uk=""П'ята група""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТретьяГруппа" Тогда 
				Возврат НСтр("ru='Третья группа';uk='Третя група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧетвертаяГруппа" Тогда 
				Возврат НСтр("ru='Четвертая группа';uk='Четверта група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ШестаяГруппа" Тогда 
				Возврат НСтр("ru='Шестая группа';uk='Шоста група'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействиеПриОбмене" Тогда 
			Если ИмяДляПеревода = "ВыгрузкаДанных" Тогда 
				Возврат НСтр("ru='Выгрузка данных';uk='Вивантаження даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗагрузкаДанных" Тогда 
				Возврат НСтр("ru='Загрузка данных';uk='Завантаження даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтложенныеДвижения" Тогда 
				Возврат НСтр("ru='Отложенные движения';uk='Відкладені рухи'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДетализацияПланирования" Тогда 
			Если ИмяДляПеревода = "Номенклатура" Тогда 
				Возврат НСтр("ru='Номенклатура';uk='Номенклатура'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатурныеГруппы" Тогда 
				Возврат НСтр("ru='Номенклатурные группы';uk='Номенклатурні групи'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДниНедели" Тогда 
			Если ИмяДляПеревода = "Воскресенье" Тогда 
				Возврат НСтр("ru='Воскресенье';uk='Неділя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вторник" Тогда 
				Возврат НСтр("ru='Вторник';uk='Вівторок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Понедельник" Тогда 
				Возврат НСтр("ru='Понедельник';uk='Понеділок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пятница" Тогда 
				Возврат НСтр("ru='Пятница';uk=""П'ятниця""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Среда" Тогда 
				Возврат НСтр("ru='Среда';uk='Середа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Суббота" Тогда 
				Возврат НСтр("ru='Суббота';uk='Субота'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Четверг" Тогда 
				Возврат НСтр("ru='Четверг';uk='Четвер'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов" Тогда 
			Если ИмяДляПеревода = "Артикул" Тогда 
				Возврат НСтр("ru='Артикул';uk='Артикул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Код" Тогда 
				Возврат НСтр("ru='Код';uk='Код'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыводить" Тогда 
				Возврат НСтр("ru='Не выводить';uk='Не виводити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЕдиницыВремениУчетаСпецстажа" Тогда 
			Если ИмяДляПеревода = "КалендарныеДни" Тогда 
				Возврат НСтр("ru='Календарные дни';uk='Календарні дні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Смены" Тогда 
				Возврат НСтр("ru='Смены';uk='Зміни'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Часы" Тогда 
				Возврат НСтр("ru='Часы';uk='Г-ни'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Занятость" Тогда 
			Если ИмяДляПеревода = "Занято" Тогда 
				Возврат НСтр("ru='Занято';uk='Зайняте'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Недоступно" Тогда 
				Возврат НСтр("ru='Недоступно';uk='Недоступно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Свободно" Тогда 
				Возврат НСтр("ru='Свободно';uk='Вільно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИзменениеПоказателейСхемМотивации" Тогда 
			Если ИмяДляПеревода = "ВводитсяПриРасчете" Тогда 
				Возврат НСтр("ru='Вводится только при расчете';uk='Вводиться тільки при розрахунках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВиденНоНеРедактируетсяПриРасчете" Тогда 
				Возврат НСтр("ru='Ежемесячно перед расчётом зарплаты';uk='Щомісяця перед розрахунками зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзменяетсяПриРасчете" Тогда 
				Возврат НСтр("ru='Может изменяться при расчете';uk='Може змінюватися при розрахунках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИзменяется" Тогда 
				Возврат НСтр("ru='Вводится только при кадровых изменениях';uk='Вводиться тільки при кадрових змінах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииВоинскогоУчета" Тогда 
			Если ИмяДляПеревода = "Вторая" Тогда 
				Возврат НСтр("ru='Вторая(ой)';uk='Друга(ий)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Первая" Тогда 
				Возврат НСтр("ru='Первая(ый)';uk='Перша(ий)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииРасчетов" Тогда 
			Если ИмяДляПеревода = "ЗависимоеВторогоУровня" Тогда 
				Возврат НСтр("ru='Зависимое второго уровня';uk='Залежне другого рівня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗависимоеПервогоУровня" Тогда 
				Возврат НСтр("ru='Зависимое первого уровня';uk='Залежне першого рівня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗависимоеТретьегоУровня" Тогда 
				Возврат НСтр("ru='Зависимое третьего уровня';uk='Залежне третього рівня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Первичное" Тогда 
				Возврат НСтр("ru='Первичное';uk='Первинне'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КлассыСчетовРасходов" Тогда 
			Если ИмяДляПеревода = "Класс8" Тогда 
				Возврат НСтр("ru='Класс 8 (элементы затрат)';uk='Клас 8 (елементи витрат)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Класс8и9" Тогда 
				Возврат НСтр("ru='Классы 8 и 9 (элементы и затраты деятельности)';uk='Класи 8 і 9 (елементи й витрати діяльності)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Класс9" Тогда 
				Возврат НСтр("ru='Класс 9 (затраты деятельности)';uk='Клас 9 (витрати діяльності)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийБракВПроизводстве" Тогда 
			Если ИмяДляПеревода = "ВнутренниеУслугиНаПостоянныеЗатраты" Тогда 
				Возврат НСтр("ru='Внутренние услуги на постоянные затраты';uk='Внутрішні послуги на постійні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеПостоянныеЗатраты" Тогда 
				Возврат НСтр("ru='Прочие постоянные затраты';uk='Інші постійні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеБракВПроизводстве_Регламент" Тогда 
				Возврат НСтр("ru='Списание затрат по браку в пр-ве (24-й счет) (регламент.)';uk='Списання витрат на брак в виробництві ( 24-й рахунок) (регламент.)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПартийВПроизводствоОперативно" Тогда 
				Возврат НСтр("ru='Списание партий в производство оперативно';uk='Списання партій у виробництво оперативно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УслугиКонтрагентаНаПостоянныеЗатраты" Тогда 
				Возврат НСтр("ru='Услуги контрагента на постоянные затраты';uk='Послуги контрагента на постійні витрати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций" Тогда 
			Если ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр("ru='Взносы';uk='Внески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выплата" Тогда 
				Возврат НСтр("ru='Выплата';uk='Виплата'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начисления" Тогда 
				Возврат НСтр("ru='Начисления';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛ" Тогда 
				Возврат НСтр("ru='НДФЛ';uk='ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносОстатковНаСледующийМесяц" Тогда 
				Возврат НСтр("ru='Перенос остатков на следующий месяц';uk='Перенос залишків на наступний місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удержания" Тогда 
				Возврат НСтр("ru='Удержания';uk='Утримання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийВыпускПродукции" Тогда 
			Если ИмяДляПеревода = "ВозвратМатериаловИзПроизводстваРасч" Тогда 
				Возврат НСтр("ru='Возврат материалов из производства по расчетной стоимости';uk='Повернення матеріалів з виробництва по розрахунковій вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииПоФиксированнойСтоимости" Тогда 
				Возврат НСтр("ru='Выпуск продукции по фиксированной стоимости';uk='Випуск продукції по фіксованій вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксВнешниеУслуги" Тогда 
				Возврат НСтр("ru='Выпуск продукции фикс (внешние услуги)';uk='Випуск продукції фікс (зовнішні послуги)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксВнутрУслугиНаПостЗатраты" Тогда 
				Возврат НСтр("ru='Выпуск продукции фикс (внутр. услуги на постоянные затраты)';uk='Випуск продукції фікс (внутр. послуги на постійні витрати)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксВнутрУслугиНаПроизводство" Тогда 
				Возврат НСтр("ru='Выпуск продукции фикс (внутр. услуги на производство)';uk='Випуск продукції фікс (внутр. послуги на виробництво)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксВнутрУслугиНаСчет" Тогда 
				Возврат НСтр("ru='Выпуск продукции фикс (внутр. услуги на счета бух.учета)';uk='Випуск продукції фікс (внутр. послуги на рахунки бух.обліку)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксНаСклад" Тогда 
				Возврат НСтр("ru='Выпуск продукции фикс. (на склад)';uk='Випуск продукції фікс. (на склад)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаНЗПРасч" Тогда 
				Возврат НСтр("ru='Корректировка незавершенного производства по расчетной стоимости';uk='Коригування незавершеного виробництва по розрахунковій вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкиНУ" Тогда 
				Возврат НСтр("ru='Корректировки НУ';uk='Коригування ПО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОприходованиеНЗП" Тогда 
				Возврат НСтр("ru='Оприходование НЗП';uk='Оприбуткування НЗВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНЗП" Тогда 
				Возврат НСтр("ru='Списание НЗП';uk='Списання НЗП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормированиеФактСебестоимости" Тогда 
				Возврат НСтр("ru='Формирование фактической себестоимости';uk='Формування фактичної собівартості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийМалоценкиВЭксплуатации" Тогда 
			Если ИмяДляПеревода = "ПеремещениеВЭксплуатации" Тогда 
				Возврат НСтр("ru='Перемещение в эксплуатации';uk='Переміщення в експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеИзЭксплуатации" Тогда 
				Возврат НСтр("ru='Списание из эксплуатации';uk='Списання з експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПартийВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Списание партий в эксплуатацию';uk='Списання партій в експлуатацію'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийНДСНалоговыйКредит" Тогда 
			Если ИмяДляПеревода = "КорректировкиНеправильноЗарегистрированныхДокументов" Тогда 
				Возврат НСтр("ru='Корректировки неправильно зарегистрированных документов';uk='Коригування неправильно зареєстрованих документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкиПоИспользованию" Тогда 
				Возврат НСтр("ru='Корректировки по использованию';uk='Коригування по використанню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПервичныйДокумент" Тогда 
				Возврат НСтр("ru='Первичный документ';uk='Первинний документ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийНезавершенноеПроизводство" Тогда 
			Если ИмяДляПеревода = "ВнутренниеУслугиНаПроизводство" Тогда 
				Возврат НСтр("ru='Внутренние услуги на производство';uk='Внутрішні послуги на виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратМатериаловИзПроизводстваФикс" Тогда 
				Возврат НСтр("ru='Возврат материалов из производства по фиксированной стоимости';uk='Повернення матеріалів з виробництва по фіксованій вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнвентаризацияНЗП" Тогда 
				Возврат НСтр("ru='Инвентаризация незавершенного производства';uk='Інвентаризація незавершеного виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаНЗПФикс" Тогда 
				Возврат НСтр("ru='Корректировка незавершенного производства  (фикс. стоимость)';uk='Коригування незавершеного виробництва  (фикс. вартість)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОприходованиеНЗП" Тогда 
				Возврат НСтр("ru='Оприходование НЗП';uk='Оприбуткування НЗВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОприходованиеНЗПФикс" Тогда 
				Возврат НСтр("ru='Оприходование НЗП (фикс. стоимость)';uk='Оприбуткування НЗВ (фікс. вартість)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтрицательныеЗатраты" Тогда 
				Возврат НСтр("ru='Отрицательные затраты';uk='Негативні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеАдминистративныеРасходы_Регламент" Тогда 
				Возврат НСтр("ru='Списание админ. затрат (92-й счет) (регл.)';uk='Списання админ. витрат ( 92-й рахунок) (регл.)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеБракВПроизводстве_Регламент" Тогда 
				Возврат НСтр("ru='Списание затрат по браку в пр-ве (24-й счет) (регламент.)';uk='Списання витрат на брак в виробництві ( 24-й рахунок) (регламент.)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеКоличестваВПроизводствоОперативно" Тогда 
				Возврат НСтр("ru='Списание количества в производство оперативно';uk='Списання кількості у виробництво оперативно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНЗПРегламент" Тогда 
				Возврат НСтр("ru='Списание незавершенного производства регламент.';uk='Списання незавершеного виробництва регламент.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНЗПФикс" Тогда 
				Возврат НСтр("ru='Списание незавершенного производства (по фиксированной стоимости)';uk='Списання незавершеного виробництва (по фіксованій вартості)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеОбщепроизводственныеРасходы_Регламент" Тогда 
				Возврат НСтр("ru='Списание общепр. затрат (91-й счет) (регл.)';uk='Списання загальновир. витрат ( 91-й рахунок) (регл.)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеОтрицЗатратРегламент" Тогда 
				Возврат НСтр("ru='Списание отрицательных затрат (регламент.)';uk='Списання негативних витрат (регламент.)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПартийВПроизводствоОперативно" Тогда 
				Возврат НСтр("ru='Списание партий в производство оперативно';uk='Списання партій у виробництво оперативно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПрочихЗатратВПроизводство" Тогда 
				Возврат НСтр("ru='Списание прочих затрат в производство';uk='Списання інших витрат у виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УслугиКонтрагентаНаПроизводство" Тогда 
				Возврат НСтр("ru='Услуги контрагента на производство';uk='Послуги контрагента на виробництво'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений" Тогда 
			Если ИмяДляПеревода = "КорректировкаНалоговыйДокумент" Тогда 
				Возврат НСтр("ru='Корректировка налоговый документ';uk='Коригування податковий документ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаНеправильноОформленныхНалоговыхДокументов" Тогда 
				Возврат НСтр("ru='Корректировка неправильно оформленных налоговых документов';uk='Коригування неправильно оформлених податкових документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаОжидаемогоНДСПоВидамДеятельностиОплат" Тогда 
				Возврат НСтр("ru='Корректировка ожидаемого НДС по видам деятельности оплат';uk='Коригування очікуваного ПДВ по видах діяльності оплат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаПервичныйДокумент" Тогда 
				Возврат НСтр("ru='Корректировка первичный документ';uk='Коригування первинний документ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаРегламентная" Тогда 
				Возврат НСтр("ru='Корректировка регламентная';uk='Коригування регламентне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаемыйНДС" Тогда 
				Возврат НСтр("ru='Ожидаемый НДС';uk='Очікуваний ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтменаРегистрацииАвансов" Тогда 
				Возврат НСтр("ru='Отмена регистрации авансов';uk='Скасування реєстрації авансів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодтвержденныйНДС" Тогда 
				Возврат НСтр("ru='Подтвержденный НДС';uk='Підтверджений ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегистрацияАвансов" Тогда 
				Возврат НСтр("ru='Регистрация авансов';uk='Реєстрація авансів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж" Тогда 
			Если ИмяДляПеревода = "КорректировкаНеправильноОформленныхНалоговыхДокументов" Тогда 
				Возврат НСтр("ru='Корректировка неправильно оформленных налоговых документов';uk='Коригування неправильно оформлених податкових документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаОжидаемогоНДСПоВидамДеятельностиОплат" Тогда 
				Возврат НСтр("ru='Корректировка ожидаемого НДС по видам деятельности оплат';uk='Коригування очікуваного ПДВ по видах діяльності оплат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаемыйНДС" Тогда 
				Возврат НСтр("ru='Ожидаемый НДС';uk='Очікуваний ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтменаРегистрацииАвансов" Тогда 
				Возврат НСтр("ru='Отмена регистрации авансов';uk='Скасування реєстрації авансів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереводОФвСоставНепроизводственных" Тогда 
				Возврат НСтр("ru='Перевод основных фондов в состав непроизводственных';uk='Переведення основних фондів до складу невиробничих'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодтвержденныйНДС" Тогда 
				Возврат НСтр("ru='Подтвержденный НДС';uk='Підтверджений ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегистрацияАвансов" Тогда 
				Возврат НСтр("ru='Регистрация авансов';uk='Реєстрація авансів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийПартииМалоценкиВЭксплуатации" Тогда 
			Если ИмяДляПеревода = "ПеремещениеВЭксплуатации" Тогда 
				Возврат НСтр("ru='Перемещение в эксплуатации';uk='Переміщення в експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеИзЭксплуатации" Тогда 
				Возврат НСтр("ru='Списание из эксплуатации';uk='Списання з експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПартийВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Списание партий в эксплуатацию';uk='Списання партій в експлуатацію'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийПартииТоваров" Тогда 
			Если ИмяДляПеревода = "ВозвратОтКомиссионера" Тогда 
				Возврат НСтр("ru='Возврат от комиссионера';uk='Повернення від комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтПереработчика" Тогда 
				Возврат НСтр("ru='Возврат от переработчика';uk='Повернення від переробника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтПокупателя" Тогда 
				Возврат НСтр("ru='Возврат от покупателя';uk='Повернення від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтПокупателяТекущийМесяц" Тогда 
				Возврат НСтр("ru='Возврат от покупателя (текущий месяц)';uk='Повернення від покупця (поточний місяць)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Возврат поставщику';uk='Повернення постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТарыОтКонтрагента" Тогда 
				Возврат НСтр("ru='Возврат тары от контрагента';uk='Повернення тари від контрагента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПоОперацииСтоимость" Тогда 
				Возврат НСтр("ru='Выпуск по операции стоимость';uk='Випуск по операції вартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксНаСклад" Тогда 
				Возврат НСтр("ru='Выпуск продукции фикс. (на склад)';uk='Випуск продукції фікс. (на склад)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Комплектация" Тогда 
				Возврат НСтр("ru='Комплектация';uk='Комплектація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаКачества" Тогда 
				Возврат НСтр("ru='Корректировка качества';uk='Коригування якості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаСерийИХарактеристик" Тогда 
				Возврат НСтр("ru='Корректировка серий и характеристик';uk='Коригування серій і характеристик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оприходование" Тогда 
				Возврат НСтр("ru='Оприходование';uk='Оприбуткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтложеннаяОтгрузка" Тогда 
				Возврат НСтр("ru='Отложенная отгрузка';uk='Відкладене відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВПереработку" Тогда 
				Возврат НСтр("ru='Передача в переработку';uk='Передача в переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаМалоценкиВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Передача малоценки в эксплуатацию';uk='Передача малоцінки в експлуатацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаКомиссию" Тогда 
				Возврат НСтр("ru='Передача на комиссию';uk='Передача на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаОборудованияВМонтаж" Тогда 
				Возврат НСтр("ru='Передача оборудования в монтаж';uk='Передача устаткування в монтаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаТарыКонтрагенту" Тогда 
				Возврат НСтр("ru='Передача тары контрагенту';uk='Передача тари контрагентові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеМеждуСкладами" Тогда 
				Возврат НСтр("ru='Перемещение между складами';uk='Переміщення між складами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаВРознице" Тогда 
				Возврат НСтр("ru='Переоценка в рознице';uk='Переоцінка в роздробі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаПринятыхНаКомиссию" Тогда 
				Возврат НСтр("ru='Переоценка принятых на комиссию';uk='Переоцінка прийнятих на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступление" Тогда 
				Возврат НСтр("ru='Поступление';uk='Надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеВПереработку" Тогда 
				Возврат НСтр("ru='Поступление в переработку';uk='Надходження у переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДопРасходов" Тогда 
				Возврат НСтр("ru='Поступление доп. расходов';uk='Надходження дод. витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеНаКомиссию" Тогда 
				Возврат НСтр("ru='Поступление на комиссию';uk='Надходження на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеПоОрдеру" Тогда 
				Возврат НСтр("ru='Поступление по ордеру';uk='Надходження по ордеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятиеКУчетуОС" Тогда 
				Возврат НСтр("ru='Принятие к учету ОС';uk='Прийняття до обліку ОЗ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Реализация" Тогда 
				Возврат НСтр("ru='Реализация';uk='Реалізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияКомиссия" Тогда 
				Возврат НСтр("ru='Реализация комиссионером';uk='Реалізація комісіонером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияРозница" Тогда 
				Возврат НСтр("ru='Реализация в розницу';uk='Реалізація в роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РезервированиеПодЗаказ" Тогда 
				Возврат НСтр("ru='Резервирование под заказ';uk='Резервування під замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятиеРезерваПодЗаказ" Тогда 
				Возврат НСтр("ru='Снятие резерва под заказ';uk='Зняття резерву під замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеМатериаловЗаказчикаВПроизводствоОперативно" Тогда 
				Возврат НСтр("ru='Списание материалов заказчика в производство оперативно';uk='Списання матеріалів замовника у виробництво оперативно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНаБрак" Тогда 
				Возврат НСтр("ru='Списание на брак';uk='Списання на брак'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНаВложенияВоВнеоборотныеАктивы" Тогда 
				Возврат НСтр("ru='Списание на вложения во внеоборотные активы';uk='Списання на вкладення у внеоборотні активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНаЗатраты" Тогда 
				Возврат НСтр("ru='Списание на затраты';uk='Списання на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеНаСтроительствоОбъектовОС" Тогда 
				Возврат НСтр("ru='Списание на строительство объектов ОС';uk=""Списання на будівництво об'єктів ОЗ""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПартийВПроизводствоОперативно" Тогда 
				Возврат НСтр("ru='Списание партий в производство оперативно';uk='Списання партій у виробництво оперативно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПартийПереданныхВПроизводство" Тогда 
				Возврат НСтр("ru='Списание партий переданных в производство';uk='Списання партій переданих у виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПоИнвентаризации" Тогда 
				Возврат НСтр("ru='Списание по инвентаризации';uk='Списання по інвентаризації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПоОрдеру" Тогда 
				Возврат НСтр("ru='Списание по ордеру';uk='Списання по ордеру'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийРасчетыСФСС" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Корректировка" Тогда 
				Возврат НСтр("ru='Корректировка';uk='Коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начислено" Тогда 
				Возврат НСтр("ru='Начислено';uk='Нараховано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Получено" Тогда 
				Возврат НСтр("ru='Получено';uk='Отримане'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийТоварыВНТТВПродажныхЦенах" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступление" Тогда 
				Возврат НСтр("ru='Поступление';uk='Надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Реализация" Тогда 
				Возврат НСтр("ru='Реализация';uk='Реалізація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодыОперацийТоварыВНТТВПродажныхЦенахНалоговыйУчет" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступление" Тогда 
				Возврат НСтр("ru='Поступление';uk='Надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Реализация" Тогда 
				Возврат НСтр("ru='Реализация';uk='Реалізація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыКорректировкиНалоговогоКредита" Тогда 
			Если ИмяДляПеревода = "НаНалоговыеОбязательства" Тогда 
				Возврат НСтр("ru='Начислить обязательства';uk=""Нарахувати зобов'язання""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаНалоговыйКредит" Тогда 
				Возврат НСтр("ru='Начислить кредит';uk='Нарахувати кредит'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеКорректировать" Тогда 
				Возврат НСтр("ru='Не корректировать';uk='Не коригувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыРаспределенияРБП" Тогда 
			Если ИмяДляПеревода = "ПоДням" Тогда 
				Возврат НСтр("ru='По количеству дней в месяце';uk='По кількості днів у місяці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоМесяцам" Тогда 
				Возврат НСтр("ru='Равными частями каждый месяц';uk='Рівними частинами кожен місяць'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МоментыОпределенияНалоговойБазы" Тогда 
			Если ИмяДляПеревода = "НеОпределять" Тогда 
				Возврат НСтр("ru='Не определять';uk='Не визначати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОплате" Тогда 
				Возврат НСтр("ru='По оплате';uk='По оплаті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОтгрузке" Тогда 
				Возврат НСтр("ru='По отгрузке';uk='По відвантаженню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПервомуСобытию" Тогда 
				Возврат НСтр("ru='По первому событию';uk='За першою подією'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НаправленияДвижений" Тогда 
			Если ИмяДляПеревода = "Выбытие" Тогда 
				Возврат НСтр("ru='Выбытие';uk='Вибуття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступление" Тогда 
				Возврат НСтр("ru='Поступление';uk='Надходження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОбластиДанныхОбъектовДоступа" Тогда 
			Если ИмяДляПеревода = "КонтрагентыСписок" Тогда 
				Возврат НСтр("ru='Контрагенты (список)';uk='Контрагенти (список)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОбязательностьЗаполненияОтветаНаВопрос" Тогда 
			Если ИмяДляПеревода = "НеОбязателенКЗаполнению" Тогда 
				Возврат НСтр("ru='Не обязателен к заполнению';uk=""Не обов'язковий до заповнення""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбязателенКЗаполнению" Тогда 
				Возврат НСтр("ru='Обязателен к заполнению';uk=""Обов'язковий до заповнення""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловноНеЗаполнять" Тогда 
				Возврат НСтр("ru='Условно не заполнять';uk='Умовно не заповнювати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловноОбязателенКЗаполнению" Тогда 
				Возврат НСтр("ru='Условно обязателен к заполнению';uk=""Умовно обов'язковий до заповнення""" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтветственныеЛицаОрганизаций" Тогда 
			Если ИмяДляПеревода = "ГлавныйБухгалтер" Тогда 
				Возврат НСтр("ru='Главный бухгалтер';uk='Головний бухгалтер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кассир" Тогда 
				Возврат НСтр("ru='Кассир';uk='Касир'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководитель" Тогда 
				Возврат НСтр("ru='Руководитель';uk='Керівник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РуководительКадровойСлужбы" Тогда 
				Возврат НСтр("ru='Руководитель кадровой службы';uk='Керівник кадрової служби'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтношениеКВоинскойОбязанности" Тогда 
			Если ИмяДляПеревода = "Военнообязанный" Тогда 
				Возврат НСтр("ru='Военнообязанный';uk=""Військовозобов'язаний""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВоеннообязанный" Тогда 
				Возврат НСтр("ru='Не военнообязанный';uk=""Не військовозобов'язаний""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Призывник" Тогда 
				Возврат НСтр("ru='Призывник';uk='Призовник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтношениеКВоинскомуУчету" Тогда 
			Если ИмяДляПеревода = "Встает" Тогда 
				Возврат НСтр("ru='Встает на воинский учет';uk='Встає на військовий облік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСостоит" Тогда 
				Возврат НСтр("ru='Не состоит на воинском учете (но должен)';uk='Не знаходиться на військовому обліку (але повинен)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятПоВозрасту" Тогда 
				Возврат НСтр("ru='Снят с воинского учета по возрасту';uk='Знятий із військового обліку за віком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятПоСостояниюЗдоровья" Тогда 
				Возврат НСтр("ru='Снят с воинского учета по состоянию здоровья';uk=""Знятий із військового обліку за станом здоров'я""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Состоит" Тогда 
				Возврат НСтр("ru='Состоит на воинском учете';uk='Перебуває на військовому обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПараметрыABCКлассификацииПокупателей" Тогда 
			Если ИмяДляПеревода = "СуммаВаловойПрибыли" Тогда 
				Возврат НСтр("ru='Сумма валовой прибыли';uk='Сума валового прибутку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВыручки" Тогда 
				Возврат НСтр("ru='Сумма выручки';uk='Сума виторгу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПараметрыРаспределенияПокупателейПоСтадиямВзаимоотношений" Тогда 
			Если ИмяДляПеревода = "ИнтервалыМеждуРасходнымиДокументами" Тогда 
				Возврат НСтр("ru='Интервалы между расходными документами';uk='Інтервали між видатковими документами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоПродаж" Тогда 
				Возврат НСтр("ru='Количество продаж';uk='Кількість продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоПроданныхТоваров" Тогда 
				Возврат НСтр("ru='Количество проданных товаров';uk='Кількість проданих товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВаловойПрибыли" Тогда 
				Возврат НСтр("ru='Сумма валовой прибыли';uk='Сума валового прибутку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВыручки" Тогда 
				Возврат НСтр("ru='Сумма выручки';uk='Сума виторгу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Периодичность" Тогда 
			Если ИмяДляПеревода = "Год" Тогда 
				Возврат НСтр("ru='Год';uk='Рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Декада" Тогда 
				Возврат НСтр("ru='Декада';uk='Декада'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "День" Тогда 
				Возврат НСтр("ru='День';uk='День'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Квартал" Тогда 
				Возврат НСтр("ru='Квартал';uk='Квартал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 
				Возврат НСтр("ru='Месяц';uk='Місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неделя" Тогда 
				Возврат НСтр("ru='Неделя';uk='Тиждень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полугодие" Тогда 
				Возврат НСтр("ru='Полугодие';uk='Півріччя'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПериодичностьНакопленияСкидок" Тогда 
			Если ИмяДляПеревода = "ВТечениеВсегоПериода" Тогда 
				Возврат НСтр("ru='В течение всего периода';uk='Протягом  усього періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Год" Тогда 
				Возврат НСтр("ru='Год';uk='Рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Квартал" Тогда 
				Возврат НСтр("ru='Квартал';uk='Квартал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 
				Возврат НСтр("ru='Месяц';uk='Місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полугодие" Тогда 
				Возврат НСтр("ru='Полугодие';uk='Півріччя'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПолФизическихЛиц" Тогда 
			Если ИмяДляПеревода = "Женский" Тогда 
				Возврат НСтр("ru='Женский';uk='Жіноча'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Мужской" Тогда 
				Возврат НСтр("ru='Мужской';uk='Чоловіча'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорогиШкалыСтавокНалогов" Тогда 
			Если ИмяДляПеревода = "Порог1" Тогда 
				Возврат НСтр("ru='Порог1';uk='Поріг1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог2" Тогда 
				Возврат НСтр("ru='Порог2';uk='Поріг2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог3" Тогда 
				Возврат НСтр("ru='Порог3';uk='Поріг3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог4" Тогда 
				Возврат НСтр("ru='Порог4';uk='Поріг4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог5" Тогда 
				Возврат НСтр("ru='Порог5';uk='Поріг5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог6" Тогда 
				Возврат НСтр("ru='Порог6';uk='Поріг6'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог7" Тогда 
				Возврат НСтр("ru='Порог7';uk='Поріг7'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог8" Тогда 
				Возврат НСтр("ru='Порог8';uk='Поріг8'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог9" Тогда 
				Возврат НСтр("ru='Порог9';uk='Поріг9'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядкиОкругления" Тогда 
			Если ИмяДляПеревода = "Окр0_01" Тогда 
				Возврат НСтр("ru='0.01';uk='0.01'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр0_05" Тогда 
				Возврат НСтр("ru='0.05';uk='0.05'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр0_1" Тогда 
				Возврат НСтр("ru='0.1';uk='0.1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр0_5" Тогда 
				Возврат НСтр("ru='0.5';uk='0.5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр1" Тогда 
				Возврат НСтр("ru='1';uk='1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр10" Тогда 
				Возврат НСтр("ru='10';uk='10'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр100" Тогда 
				Возврат НСтр("ru='100';uk='100'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр5" Тогда 
				Возврат НСтр("ru='5';uk='5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр50" Тогда 
				Возврат НСтр("ru='50';uk='50'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядкиОкругленияОтчетности" Тогда 
			Если ИмяДляПеревода = "Окр1" Тогда 
				Возврат НСтр("ru='1';uk='1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр1000" Тогда 
				Возврат НСтр("ru='1 000';uk='1 000'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр1000000" Тогда 
				Возврат НСтр("ru='1 000 000';uk='1 000 000'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокПрисвоенияPLU" Тогда 
			Если ИмяДляПеревода = "ПоКодуНоменклатуры" Тогда 
				Возврат НСтр("ru='По коду номенклатуры';uk='По коду номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПорядку" Тогда 
				Возврат НСтр("ru='По порядку';uk='По порядку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг" Тогда 
			Если ИмяДляПеревода = "ПоОбъемуВыпуска" Тогда 
				Возврат НСтр("ru='По объему выпуска';uk='По обсягу випуску'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПлановымЦенам" Тогда 
				Возврат НСтр("ru='По плановой себестоимости выпуска';uk='По плановій собівартості випуску'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПлановымЦенамИОбъемуВыпуска" Тогда 
				Возврат НСтр("ru='По плановой себестоимости и по объему выпуска';uk='По плановій собівартості й по обсягу випуску'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРаспределенияРасходовНаОказаниеУслуг" Тогда 
			Если ИмяДляПеревода = "ПоВыручке" Тогда 
				Возврат НСтр("ru='По выручке';uk='За виторгом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПлановымЦенам" Тогда 
				Возврат НСтр("ru='По плановой себестоимости выпуска';uk='По плановій собівартості випуску'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПлановымЦенамИВыручке" Тогда 
				Возврат НСтр("ru='По плановой себестоимости выпуска и выручке';uk='По плановій собівартості випуску й виторгу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРасчетаОтпуска" Тогда 
			Если ИмяДляПеревода = "ПоГрафику" Тогда 
				Возврат НСтр("ru='По графику';uk='За графіком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоКалендарнымДням" Тогда 
				Возврат НСтр("ru='По календарным дням';uk='По календарних днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоШестидневке" Тогда 
				Возврат НСтр("ru='По шестидневке';uk='По шестиденці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПочтовыеТарифы" Тогда 
			Если ИмяДляПеревода = "Простой" Тогда 
				Возврат НСтр("ru='Простой';uk='Простий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Срочный" Тогда 
				Возврат НСтр("ru='Срочный';uk='Терміновий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Электронный" Тогда 
				Возврат НСтр("ru='Электронный';uk='Електронний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПредставленияЭлементовОтчетов" Тогда 
			Если ИмяДляПеревода = "Диаграмма" Тогда 
				Возврат НСтр("ru='Диаграмма';uk='Діаграма'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КроссТаблица" Тогда 
				Возврат НСтр("ru='Кросс-таблица';uk='Крос-Таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сложный" Тогда 
				Возврат НСтр("ru='Сложный';uk='Складний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Таблица" Тогда 
				Возврат НСтр("ru='Таблица';uk='Таблиця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПриоритетОбъектовОбмена" Тогда 
			Если ИмяДляПеревода = "ПриоритетПоступившегоПриОбменеОбъектаВыше" Тогда 
				Возврат НСтр("ru='Приоритет объекта обмена выше';uk=""Пріоритет об'єкта обміну вище""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриоритетПоступившегоПриОбменеОбъектаНиже" Тогда 
				Возврат НСтр("ru='Приоритет объекта обмена ниже';uk=""Пріоритет об'єкта обміну нижче""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриоритетПоступившегоПриОбменеОбъектаСовпадает" Тогда 
				Возврат НСтр("ru='Приоритет объекта обмена совпадает';uk=""Пріоритет об'єкта обміну збігається""" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПричиныИзмененияСостояния" Тогда 
			Если ИмяДляПеревода = "Перемещение" Тогда 
				Возврат НСтр("ru='Перемещение';uk='Переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемНаРаботу" Тогда 
				Возврат НСтр("ru='Прием на работу';uk='Прийом на роботу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увольнение" Тогда 
				Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПрофилиОфицеров" Тогда 
			Если ИмяДляПеревода = "Ветеринарный" Тогда 
				Возврат НСтр("ru='Ветеринарный';uk='Ветеринарний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Инженерный" Тогда 
				Возврат НСтр("ru='Инженерный';uk='Інженерний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Командный" Тогда 
				Возврат НСтр("ru='Командный';uk='Командний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Медицинский" Тогда 
				Возврат НСтр("ru='Медицинский';uk='Медичний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Технический" Тогда 
				Возврат НСтр("ru='Технический';uk='Технічний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Юридический" Тогда 
				Возврат НСтр("ru='Юридический';uk='Юридичний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазделыУчета" Тогда 
			Если ИмяДляПеревода = "НУ" Тогда 
				Возврат НСтр("ru='Налоговый учет';uk='Податковий облік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОценкаМПЗ" Тогда 
				Возврат НСтр("ru='Оценка МПЗ при выбытии';uk='Оцінка МВВ при вибутті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСКонтрагентами" Тогда 
				Возврат НСтр("ru='Расчеты с контрагентами';uk='Розрахунки з контрагентами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазделыУчетаДляКорректировкиОстатковНКУна01042011" Тогда 
			Если ИмяДляПеревода = "ЗапасыПереданные" Тогда 
				Возврат НСтр("ru='Запасы переданные (счета 206, 283)';uk='Запаси передані (рахунку 206, 283)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗапасыСебестоимость" Тогда 
				Возврат НСтр("ru='Запасы по себестоимости (счета 1521, 1531, 201-205, 207-209, 221, 234, 25, 26, 27, 281, 284, 286, 289)';uk='Запаси за собівартістю (рахунки 1521, 1531, 201-205, 207-209, 221, 234, 25, 26, 27, 281, 284, 286, 289)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КапитальныеИнвестиции" Тогда 
				Возврат НСтр("ru='Капитальные инвестиции (счета 151-154, 235, кроме 1521, 1531)';uk='Капітальні інвестиції (рахунки 151-154, 235, крім 1521, 1531)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МалоценныеАктивыВЭксплуатации" Тогда 
				Возврат НСтр("ru='Малоценные активы в эксплуатации (счета 1112, 1122, 1322, МЦ)';uk='Малоцінні активи в експлуатації (рахунки 1112, 1122, 1322, МЦ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НезавершенноеПроизводство" Тогда 
				Возврат НСтр("ru='Незавершенное производство (счета 231–233, 24)';uk='Незавершене виробництво (рахунки 231–233, 24)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НематериальныеАктивы" Тогда 
				Возврат НСтр("ru='Нематериальные активы (счета 12, 133)';uk='Нематеріальні активи (рахунки 12, 133)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновныеСредства" Тогда 
				Возврат НСтр("ru='Основные средства (счета 10, 11, 13)';uk='Основні засоби (рахунки 10, 11, 13)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыБудущихПериодов" Тогда 
				Возврат НСтр("ru='Расходы будущих периодов (счет 39)';uk='Витрати майбутніх періодів (рахунок 39)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПоПродажнойЦене" Тогда 
				Возврат НСтр("ru='Товары по продажной цене (счета 282, 285)';uk='Товари за ціною продажу (рахунки 282, 285)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТранспортноЗаготовительныеРасходыНаОтдельныхСубсчетах" Тогда 
				Возврат НСтр("ru='Транспортно заготовительные расходы (200, 280)';uk='Транспортно заготівельні витрати (200, 280)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РасчетыВозврат" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Расчеты" Тогда 
				Возврат НСтр("ru='Расчеты';uk='Розрахунки'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимОтбораДокументов" Тогда 
			Если ИмяДляПеревода = "ПоОборотам" Тогда 
				Возврат НСтр("ru='По оборотам';uk='По оборотах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОстаткам" Тогда 
				Возврат НСтр("ru='По остаткам';uk='По залишкам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРеквизитам" Тогда 
				Возврат НСтр("ru='По реквизитам';uk='По реквізитах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимФормированияПечатныхФорм" Тогда 
			Если ИмяДляПеревода = "НаРусскомЯзыке" Тогда 
				Возврат НСтр("ru='На русском языке';uk='Російською мовою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаУкраинскомЯзыке" Тогда 
				Возврат НСтр("ru='На украинском языке';uk='Українською мовою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаЯзыкеИнтерфейсаПользователя" Тогда 
				Возврат НСтр("ru='На языке интерфейса пользователя';uk='Мовою інтерфеса користувача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаЯзыкеИнформационнойБазы" Тогда 
				Возврат НСтр("ru='На языке информационной базы';uk='Мовою інформаційної бази'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыВыбораПартий" Тогда 
			Если ИмяДляПеревода = "ВыборИзПартийИмеющихОстатки" Тогда 
				Возврат НСтр("ru='Выбор из партий, имеющих остатки';uk='Вибір з партій, що мають залишки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыборИзПартийПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Выбор из партий по номенклатуре';uk='Вибір з партій по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыборИзПолногоСпискаПартий" Тогда 
				Возврат НСтр("ru='Выбор из полного списка партий';uk='Вибір з повного списку партій'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыЗавершенияРаботыПользователей" Тогда 
			Если ИмяДляПеревода = "ЗавершитьБезусловно" Тогда 
				Возврат НСтр("ru='Завершить безусловно';uk='Завершити безумовно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗавершитьПослеОжиданияПодтвержденияПользователя" Тогда 
				Возврат НСтр("ru='Завершить после ожидания подтверждения пользователя';uk='Завершити після очікування підтвердження користувача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗавершитьПриНаличииПодтвержденияПользователя" Тогда 
				Возврат НСтр("ru='Завершить при наличии подтверждения пользователя';uk='Завершити при наявності підтвердження користувача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗавершитьССохранениемДанныхПользователя" Тогда 
				Возврат НСтр("ru='Завершить с сохранением данных пользователя';uk='Завершити зі збереженням даних користувача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешитьРаботу" Тогда 
				Возврат НСтр("ru='Разрешить работу';uk='Дозволити роботу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатРассмотренияКоллизии" Тогда 
			Если ИмяДляПеревода = "ОбъектЗамененНаВерсиюПоступившуюПриОбмене" Тогда 
				Возврат НСтр("ru='Объект заменен на версию объекта обмена';uk=""Об'єкт замінений на версію об'єкта обміну""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектНеБылИзменен" Тогда 
				Возврат НСтр("ru='Объект не изменен';uk=""Об'єкт не змінений""" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыБизнесПроцессаСогласование" Тогда 
			Если ИмяДляПеревода = "ЗавершитьСогласование" Тогда 
				Возврат НСтр("ru='Завершить согласование';uk='Завершити погодження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонить" Тогда 
				Возврат НСтр("ru='Отклонить';uk='Відхилити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПовторноеСогласование" Тогда 
				Возврат НСтр("ru='Повторное согласование';uk='Повторне погодження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвердить" Тогда 
				Возврат НСтр("ru='Утвердить';uk='Затвердити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СобытияНДСПриобретений" Тогда 
			Если ИмяДляПеревода = "ВозвратОплатыПоставщиком" Тогда 
				Возврат НСтр("ru='Возврат оплаты поставщиком';uk='Повернення оплати постачальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Возврат поставщику';uk='Повернення постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтПоставщика" Тогда 
				Возврат НСтр("ru='Поступление от поставщика';uk='Надходження від постачальника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СобытияНДСПродаж" Тогда 
			Если ИмяДляПеревода = "ВозвратОплатыПокупателю" Тогда 
				Возврат НСтр("ru='Возврат оплаты покупателю';uk='Повернення оплати покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтПокупателя" Тогда 
				Возврат НСтр("ru='Возврат от покупателя';uk='Повернення від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратРозница" Тогда 
				Возврат НСтр("ru='Возврат розница';uk='Повернення роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратРозничнойВыручки" Тогда 
				Возврат НСтр("ru='Возврат розничной выручки';uk='Повернення роздрібного виторгу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПокупателем" Тогда 
				Возврат НСтр("ru='Оплата покупателем';uk='Оплата покупцем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РализацияРозница" Тогда 
				Возврат НСтр("ru='Рализация розница';uk='Реалізація роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПокупателю" Тогда 
				Возврат НСтр("ru='Реализация покупателю';uk='Реалізація покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозничнаяВыручка" Тогда 
				Возврат НСтр("ru='Розничная выручка';uk='Роздрібний виторг'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СобытияОжидаемыйИПодтвержденныйНДСПриобретений" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступление" Тогда 
				Возврат НСтр("ru='Поступление';uk='Надходження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СобытияОжидаемыйИПодтвержденныйНДСПродаж" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратРозница" Тогда 
				Возврат НСтр("ru='Возврат розница';uk='Повернення роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Реализация" Тогда 
				Возврат НСтр("ru='Реализация';uk='Реалізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияРозница" Тогда 
				Возврат НСтр("ru='Реализация розница';uk='Реалізація роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Условная продажа';uk='Умовний продаж'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СобытияПриобретенияНалоговыйУчет" Тогда 
			Если ИмяДляПеревода = "ВозвратОплатыПоставщиком" Тогда 
				Возврат НСтр("ru='Возврат оплаты поставщиком';uk='Повернення оплати постачальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Возврат поставщику';uk='Повернення постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтПоставщика" Тогда 
				Возврат НСтр("ru='Поступление от поставщика';uk='Надходження від постачальника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СобытияПродажиНалоговыйУчет" Тогда 
			Если ИмяДляПеревода = "ВозвратОплатыПокупателю" Тогда 
				Возврат НСтр("ru='Возврат оплаты покупателю';uk='Повернення оплати покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтПокупателя" Тогда 
				Возврат НСтр("ru='Возврат от покупателя';uk='Повернення від покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПокупателем" Тогда 
				Возврат НСтр("ru='Оплата покупателем';uk='Оплата покупцем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПокупателю" Тогда 
				Возврат НСтр("ru='Реализация покупателю';uk='Реалізація покупцю'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СоставыВоеннослужащих" Тогда 
			Если ИмяДляПеревода = "ВысшиеОфицеры" Тогда 
				Возврат НСтр("ru='Высшие офицеры';uk='Вищі офіцери'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МладшиеОфицеры" Тогда 
				Возврат НСтр("ru='Младшие офицеры';uk='Молодші офіцери'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрапорщиковИМичманов" Тогда 
				Возврат НСтр("ru='Прапорщиков и мичманов';uk='Прапорщиків та мічманів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рядовой" Тогда 
				Возврат НСтр("ru='Рядовой';uk='Рядовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СержантскийИСтаршинский" Тогда 
				Возврат НСтр("ru='Сержантский и старшинский';uk='Сержантський і старшинський'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршиеОфицеры" Тогда 
				Возврат НСтр("ru='Старшие офицеры';uk='Старші офіцери'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостояниеОбъектаСогласования" Тогда 
			Если ИмяДляПеревода = "НаСогласовании" Тогда 
				Возврат НСтр("ru='На согласовании';uk='На погодженні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласован" Тогда 
				Возврат НСтр("ru='Согласован';uk='Погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияОбъектов" Тогда 
			Если ИмяДляПеревода = "Отклонен" Тогда 
				Возврат НСтр("ru='Отклонен';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отложен" Тогда 
				Возврат НСтр("ru='Отложен';uk='Відкладений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлен" Тогда 
				Возврат НСтр("ru='Подготовлен';uk='Підготовлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвержден" Тогда 
				Возврат НСтр("ru='Утвержден';uk='Затверджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияОС" Тогда 
			Если ИмяДляПеревода = "ВведеноВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Введено в эксплуатацию';uk='Введено в експлуатацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятоСУчета" Тогда 
				Возврат НСтр("ru='Снято с учета';uk='Знято з обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияПотомковЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "ОтветОтправлен" Тогда 
				Возврат НСтр("ru='Ответ отправлен';uk='Відповідь відправлена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтветСохранен" Тогда 
				Возврат НСтр("ru='Ответ сохранен';uk='Відповідь збережена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереадресацияОтправлена" Тогда 
				Возврат НСтр("ru='Переадресация отправлена';uk='Переадресація відправлена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереадресацияСохранена" Тогда 
				Возврат НСтр("ru='Переадресация сохранена';uk='Переадресація збережена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРаботникаОрганизации" Тогда 
			Если ИмяДляПеревода = "Заболевание" Тогда 
				Возврат НСтр("ru='Болеет';uk='Хворіє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Командировка" Тогда 
				Возврат НСтр("ru='В командировке';uk='У відрядженні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИзменять" Тогда 
				Возврат НСтр("ru='Не изменять';uk='Не змінювати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеРаботает" Тогда 
				Возврат НСтр("ru='Не работает';uk='Не працює'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускБезСохраненияЗарплаты" Тогда 
				Возврат НСтр("ru='Отпуск без сохранения зарплаты';uk='Відпустка без збереження зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускЕжегодный" Тогда 
				Возврат НСтр("ru='В ежегодном отпуске';uk='У щорічній відпустці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоБеременностиИРодам" Тогда 
				Возврат НСтр("ru='Отпуск по беременности и родам';uk=""Відпустка у зв'язку з вагітністю та пологами""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоУходуЗаРебенком" Тогда 
				Возврат НСтр("ru='Отпуск по уходу за ребенком';uk='Відпустка по догляду за дитиною'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПрочий" Тогда 
				Возврат НСтр("ru='Отпуск прочий';uk='Відпустка інша'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтсутствуетПоНевыясненнойПричине" Тогда 
				Возврат НСтр("ru='Отсутствует по невыясненной причине';uk=""Відсутній по нез'ясованій причині""" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Работает" Тогда 
				Возврат НСтр("ru='Работает';uk='Працює'" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Мобилизован" Тогда 
				Возврат НСтр("ru='Мобилизован';uk='Мобілізований'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСобытий" Тогда 
			Если ИмяДляПеревода = "Завершено" Тогда 
				Возврат НСтр("ru='Завершено';uk='Завершено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Запланировано" Тогда 
				Возврат НСтр("ru='Запланировано';uk='Заплановано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменено" Тогда 
				Возврат НСтр("ru='Отменено';uk='Скасовано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СоциальныеГруппыНаселения" Тогда 
			Если ИмяДляПеревода = "ДетиДо18" Тогда 
				Возврат НСтр("ru='Минимальная зарплата (дети от6до18 лет)';uk='Мінімальна зарплата (діти від6до18 років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДетиДо6" Тогда 
				Возврат НСтр("ru='Минимальная зарплата (дети до 6 лет)';uk='Мінімальна зарплата (діти до 6 років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТрудоспособные" Тогда 
				Возврат НСтр("ru='Нетрудоспособные';uk='Непрацездатні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Трудоспособные" Тогда 
				Возврат НСтр("ru='Трудоспособные';uk='Працездатні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособРасчетаСуммыДокумента" Тогда 
			Если ИмяДляПеревода = "БезУчетаРучнойСкидки" Тогда 
				Возврат НСтр("ru='Без учета ручной скидки';uk='Без обліку ручної знижки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БезУчетаСкидок" Тогда 
				Возврат НСтр("ru='Без учета скидок';uk='Без обліку знижок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СУчетомВсехСкидок" Тогда 
				Возврат НСтр("ru='С учетом всех скидок';uk='З урахуванням усіх знижок'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВводаДанныхОВремени" Тогда 
			Если ИмяДляПеревода = "ВЦеломЗаПериод" Тогда 
				Возврат НСтр("ru='Ввод данных в целом за период';uk='Введення даних у цілому за період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаДень" Тогда 
				Возврат НСтр("ru='Ввод данных за день';uk='Введення даних за день'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДням" Тогда 
				Возврат НСтр("ru='Ввод данных по дням';uk='Введення даних по днях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВыплатыЗарплаты" Тогда 
			Если ИмяДляПеревода = "ЧерезБанк" Тогда 
				Возврат НСтр("ru='Через банк';uk='Через банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезКассу" Тогда 
				Возврат НСтр("ru='Через кассу';uk='Через касу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыЗаполненияЦен" Тогда 
			Если ИмяДляПеревода = "ПоНоменклатуреИЦенамКонтрагентов" Тогда 
				Возврат НСтр("ru='По номенклатуре и ценам контрагентов';uk='По номенклатурі й цінам контрагентів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПродажнымЦенам" Тогда 
				Возврат НСтр("ru='По продажным ценам';uk='За продажними цінами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРозничнымЦенам" Тогда 
				Возврат НСтр("ru='По розничным ценам';uk='За роздрібними цінами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЦенамНоменклатуры" Тогда 
				Возврат НСтр("ru='По ценам номенклатуры';uk='За цінами номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЦенамНоменклатурыКонтрагентов" Тогда 
				Возврат НСтр("ru='По ценам номенклатуры контрагентов';uk='За цінами номенклатури контрагентів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыИспользованияНакопительныхСкидок" Тогда 
			Если ИмяДляПеревода = "СкидкиНакапливаютсяПоВладельцуДисконтнойКарты" Тогда 
				Возврат НСтр("ru='Скидки накапливаются по владельцу дисконтной карты';uk='Знижки накопичуються по власнику дисконтної карти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СкидкиНакапливаютсяПоДисконтнойКарте" Тогда 
				Возврат НСтр("ru='Скидки накапливаются по дисконтной карте';uk='Знижки накопичуються по дисконтній карті'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыКонтроляДнейЗадолженности" Тогда 
			Если ИмяДляПеревода = "ПоКалендарнымДням" Тогда 
				Возврат НСтр("ru='По календарным дням';uk='По календарних днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРабочимДням" Тогда 
				Возврат НСтр("ru='По рабочим дням';uk='По робочих днях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНачисленияАмортизацииНМА" Тогда 
			Если ИмяДляПеревода = "Кумулятивный" Тогда 
				Возврат НСтр("ru='Кумулятивный (по сумме чисел лет)';uk='Кумулятивний (по сумі чисел років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Производственный" Тогда 
				Возврат НСтр("ru='Производственный';uk='Виробничий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прямолинейный" Тогда 
				Возврат НСтр("ru='Прямолинейный';uk='Прямолінійний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшенияОстатка" Тогда 
				Возврат НСтр("ru='Уменьшения остатка';uk='Зменшення залишку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УскоренногоУменьшенияОстатка" Тогда 
				Возврат НСтр("ru='Ускоренного уменьшения остатка';uk='Прискореного зменшення залишку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНачисленияАмортизацииОС" Тогда 
			Если ИмяДляПеревода = "_100" Тогда 
				Возврат НСтр("ru='100%';uk='100%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "_50_50" Тогда 
				Возврат НСтр("ru='50% - 50%';uk='50% - 50%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кумулятивный" Тогда 
				Возврат НСтр("ru='Кумулятивный (по сумме чисел лет)';uk='Кумулятивний (по сумі чисел років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Налоговый" Тогда 
				Возврат НСтр("ru='Налоговый (с 01.04.2011 не актуален)';uk='Податковий (з 01.04.2011 не актуальний)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Производственный" Тогда 
				Возврат НСтр("ru='Производственный';uk='Виробничий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прямолинейный" Тогда 
				Возврат НСтр("ru='Прямолинейный';uk='Прямолінійний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшенияОстатка" Тогда 
				Возврат НСтр("ru='Уменьшения остатка';uk='Зменшення залишку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УскоренногоУменьшенияОстатка" Тогда 
				Возврат НСтр("ru='Ускоренного уменьшения остатка';uk='Прискореного зменшення залишку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОпределенияЗначенияТочкиЗаказа" Тогда 
			Если ИмяДляПеревода = "НеКонтролировать" Тогда 
				Возврат НСтр("ru='Не контролировать';uk='Не контролювати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОптимальныйРазмерЗаказа" Тогда 
				Возврат НСтр("ru='Оптимальный размер заказа';uk='Оптимальний розмір замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СреднийРазмерПартии" Тогда 
				Возврат НСтр("ru='Средний размер партии';uk='Середній розмір партії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Фиксированная" Тогда 
				Возврат НСтр("ru='Фиксированная';uk='Фіксована'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОтраженияПрочегоПоступленияДенежныхСредствВНУ" Тогда 
			Если ИмяДляПеревода = "ВаловыеДоходы" Тогда 
				Возврат НСтр("ru='Валовые доходы';uk='Валові доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОтражать" Тогда 
				Возврат НСтр("ru='Не отражать';uk='Не відображати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноВаловыхРасходов" Тогда 
				Возврат НСтр("ru='Сторно валовых расходов';uk='Сторно валових витрат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОтраженияПрочегоСписанияДенежныхСредствВНУ" Тогда 
			Если ИмяДляПеревода = "ВаловыеРасходы" Тогда 
				Возврат НСтр("ru='Валовые расходы';uk='Валові витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОтражать" Тогда 
				Возврат НСтр("ru='Не отражать';uk='Не відображати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноВаловыхДоходов" Тогда 
				Возврат НСтр("ru='Сторно валовых доходов';uk='Сторно валових доходів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОценки" Тогда 
			Если ИмяДляПеревода = "ЛИФО" Тогда 
				Возврат НСтр("ru='ЛИФО';uk='ЛІФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСредней" Тогда 
				Возврат НСтр("ru='По средней';uk='По середній'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФИФО" Тогда 
				Возврат НСтр("ru='ФИФО';uk='ФІФО'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОценкиСтоимостиВстречногоВыпуска" Тогда 
			Если ИмяДляПеревода = "НеРассчитывается" Тогда 
				Возврат НСтр("ru='Не рассчитывается';uk='Не розраховується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРасчетнойСтоимости" Тогда 
				Возврат НСтр("ru='По расчетной стоимости';uk='По розрахунковій вартості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПеречисленияСуммПоИсполнительнымЛистам" Тогда 
			Если ИмяДляПеревода = "ПочтовымПереводом" Тогда 
				Возврат НСтр("ru='Почтовым переводом';uk='Поштовим переказом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезБанк" Тогда 
				Возврат НСтр("ru='Через банк';uk='Через банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезКассу" Тогда 
				Возврат НСтр("ru='Через кассу';uk='Через касу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПримененияЛьготРаботников" Тогда 
			Если ИмяДляПеревода = "НаКаждогоРебенка" Тогда 
				Возврат НСтр("ru='На каждого ребенка';uk='На кожну дитину'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаКаждогоРебенкаИнвалида" Тогда 
				Возврат НСтр("ru='На каждого ребенка-инвалида';uk='На кожну дитину-інваліда'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаТроихДетей" Тогда 
				Возврат НСтр("ru='На троих и больше детей';uk='На трьох і більше дітей'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Основной" Тогда 
				Возврат НСтр("ru='Основной';uk='Основний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРаспределенияДопРасходов" Тогда 
			Если ИмяДляПеревода = "ПоВесу" Тогда 
				Возврат НСтр("ru='По весу';uk='По вазі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоКоличеству" Тогда 
				Возврат НСтр("ru='По количеству';uk='По кількості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСумме" Тогда 
				Возврат НСтр("ru='По сумме';uk='По сумі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРаспределенияКосвенныхРасходов" Тогда 
			Если ИмяДляПеревода = "МатериальныеЗатраты" Тогда 
				Возврат НСтр("ru='Материальные затраты';uk='Матеріальні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеРаспределяется" Тогда 
				Возврат НСтр("ru='Не распределяется';uk='Не розподіляється'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъемВыпуска" Тогда 
				Возврат НСтр("ru='Объем выпуска';uk='Обсяг випуску'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТруда" Тогда 
				Возврат НСтр("ru='Оплата труда';uk='Оплата праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтдельныеСтатьиПрямыхЗатрат" Тогда 
				Возврат НСтр("ru='Отдельные статьи прямых затрат';uk='Окремі статті прямих витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлановаяСебестоимость" Тогда 
				Возврат НСтр("ru='Плановая себестоимость';uk='Планова собівартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрямыеЗатраты" Тогда 
				Возврат НСтр("ru='Прямые затраты';uk='Прямі витрати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаКомиссионногоВознаграждения" Тогда 
			Если ИмяДляПеревода = "НеРассчитывается" Тогда 
				Возврат НСтр("ru='Не рассчитывается';uk='Не розраховується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентОтПрибыли" Тогда 
				Возврат НСтр("ru='Процент от разности сумм продажи и поступления';uk='Відсоток від різниці сум продажу й надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентОтСуммыПродажи" Тогда 
				Возврат НСтр("ru='Процент от суммы продажи';uk='Відсоток від суми продажу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаОплатыТруда" Тогда 
			Если ИмяДляПеревода = "АлиментыПроцентом" Тогда 
				Возврат НСтр("ru='Алименты процентом';uk='Аліменти відсотком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АлиментыПроцентомДоПредела" Тогда 
				Возврат НСтр("ru='Алименты процентом до предела';uk='Аліменти відсотком до межі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АлиментыФиксСуммой" Тогда 
				Возврат НСтр("ru='Алименты фиксированной суммой';uk='Аліменти фіксованою сумою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АлиментыФиксСуммойДоПредела" Тогда 
				Возврат НСтр("ru='Алименты фиксированной суммой до предела';uk='Аліменти фіксованою сумою до межі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр("ru='Взносы';uk='Внески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВзносыФОТ" Тогда 
				Возврат НСтр("ru='Взносы ФОТ';uk='Внески ФОП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыслугаЛет" Тогда 
				Возврат НСтр("ru='Выслуга лет';uk='Вислуга років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСреднегоЗаработка" Тогда 
				Возврат НСтр("ru='Доплата до среднего заработка';uk='Доплата до середнього заробітку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаЗаВечерниеЧасы" Тогда 
				Возврат НСтр("ru='Доплата за вечерние часы';uk='Доплата за вечірні години'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаЗаНочныеЧасы" Тогда 
				Возврат НСтр("ru='Доплата за ночные часы';uk='Доплата за нічні години'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Замена" Тогда 
				Возврат НСтр("ru='Замена';uk='Заміна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИндексацияЗарплаты" Тогда 
				Возврат НСтр("ru='Индексация зарплаты';uk='Індексація зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИндексацияСоциальныхНачислений" Тогда 
				Возврат НСтр("ru='Индексация социальных начислений';uk='Індексація соціальних нарахувань'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнителныйЛистСУчетомОграничения" Тогда 
				Возврат НСтр("ru='Исполнительный лист с учетом ограничения';uk='Виконавчий лист з урахуванням обмеження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистПроцентом" Тогда 
				Возврат НСтр("ru='Исполнительный лист процентом';uk='Виконавчий лист відсотком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистПроцентомДоПредела" Тогда 
				Возврат НСтр("ru='Исполнительный лист процентом до предела';uk='Виконавчий лист відсотком до межі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистФиксСуммой" Тогда 
				Возврат НСтр("ru='Исполнительный лист фиксированной суммой';uk='Виконавчий лист фіксованою сумою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистФиксСуммойДоПредела" Тогда 
				Возврат НСтр("ru='Исполнительный лист фиксированной суммой до предела';uk='Виконавчий лист фіксованою сумою до межі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияНевыплаченнойЗарплаты" Тогда 
				Возврат НСтр("ru='Компенсация невыплаченной зарплаты';uk='Компенсація невиплаченої зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НулеваяСумма" Тогда 
				Возврат НСтр("ru='Нулевая сумма';uk='Нульова сума'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДневнойТарифнойСтавке" Тогда 
				Возврат НСтр("ru='По дневной тарифной ставке';uk='По денній тарифній ставці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДоговоруФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='По договору фиксированной суммой';uk='За договором  фіксованою сумою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоМесячнойТарифнойСтавкеПоДням" Тогда 
				Возврат НСтр("ru='По месячной тарифной ставке';uk='По місячній тарифній ставці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоМесячнойТарифнойСтавкеПоЧасам" Тогда 
				Возврат НСтр("ru='По месячной тарифной ставке по часам';uk='По місячній тарифній ставці по годинах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработку" Тогда 
				Возврат НСтр("ru='По среднему заработку';uk='По середньому заробіткові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуДляОтпуска" Тогда 
				Возврат НСтр("ru='По среднему заработку для отпуска';uk='По середньому заробіткові для відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуКомпенсацияОтпуска" Тогда 
				Возврат НСтр("ru='По среднему заработку для компенсации отпуска';uk='По середньому заробіткові для компенсації відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуФСС" Тогда 
				Возврат НСтр("ru='По среднему заработку ФСС';uk='По середньому заробіткові ФСС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЧасовойТарифнойСтавке" Тогда 
				Возврат НСтр("ru='По часовой тарифной ставке';uk='По годинній тарифній ставці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПочтовыйСбор" Тогда 
				Возврат НСтр("ru='Почтовый сбор';uk='Поштовий збір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольнаяФормула" Тогда 
				Возврат НСтр("ru='Произвольная формула';uk='Довільна формула'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Процентом" Тогда 
				Возврат НСтр("ru='Процентом';uk='Відсотком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1" Тогда 
				Возврат НСтр("ru='Удалить п1';uk='Вилучити п1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1ДП2ОП3" Тогда 
				Возврат НСтр("ru='(П1 / П2) Оценить по шкале П3';uk='(П1 / П2) Оцінити за шкалою П3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1ДП2УП3" Тогда 
				Возврат НСтр("ru='П1 / (П2 * П3)';uk='П1 / (П2 * П3)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1ОП2" Тогда 
				Возврат НСтр("ru='П1 Оценить по шкале П2';uk='П1 Оцінити по шкалі П2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1ОП2ДП3" Тогда 
				Возврат НСтр("ru='(П1 Оценить по шкале П2) / П3';uk='(П1 Оцінити за шкалою П2) / П3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1ОП2УП3" Тогда 
				Возврат НСтр("ru='(П1 Оценить по шкале П2) * П3';uk='(П1 Оцінити за  шкалою П2) * П3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1УП2" Тогда 
				Возврат НСтр("ru='П1 * П2';uk='П1 * П2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1УП2ДП3" Тогда 
				Возврат НСтр("ru='(П1 * П2) / П3';uk='(П1 * П2) / П3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1УП2ОП3" Тогда 
				Возврат НСтр("ru='(П1 * П2) Оценить по шкале П3';uk='(П1 * П2) Оцінити за шкалою П3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП1УП2УП3" Тогда 
				Возврат НСтр("ru='П1 * П2 * П3';uk='П1 * П2 * П3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьП3ДП1ОП2" Тогда 
				Возврат НСтр("ru='П3 / (П1 Оценить по шкале П2)';uk='П3 / (П1 Оцінити по шкалі П2)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='Удержание фиксированной суммой';uk='Утримання фіксованою сумою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='Фиксированной суммой';uk='Фіксованою сумою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаПоШкале" Тогда 
			Если ИмяДляПеревода = "ПоШкале" Тогда 
				Возврат НСтр("ru='По шкале';uk='За шкалою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прогрессивный" Тогда 
				Возврат НСтр("ru='Прогрессивный';uk='Прогресивний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьСДекретных" Тогда 
				Возврат НСтр("ru='(Не использовать) С декретных';uk='(Не використовувати) З декретних'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаСебестоимостиПродукции" Тогда 
			Если ИмяДляПеревода = "ПоПеределам" Тогда 
				Возврат НСтр("ru='По переделам';uk='По переділах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПодразделениям" Тогда 
				Возврат НСтр("ru='По подразделениям';uk='По підрозділах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаЦены" Тогда 
			Если ИмяДляПеревода = "ПоВхождениюБазовойЦеныВДиапазон" Тогда 
				Возврат НСтр("ru='По вхождению базовой цены в диапазон';uk='По входженню базової ціни в діапазон'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПроцентнойНаценкеНаБазовыйТип" Тогда 
				Возврат НСтр("ru='По процентной наценке на базовый тип';uk='По процентній націнці на базовий тип'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыСписанияОстаткаТоваров" Тогда 
			Если ИмяДляПеревода = "ИзРезерва" Тогда 
				Возврат НСтр("ru='Из резерва';uk='З резерву'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоСклада" Тогда 
				Возврат НСтр("ru='Со склада';uk='Зі складу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтавкиНДС" Тогда 
			Если ИмяДляПеревода = "БезНДС" Тогда 
				Возврат НСтр("ru='Без НДС';uk='Без ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС0" Тогда 
				Возврат НСтр("ru='0%';uk='0%'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "НДС7" Тогда 
				Возврат НСтр("ru='7%';uk='7%'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "НДС20" Тогда 
				Возврат НСтр("ru='20%';uk='20%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДС" Тогда 
				Возврат НСтр("ru='Не НДС';uk='Не ПДВ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтадииВзаимоотношенийСПокупателями" Тогда 
			Если ИмяДляПеревода = "ПостоянныйПокупатель" Тогда 
				Возврат НСтр("ru='Постоянный покупатель';uk='Постійний покупець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПотенциальныйПокупатель" Тогда 
				Возврат НСтр("ru='Потенциальный покупатель';uk='Потенційний покупець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПотерянныйПокупатель" Тогда 
				Возврат НСтр("ru='Потерянный покупатель';uk='Загублений покупець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазовыйПокупатель" Тогда 
				Возврат НСтр("ru='Разовый покупатель';uk='Разовий покупець'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыКонтрагентов" Тогда 
			Если ИмяДляПеревода = "Покупатель" Тогда 
				Возврат НСтр("ru='Покупатель';uk='Покупець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поставщик" Тогда 
				Возврат НСтр("ru='Поставщик';uk='Постачальник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПартийТоваров" Тогда 
			Если ИмяДляПеревода = "ВозвратнаяТара" Тогда 
				Возврат НСтр("ru='Возвратная тара';uk='Зворотна тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратнаяТараОтложеннаяОтгрузка" Тогда 
				Возврат НСтр("ru='Возвратная тара отложенная отгрузка';uk='Зворотна тара відкладене відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПереработку" Тогда 
				Возврат НСтр("ru='В переработку';uk='У переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Купленный" Тогда 
				Возврат НСтр("ru='Купленный';uk='Куплений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КупленныйОтложеннаяОтгрузка" Тогда 
				Возврат НСтр("ru='Купленный отложенная отгрузка';uk='Куплений відкладене відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаКомиссию" Тогда 
				Возврат НСтр("ru='На комиссию';uk='На комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОрдеру" Тогда 
				Возврат НСтр("ru='По ордеру';uk='По ордеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продукция" Тогда 
				Возврат НСтр("ru='Продукция';uk='Продукція'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПисем" Тогда 
			Если ИмяДляПеревода = "Исходящее" Тогда 
				Возврат НСтр("ru='Исходящее';uk='Вихідне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправленное" Тогда 
				Возврат НСтр("ru='Отправленное';uk='Відправлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полученное" Тогда 
				Возврат НСтр("ru='Полученное';uk='Отриманий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сохраненное" Тогда 
				Возврат НСтр("ru='Сохраненное';uk='Збережений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПолученияПередачиТоваров" Тогда 
			Если ИмяДляПеревода = "ВозвратнаяТара" Тогда 
				Возврат НСтр("ru='Возвратная тара';uk='Зворотна тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПереработку" Тогда 
				Возврат НСтр("ru='В переработку';uk='У переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаКомиссию" Тогда 
				Возврат НСтр("ru='На комиссию';uk='На комісію'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРегламентированныхОтчетов" Тогда 
			Если ИмяДляПеревода = "ЖдетПодтвержденияСтатуса" Тогда 
				Возврат НСтр("ru='Ждет подтверждения статуса';uk='Чекає підтвердження статусу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПринят" Тогда 
				Возврат НСтр("ru='Не принят';uk='Не прийнятий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принят" Тогда 
				Возврат НСтр("ru='Принят';uk='Прийнятий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтратегииАвторезервированияНоменклатуры" Тогда 
			Если ИмяДляПеревода = "СначалаВЗаказахПоставщикамПотомНаСкладах" Тогда 
				Возврат НСтр("ru='Сначала в заказах поставщикам потом на складах';uk='Спочатку в замовленнях постачальникам потім на складах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СначалаНаСкладахПотомВЗаказахПоставщикам" Тогда 
				Возврат НСтр("ru='Сначала на складах потом в заказах поставщикам';uk='Спочатку на складах потім у замовленнях постачальникам'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтратегияРедактированияНомеровОбъектов" Тогда 
			Если ИмяДляПеревода = "Доступно" Тогда 
				Возврат НСтр("ru='Доступно';uk='Доступно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Недоступно" Тогда 
				Возврат НСтр("ru='Недоступно';uk='Недоступно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтретегииСписанияПартийТоваровПоСтатусам" Тогда 
			Если ИмяДляПеревода = "СначалаПринятыеПотомСобственные" Тогда 
				Возврат НСтр("ru='Сначала принятые потом собственные';uk='Спочатку прийняті потім власні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СначалаСобственныеПотомПринятые" Тогда 
				Возврат НСтр("ru='Сначала собственные потом принятые';uk='Спочатку власні потім прийняті'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипДетализацииСтандартныхОтчетов" Тогда 
			Если ИмяДляПеревода = "Иерархия" Тогда 
				Возврат НСтр("ru='С группами';uk='Із групами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоИерархия" Тогда 
				Возврат НСтр("ru='Только группы';uk='Тільки групи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Элементы" Тогда 
				Возврат НСтр("ru='Без групп';uk='Без груп'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипНалоговойДеятельности" Тогда 
			Если ИмяДляПеревода = "НеОблагаемый" Тогда 
				Возврат НСтр("ru='Не облагаемый';uk='Не оподатковуваний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыйПоОбычнойСтавке" Тогда 
				Возврат НСтр("ru='Облагаемый по обычной ставке';uk='Оподатковуваний по звичайній ставці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныйОтНалогообложения" Тогда 
				Возврат НСтр("ru='Освобожденный от налогообложения';uk='Звільнений від оподаткування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипОчередиДляОбработкиЭлектронныхСообщений" Тогда 
			Если ИмяДляПеревода = "ВсеОчереди" Тогда 
				Возврат НСтр("ru='Все очереди';uk='Усі черги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновнаяОчередь" Тогда 
				Возврат НСтр("ru='Основная очередь';uk='Основна черга'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТестоваяОчередь" Тогда 
				Возврат НСтр("ru='Тестовая очередь';uk='Тестова черга'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыАвтоматическогоОбменаДанными" Тогда 
			Если ИмяДляПеревода = "ОбменЧерезComСоединение" Тогда 
				Возврат НСтр("ru='Обмен через подключение к информационной базе';uk='Обмін через підключення до інформаційної бази'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбменЧерезFTPРесурс" Тогда 
				Возврат НСтр("ru='Обмен через FTP ресурс';uk='Обмін через FTP ресурс'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбменЧерезПочту" Тогда 
				Возврат НСтр("ru='Обмен электронными сообщениями';uk='Обмін електронними повідомленнями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбменЧерезФайловыйРесурс" Тогда 
				Возврат НСтр("ru='Обмен через файловый ресурс';uk='Обмін через файловий ресурс'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДомов" Тогда 
			Если ИмяДляПеревода = "Владение" Тогда 
				Возврат НСтр("ru='владение';uk='володіння'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дом" Тогда 
				Возврат НСтр("ru='дом';uk='будинок'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИнформационныхКарт" Тогда 
			Если ИмяДляПеревода = "Дисконтная" Тогда 
				Возврат НСтр("ru='Дисконтная';uk='Дисконтна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Регистрационная" Тогда 
				Возврат НСтр("ru='Регистрационная';uk='Реєстраційна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИсточниковДанных" Тогда 
			Если ИмяДляПеревода = "ВнешняяОбработка" Тогда 
				Возврат НСтр("ru='Внешняя обработка';uk='Зовнішня обробка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольныйОтчет" Тогда 
				Возврат НСтр("ru='Произвольный отчет';uk='Довільний звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТиповойОтчет" Тогда 
				Возврат НСтр("ru='Типовой отчет';uk='Типовий звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УниверсальныйОтчет" Тогда 
				Возврат НСтр("ru='Универсальный отчет';uk='Універсальний звіт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКвартир" Тогда 
			Если ИмяДляПеревода = "Квартира" Тогда 
				Возврат НСтр("ru='кв.';uk='кв.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Офис" Тогда 
				Возврат НСтр("ru='оф.';uk='оф.'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКонтактнойИнформации" Тогда 
			Если ИмяДляПеревода = "Адрес" Тогда 
				Возврат НСтр("ru='Адрес';uk='Адреса'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АдресЭлектроннойПочты" Тогда 
				Возврат НСтр("ru='E-Mail';uk='E-maіl'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВебСтраница" Тогда 
				Возврат НСтр("ru='Веб-страница';uk='Веб-сторінка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Другое" Тогда 
				Возврат НСтр("ru='Другое';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Телефон" Тогда 
				Возврат НСтр("ru='Телефон';uk='Телефон'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКорпусов" Тогда 
			Если ИмяДляПеревода = "Корпус" Тогда 
				Возврат НСтр("ru='корпус';uk='корпус'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строение" Тогда 
				Возврат НСтр("ru='строение';uk='будівля'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыНастроек" Тогда 
			Если ИмяДляПеревода = "НастройкиОтчета" Тогда 
				Возврат НСтр("ru='Настройки отчета';uk='Настройки звіту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастройкиПользователяНастройкиОтчета" Тогда 
				Возврат НСтр("ru='Настройки пользователя настройки отчета';uk='Настройки користувача настройки звіту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастрокиФормы" Тогда 
				Возврат НСтр("ru='Настроки формы';uk='Настройки форми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщиеНастройкиОтчетов" Тогда 
				Возврат НСтр("ru='Общие настройки отчетов';uk='Загальні настройки звітів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольныеНастройки" Тогда 
				Возврат НСтр("ru='Произвольные настройки';uk='Довільні настройки'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыНоменклатуры" Тогда 
			Если ИмяДляПеревода = "Комплект" Тогда 
				Возврат НСтр("ru='Набор-комплект';uk='Набір-Комплект'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Набор" Тогда 
				Возврат НСтр("ru='Набор-пакет';uk='Набір-Пакет'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товар" Тогда 
				Возврат НСтр("ru='Товар';uk='Товар'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Услуга" Тогда 
				Возврат НСтр("ru='Услуга';uk='Послуга'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОплатЧекаККМ" Тогда 
			Если ИмяДляПеревода = "БанковскийКредит" Тогда 
				Возврат НСтр("ru='Банковский кредит';uk='Банківський кредит'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Наличные" Тогда 
				Возврат НСтр("ru='Наличные';uk='Готівка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежнаяКарта" Тогда 
				Возврат НСтр("ru='Платежная карта';uk='Платіжна карта'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОтветаНаВопросАнкеты" Тогда 
			Если ИмяДляПеревода = "Адрес" Тогда 
				Возврат НСтр("ru='адреса';uk='адреса'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АдресЭлектроннойПочты" Тогда 
				Возврат НСтр("ru='адреса электронной почты';uk='адреси електронної пошти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Булево" Тогда 
				Возврат НСтр("ru='да/нет';uk='так/ні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВебСтраница" Тогда 
				Возврат НСтр("ru='ссылки на веб-страницу';uk='посилання на веб-сторінку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дата" Тогда 
				Возврат НСтр("ru='даты';uk='дати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Другое" Тогда 
				Возврат НСтр("ru='другой контактной информации';uk='іншої контактної інформації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтактнаяИнформация" Тогда 
				Возврат НСтр("ru='контактной информации';uk='контактної інформації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НесколькоВариантовОтвета" Тогда 
				Возврат НСтр("ru='нескольких вариантов из списка';uk='декількох варіантів зі списку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОдинИзВариантовОтвета" Тогда 
				Возврат НСтр("ru='одного из вариантов';uk='одного з варіантів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ссылка" Тогда 
				Возврат НСтр("ru='ссылки';uk='посилання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строка" Тогда 
				Возврат НСтр("ru='строки';uk='рядка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Табличный" Тогда 
				Возврат НСтр("ru='таблицы';uk='таблиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Текст" Тогда 
				Возврат НСтр("ru='текста';uk='тексту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Телефон" Тогда 
				Возврат НСтр("ru='телефонного номера';uk='телефонного номера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Число" Тогда 
				Возврат НСтр("ru='числа';uk='числа'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПоказателейСхемМотивации" Тогда 
			Если ИмяДляПеревода = "Денежный" Тогда 
				Возврат НСтр("ru='Денежный';uk='Грошовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОценочнаяШкалаПроцентная" Тогда 
				Возврат НСтр("ru='Оценочная шкала процентная';uk='Оцінна шкала процентна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОценочнаяШкалаЧисловая" Тогда 
				Возврат НСтр("ru='Оценочная шкала числовая';uk='Оцінна шкала числова'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Процентный" Тогда 
				Возврат НСтр("ru='Процентный';uk='Процентний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Числовой" Тогда 
				Возврат НСтр("ru='Числовой';uk='Числовий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСкладов" Тогда 
			Если ИмяДляПеревода = "НТТ" Тогда 
				Возврат НСтр("ru='НТТ без суммового учета';uk='НТТ без суммового обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оптовый" Тогда 
				Возврат НСтр("ru='Оптовый';uk='Гуртовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Розничный" Тогда 
				Возврат НСтр("ru='Розничный';uk='Роздрібний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СНТТ" Тогда 
				Возврат НСтр("ru='НТТ с суммовым учетом';uk='НТТ із суммовым обліком'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСтруктурныхЕдиниц" Тогда 
			Если ИмяДляПеревода = "Касса" Тогда 
				Возврат НСтр("ru='Касса';uk='Каса'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Склад" Тогда 
				Возврат НСтр("ru='Склад';uk='Склад'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСчетчиковВыгрузки" Тогда 
			Если ИмяДляПеревода = "СчетчикДокументовВФормате201" Тогда 
				Возврат НСтр("ru='Счетчик документов в формате 2.01';uk='Лічильник документів у форматі 2.01'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикДокументовВФормате300" Тогда 
				Возврат НСтр("ru='Счетчик документов в формате 3.00';uk='Лічильник документів у форматі 3.00'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикФайлов" Тогда 
				Возврат НСтр("ru='Счетчик файлов';uk='Лічильник файлів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикФайловАлко" Тогда 
				Возврат НСтр("ru='Счетчик файлов для алкогольных деклараций';uk='Лічильник файлів для алкогольних декларацій'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТоварТара" Тогда 
			Если ИмяДляПеревода = "Тара" Тогда 
				Возврат НСтр("ru='Тара';uk='Тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товар" Тогда 
				Возврат НСтр("ru='Товар';uk='Товар'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТООшибкиККМOffline" Тогда 
			Если ИмяДляПеревода = "ОшибкаВыгрузкиТоваров" Тогда 
				Возврат НСтр("ru='При попытке выгрузки товаров в ККМ, подключаемую в режиме Offline, произошла ошибка. Товары не были выгружены.';uk='При спробі вивантаження товарів у ККМ, що підключається в режимі Offlіne, відбулася помилка. Товари не були вивантажені.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаЗагрузкиОтчета" Тогда 
				Возврат НСтр("ru='При попытке загрузки отчёта о продажах из ККМ, подключаемой в режиме Offline, произошла ошибка. Отчёт не был загружен.';uk='При спробі завантаження звіту про продажі із ККМ, що підключається в режимі Offlіne, відбулася помилка. Звіт не був завантажений.'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТООшибкиОбщие" Тогда 
			Если ИмяДляПеревода = "ОшибкаЗагрузкиДрайвера" Тогда 
				Возврат НСтр("ru='Не удалось загрузить драйвер торгового оборудования';uk='Не вдалося завантажити драйвер торговельного обладнання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаЗагрузкиОбработкиОбслуживания" Тогда 
				Возврат НСтр("ru='Ошибка загрузки обработки обслуживания';uk='Помилка завантаження обробки обслуговування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНеизвестно" Тогда 
				Возврат НСтр("ru='Неизвестная ошибка';uk='Невідома помилка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНетПрав" Тогда 
				Возврат НСтр("ru='У текущего пользователя нет прав на использование торгового оборудования';uk='У поточного користувача немає прав на використання торговельного обладнання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаПараметровНастройки" Тогда 
				Возврат НСтр("ru='Подключаемое оборудование не было корректно настроено';uk='Обладнання, що підключається, не було коректно настроєне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаПриПодключении" Тогда 
				Возврат НСтр("ru='Ошибка при подключении устройства';uk='Помилка при підключенні обладнання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаТестНеПройден" Тогда 
				Возврат НСтр("ru='Тест устройства не был пройден';uk='Тест обладнання не був пройдений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТООшибкиСМК" Тогда 
			Если ИмяДляПеревода = "ОшибкаНеизвестнаяКарта" Тогда 
				Возврат НСтр("ru='Считанная карта не может быть обработана';uk='Прочитана карта не може бути оброблена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТООшибкиСШК" Тогда 
			Если ИмяДляПеревода = "ОшибкаНеизвестныйШтрихкод" Тогда 
				Возврат НСтр("ru='Считанный штрихкод не может быть обработан';uk='Прочитаний штрихкод не може бути оброблений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТООшибкиТСД" Тогда 
			Если ИмяДляПеревода = "ОшибкаЗагрузкиСтроки" Тогда 
				Возврат НСтр("ru='Ошибка загрузки строки';uk='Помилка завантаження рядка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНеизвестныйТовар" Тогда 
				Возврат НСтр("ru='Загружен штрихкод неизвестного товара';uk='Завантажений штрихкод невідомого товару'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНетЗаписей" Тогда 
				Возврат НСтр("ru='В таблице терминала нет данных';uk='У таблиці термінала немає даних'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТООшибкиФР" Тогда 
			Если ИмяДляПеревода = "ОшибкаНеобходимПарольАдминистратора" Тогда 
				Возврат НСтр("ru='Для выполнения данной операции необходим корректный пароль администратора';uk='Для виконання даної операції необхідний коректний пароль адміністратора'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНеобходимПарольКассира" Тогда 
				Возврат НСтр("ru='Для выполнения данной операции необходим корректный пароль кассира';uk='Для виконання даної операції необхідний коректний пароль касира'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНетВозможностиПечатиПКО" Тогда 
				Возврат НСтр("ru='Данный фискальный регистратор не имеет возможности отражать в чеке факт наличных расчетов с юридическими лицами';uk='Даний фіскальний реєстратор не має можливості відбивати в чеку факт розрахунків готівкою з юридичними особами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаНетНаличных" Тогда 
				Возврат НСтр("ru='Недостаточно наличных средств в кассе для выполнения операции';uk='Недостатньо наявних засобів у касі для виконання операції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаРежимПечатиЧека" Тогда 
				Возврат НСтр("ru='Выполнение данного действия невозможно в режиме печати чека';uk='Виконання даного дії неможливо в режимі друку чека'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаСуммыНедостаточно" Тогда 
				Возврат НСтр("ru='Переданной суммы недостаточно для оплаты';uk='Переданої суми недостатньо для оплати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТСДПоляДанных" Тогда 
			Если ИмяДляПеревода = "Качество" Тогда 
				Возврат НСтр("ru='Качество';uk='Якість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоНаСкладе" Тогда 
				Возврат НСтр("ru='Количество на складе';uk='Кількість на складі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураАртикул" Тогда 
				Возврат НСтр("ru='Артикул номенклатуры';uk='Артикул номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураИзмерение" Тогда 
				Возврат НСтр("ru='Единица измерения номенклатуры';uk='Одиниця вимірювання номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураКод" Тогда 
				Возврат НСтр("ru='Код номенклатуры';uk='Код номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураНаименование" Тогда 
				Возврат НСтр("ru='Наименование номенклатуры';uk='Найменування номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураСерия" Тогда 
				Возврат НСтр("ru='Серия номенклатуры';uk='Серія номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураХарактеристика" Тогда 
				Возврат НСтр("ru='Характеристика номенклатуры';uk='Характеристика номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НоменклатураЦена" Тогда 
				Возврат НСтр("ru='Цена номенклатуры';uk='Ціна номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ШтрихКод" Тогда 
				Возврат НСтр("ru='Штрихкод';uk='Штрихкод'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УсловияОплатыРасчетныхДокументов" Тогда 
			Если ИмяДляПеревода = "БезАкцепта" Тогда 
				Возврат НСтр("ru='Без акцепта';uk='Без акцепту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "САкцептом" Тогда 
				Возврат НСтр("ru='С акцептом';uk='З акцептом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УсловияСкидкиНаценки" Тогда 
			Если ИмяДляПеревода = "БезУсловий" Тогда 
				Возврат НСтр("ru='Без условий';uk='Без умов'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоВидуДисконтныхКарт" Тогда 
				Возврат НСтр("ru='По виду дисконтных карт';uk='По виду дисконтних карт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоВидуОплаты" Тогда 
				Возврат НСтр("ru='По виду оплаты';uk='По виду оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДисконтнойКарте" Тогда 
				Возврат НСтр("ru='По дисконтной карте';uk='По дисконтній карті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоКоличествуТовара" Тогда 
				Возврат НСтр("ru='Количество одного товара в документе превысило';uk='Кількість одного товару в документі перевищило'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСуммеДокумента" Тогда 
				Возврат НСтр("ru='Сумма документа продажи превысила ';uk='Сума документа продажу перевищив '" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РучнаяСкидка" Тогда 
				Возврат НСтр("ru='Ручная скидка';uk='Ручна знижка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпецПредложение" Тогда 
				Возврат НСтр("ru='Спец. предложение';uk='Спец. пропозиція'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УсловияФильтровЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "ПолеКомуСодержит" Тогда 
				Возврат НСтр("ru='Поле ""Кому"" содержит ...';uk='Поле ""Кому"" містить ...'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолеКопииСодержит" Тогда 
				Возврат НСтр("ru='Поле ""Копии"" содержит ...';uk='Поле ""Копії"" містить ...'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолеОтправительСодержит" Тогда 
				Возврат НСтр("ru='Поле ""Отправитель"" содержит ...';uk='Поле ""Відправник"" містить ...'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекстПисьмаСодержит" Тогда 
				Возврат НСтр("ru='Текст письма содержит ...';uk='Текст листа містить ...'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТемаПисьмаСодержит" Тогда 
				Возврат НСтр("ru='Тема письма содержит ...';uk='Тема листа містить ...'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФормыОбучения" Тогда 
			Если ИмяДляПеревода = "Вечерняя" Тогда 
				Возврат НСтр("ru='Вечерняя';uk='Вечірня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Заочная" Тогда 
				Возврат НСтр("ru='Заочная';uk='Заочна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Очная" Тогда 
				Возврат НСтр("ru='Очная';uk='Очна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Экстернат" Тогда 
				Возврат НСтр("ru='Экстернат';uk='Екстернат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерВыплатыПоДоговору" Тогда 
			Если ИмяДляПеревода = "Ежемесячно" Тогда 
				Возврат НСтр("ru='Ежемесячно';uk='Щомісяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОднократноВКонцеСрока" Тогда 
				Возврат НСтр("ru='Однократно в конце срока';uk='Однократно наприкінці  строку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерЗатрат" Тогда 
			Если ИмяДляПеревода = "АдминистративныеРасходы" Тогда 
				Возврат НСтр("ru='Административные затраты';uk='Адміністративні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БракВПроизводстве" Тогда 
				Возврат НСтр("ru='Брак в производстве';uk='Брак у виробництві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВложенияВоВнеоборотныеАктивы" Тогда 
				Возврат НСтр("ru='Вложения во внеоборотные активы';uk='Вкладення у внеоборотні активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщепроизводственныеРасходы" Тогда 
				Возврат НСтр("ru='Общепроизводственные расходы';uk='Загальновиробничі витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводственныеРасходы" Тогда 
				Возврат НСтр("ru='Производственные расходы';uk='Виробничі витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочие" Тогда 
				Возврат НСтр("ru='Прочие';uk='Інші'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеОперационныеРасходы" Тогда 
				Возврат НСтр("ru='Прочие операционные затраты';uk='Інші операційні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыНаСбыт" Тогда 
				Возврат НСтр("ru='Затраты на сбыт';uk='Витрати на збут'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТранспортноЗаготовительныеРасходы" Тогда 
				Возврат НСтр("ru='Транспортно - заготовительные расходы';uk='Транспортно - заготівельні витрати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЮрФизЛицо" Тогда 
			Если ИмяДляПеревода = "ФизЛицо" Тогда 
				Возврат НСтр("ru='Физ. лицо';uk='Фіз. особа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЮрЛицо" Тогда 
				Возврат НСтр("ru='Юр. лицо';uk='Юр. особа'" ,КодЯзыка);			
			КонецЕсли;
			
		КонецЕсли;	
		
КонецФункции //ОбработатьПереводы()

Процедура РазделитьСлово(СловоДляПеревода, Слово, Префикс, Суффикс, КодЯзыкаРезультат, КодЯзыкаИсточник)

	Префикс = "";
	Суффикс = "";
	
	// обработаем пробелы в конце
	Слово = СокрП(СловоДляПеревода);
	Если СтрДлина(Слово) <> СтрДлина(СловоДляПеревода) Тогда
		Суффикс = Сред(СловоДляПеревода, СтрДлина(Слово) + 1) + Суффикс;
	КонецЕсли;	
	
	// обработаем : в конце
	Если Прав(Слово, 1) = ":" Тогда
		Суффикс = ":" + Суффикс;
		Слово = Лев(Слово, СтрДлина(Слово) - 1);
	КонецЕсли; 
	
	СтрокаКатегории = НСтр("ru=' (категории)';uk=' (категорії)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаКатегории)) = СтрокаКатегории Тогда
		Суффикс = НСтр("ru=' (категории)';uk=' (категорії)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаКатегории));
	КонецЕсли; 
	
	СтрокаКатегория = НСтр("ru='(категория ';uk='(категорія '", КодЯзыкаИсточник);
	ПозКатегория = Найти(Слово, СтрокаКатегория);
	Если ПозКатегория <> 0 Тогда
		Префикс = Лев(Слово, ПозКатегория - 1);
		Префикс = Префикс + НСтр("ru='(категория ';uk='(категорія '", КодЯзыкаРезультат);
		Слово   = Сред(Слово, ПозКатегория + СтрДлина(СтрокаКатегория));
		Слово   = Сред(Слово, 1, СтрДлина(Слово) - 1);
		Суффикс = ")" + Суффикс;
	КонецЕсли; 
	
	СтрокаСвойство = НСтр("ru='(св-во ';uk='(вл-ть '", КодЯзыкаИсточник);
	ПозСвойство = Найти(Слово, СтрокаСвойство);
	Если ПозСвойство <> 0 Тогда
		Префикс = Лев(Слово, ПозСвойство - 1);
		Префикс = Префикс + НСтр("ru='(св-во ';uk='(вл-ть '", КодЯзыкаРезультат);
		Слово   = Сред(Слово, ПозСвойство + СтрДлина(СтрокаСвойство));
		Слово   = Сред(Слово, 1, СтрДлина(Слово) - 1);
		Суффикс = ")" + Суффикс;
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (нач. ост.)';uk=' (поч. зал.)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (нач. ост.)';uk=' (поч. зал.)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (приход)';uk=' (прибуток)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (приход)';uk=' (прибуток)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (расход)';uk=' (витрата)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (расход)';uk=' (витрата)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (кон. ост.)';uk=' (кін. зал.)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (кон. ост.)';uk=' (кін. зал.)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (оборот)';uk=' (оборот)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (оборот)';uk=' (оборот)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = " (" + глЗначениеПеременной("ВалютаУправленческогоУчета") + ")";
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = " (" + глЗначениеПеременной("ВалютаУправленческогоУчета") + ")" + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = " (" + глЗначениеПеременной("ВалютаРегламентированногоУчета") + ")";
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = " (" + глЗначениеПеременной("ВалютаРегламентированногоУчета") + ")" + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в ед. хранения)';uk=' (в од. зберігання)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в ед. хранения)';uk=' (в од. зберігання)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в базовых ед.)';uk=' (у базових од.)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в базовых ед.)';uk=' (у базових од.)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в ед. отчетов)';uk=' (в од. звітів)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в ед. отчетов)';uk=' (в од. звітів)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в ед. заказа)';uk=' (в од. замовлення)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в ед. заказа)';uk=' (в од. замовлення)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в валюте упр. учета)';uk=' (у валюті упр. обліку)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в валюте упр. учета)';uk=' (у валюті упр. обліку)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в валюте регл. учета)';uk=' (у валюті регл. обліку)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в валюте регл. учета)';uk=' (у валюті регл. обліку)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в валюте взаиморасчетов)';uk=' (у валюті взаєморозрахунків)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в валюте взаиморасчетов)';uk=' (у валюті взаєморозрахунків)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (управленческий учет)';uk=' (управлінський облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (управленческий учет)';uk=' (управлінський облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (бухгалтерский учет)';uk=' (бухгалтерський облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (бухгалтерский учет)';uk=' (бухгалтерський облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (налоговый учет)';uk=' (податковий облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (налоговый учет)';uk=' (податковий облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	
	СловоБезПробелов = СокрП(Слово);
	Если СтрДлина(Слово) <> СтрДлина(СловоБезПробелов) Тогда
		Суффикс = Сред(Слово, СтрДлина(СловоБезПробелов) + 1) + Суффикс;
		Слово   = СловоБезПробелов;
	КонецЕсли;	
	
КонецПроцедуры // РазделитьСлово()

Функция ПолучитьПереводСлова(СловоДляПеревода, КодЯзыкаРезультат = Неопределено, КодЯзыкаИсточник = "ru") Экспорт
	
	Если КодЯзыкаРезультат = Неопределено Тогда
		КодЯзыкаРезультат = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	КонецЕсли; 
	
	Если КодЯзыкаРезультат = КодЯзыкаИсточник Тогда	
		// переводить не требуется
		Возврат СловоДляПеревода;
	КонецЕсли; 
	
	Слово   = СловоДляПеревода;
	Префикс = "";
	Суффикс = "";
	
	РазделитьСлово(СловоДляПеревода, Слово, Префикс, Суффикс, КодЯзыкаРезультат, КодЯзыкаИсточник);
	
	ХешИсточник = ЛокализацияПовтИсп.ПолучитьХешСтроки(Слово);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	| 	Переводы.ТекстRU КАК Текст,
	|   Переводы.ТекстUK КАК Перевод
	|ИЗ 
	|	РегистрСведений.ПереводыТекстов КАК Переводы
	|ГДЕ
	|	Переводы.ХешRU = &Хеш 
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "RU", ВРЕГ(КодЯзыкаИсточник));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "UK", ВРЕГ(КодЯзыкаРезультат));
	
	Запрос.УстановитьПараметр("Хеш", ХешИсточник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Количество = Выборка.Количество();
	
	Результат = "";
	НеобходимоДобавить = Истина;
	
	Если Количество = 0 Тогда
		НеобходимоДобавить = Истина;
	ИначеЕсли Количество = 1 Тогда
		Выборка.Следующий();
		Если Выборка.Текст = Слово Тогда
			Результат = Выборка.Перевод;
			НеобходимоДобавить = Ложь;
		КонецЕсли;	
	Иначе
		Пока Выборка.Следующий() Цикл 
			Если Выборка.Текст = Слово Тогда
				Результат = Выборка.Перевод;
				НеобходимоДобавить = Ложь;
				Прервать;
			КонецЕсли; 	
		КонецЦикла;	
	КонецЕсли; 
	
	Если НеобходимоДобавить Тогда
		
		Запись = РегистрыСведений.ПереводыТекстов.СоздатьМенеджерЗаписи();
		
		ИмяПоляТекстИсточник  = "Текст" + ВРЕГ(КодЯзыкаИсточник);
		ИмяПоляТекстРезультат = "Текст" + ВРЕГ(КодЯзыкаРезультат);
		
		Запись[ИмяПоляТекстИсточник]  = Слово;
		Запись[ИмяПоляТекстРезультат] = "";
		
		Запись.Записать();
		Если ТестовыйРежим() Тогда
			Сообщить(НСтр("ru='ПолучитьПереводСлова - добавлена запись в РегистрыСведений.Переводы для ';uk='ПолучитьПереводСлова - доданий запис у РегистрыСведений.Переводы для '") + Слово + НСтр("ru=', необходимо добавить перевод на ';uk=', необхідно додати переклад на '") + ВРЕГ(КодЯзыкаРезультат));
		КонецЕсли; 
		
		Результат = Слово;
		
	ИначеЕсли ПустаяСтрока(Результат) Тогда
		
		Если ТестовыйРежим() Тогда
			Сообщить(НСтр("ru='ПолучитьПереводСлова - не найден перевод для ';uk='ПолучитьПереводСлова - не знайдений переклад для '") + Слово + НСтр("ru=' на ';uk=' на '") + ВРЕГ(КодЯзыкаРезультат));
		КонецЕсли; 
		
		Результат = Слово;
		
	КонецЕсли; 
	
	Возврат Префикс + Результат + Суффикс;

КонецФункции // ПолучитьПереводСлова()

Функция ПолучитьМассивНаименованийСубконто() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыСубконтоХозрасчетные.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ВидыСубконтоХозрасчетные КАК ВидыСубконтоХозрасчетные
	|";	
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
	Возврат Результат;

КонецФункции // ПолучитьМассивНаименованийСубконто()

Функция ПолучитьПереводТекста(Текст, КодЯзыкаРезультат = Неопределено, КодЯзыкаИсточник = "ru", ПереводитьСубконто = Истина) Экспорт
	
	Если КодЯзыкаРезультат = Неопределено Тогда
		КодЯзыкаРезультат = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	КонецЕсли; 
	
	Если КодЯзыкаРезультат = КодЯзыкаИсточник Тогда	
		// переводить не требуется
		Возврат Текст;
	КонецЕсли; 
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Текст;
	КонецЕсли; 
	
	Если Не ПереводитьСубконто Тогда
		МассивНепереводимыхСлов = ЛокализацияПовтИсп.ПолучитьМассивНаименованийСубконто();
	Иначе
		МассивНепереводимыхСлов = Неопределено;
	КонецЕсли; 
	
	МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, ".");
	КоличествоСтрок = МассивСтрок.Количество();
	
	ПереводитьКакПодстроки = Ложь;
	
	Если КоличествоСтрок > 1 Тогда
		ПереводитьКакПодстроки = Истина;
		
		Для Индекс = 1 По КоличествоСтрок - 1 Цикл
			ТекСтрока  = МассивСтрок[Индекс];
			ПредСтрока = МассивСтрок[Индекс - 1];
			ПервыйСимволПредыдущей = Лев(ПредСтрока, 1);
			Если НЕ (ЛокализацияПовтИсп.СимволБуква(ПервыйСимволПредыдущей) ИЛИ ЛокализацияПовтИсп.СимволЦифра(ПервыйСимволПредыдущей)) Тогда
				ПереводитьКакПодстроки = Ложь;
				Прервать;
			КонецЕсли; 
			ПервыйСимволТекущей = Лев(ТекСтрока, 1);
			Если НЕ (ЛокализацияПовтИсп.СимволБуква(ПервыйСимволТекущей) И ВРЕГ(ПервыйСимволТекущей) = ПервыйСимволТекущей) Тогда
				ПереводитьКакПодстроки = Ложь;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	
	Если ПереводитьКакПодстроки Тогда
		Результат = "";
		Для Индекс = 0 По КоличествоСтрок - 1 Цикл
			Если МассивНепереводимыхСлов <> Неопределено И МассивНепереводимыхСлов.Найти(МассивСтрок[Индекс]) <> Неопределено Тогда
				ПереводСлова = МассивСтрок[Индекс];
			Иначе
				ПереводСлова = ЛокализацияПовтИсп.ПолучитьПереводСлова(МассивСтрок[Индекс], КодЯзыкаРезультат, КодЯзыкаИсточник);
			КонецЕсли;
				
			Результат = Результат 
						+ ?(ПустаяСтрока(Результат), "", ".") 
						+ ПереводСлова;
						
		КонецЦикла; 
		Возврат Результат;
	Иначе
		МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, Символы.ПС);
		КоличествоСтрок = МассивСтрок.Количество();
		Если КоличествоСтрок = 1 Тогда
			Если МассивНепереводимыхСлов <> Неопределено И МассивНепереводимыхСлов.Найти(Текст) <> Неопределено Тогда
				Возврат Текст;
			Иначе
				Возврат ЛокализацияПовтИсп.ПолучитьПереводСлова(Текст, КодЯзыкаРезультат, КодЯзыкаИсточник);
			КонецЕсли;	
		Иначе	
			Результат = "";
			Для Индекс = 0 По КоличествоСтрок - 1 Цикл
				
				Если МассивНепереводимыхСлов <> Неопределено И МассивНепереводимыхСлов.Найти(МассивСтрок[Индекс]) <> Неопределено Тогда
					ПереводСлова = МассивСтрок[Индекс];
				Иначе
					ПереводСлова = ЛокализацияПовтИсп.ПолучитьПереводСлова(МассивСтрок[Индекс], КодЯзыкаРезультат, КодЯзыкаИсточник);
				КонецЕсли;
				
				Результат = Результат 
							+ ?(ПустаяСтрока(Результат), "", Символы.ПС) 
							+ ПереводСлова;
				
				
			КонецЦикла; 
			Возврат Результат;
		КонецЕсли; 
	КонецЕсли;

КонецФункции // ПолучитьПереводТекста()

Функция ОбработатьИсключенияЗначенийПолейСКД(ЗначениеПоля, КодЯзыка) Экспорт
	
	НовоеЗначениеПоля = Неопределено; 
	
	Если Лев(ЗначениеПоля, 7) = "Период:" Тогда
		
		НовоеЗначениеПоля = НСтр("ru='Период:';uk='Період:'", КодЯзыка) + 
							Сред(ЗначениеПоля, 8);
							
							
	ИначеЕсли Лев(ЗначениеПоля, 27) = НСтр("ru='Период формирования отчета:';uk='Період формування звіту:'") Тогда
		
		НовоеЗначениеПоля = НСтр("ru='Период формирования отчета:';uk='Період формування звіту:'", КодЯзыка) + 
							Сред(ЗначениеПоля, 28);
							
	ИначеЕсли Лев(ЗначениеПоля, 5) = "Дата:" Тогда
		
		НовоеЗначениеПоля = НСтр("ru='Дата:';uk='Дата:'", КодЯзыка) + 
							Сред(ЗначениеПоля, 6);
							
	ИначеЕсли ЗначениеПоля = НСтр("ru='Итого';uk='Разом'", КодЯзыка) Тогда
		// не переводим, СКД "сама перевела"
		НовоеЗначениеПоля = ЗначениеПоля;
	КонецЕсли; 
	
	Возврат НовоеЗначениеПоля;

КонецФункции // ОбработатьИсключенияЗначенийПолейСКД()

Функция ПолучитьХешСтроки(Строка) Экспорт
	
	
	МаксХеш = 4294967295; // Pow(2, 32) - 1
	Простое = 33; 

	Результат = 0;
	
	Длина = СтрДлина(Строка);
	
	Если Длина = 0 Тогда
		Возврат 0;
	КонецЕсли; 
	
	Для Поз = 1 По Длина Цикл
		Результат = Результат * Простое + КодСимвола(Строка, Поз);
		Если Результат > МаксХеш Тогда
			Результат = Результат % МаксХеш;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции // ПолучитьХешСтроки()

Функция ПолучитьПереводДляОтчетовНаСКД(Строка, КодЯзыка = Неопределено, ПереводитьСубконто = Истина) Экспорт	
	Возврат ЛокализацияПовтИсп.ПолучитьПереводТекста(Строка, КодЯзыка,,ПереводитьСубконто);
КонецФункции // ПолучитьПереводДляОтчетовНаСКД()

Функция ПолучитьФорматЯзыкаДляПредставленияВСхемахСКД() Экспорт
	
	КодЯзыка  = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Результат = ";Л=" + ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
	Возврат Результат;

КонецФункции // ПолучитьФорматЯзыкаДляПредставленияВСхемахСКД()
 
// Проверяет, является ли символ цифрой.
//
// Параметры:
//  СимволПроверки - символ для проверки.
//
// Возвращаемое значение:
//  Истина       - символ является цифрой;
//  Ложь         - символ не является цифрой;
//
Функция СимволЦифра(Знач СимволПроверки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СимволПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодСимвола = КодСимвола(СимволПроверки);
	Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СимволЦифра()

// Проверяет, является ли символ символом кириллического алфавита.
//
// Параметры: 
//    СимволПроверки - символ проверки
//
// Возвращаемое значение:
//  Истина       - символ является символом кириллического алфавита;
//  Ложь         - символ не является символом кириллического алфавита или пустой;
//
Функция СимволКириллица(Знач СимволПроверки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СимволПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	КодыДопустимыхСимволов.Добавить(1105); // "ё"
	КодыДопустимыхСимволов.Добавить(1025); // "Ё"
	КодыДопустимыхСимволов.Добавить(1110); // "і"
	КодыДопустимыхСимволов.Добавить(1030); // "І"
	КодыДопустимыхСимволов.Добавить(1111); // "ї"
	КодыДопустимыхСимволов.Добавить(1031); // "Ї"
	КодыДопустимыхСимволов.Добавить(1108); // "є"
	КодыДопустимыхСимволов.Добавить(1028); // "Є"
	
	КодСимвола = КодСимвола(СимволПроверки);
	Если ((КодСимвола < 1040) Или (КодСимвола > 1103)) 
		И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СимволКириллица

// Проверяет, является ли символ символом латинского или кириллического алфавита.
//
// Параметры: 
//    СимволПроверки - символ проверки
//
// Возвращаемое значение:
//  Истина       - символ является символом латинского алфавита;
//  Ложь         - символ не является символом латинского алфавита или пустой;
//
Функция СимволЛатиница(Знач СимволПроверки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СимволПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодСимвола = КодСимвола(СимволПроверки);
	Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СимволЛатиница

// Проверяет, является ли символ символом символом латинского или кириллического алфавита.
//
// Параметры: 
//    СимволПроверки - символ проверки
//
// Возвращаемое значение:
//  Истина       - символ является символом латинского или кириллического алфавита;
//  Ложь         - символ не является символом латинского или кириллического алфавита или пустой;
//
Функция СимволБуква(Знач СимволПроверки) Экспорт
	
	Возврат ЛокализацияПовтИсп.СимволКириллица(СимволПроверки) ИЛИ ЛокализацияПовтИсп.СимволЛатиница(СимволПроверки);
	
КонецФункции // СимволБуква

Функция ТестовыйРежим() Экспорт
	Возврат Ложь; 
КонецФункции // ТестовыйРежим()
