// Позволяет определить, есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъекта) Экспорт

	Возврат НЕ (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

КонецФункции

Функция ПолучитьАдресКартинкиТовара(Номенклатура, УникальныйИдентификаторХранилища = Неопределено) Экспорт

	АдресКартинки = "";
	РежимОбновленияКартинок = Константы.РежимОбновленияКартинок.Получить();

	ПолучатьДвоичныеДанные = Истина;
	Если РежимОбновленияКартинок = Перечисления.РежимЗагрузкиКартинок.Загружать Тогда
		Разработка.ПолучитьКартинкуНоменклатуры(Номенклатура);
	ИначеЕсли РежимОбновленияКартинок = Перечисления.РежимЗагрузкиКартинок.ЗагружатьНезагруженные Тогда
		ДвоичныеДанные = Номенклатура.ОсновноеИзображение.Получить();
		Если ЗначениеЗаполнено(Номенклатура) И НЕ ЗначениеЗаполнено(ДвоичныеДанные) Тогда
			Разработка.ПолучитьКартинкуНоменклатуры(Номенклатура);
		Иначе
			ПолучатьДвоичныеДанные = Ложь;
		КонецЕсли;
	ИначеЕсли РежимОбновленияКартинок = Перечисления.РежимЗагрузкиКартинок.ПолучатьОнлайн Тогда
		ДвоичныеДанные = Разработка.ПолучитьКартинкуНоменклатуры(Номенклатура, Истина);
		ПолучатьДвоичныеДанные = Ложь;
	КонецЕсли;

	Если ПолучатьДвоичныеДанные Тогда
		ДвоичныеДанные = Номенклатура.ОсновноеИзображение.Получить();
	КонецЕсли;
	Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Если УникальныйИдентификаторХранилища = Неопределено Тогда
			УникальныйИдентификаторХранилища = Новый УникальныйИдентификатор;
		КонецЕсли;
		АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторХранилища);
	КонецЕсли;

	Возврат АдресКартинки;

КонецФункции
