
&НаКлиенте
Процедура РаспоряженияПриАктивизацииСтроки(Элемент)
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ЗаказПоставщику;
	Исключение
		ДокументСсылка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();	
	КонецПопытки;
	ОбновитьТоварыКПриемке(ДокументСсылка);
	Ордера.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументСсылка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТоварыКПриемке(Документ)
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход) КАК НеобходимоПринять,
	               |	ЗаказыПоставщикамОстаткиИОбороты.Номенклатура,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Принято
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(, , , , ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикамОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка,
	               |			ПриходныйОрдерНаТоварыТовары.НомерСтроки КАК НомерСтроки,
	               |			ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	               |			ПриходныйОрдерНаТоварыТовары.КоличествоМест КАК КоличествоМест,
	               |			ПриходныйОрдерНаТоварыТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |			ПриходныйОрдерНаТоварыТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	               |			ПриходныйОрдерНаТоварыТовары.Коэффициент КАК Коэффициент,
	               |			ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
	               |			ПриходныйОрдерНаТоварыТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	               |			ПриходныйОрдерНаТоварыТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |			ПриходныйОрдерНаТоварыТовары.ДокументРезерва КАК ДокументРезерва,
	               |			ПриходныйОрдерНаТоварыТовары.Качество КАК Качество
	               |		ИЗ
	               |			Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	               |		ГДЕ
	               |			ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен
	               |			И ПриходныйОрдерНаТоварыТовары.Ссылка.ДокументОснования = &ЗаказПоставщику) КАК ВложенныйЗапрос
	               |		ПО ЗаказыПоставщикамОстаткиИОбороты.ЗаказПоставщику = ВложенныйЗапрос.Ссылка.ДокументОснования
	               |			И ЗаказыПоставщикамОстаткиИОбороты.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыПоставщикамОстаткиИОбороты.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.НеобходимоПринять,
	               |	Данные.Номенклатура,
	               |	Данные.НеобходимоПринять - ЕСТЬNULL(Данные.Принято, 0) КАК ОстатокКПриемке,
	               |	Данные.Принято
	               |ИЗ
	               |	Данные КАК Данные";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику",Документ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	СостояниеПриемки.Загрузить(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Распоряжения.Параметры.УстановитьЗначениеПараметра("Склад", Объект.Склад);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Распоряжения.Параметры.УстановитьЗначениеПараметра("Склад", Объект.Склад);
	Ордера.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 Объект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнойСклад");
	
КонецПроцедуры


&НаСервере
Функция СоздатьОрдерНаСервере(ЗаказПоставщику)
	Об			         = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	об.Склад 		     = Объект.Склад;
	об.ДокументОснования = ЗаказПоставщику;
	об.Ответственный 	 = ПараметрыСеанса.ТекущийПользователь;
	об.Организация		 = ЗаказПоставщику.организация;
	об.Контрагент 		 = ЗаказПоставщику.Контрагент;
	
	
	Возврат об;

КонецФункции


&НаКлиенте
Процедура СоздатьОрдер(Команда)
Попытка	
	Об = СоздатьОрдерНаСервере(Элементы.Распоряжения.ТекущиеДанные.ЗаказПоставщику); // Заполняем документ на сервере
	об.получитьФорму().Открыть();
Исключение
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура РаспоряженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ЗаказПоставщику;
		ОткрытьЗначение(ДокументСсылка);
	Исключение
		ДокументСсылка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();	
	КонецПопытки;
	

КонецПроцедуры


&НаСервере
Процедура ОбновитьНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	Попытка
		ДокументСсылка = Элементы.Распоряжения.ТекущиеДанные.ЗаказПоставщику;
	Исключение
		ДокументСсылка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();	
	КонецПопытки;
	ОбновитьТоварыКПриемке(ДокументСсылка);
	Ордера.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументСсылка);

КонецПроцедуры

