// Хранит дерево документов на сервере.
&НаСервере
Перем мДерево;

// Хранит соответствие документов и признак присутствия в списке на сервере.
&НаСервере
Перем мУжеВСписке;

// Хранит соответствие имени документов и их метаданных на сервере.
&НаСервере
Перем мКэшРеквизитовДокумента;

// Хранит соответствие документов и права доступа к ним на сервере.
&НаСервере
Перем мКэшПраваДоступаКМетаданным;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ОбъектОтбора", ДокументСсылка);
	
	ИсходныйДокумент = ДокументСсылка;
	
	//Если ЗначениеЗаполнено(ДокументСсылка) Тогда
	//	ОбновитьДеревоСтруктурыПодчиненности();
	//КонецЕсли;
	ОбновитьЗадачи();
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДляТекущего(Команда)
	
	ТекущийДокумент = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
		ДокументСсылка = ТекущийДокумент;
	Иначе
		Возврат;
	КонецЕсли;
	
	//ВывестиСтруктуруПодчиненности();
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ДокументСсылка = ДанныеТекущейСтроки.Ссылка;
		
	Если ОсновнойДокументЕщеДоступен(ДокументСсылка) Тогда
		ВыполнитьОбновлениеДереваДокументов();
	Иначе
		ЗакрытьФормуСПредупреждением("ru = 'Документ, для которого сформирован отчет о структуре
									 |подчиненности был удален, или же стал недоступен.'");
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ВывестиСтруктуруПодчиненности()
	
	
	Если ДокументСсылка = Неопределено 
		Или ДокументСсылка.Пустая() Тогда
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеДереваДокументов();

	КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыполнитьОбновлениеДереваДокументов()
	
	ВывестиДеревоДокументов();
	РазвернутьТаблицуДокументов();
		
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьТаблицуДокументов()

	ЭлементыДерева = ДеревоДокументов.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл

		Элементы.ДеревоДокументов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);

	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ВывестиДеревоДокументов()
	
	ДанныеДерева = ДеревоДокументов.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	мДерево = ДанныеДерева;	
	мУжеВСписке.Очистить();
	ВывестиРодительскиеДокументы(ДокументСсылка);
	
	ВывестиПодчиненныеДокументы(мДерево, мКэшПраваДоступаКМетаданным);
	ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка);
	
	//ВывестиДокументыОплатыПлатежныхПозиций(ДанныеДерева);
	
КонецПроцедуры // ВывестиДеревоДокументов()

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры вывода в табличный документ.


&НаСервере
Функция ПолучитьПредставлениеДокументаДляПечати(Выборка)
	
	ПредставлениеДокумента = Выборка.Представление;
	Если (Выборка.СуммаДокумента <> 0) И (Выборка.СуммаДокумента <> NULL) Тогда
		ПредставлениеДокумента = ПредставлениеДокумента + " " + НСтр("ru='на сумму';uk='на суму'") + " " + Выборка.СуммаДокумента + " " + Выборка.Валюта;
	КонецЕсли;
	
	Возврат ПредставлениеДокумента;
	
КонецФункции


&НаСервере
Процедура ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеДокумента, ЧтоЗаменять, ИмяРеквизита, Представление)

	Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменять, ИмяРеквизита + " КАК " + Представление);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменять, " NULL КАК " + Представление);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДополнитьТекстЗапросаПоРеквизитамДокумента(ТекстЗапроса, МассивРеквизитов)
	
	ТекстПредставление = "Представление КАК Представление";
	
	Для Инд = 1 По 3 Цикл
		
		ТекстПредставление = ТекстПредставление + ",
			|	" + ?(МассивРеквизитов.Количество() >= Инд,МассивРеквизитов[инд - 1],"NULL") + " Как ДополнительныйРеквизит" + Инд;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Представление", ТекстПредставление);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиПриАктивизацииСтроки(Элемент)
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ссылка;
	Исключение
		ДокументСсылка = Документы.ОбходнойЛист.ПустаяСсылка();	
	КонецПопытки;
	ВывестиСтруктуруПодчиненности();
	ОбновитьТаблицуЭтаповСогласования(ДокументСсылка);
	ОбновитьЗадачи();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВРаботу(Команда)
	
	Если Элементы.ОбходныеЛисты.ТекущиеДанные.ссылка.Проведен тогда
		
		
		//Если ЕстьФайлы( Элементы.Заявки.ТекущаяСтрока) или ПроходитПоСумме(Элементы.Заявки.ТекущиеДанные.ссылка)  Тогда 
			
			УспешныйЗапуск = ЗапуститьВРаботуНаСервере(Элементы.ОбходныеЛисты.ТекущаяСтрока);
			
			Если УспешныйЗапуск Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обідний лист № "+Элементы.ОбходныеЛисты.ТекущиеДанные.Номер+" успішно відправлений на погодження!");	
			КонецЕсли;
			
			ОбновитьФорму();
			
		//Иначе
		//	
		//	Сообщить("Вы не можете запустить в работу заявку на расходование денежных средств без прикрепленных файлов!",СтатусСообщения.ОченьВажное);
		//	
		//КонецЕсли;
		
	Иначе
		
		Сообщить("Ви не можете запустити в роботу не проведений документ!",СтатусСообщения.ОченьВажное);
		
		
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Функция ЗапуститьВРаботуНаСервере(ОбходнойЛист)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СогласованиеОбходногоЛиста.Ссылка
	               |ИЗ
	               |	БизнесПроцесс.СогласованиеОбходногоЛиста КАК СогласованиеОбходногоЛиста
	               |ГДЕ
	               |	СогласованиеОбходногоЛиста.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет",ОбходнойЛист); 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процесс согласования уже запущен"); 
		
	ИначеЕсли ОбходнойЛист.Статус = Перечисления.СтатусыОбходныхЛистов.Согласован Тогда 

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процесс согласования уже пройден"); 
	
		
	Иначе
		
		БизнесПроцесс = БизнесПроцессы.СогласованиеОбходногоЛиста.СоздатьБизнесПроцесс();
		БизнесПроцесс.Заполнить(ОбходнойЛист); 
		БизнесПроцесс.Дата = ОбходнойЛист.дата;
		БизнесПроцесс.Записать();
		БизнесПроцесс.Старт(); 
		
		ОбходнойЛистОб = ОбходнойЛист.ПолучитьОбъект();
		ОбходнойЛистОб.Статус = Перечисления.СтатусыОбходныхЛистов.НаСогласовании;
		ОбходнойЛистОб.записать();
		
		Возврат истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


&НаСервере
Процедура ОбновитьТаблицуЭтаповСогласования(Заявка)
	
	Запрос = новый запрос;
	Запрос.Текст =    "ВЫБРАТЬ
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.ДатаСогласования,
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.РезультатСогласования,
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.Рецензент КАК Ответственный,
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.ТочкаМаршрута.Порядок КАК Индекс,
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.ТочкаМаршрута,
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.Комментарий
	                  |ИЗ
	                  |	БизнесПроцесс.СогласованиеОбходногоЛиста.РезультатыСогласования КАК СогласованиеОбходногоЛистаРезультатыСогласования
	                  |ГДЕ
	                  |	СогласованиеОбходногоЛистаРезультатыСогласования.Ссылка.Предмет = &Предмет";
	Запрос.УстановитьПараметр("Предмет",Заявка);  
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса.Колонки.Добавить("ЭтапСогласования"); 
	РезультатЗапроса.Колонки.Добавить("РольИсполнителя"); 
	
	Для Каждого Строка из РезультатЗапроса цикл     
			Строка.ЭтапСогласования = Строка.ТочкаМаршрута;	
	КонецЦикла;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадачаИсполнителя.ТочкаМаршрута,
	               |	ЗадачаИсполнителя.РольИсполнителя
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |ГДЕ
	               |	ЗадачаИсполнителя.БизнесПроцесс.Предмет = &Предмет
	               |	И НЕ ЗадачаИсполнителя.Выполнена"; 
	Запрос.УстановитьПараметр("Предмет",Заявка);
	РезультатЗапросаТекущийЭтапСогласования = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапросаТекущийЭтапСогласования.Следующий() Тогда 	
		СтрокаСогласование = РезультатЗапроса.Добавить();
		СтрокаСогласование. ЭтапСогласования =РезультатЗапросаТекущийЭтапСогласования.ТочкаМаршрута;
		СтрокаСогласование. РольИсполнителя =РезультатЗапросаТекущийЭтапСогласования.РольИсполнителя;
	КонецЕсли; 
	
	Согласование.Загрузить(РезультатЗапроса);					  
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗадачи()
	//ЗадачиПоЗаявке.Параметры.УстановитьЗначениеПараметра("Предмет",Элементы.Заявки.ТекущаяСтрока);
	

	Элементы.ЗадачиПоЗаявке.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Элементы.ОбходныеЛисты.Обновить();
	ДокументСсылка = Элементы.ОбходныеЛисты.ТекущаяСтрока;
	ВывестиСтруктуруПодчиненности();
    ОбновитьТаблицуЭтаповСогласования(ДокументСсылка);
	ОбновитьЗадачи();
	
	
	Если ОсновнойДокументЕщеДоступен(ДокументСсылка) Тогда
		ВыполнитьОбновлениеДереваДокументов();
	Иначе
		ЗакрытьФормуСПредупреждением("ru = 'Документ, для которого сформирован отчет о структуре
									 |подчиненности был удален, или же стал недоступен.'");
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьФорму() Экспорт           
	
	ОбновитьЗадачи();
	ВывестиСтруктуруПодчиненности();
	Элементы.ОбходныеЛисты.Обновить();
	Элементы.Согласование.Обновить();
    ОбновитьТаблицуЭтаповСогласования(Элементы.ОбходныеЛисты.ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиПоЗаявкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормаДокумента = Элементы.ЗадачиПоЗаявке.ТекущаяСтрока.Предмет.ПолучитьФорму();
	ФормаДокумента.ОткрытьМодально();
	
	ОбновитьФорму();
КонецПроцедуры

&НаСервере
Функция ЕстьФайлы(Заявка)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеДополнительнойИнформации.Ссылка
	               |ИЗ
	               |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	               |ГДЕ
	               |	ХранилищеДополнительнойИнформации.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",Заявка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество();
КонецФункции 

#КонецОбласти

//////////////////////////////////////////Структура подчиненности///////////


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


// бит_DKravchenko Процедура разворачивает дерево документов.
//
// Параметры:
//  Нет.
//

// бит_DKravchenko Процедура устанавливает индекс пиктограммы текущего состояния документа на клиенте.
//
// Параметры:
//  ДанныеТекущейСтроки - ДанныеФормыЭлементДерева.
//
&НаКлиенте 
Процедура УстановитьИндексПиктограммыСостоянияДокументаКлиент(ДанныеТекущейСтроки)
	
	// Установим индекс пиктограммы текущего состояния документа:
	// 0 - Проведен
	// 1 - помечен на удаление
	// 2 - непроведен
	
	Если ДанныеТекущейСтроки.Проведен Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 0;
		
	ИначеЕсли ДанныеТекущейСтроки.ПометкаУдаления Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 1;
		
	Иначе
		ДанныеТекущейСтроки.ИндексПиктограммы = 2;
	КонецЕсли;
	
КонецПроцедуры

// бит_DKravchenko Процедура выполняет закрытие формы с предупреждением.
//
// Параметры:
//  ТекстПредупреждения - Строка.
//
&НаКлиенте
Процедура ЗакрытьФормуСПредупреждением(ТекстПредупреждения)
	
	ЭтаФорма.Закрыть();
	
	Предупреждение(ТекстПредупреждения);
	
КонецПроцедуры

// бит_DKravchenko Процедура выполняет открытие текущего документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура ОткрытьДокумент()
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ДанныеТекущейСтроки.Ссылка);
	
КонецПроцедуры

// Процедура управляет доступностью кнопок.
//
&НаКлиенте 
Процедура ОбновитьДоступностьКнопок()
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		ПроведениеРазрешено 		= Ложь;
		ИзменениеСостоянияРазрешено = Ложь;
		
	Иначе
		
		ТекДокументСсылка   		= ДанныеТекущейСтроки.Ссылка;
		ПроведениеРазрешено 		= ПроведениеДляДокументаРазрешено(ТекДокументСсылка);
		ИзменениеСостоянияРазрешено = ?(Не ТекДокументСсылка = ДокументСсылкаИсточник, Истина, Ложь);
		
	КонецЕсли;
	
	Элементы.ДеревоДокументовИзменитьДокумент.Доступность 		 = ИзменениеСостоянияРазрешено;
	Элементы.ДеревоДокументовИзменитьПометкуУдаления.Доступность = ИзменениеСостоянияРазрешено;
	Элементы.ДеревоДокументовПровести.Доступность 				 = ИзменениеСостоянияРазрешено
																   И ПроведениеРазрешено
																   И Не ДанныеТекущейСтроки.ПометкаУдаления;
	Элементы.ДеревоДокументовОтменаПроведения.Доступность 		 = ИзменениеСостоянияРазрешено
																   И ПроведениеРазрешено
																   И ДанныеТекущейСтроки.Проведен;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// бит_DKravchenko Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ДокументСсылка = Неопределено 
		Или ДокументСсылка.Пустая() Тогда
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеДереваДокументов();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// бит_DKravchenko Процедура - обработчик команды "Изменить" формы.
//
&НаКлиенте
Процедура Изменить(Команда)
	
	ОткрытьДокумент();
	
КонецПроцедуры

// бит_DKravchenko Процедура - обработчик команды "ИзменитьПометкуУдаления" формы.
//
&НаКлиенте
Процедура ИзменитьПометкуУдаления(Команда)
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДокументСсылка = ДанныеТекущейСтроки.Ссылка;
	ПометкаУдаления   = ДанныеТекущейСтроки.ПометкаУдаления;
	ИзмененаПометка   = ИзменитьПометкуУдаленияДокумента(ТекДокументСсылка, ПометкаУдаления);
	
	Если ИзмененаПометка Тогда
		
		ДанныеТекущейСтроки.Проведен 		= Ложь;
		ДанныеТекущейСтроки.ПометкаУдаления = Не ПометкаУдаления;
		
		// Установим индекс пиктограммы текущего состояния документа.
		УстановитьИндексПиктограммыСостоянияДокументаКлиент(ДанныеТекущейСтроки);
		
		ОповеститьОбИзменении(ТипЗнч(ТекДокументСсылка));
		
		ОбновитьДоступностьКнопок();
		
	КонецЕсли;

КонецПроцедуры

// бит_DKravchenko Процедура - обработчик команды "Провести" формы.
//
&НаКлиенте
Процедура Провести(Команда)
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено
		Или ДанныеТекущейСтроки.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ТекДокументСсылка = ДанныеТекущейСтроки.Ссылка;
	ДействиеВыполнено = ПровестиДокумент(ТекДокументСсылка, РежимЗаписиДокумента.Проведение);
	
	Если ДействиеВыполнено Тогда
		
		ДанныеТекущейСтроки.Проведен = Истина;
		
		// Установим индекс пиктограммы текущего состояния документа.
		УстановитьИндексПиктограммыСостоянияДокументаКлиент(ДанныеТекущейСтроки);
		
		ОповеститьОбИзменении(ТипЗнч(ТекДокументСсылка));
		
		ОбновитьДоступностьКнопок();
		
	КонецЕсли;
	
КонецПроцедуры

// бит_DKravchenko Процедура - обработчик команды "ОтменаПроведения" формы.
//
&НаКлиенте
Процедура ОтменаПроведения(Команда)
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено
		Или ДанныеТекущейСтроки.ПометкаУдаления
		Или Не ДанныеТекущейСтроки.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ТекДокументСсылка = ДанныеТекущейСтроки.Ссылка;
	ДействиеВыполнено = ПровестиДокумент(ТекДокументСсылка, РежимЗаписиДокумента.ОтменаПроведения);
	
	Если ДействиеВыполнено Тогда
		
		ДанныеТекущейСтроки.Проведен = Ложь;
		
		// Установим индекс пиктограммы текущего состояния документа.
		УстановитьИндексПиктограммыСостоянияДокументаКлиент(ДанныеТекущейСтроки);
		
		ОповеститьОбИзменении(ТипЗнч(ТекДокументСсылка));
		
		ОбновитьДоступностьКнопок();
		
	КонецЕсли;
	
КонецПроцедуры

// бит_DKravchenko Процедура - обработчик команды "Обновить" формы.
//



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ "ДеревоДокументов"

// бит_DKravchenko Процедура - обработчик события "ПриАктивизацииСтроки" 
// табличного поля "ДеревоДокументов".
//
&НаКлиенте
Процедура ДеревоДокументовПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьКнопок();
	
КонецПроцедуры

// бит_DKravchenko Процедура - обработчик события "ПередНачаломИзменения" 
// табличного поля "ДеревоДокументов".
//
&НаКлиенте
Процедура ДеревоДокументовПередНачаломИзменения(Элемент, Отказ)	
	
	Отказ = Истина;
	
	//ОткрытьДокумент();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// бит_DKravchenko Функция проверяет наличие документа в ИБ.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ДокументДоступен - Булево.
//
&НаСервереБезКонтекста
Функция ОсновнойДокументЕщеДоступен(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	Представление 
	|ИЗ 
	|	Документ." + ДокументСсылка.Метаданные().Имя + " 
	|ГДЕ 
	|	Ссылка = &ТекущийДокумент";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДокументДоступен = ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
	Возврат ДокументДоступен;
	
КонецФункции

// бит_ASubbotina Процедура вывода дерева структуры подчиненности документа.
//
// Параметры:
//  Нет.
//

// бит_DKravchenko Функция изменяет пометку удаления документа.
//
// Параметры:
//  ТекДокументСсылка - ДокументСсылка.
//  ПометкаУдаления   - Булево.
//
// Возвращаемое значение:
//   ИзмененаПометка – Булево
//
&НаСервере 
Функция ИзменитьПометкуУдаленияДокумента(ТекДокументСсылка, ПометкаУдаления)
	
	ИзмененаПометка = ИзменитьПометкуНаУдалениеУОбъекта(ТекДокументСсылка
																			,Не ПометкаУдаления
																			,
																			,"Ошибки");
	Возврат ИзмененаПометка;
	
КонецФункции

Функция ИзменитьПометкуНаУдалениеУОбъекта(ТекущийОбъект, ПометкаНаУдаление, Заголовок = "", 
                                          РежимСообщений = "Все", СтруктураПараметров = Неопределено) Экспорт

	ВыводитьОшибки     = (РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки");
	ВыводитьИнформацию = РежимСообщений = "Все";
	
	Попытка
		
		ПометкаНаУдалениеУОбъекта = ТекущийОбъект.ПометкаУдаления;
		
		Если ПометкаНаУдалениеУОбъекта <> ПометкаНаУдаление Тогда
			
			УказанаСтруктураПараметров = ?(ТипЗнч(СтруктураПараметров) = Тип("Структура"), Истина, Ложь);
			
			Если УказанаСтруктураПараметров
				И СтруктураПараметров.Свойство("ОбъектПолучен") Тогда
				ПолученныйОбъект = ТекущийОбъект;
			Иначе
				ПолученныйОбъект = ТекущийОбъект.ПолучитьОбъект();
			КонецЕсли;
			
			Если УказанаСтруктураПараметров Тогда
				
				Если СтруктураПараметров.Свойство("ЭтоПометкаИзГрафикаПлатажей") Тогда
					ПолученныйОбъект.мПометкаИзГрафикаПлатажей = Истина;
				ИначеЕсли СтруктураПараметров.Свойство("ЭтоПометкаИзГрафикаНачислений") Тогда
					ПолученныйОбъект.мПометкаИзГрафикаНачислений = Истина;	
				КонецЕсли;
				
			КонецЕсли;
			
			ПолученныйОбъект.УстановитьПометкуУдаления(ПометкаНаУдаление);
			
			Если ВыводитьИнформацию Тогда
				
				Если ПометкаНаУдаление Тогда
					ТекстСообщения = "Объект «" + ТекущийОбъект.Ссылка + "» помечен на удаление.";
				Иначе
					ТекстСообщения = "У объекта «" + ТекущийОбъект.Ссылка + "» снята пометка на удаление.";
				КонецЕсли;
				
				Сообщить(ТекстСообщения, СтатусСообщения.Информация);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		Если ВыводитьОшибки Тогда
			
			Если ПометкаНаУдаление Тогда
				ТекстСообщения = "ru = 'Не удалось пометить на удаление объект «" + ТекущийОбъект.Ссылка + "».'";
			Иначе
				ТекстСообщения = "ru = 'Не удалось снять пометку на удаление у объекта «" + ТекущийОбъект.Ссылка + "».'";
			КонецЕсли;
			
			ТекстСообщения = НСтр(ТекстСообщения);
			
			Если УказанаСтруктураПараметров
				И СтруктураПараметров.Свойство("ОшибкуПодробно") Тогда
				ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
			КонецЕсли;
			
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
			
		КонецЕсли;
		
	КонецПопытки;
	
    ДействиеВыполнено = ТекущийОбъект.ПометкаУдаления = ПометкаНаУдаление;
    
	Возврат ДействиеВыполнено;
    
КонецФункции // ИзменитьПометкуНаУдалениеУОбъекта()


// бит_DKravchenko Процедура выполняет проведение/отмену проведения документа.
//
// Параметры:
//  ТекДокументСсылка - ДокументСсылка.
//  РежимЗаписи 	  - РежимЗаписиДокумента.
//
// Возвращаемое значение:
//   ДействиеВыполнено – Булево
//
&НаСервере 
Функция ПровестиДокумент(ТекДокументСсылка, РежимЗаписи)
	
	Попытка
		
		ДокументОбъект    = ТекДокументСсылка.ПолучитьОбъект();
		ДействиеВыполнено = ЗаписатьПровестиДокумент(ДокументОбъект
																		 ,РежимЗаписи
																		 ,
																		 ,"Ошибки");
																		 
	Исключение
		
		ДействиеВыполнено = Ложь;
		
		Сообщить("" + ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат ДействиеВыполнено;
	
КонецФункции

Функция ЗаписатьПровестиДокумент(ТекущийОбъект, РежимЗаписи, Заголовок = "", РежимСообщений = "Все", ЗаписыватьПередПроведением=Истина) Экспорт

	ДействиеВыполнено  = Ложь;
	
	ВыводитьОшибки     = РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки";
	ВыводитьИнформацию = РежимСообщений = "Все";
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись 
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗаписыватьПередПроведением) Тогда
		
		Попытка
			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = Нстр("ru = 'Записан документ ""%1%"".'");
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);
			КонецЕсли; 
			
		Исключение
			
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = Нстр("ru = 'Не удалось записать документ ""%1%"".'") + Символы.ПС + ОписаниеОшибки();
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);
			КонецЕсли; 
			
		КонецПопытки;
		
	КонецЕсли; 
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Попытка
			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = Нстр("ru = 'Проведен документ ""%1%"".'");
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);
			КонецЕсли; 
			
		Исключение
			
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = Нстр("ru = 'Не удалось провести документ ""%1%"".'") + Символы.ПС + ОписаниеОшибки();
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);
			КонецЕсли; 
			
		КонецПопытки;
		
	КонецЕсли; 


	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Попытка
			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = Нстр("ru = 'Отменено проведение документа ""%1%"".'");
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);				
			КонецЕсли; 	
			
		Исключение
			
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = Нстр("ru = 'Не удалось отменить проведение документа ""%1%"".'") + Символы.ПС + ОписаниеОшибки();
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);
			КонецЕсли; 
			
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ДействиеВыполнено;
	
КонецФункции // ЗаписатьПровестиДокумент()

Функция ПодставитьПараметрыСтроки(Знач СтрокаИсходная,
                                   Знач П1,
                                   Знач П2 = Неопределено,
                                   Знач П3 = Неопределено,
                                   Знач П4 = Неопределено,
                                   Знач П5 = Неопределено) Экспорт
	
	СтрокаРезультат = СтрокаИсходная;
	
	СтрокаРезультат    = СтрЗаменить(СтрокаРезультат, "%1%", П1);
	
	Если П2 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%2%", П2);
	КонецЕсли;
	
	Если П3 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%3%", П3);
	КонецЕсли;
	
	Если П4 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%4%", П4);
	КонецЕсли;
	
	Если П5 <> Неопределено Тогда
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "%5%", П5);
	КонецЕсли;
	
	Возврат СтрокаРезультат;
	
КонецФункции


// бит_MZyubin Процедура выполняет запись элемента справочника
//
// Параметры:
//  ТекущийОбъект  – СправочникОбъект
//  Заголовок      - Строка
//  РежимСообщений - Строка: "Нет","Все","Ошибки"
//  РежимЗагрузки  - Булево
//
// Возвращаемое значение:
//   Булево - действие выполнено
//
Функция ЗаписатьСправочник(ТекущийОбъект, Заголовок = "", РежимСообщений = "Все", РежимЗагрузки = Ложь) Экспорт

	ДействиеВыполнено  = Ложь;
	
	ВыводитьОшибки     = РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки";
	ВыводитьИнформацию = РежимСообщений = "Все";
	
	Попытка
		
		Если РежимЗагрузки Тогда
			
			ТекущийОбъект.ОбменДанными.Загрузка = Истина;
			ДействиеВыполнено				 	= Истина;
			
		Иначе
			
			ДействиеВыполнено = ТекущийОбъект.ПроверитьЗаполнение();
			
		КонецЕсли; 
		
		Если ДействиеВыполнено Тогда
			
			ТекущийОбъект.Записать();
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = Нстр("ru = 'Записан справочник ""%1%"".'");
				ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
				Сообщить(ТекстСообщения);	
			КонецЕсли; 		
		
		КонецЕсли;
		 
	Исключение
		
		ДействиеВыполнено = Ложь;						
		Если ВыводитьОшибки Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось записать справочник ""%1%"".'") + Символы.ПС + ОписаниеОшибки();
			ТекстСообщения = ПодставитьПараметрыСтроки(ТекстСообщения, ТекущийОбъект.Ссылка);
			Сообщить(ТекстСообщения);
		КонецЕсли; 
		
	КонецПопытки;
	
	Возврат ДействиеВыполнено;
	
КонецФункции // ЗаписатьСправочник()


////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// бит_DKravchenko Процедура устанавливает индекс пиктограммы текущего состояния документа на сервере.
//
// Параметры:
//  ДанныеТекущейСтроки - ДанныеФормыЭлементДерева.
//
&НаСервереБезКонтекста 
Процедура УстановитьИндексПиктограммыСостоянияДокументаСервер(ДанныеТекущейСтроки)
	
	// Установим индекс пиктограммы текущего состояния документа:
	// 0 - Проведен
	// 1 - помечен на удаление
	// 2 - непроведен
	
	Если ДанныеТекущейСтроки.Проведен Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 0;
		
	ИначеЕсли ДанныеТекущейСтроки.ПометкаУдаления Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 1;
		
	Иначе
		ДанныеТекущейСтроки.ИндексПиктограммы = 2;
	КонецЕсли;
	
КонецПроцедуры


// бит_ASubbotina Функция получает имя табличной части документа - родителя, в которой нужно искать текущий документ
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка
//  
// Возвращаемое значение:
//   Строка
//
&НаСервере
Функция ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка)

	Если (Метаданные.Документы.Найти("бит_ЗаявкаНаРасходованиеСредств") <> Неопределено И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.бит_ЗаявкаНаРасходованиеСредств")) 
		ИЛИ (Метаданные.Документы.Найти("бит_ПланируемоеПоступлениеДенежныхСредств") <> Неопределено И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.бит_ПланируемоеПоступлениеДенежныхСредств")) Тогда
		ИмяТабЧастиРодителя = "ГрафикПлатежей";
		
	ИначеЕсли (Метаданные.Документы.Найти("бит_ЗаявкаНаЗатраты") <> Неопределено И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.бит_ЗаявкаНаЗатраты")) Тогда
		ИмяТабЧастиРодителя = "ГрафикНачислений";
		
	Иначе
		ИмяТабЧастиРодителя = Неопределено;	
		
	КонецЕсли;

	Возврат ИмяТабЧастиРодителя;
	
КонецФункции // ПолучитьИмяТабличнойЧастиДляПоискаРодителя()

// бит_ASubbotina Функция добавляет элементы в список документов 
//
// Параметры:
//  СписокРеквизитов     	- СписокЗначений
//  МетаданныеДокумента  	- ОбъектМетаданных
//  МетаданныеДокументы  	- КоллекцияОбъектовМетаданных
//  мКэшМетаданныеРеквизита - Соответствие
//
&НаСервере
Процедура ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита)

	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = мКэшМетаданныеРеквизита.Получить(ТекущийТип);
			Если МетаданныеРеквизита = неопределено Тогда
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				мКэшМетаданныеРеквизита.Вставить(ТекущийТип,МетаданныеРеквизита);
			КонецЕсли;
					
			Если МетаданныеРеквизита<>Неопределено 
				 И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
				 И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						 ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры // ДополнитьСписокДокументовПоРеквизитам()

// бит_ASubbotina Функция добавляет элементы в список документов из табличных частей
//
// Параметры:
//  СписокРеквизитов     - СписокЗначений
//  МетаданныеДокумента  - ОбъектМетаданных
//  МетаданныеДокументы  - КоллекцияОбъектовМетаданных
//
&НаСервере
Процедура ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы)

	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
		
		Попытка
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Исключение
		КонецПопытки;
		
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И МетаданныеДокументы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
			
КонецПроцедуры // ДополнитьСписокДокументовПоТабличнымЧастям()

// бит_ASubbotina Функция добавляет элементы в список документов 
//
// Параметры:
//  СписокРеквизитов     	- СписокЗначений
//  ДокументСсылка          - ДокументСсылка
//  ИмяТабЧастиРодителя  	- Строка
//
&НаСервере
Процедура ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя)

	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДопУсловияПоДоговоруТч.Ссылка,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Проведен,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ПометкаУдаления,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Представление,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ВалютаДокумента,
	|	NULL КАК СуммаДокумента
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору." + ИмяТабЧастиРодителя + " КАК бит_ДопУсловияПоДоговоруТч
	|ГДЕ
	|	бит_ДопУсловияПоДоговоруТч.ДокументПланирования = &ДокументПланирования
	|";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаДокумент = Выборка.Ссылка;
		ВывестиРодительскиеДокументы(СсылкаНаДокумент);
				
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСтрокуРодителя()

// Процедура выполняет вывод родительских документов.
//
&НаСервере
Процедура ВывестиРодительскиеДокументы(ДокументСсылка)
	
	МетаданныеДокумента 	= ДокументСсылка.Метаданные();
	СписокРеквизитов 		= Новый СписокЗначений;
	МетаданныеДокументы 	= Метаданные.Документы; 
	мКэшМетаданныеРеквизита = Новый соответствие;
	
	РеквизитыТчПодчинённые = Ложь;
	ИмяТабЧастиРодителя    = ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка);
	
	ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита);
	Если Не РеквизитыТчПодчинённые Тогда 		
		ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);		
	КонецЕсли; // если надо выводить реквизиты табличной части в качестве родителей
	Если СписокРеквизитов.Количество() = 0 И ИмяТабЧастиРодителя <> Неопределено Тогда
		ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя);	
	КонецЕсли;
		
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов);		
	КонецЕсли;

	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокаДерева = мДерево.ПолучитьЭлементы().Добавить();
	Иначе
		СтрокаДерева = мДерево.Добавить();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
						   | ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
						   
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		
		СтрокаДерева.Ссылка   		 = Выборка.Ссылка;
		СтрокаДерева.Проведен 		 = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		
		// Установим индекс пиктограммы текущего состояния документа.
		УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
		
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		СтрокаДерева.СуммаДокумента  = Выборка.СуммаДокумента;
		СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		
	Иначе
		
		СтрокаДерева.Ссылка= ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		СтрокаДерева.СуммаДокумента 	   = ДокументСсылка.СуммаДокумента;
		
	КонецЕсли;
	
	мДерево = СтрокаДерева;
		
КонецПроцедуры // ВывестиРодительскиеДокументы()

// Процедура осуществляет вывод родительских документов с ограничением по уровню в дереве.
//
&НаСервере
Процедура ВывестиБезРодителей(СписокДокументов, ВывестиПодчиненные = Ложь)
	
	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = мДерево.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = мДерево;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Выборка  = Запрос.Выполнить().Выбрать();
		ЕСли Выборка.Следующий() Тогда		
			
			Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
				
	            СтрокаДерева = СтрокиДерева.Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				
				// Установим индекс пиктограммы текущего состояния документа.
				УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
				
				СтрокаДерева.ДокументПредставление = Выборка.Представление;
				СтрокаДерева.СуммаДокумента 	   = Выборка.СуммаДокумента;
				СтрокаДерева.ВалютаДокумента 	   = Выборка.ВалютаДокумента;
				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
				
				Если ВывестиПодчиненные Тогда
					ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;

	мДерево = СтрокаДерева;
	
КонецПроцедуры // ВывестиБезРодителей()

// Процедура осуществляет вывод подчиненных документов.
//
&НаСервере
Процедура ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;	
	// бит_DKravchenko изменение кода. Начало. 15.01.2010{{ 
	Таблица = ПолучитьСписокПодчиненныхДокументов(ТекущийДокумент, мКэшПраваДоступаКМетаданным);
	// бит_DKravchenko изменение кода. Конец. 15.01.2010}} 
	КэшПоТипамДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;			
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
		
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);		
	КонецЦикла;
	
	Если КэшПоТипамДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
					|ВЫБРАТЬ ", "
					|ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ") + "
					|Дата, Ссылка, Представление, Проведен, ПометкаУдаления, 
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"], "СуммаДокумента", "NULL") + " КАК СуммаДокумента,
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДокумента"], "ВалютаДокумента", "NULL") + " КАК ВалютаДокумента
					|ИЗ Документ." + КлючИЗначение.Ключ + "
					|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
					
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = СтрокаДерева;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
			
			НоваяСтрока = СтрокиДерева.Добавить();
			НоваяСтрока.Ссылка 				  = Выборка.Ссылка;
			НоваяСтрока.ДокументПредставление = Выборка.Представление;
			НоваяСтрока.СуммаДокумента 		  = Выборка.СуммаДокумента;
			НоваяСтрока.ВалютаДокумента 	  = Выборка.ВалютаДокумента;
			НоваяСтрока.Проведен 			  = Выборка.Проведен;
			НоваяСтрока.ПометкаУдаления 	  = Выборка.ПометкаУдаления;		
			
			// Установим индекс пиктограммы текущего состояния документа.
			УстановитьИндексПиктограммыСостоянияДокументаСервер(НоваяСтрока);
			
			мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			ВывестиПодчиненныеДокументы(НоваяСтрока,мКэшПраваДоступаКМетаданным);
			
			ТемпДерево = мДерево;
			мДерево    = НоваяСтрока;
			ВывестиПодчинённыеИзТабличныхЧастей(НоваяСтрока.Ссылка);
			мДерево = ТемпДерево;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиПодчиненныеДокументы()

// бит_DFedotov Процедура находит по платежным позициям документы оплаты и выводит их в дерево
//
// Параметры:
//	ДанныеДерева - ДанныеФормыКоллекцияЭлементовДерева
//	

// бит_DFedotov Процедура выводит найденные документы оплаты по платежным позициям в дерево
//	Вызывается рекурсивно.
//
// Параметры:
//	ЭлементыСтроки - ДанныеФормыКоллекцияЭлементовДерева
//	СоответствиеДокументов - Соответствие
//
&НаСервере
Процедура ВывестиДокументыОплаты(ЭлементыСтроки, СоответствиеДокументов)
	
	Для Каждого ТекСтрока Из ЭлементыСтроки Цикл
		
		ДокументОплаты = СоответствиеДокументов[ТекСтрока.Ссылка];
		
		ПодчиненныеСтроки = ТекСтрока.ПолучитьЭлементы();
		
		Если НЕ ДокументОплаты = Неопределено Тогда
			
			МетаданныеДокумента = ДокументОплаты.Метаданные();
			
			ИмяДокумента = МетаданныеДокумента.Имя;
			
			Если мКэшРеквизитовДокумента[ИмяДокумента] = Неопределено Тогда
				ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
			КонецЕсли;
			
			НоваяСтрока = ПодчиненныеСтроки.Добавить();
			
			НоваяСтрока.Ссылка = ДокументОплаты;
			НоваяСтрока.ДокументПредставление = Строка(ДокументОплаты);
			НоваяСтрока.СуммаДокумента = ?(мКэшРеквизитовДокумента[ИмяДокумента]["СуммаДокумента"], ДокументОплаты.СуммаДокумента, 0);
			НоваяСтрока.ВалютаДокумента = ?(мКэшРеквизитовДокумента[ИмяДокумента]["ВалютаДокумента"], ДокументОплаты.ВалютаДокумента, Неопределено);
			НоваяСтрока.Проведен = ДокументОплаты.Проведен;
			НоваяСтрока.ПометкаУдаления = ДокументОплаты.ПометкаУдаления;
			
			// Установим индекс пиктограммы текущего состояния документа.
			УстановитьИндексПиктограммыСостоянияДокументаСервер(НоваяСтрока);
			
			мУжеВСписке.Вставить(ДокументОплаты, Истина);
			ВывестиПодчиненныеДокументы(НоваяСтрока,мКэшПраваДоступаКМетаданным);
		КонецЕсли;
		
		ВывестиДокументыОплаты(ПодчиненныеСтроки, СоответствиеДокументов);
		
	КонецЦикла;
	
КонецПроцедуры

// бит_ASubbotina Процедура выводит подчинённые записанные в табличных частях
//
// Параметры:
//  Параметр1  - Тип_описание
//  Параметр2  - Тип_описание
//
&НаСервере
Процедура ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка)

	РеквизитыТчПодчинённые = Ложь;
		
	Если Не РеквизитыТчПодчинённые Тогда
		Возврат;
	КонецЕсли;
		
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов 	= Новый СписокЗначений;
	МетаданныеДокументы = Метаданные.Документы;
	
	ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);
    ВывестиБезРодителей(СписокРеквизитов, Истина);

КонецПроцедуры // ВывестиПодчинённыеИзТабличныхЧастей()

Функция ПолучитьСписокПодчиненныхДокументов(ДокументОснование, мКэшПраваДоступаКМетаданным, ИмяКритерия = "СвязанныеДокументы") Экспорт
		
	ТекстЗапроса = "";
	
	ТаблицаДокументов 	 = Новый ТаблицаЗначений;
	ТипДокументОснование = ТипЗнч(ДокументОснование);
	СоставКритерия		 = Метаданные.КритерииОтбора[ИмяКритерия].Состав;
	
	Для Каждого ЭлементСостава ИЗ СоставКритерия Цикл
		
		Если Не ЭлементСостава.Тип.СодержитТип(ТипДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным
																				   ,мКэшПраваДоступаКМетаданным);
		Если Не СтруктураПутьКДанным.ЕстьДоступКМетаданным Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." 
						   + СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ 		 = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
					   |ВЫБРАТЬ") + "
					   |" + СтруктураПутьКДанным.ВидОбъекта   + ".Ссылка ИЗ " + ИмяОбъекта 						+ "."
					      + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " 	  + СтруктураПутьКДанным.ВидОбъекта + "
					   |" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
					   |";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТаблицаДокументов = РезультатЗапроса.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПолучитьСписокПодчиненныхДокументов()

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным, мКэшПраваДоступаКМетаданным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	ЕстьДоступКМетаданным = мКэшПраваДоступаКМетаданным.Получить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта);
	Если ЕстьДоступКМетаданным = неопределено Тогда
		Если Структура.ТипОбъекта = "Документ" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Документы[Структура.ВидОбъекта]);
		ИначеЕсли Структура.ТипОбъекта = "Задача" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Задачи[Структура.ВидОбъекта]);
		Иначе
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Справочники[Структура.ВидОбъекта]);
		КонецЕсли;
	КонецЕсли;                                                          
	
	Структура.Вставить("ЕстьДоступКМетаданным", ЕстьДоступКМетаданным);
	мКэшПраваДоступаКМетаданным.Вставить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта,ЕстьДоступКМетаданным);        
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()


// Процедура дополняет кэш метаданных для документа.
//
&НаСервереБезКонтекста
Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента)
	
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;		
		РеквизитыДокумента.Вставить("СуммаДокумента" , МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента")  <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаДокумента", МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено);		
		
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

// бит_DKravchenko Функция проверяет возможность проведения ля документа.
//
// Параметры:
//  ТекДокументСсылка - ДокументСсылка.
//
&НаСервереБезКонтекста 
Функция ПроведениеДляДокументаРазрешено(ТекДокументСсылка)
	
	ПроведениеРазрешено = ?(ТекДокументСсылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
						   ,Истина
						   ,Ложь);
	
	Возврат ПроведениеРазрешено;
	
КонецФункции

&НаКлиенте
Процедура Файлы(Команда)
		
	
	ФормаФайлов = Справочники.ХранилищеДополнительнойИнформации.ПолучитьФорму("ФормаСпискаФайловИИзображений", ЭтаФорма);
	
	ФормаФайлов.Изображения.Отбор.Объект.Использование                               = Истина;
	ФормаФайлов.Изображения.Отбор.Объект.Значение                                    = Элементы.ОбходныеЛисты.ТекущаяСтрока;
	ФормаФайлов.ЭлементыФормы.Изображения.НастройкаОтбора.Объект.Доступность         = Ложь;
	ФормаФайлов.ЭлементыФормы.Изображения.Колонки.Объект.Видимость                   = Ложь;

	ФормаФайлов.ДополнительныеФайлы.Отбор.Объект.Использование                       = Истина;
	ФормаФайлов.ДополнительныеФайлы.Отбор.Объект.Значение                            = Элементы.ОбходныеЛисты.ТекущаяСтрока;
	ФормаФайлов.ЭлементыФормы.ДополнительныеФайлы.НастройкаОтбора.Объект.Доступность = Ложь;
	ФормаФайлов.ЭлементыФормы.ДополнительныеФайлы.Колонки.Объект.Видимость           = Ложь;

	ОбязательныеОтборы = Новый Структура;
	ОбязательныеОтборы.Вставить("Объект",Элементы.ОбходныеЛисты.ТекущаяСтрока);

	ФормаФайлов.ОбязательныеОтборы = ОбязательныеОтборы;
	
	ФормаФайлов.Открыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроходитПоСумме(Заявка)
	
	Возврат Заявка.СуммаДокумента<Константы.ЛимитНаЗаявкиБезФайлов.Получить();
	
КонецФункции

&НаКлиенте
Процедура СогласованиеЭтапНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Сообщить("1");
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущийЭлемент.Имя = "СогласованиеЭтап" Тогда 
		
		ОткрытьФормуМодально("Обработка.СогласоваиеКадровыхДокументов.Форма.ФормаПросмотраИсполнителей",Новый Структура("Исполнители",ПолучитьИсполнителейПоРоли(Элемент.ТекущиеДанные.ЭтапСогласования.РольИсполнителя,Элементы.ОбходныеЛисты.текущиеданные.Подразделение)),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
 
&НаСервере
Функция ПолучитьИсполнителейПоРоли(Роль,цфо)
	
	Если роль <> Справочники.РолиИсполнителей.обКладовщик
		и роль <> Справочники.РолиИсполнителей.анРуководительЦФО Тогда 
		цфо = Неопределено;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.Исполнитель
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
	               |	И ИсполнителиЗадач.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации";
	Запрос.УстановитьПараметр("РольИсполнителя",Роль);
	Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",цфо);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мУжеВСписке 				= Новый Соответствие;
мКэшРеквизитовДокумента 	= Новый Соответствие;
мКэшПраваДоступаКМетаданным	= Новый Соответствие;

