
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура СоздатьОплату(флОбменДанными = ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводнаяОплататчДанные.ППК КАК ППК,
		|	СводнаяОплататчДанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводнаяОплататчДанные.ППК.Контрагент КАК Контрагент,
		|	СводнаяОплататчДанные.СуммаОплаты КАК СуммаДокумента,
		|	СводнаяОплататчДанные.СуммаОплаты КАК СуммаПлатежа,
		|	СводнаяОплататчДанные.СуммаОплаты КАК СуммаВзаиморасчетов,
		|	СводнаяОплататчДанные.ДоговорЭквайринга.ДоговорВзаиморасчетов.Организация КАК Организация,
		|	СводнаяОплататчДанные.Эквайрер КАК Эквайрер,
		|	&Валюта КАК ВалютаДокумента,
		|	&СтавкаНДС КАК СтавкаНДС,
		|	&ВидОперации КАК ВидОперации,
		|	&ВидОплаты,
		|	&КурсВзаиморасчетов,
		|	&КратностьВзаиморасчетов,
		|	СводнаяОплататчДанные.ДоговорЭквайринга,
		|	&СтатьяДДС КАК СтатьяДвиженияДенежныхСредств,
		|	&СчетРасчетов КАК СчетУчетаРасчетовСЭквайрером,
		|	&СчетРасчетовНдс КАК СчетУчетаНДС,
		|	&СчетУчетаНДСПодтвержденный,
		|	&СчетУчетаРасчетовСКонтрагентом,
		|	&СчетУчетаРасчетовПоАвансам,
		|	СводнаяОплататчДанные.ДоговорЭквайринга.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетовЭквайрера,
		|	СводнаяОплататчДанные.ДатаПлатежки,
		|	СводнаяОплататчДанные.НомерСтроки
		|ИЗ
		|	Документ.СводнаяОплата.тчДанные КАК СводнаяОплататчДанные
		|ГДЕ
		|	СводнаяОплататчДанные.Ссылка = &Ссылка
		|	И СводнаяОплататчДанные.ДокументОплаты = ЗНАЧЕНИЕ(Документ.ОплатаОтПокупателяПлатежнойКартой.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка"					      , Ссылка);
	Запрос.УстановитьПараметр("Валюта"					      , мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СтавкаНДС"				      , Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("ВидОперации"				      , Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя);
	Запрос.УстановитьПараметр("ВидОплаты"				      , Справочники.ВидыОплатЧекаККМ.НайтиПоНаименованию("Платежная карта"));
	Запрос.УстановитьПараметр("КурсВзаиморасчетов"		      , 1);
	Запрос.УстановитьПараметр("КратностьВзаиморасчетов"		  , 1);
	Запрос.УстановитьПараметр("СтатьяДДС"					  , Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя);
	Запрос.УстановитьПараметр("СчетРасчетов"				  , ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте);//333
	Запрос.УстановитьПараметр("СчетРасчетовНдс"               , ПланыСчетов.Хозрасчетный.НалоговыйКредит);//6441
	Запрос.УстановитьПараметр("СчетУчетаНДСПодтвержденный"    , ПланыСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный);//6442
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ПланыСчетов.Хозрасчетный.НайтиПоКоду("3611"));//361
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПоАвансам"    , ПланыСчетов.Хозрасчетный.НайтиПоКоду("3611"));//361
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	сч = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сч = сч + 1;
		
		ДокОб 								= Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
		ДокОб.ОбменДанными.Загрузка			= флОбменДанными;
		ДокОб.Дата 							= ВыборкаДетальныеЗаписи.ДатаПлатежки;
		ДокОб.Ответственный 				= Ответственный;
		ДокОб.ДокументОснование				= Ссылка;
		//ДокОб.ОтражатьВУправленческомУчете 	= Истина;
		ДокОб.ОтражатьВБухгалтерскомУчете 	= Истина;
		
		ДокОб.Комментарий = "#Создано автоматический";
		
		ЗаполнитьЗначенияСвойств(ДокОб, ВыборкаДетальныеЗаписи);
		
		НовСтр = ДокОб.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		
		Попытка
			//ДокОб.ОбменДанными.Загрузка = Истина;
			
			
			Если не ДокОб.Организация.А_УправленческийУчет Тогда 
				НовСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				НовСтр.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");;
				НовСтр.СчетУчетаНДСПодтвержденный = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
				НовСтр.СуммаНДС = ВыборкаДетальныеЗаписи.суммаДокумента/6;
				ТипИсточника        = ТипЗнч(ДокОб);
				МетаданныеИсточника = ДокОб.Метаданные();
				
				А_Подписка.СформироватьДокументУУ(ДокОб, МетаданныеИсточника, ТипИсточника, Ложь, РежимПроведенияДокумента.Оперативный);
			КонецЕсли;
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);

		Исключение
			Сообщить(ОписаниеОшибки());
			сч = сч -1;
			Продолжить;
		КонецПопытки;
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("НомерСтроки", ВыборкаДетальныеЗаписи.номерСтроки);
		тчДанные[ВыборкаДетальныеЗаписи.номерСтроки-1].ДокументОплаты = ДокОб.Ссылка;
		
	КонецЦикла;
	
	Сообщить(НСТР("ru='Создано " + сч+ " " + "документов'; uk = 'Створено " + сч+ " " + "докумнтів""'"));
	
	Записать();
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета")

