
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Организация,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Подразделение КАК ЦФО,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Статья КАК СтатьяДДС,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Проект КАК Проект,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.ТипПериода,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Период,
	               |	СУММА(ЛимитыБюджетированияПоСтатьямОбороты.СуммаОборот) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Месяц,
	               |			Подразделение = &ЦФО
	               |				И Организация = &Организация) КАК ЛимитыБюджетированияПоСтатьямОбороты
	               |ГДЕ
	               |	ЛимитыБюджетированияПоСтатьямОбороты.ТипПериода <> &ТипПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Организация,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Статья,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Подразделение,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Проект,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.ТипПериода,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Параметры.Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецГода(Параметры.Дата));

	
	Запрос.УстановитьПараметр("ЦФО",Параметры.ЦФО);
	Запрос.УстановитьПараметр("ТипПериода",Перечисления.ТипыПериодов.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация",Параметры.Организация);
	
	ОстаткиЛимитов= Запрос.Выполнить().Выгрузить();
	
	Результат.Загрузить(ОстаткиЛимитов);
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтрукутураВозврата = новый Структура;
	СтрукутураВозврата.Вставить("ЦФО",Элементы.Результат.ТекущиеДанные.ЦФО);
	СтрукутураВозврата.Вставить("СтатьяДДС",Элементы.Результат.ТекущиеДанные.СтатьяДДС);
	СтрукутураВозврата.Вставить("Проект",Элементы.Результат.ТекущиеДанные.Проект);
	СтрукутураВозврата.Вставить("ТипПериода",Элементы.Результат.ТекущиеДанные.ТипПериода);
	СтрукутураВозврата.Вставить("Период",Элементы.Результат.ТекущиеДанные.Период);
	СтрукутураВозврата.Вставить("Сумма",Элементы.Результат.ТекущиеДанные.Сумма);

	ОповеститьОВыборе(СтрукутураВозврата);
КонецПроцедуры
