
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЛимитыБюджетированияПоСтатьям.Записывать = Истина;
	Движения.ЛимитыБюджетированияПоСтатьям.Очистить();
	
	Для Каждого стр Из БДДС Цикл
		
		НоваяЗапись               = Движения.ЛимитыБюджетированияПоСтатьям.Добавить();
	    НоваяЗапись.Регистратор   = Ссылка;
	    НоваяЗапись.Период        = Стр.Период;
		НоваяЗапись.Организация   = Организация;
		НоваяЗапись.Подразделение = ЦФО;
		НоваяЗапись.Статья      = стр.СтатьяДДС;
		НоваяЗапись.Проект      = стр.Проект;
		НоваяЗапись.Сумма       = стр.Сумма;
		НоваяЗапись.VatNoVat    = стр.VatNoVat;
		НоваяЗапись.Комментарий = стр.Комментарий;
		НоваяЗапись.ТипПериода  = стр.ТипПериода;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ФормаВводаБюджета") Тогда
		// Заповнення шапки
		
		Если ДанныеЗаполнения.ВидБюджета = Перечисления.ВидБюджета.ДвижениеДенежныхСредств Тогда 
		
		ВидБюджета = ДанныеЗаполнения.ВидБюджета;
		ДатаНачалаПланирования = ДанныеЗаполнения.ДатаНачалаПланирования;
		ДатаОкончанияПланирования = ДанныеЗаполнения.ДатаОкончанияПланирования;
		Комментарий = ДанныеЗаполнения.Комментарий;
		НаправлениеБюджета = ДанныеЗаполнения.НаправлениеБюджета;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		СтатьиДДСКратко = ДанныеЗаполнения.СтатьиДДСКратко;
		ЦФО = ДанныеЗаполнения.ЦФО;
		Для Каждого ТекСтрокаБДДС Из ДанныеЗаполнения.БДДС Цикл
			НоваяСтрока             = БДДС.Добавить();
			НоваяСтрока.VatNoVat    = ТекСтрокаБДДС.VatNoVat;
			НоваяСтрока.ТипПериода  = Перечисления.ТипыПериодов.Месяц;
			НоваяСтрока.СтатьяДДС   = ТекСтрокаБДДС.СтатьяДДС;
			НоваяСтрока.Комментарий = ТекСтрокаБДДС.Комментарий;
			НоваяСтрока.Период      = ТекСтрокаБДДС.Период;
			НоваяСтрока.Проект      = ТекСтрокаБДДС.Проект;
			НоваяСтрока.Сумма       = ТекСтрокаБДДС.Сумма;
		КонецЦикла;
		Для Каждого ТекСтрокаБДДСПериоды Из ДанныеЗаполнения.БДДСПериоды Цикл
			НоваяСтрока = БДДСПериоды.Добавить();
			НоваяСтрока.VatNoVat = ТекСтрокаБДДСПериоды.VatNoVat;
			НоваяСтрока.СтатьяДДС = ТекСтрокаБДДСПериоды.СтатьяДДС; 
			НоваяСтрока.ТипПериода = Перечисления.ТипыПериодов.Месяц;
			НоваяСтрока.Комментарий = ТекСтрокаБДДСПериоды.Комментарий;
			НоваяСтрока.Период1 = ТекСтрокаБДДСПериоды.Период1;
			НоваяСтрока.Период10 = ТекСтрокаБДДСПериоды.Период10;
			НоваяСтрока.Период11 = ТекСтрокаБДДСПериоды.Период11;
			НоваяСтрока.Период12 = ТекСтрокаБДДСПериоды.Период12;
			НоваяСтрока.Период13 = ТекСтрокаБДДСПериоды.Период13;
			НоваяСтрока.Период14 = ТекСтрокаБДДСПериоды.Период14;
			НоваяСтрока.Период15 = ТекСтрокаБДДСПериоды.Период15;
			НоваяСтрока.Период16 = ТекСтрокаБДДСПериоды.Период16;
			НоваяСтрока.Период17 = ТекСтрокаБДДСПериоды.Период17;
			НоваяСтрока.Период18 = ТекСтрокаБДДСПериоды.Период18;
			НоваяСтрока.Период19 = ТекСтрокаБДДСПериоды.Период19;
			НоваяСтрока.Период2 = ТекСтрокаБДДСПериоды.Период2;
			НоваяСтрока.Период20 = ТекСтрокаБДДСПериоды.Период20;
			НоваяСтрока.Период21 = ТекСтрокаБДДСПериоды.Период21;
			НоваяСтрока.Период22 = ТекСтрокаБДДСПериоды.Период22;
			НоваяСтрока.Период23 = ТекСтрокаБДДСПериоды.Период23;
			НоваяСтрока.Период24 = ТекСтрокаБДДСПериоды.Период24;
			НоваяСтрока.Период3 = ТекСтрокаБДДСПериоды.Период3;
			НоваяСтрока.Период4 = ТекСтрокаБДДСПериоды.Период4;
			НоваяСтрока.Период5 = ТекСтрокаБДДСПериоды.Период5;
			НоваяСтрока.Период6 = ТекСтрокаБДДСПериоды.Период6;
			НоваяСтрока.Период7 = ТекСтрокаБДДСПериоды.Период7;
			НоваяСтрока.Период8 = ТекСтрокаБДДСПериоды.Период8;
			НоваяСтрока.Период9 = ТекСтрокаБДДСПериоды.Период9;
			НоваяСтрока.Проект = ТекСтрокаБДДСПериоды.Проект;
		КонецЦикла;
		КонецЕсли;
	Для Каждого Строка из ДанныеЗаполнения.СтатьиДДС Цикл 
		СтатьяСтрока = СтатьиДДС.Добавить();	
		СтатьяСтрока.Статья = Строка.Статья; 
	КонецЦикла;
Иначе
	СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
