Перем СтатусОтправкиПоПочте Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование 	= ДанныеЗаполнения;
	Организация 		= ДанныеЗаполнения.Организация;
	Подразделение		= ДанныеЗаполнения.Подразделение;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить());
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Контрагент			= ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента 	= ДанныеЗаполнения.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		Контрагент = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент), ДанныеЗаполнения.Контрагент, ДанныеЗаполнения.Абонент);
		Товары.Загрузить(ПолучитьДанныеДляСервисаТребование(ДанныеЗаполнения));
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеМалоценкиВЭксплуатации") Тогда
		Оборудование.Загрузить(ПолучитьДанныеДляСервисаПеремещениеМалоценки(ДанныеЗаполнения));			
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеОС") Тогда
		ОС.Загрузить(ПолучитьДанныеДляСервисаПеремещениеОС(ДанныеЗаполнения));		
	КонецЕсли;
	
	Для Каждого стрТовар из Товары Цикл
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			стрТовар.Склад = ДанныеЗаполнения.СкладОтправитель;	
		КонецЕсли;
		стрТовар.ВидРемонта = Перечисления.ВидРемонта.Бесплатный;
	КонецЦикла;
	
	Для Каждого стрТовар из Оборудование Цикл
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			стрТовар.Склад = ДанныеЗаполнения.СкладОтправитель;	
		КонецЕсли;
		стрТовар.ВидРемонта = Перечисления.ВидРемонта.Бесплатный;
	КонецЦикла;
	
	Для Каждого стрТовар из ОС Цикл
		стрТовар.ВидРемонта = Перечисления.ВидРемонта.Бесплатный;
	КонецЦикла;
	
	ЗаполнитьПолучателей();
	
КонецПроцедуры

Процедура ЗаполнитьПолучателей() Экспорт
	
	Получатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользователитчПодразделения.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи.тчПодразделения КАК ПользователитчПодразделения
	|ГДЕ
	|	ПользователитчПодразделения.Подразделение = &Подразделение
	|	И ПользователитчПодразделения.Ссылка.Кладовщик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПользователитчПодразделения.Ссылка
	|ИЗ
	|	Справочник.Пользователи.тчПодразделения КАК ПользователитчПодразделения
	|ГДЕ
	|	ПользователитчПодразделения.Подразделение = &Подразделение
	|	И ПользователитчПодразделения.Ссылка.МенеджерЦОА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПользователитчПодразделения.Ссылка
	|ИЗ
	|	Справочник.Пользователи.тчПодразделения КАК ПользователитчПодразделения
	|ГДЕ
	|	ПользователитчПодразделения.Ссылка.МенеджерИМ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр 				= Получатели.Добавить();	
		Новстр.Получатель	= ВыборкаДетальныеЗаписи.Пользователь;
		НовСтр.Email 		= УправлениеКонтактнойИнформацией.ПолучитьEmailИзКонтактнойИнформации(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляСервисаТребование(Док) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТребованиеНакладнаяМатериалы.Номенклатура,
		|	ТребованиеНакладнаяМатериалы.Количество,
		|	ТребованиеНакладнаяМатериалы.ЕдиницаИзмерения,
		|	ТребованиеНакладнаяМатериалы.СерияНоменклатуры,
		|	ТребованиеНакладнаяМатериалы.Ссылка.Склад
		|ИЗ
		|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
		|ГДЕ
		|	ТребованиеНакладнаяМатериалы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТребованиеНакладнаяМатериалыЗаказчика.Номенклатура,
		|	ТребованиеНакладнаяМатериалыЗаказчика.Количество,
		|	ТребованиеНакладнаяМатериалыЗаказчика.Номенклатура.БазоваяЕдиницаИзмерения,
		|	ТребованиеНакладнаяМатериалыЗаказчика.СерияНоменклатуры,
		|	ТребованиеНакладнаяМатериалыЗаказчика.Ссылка.Склад
		|ИЗ
		|	Документ.ТребованиеНакладная.МатериалыЗаказчика КАК ТребованиеНакладнаяМатериалыЗаказчика
		|ГДЕ
		|	ТребованиеНакладнаяМатериалыЗаказчика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеДляСервисаПеремещениеМалоценки(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.Номенклатура,
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.ЕдиницаИзмерения,
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.СерияНоменклатуры,
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.Количество
		|ИЗ
		|	Документ.ПеремещениеМалоценкиВЭксплуатации.МалоценныеАктивы КАК ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы
		|ГДЕ
		|	ПеремещениеМалоценкиВЭксплуатацииМалоценныеАктивы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ПолучитьДанныеДляСервисаПеремещениеОС(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеОСОС.ОсновноеСредство,
		|	1 КАК Количество
		|ИЗ
		|	Документ.ПеремещениеОС.ОС КАК ПеремещениеОСОС
		|ГДЕ
		|	ПеремещениеОСОС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ин = 0;
	Для Каждого стрТовар из Товары Цикл
		Если стрТовар.ВидРемонта = Перечисления.ВидРемонта.Платный Тогда
			Если Товары[ин].Стоимость = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле = "Товары["+ин+"].Стоимость";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				ТекстСообщения = НСтр("ru='Не заполнена стоимость ремонта в строке ""%1""';uk='Не заповнена вартість ремонту в рядку ""%1""'");
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ин+1);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		ин = ин + 1;
	КонецЦикла;	
	
	ин = 0;
	Для Каждого стрОборудование из Оборудование Цикл
		Если стрОборудование.ВидРемонта = Перечисления.ВидРемонта.Платный Тогда
			Если Оборудование[ин].Стоимость = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле = "Оборудование["+ин+"].Стоимость";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				ТекстСообщения = НСтр("ru='Не заполнена стоимость ремонта в строке ""%1""';uk='Не заповнена вартість ремонту в рядку ""%1""'");
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ин);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		ин = ин + 1;
	КонецЦикла;	
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Стоимость") + Оборудование.Итог("Стоимость");
	
	Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	
	Если ТипДоставки = Перечисления.ТипДоставки.НоваяПочта Тогда
		Если (ЗначениеЗаполнено(НомерТТНОтправки) И СтрДлина(НомерТТНОтправки) <> 14)
			ИЛИ (ЗначениеЗаполнено(НомерТТНПолучения) И СтрДлина(НомерТТНПолучения) <> 14) Тогда
			Сообщить(НСтр("ru='В номере ТТН меньше 14 символов';uk='У номері ТТН менше 14 символів'"));
			Отказ = Истина;		
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьНеЦифры(НомерТТНОтправки) ИЛИ ОбщегоНазначения.ЕстьНеЦифры(НомерТТНПолучения) Тогда
			Сообщить(НСтр("ru='В номере ТТН есть буквы';uk='У номері ТТН є літери'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтатусОтправкиПоПочте = А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Дандали В. 22.04.2024 +	
	Если Не Отказ 
		И НЕ ОбменДанными.Загрузка Тогда
		Если СтатусОтправкиПоПочте <> Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте Тогда
			А_ОбщегоНазначенияСервер.ЗаписатьДокументВОчередьНаОтправку(Ссылка);
		ИначеЕсли СтатусОтправкиПоПочте = Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте 
			И А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(Ссылка) = "" Тогда
			А_ОбщегоНазначенияСервер.УстановитьСтатусОтправкиПоПочте(Ссылка, Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте);
		КонецЕсли;
	КонецЕсли;
	//Дандали В. 22.04.2024 -
	
КонецПроцедуры