
//Проведения документов 3 дня
Процедура ОбработкаПроведенияДокументов(Источник, Отказ, РежимПроведения) Экспорт
	
	//Заглушка. начинает действовать с 01.06.2023
	Если ТекущаяДата() < Дата('20230601') Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ЗапретПроведенияДокументов3Дня") Тогда
		
		Если Источник.Дата < ТекущаяДата() - 24*60*60*3 Тогда 
			
			Отказ = Истина;
			Сообщить("Пользователь не имеет право редактировать документ спустя 3 дня");
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

//Редактирование только Своих документов
Процедура ПередЗаписьюДокументаРедактированиеТолькоСвоихДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись
		ИЛИ УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.НайтиПоНаименованию("РедактированиеДокументовДругихОтветственных"), Ложь)[0].Значение 
		ИЛИ НЕ РольДоступна("Комірник") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Ответственный", Источник.Метаданные())
		И Источник.Ответственный <> ПараметрыСеанса.ТекущийПользователь Тогда
		Если не ТипЗнч(Источник.ссылка) = тип("ДокументСсылка.ЗаказПоставщику") Тогда 
			Отказ = Истина;
			Сообщить(Нстр("ru='Пользователь не имеет право редактировать чужие документы';uk='Користувач не має права редагувати чужі документи'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Проведение документов не сегодняшней датой
Процедура ОбработкаПроведенияДокументовПрошлымПериодом(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
		ПланыВидовХарактеристик.ПраваПользователей.НайтиПоНаименованию("Разрешить проведение прошлым периодом"), Ложь)[0].Значение
		Тогда
		
		ДатаДокумента = Источник.Дата;
		ТекДата = ТекущаяДата();
		
		ДеньТекущейДаты = День(ТекДата);
		
		// Устанавливаем дату начала периода (25 число текущего месяца)
		НачалоПериода = Дата(Год(ТекДата), Месяц(ТекДата), 25);
		
		// Устанавливаем дату конца периода
		Если ДеньТекущейДаты >= 25 Тогда
			// Если сегодня 25 число или позже, конец периода - 15 число текущего месяца
			КонецПериода = Дата(Год(ТекДата), Месяц(ТекДата), 15);
		Иначе
			// Если сегодня меньше 25 числа текущего месяца, конец периода - 25 число предыдущего месяца
			КонецПериода = ДобавитьМесяц(НачалоПериода, -1);
		КонецЕсли;
		
		// Проверяем, попадает ли дата документа в период запрета
		Если КонецДня(ДатаДокумента) <= КонецДня(КонецПериода) Тогда
			ЗапретРедактирования = Истина;
		Иначе
			ЗапретРедактирования = Ложь;
		КонецЕсли;	
		
		Если ЗапретРедактирования Тогда 
			Отказ = Истина;
			Сообщить("Користувач не має права проводити документ минулим періодом");
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СкладИОтвественныеЛюди(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		
		Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("PortableDataTerminal") Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
			ПланыВидовХарактеристик.ПраваПользователей.НайтиПоНаименованию("Разрешить проведение перемещений товара"), Ложь)[0].Значение Тогда
			Если ЗначениеЗаполнено(Источник.СкладПолучатель) Тогда
				мОтвественный = ОбщегоНазначения.ПолучитьОтветственногоСклада(Источник.СкладПолучатель);
				Если мОтвественный.Количество() = 0 ИЛИ мОтвественный.Найти(ПараметрыСеанса.ТекущийПользователь) <> Неопределено Тогда
					Возврат;
				КонецЕсли;
				МассПодразделений = ПараметрыСеанса.ТекущийПользователь.тчПодразделения.ВыгрузитьКолонку("Подразделение");
				Если МассПодразделений.Найти(Источник.Подразделение) = Неопределено Тогда
					Сообщить("Склад має відповідальну особу. Проведення документа заборонено");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры