


&НаКлиенте
Перем МассивСобственныхКартинок;

&НаКлиенте
Перем МассивСобственныхКартинокСсылки;

&НаКлиенте
Перем МассивКартинокПартнеровСсылки;

&НаКлиенте
Перем КартинкаБольшаяСоственногоТовараАдрес;

&НаСервере
Перем мДерево;

// Хранит соответствие документов и признак присутствия в списке на сервере.
&НаСервере
Перем мУжеВСписке;

// Хранит соответствие имени документов и их метаданных на сервере.
&НаСервере
Перем мКэшРеквизитовДокумента;

// Хранит соответствие документов и права доступа к ним на сервере.
&НаСервере
Перем мКэшПраваДоступаКМетаданным;


&НаКлиенте
Процедура НоменклатураПоставщиковПриАктивизацииСтроки(Элемент)
	//свойства.Отбор.Элементы.Очистить();
	//ЭлементОтбора = Свойства.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = Элементы.НоменклатураПоставщиков.ТекущаяСтрока; 
	//Если ЗначениеЗаполнено(Элементы.НоменклатураПоставщиков.ТекущаяСтрока) Тогда 
	//	Элементы.СсылкаНаСайтеПоставщика.Заголовок = Элементы.НоменклатураПоставщиков.ТекущаяСтрока.СсылкаНаСайте;
	//КонецЕсли;
	ОбновитьКартинки(Элементы.НоменклатураПоставщиков.ТекущиеДанные.ссылка);
	ОбновитьСвойства(Элементы.НоменклатураПоставщиков.ТекущиеДанные.ссылка);
	Если ЗначениеЗаполнено(Элементы.НоменклатураПоставщиков.ТекущиеДанные.ссылка) Тогда 
		//ОтобразитьДанныеТовара(Элементы.НоменклатураПоставщиков.ТекущаяСтрока);
		Номенклатура = Элементы.НоменклатураПоставщиков.ТекущиеДанные.ссылка; 
	КонецЕсли;
	УстановитьПараметрДинамическогоСписка();
	
	//Элементы.НоменклатураПоставщиковСписок.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДанныеТовара(Номенклатура)
	
	Наименование_укр = Номенклатура.Наименование;
	Наименование_рус = Номенклатура.Наименование_ru;
	Описание_укр = Номенклатура.ДополнительноеОписаниеНоменклатуры;
	Описание_рус = Номенклатура.ДополнительноеОписаниеНоменклатуры_ru;
	
	
	ИмяШрифта 				= Справочники.Константы.НайтиЗначение("ДопОписаниеШрифтПоУмолчанию", "Montserrat");
	ШрифтПоУмолчанию 		= ИмяШрифта + ", sans-serif";
	РазмерШрифтаПоУмолчанию = Справочники.Константы.НайтиЗначение("ДопОписаниеРазмерШрифтаПоУмолчанию", "13pt");
	
	СтильПодСтрокиПоУмолчанию
	= "font-family: " + ШрифтПоУмолчанию
	+ ";font-size: " + РазмерШрифтаПоУмолчанию
	+ ";font-style: normal;font-weight: normal;text-decoration: none;"
	;
	
	Вложения = Новый Структура;
	
	
	//Если НЕ ЗначениеЗаполнено(Номенклатура.ДополнительноеОписаниеНоменклатуры) Тогда
	//	Номенклатура.ДополнительноеОписаниеНоменклатуры = СфПоУмолчаниюСтрокуХТМЛ(СтильПодСтрокиПоУмолчанию);
	//КонецЕсли;
	
	Описание_укр.УстановитьHTML(Номенклатура.ДополнительноеОписаниеНоменклатуры, Вложения);
	//Описание_укр.ПолучитьHTML(ДокХТМЛ, Вложения);
	
	//Если НЕ ЗначениеЗаполнено(Номенклатура.ДополнительноеОписаниеНоменклатуры_ru) Тогда
	//	Номенклатура.ДополнительноеОписаниеНоменклатуры_ru = СфПоУмолчаниюСтрокуХТМЛ(СтильПодСтрокиПоУмолчанию);
	//КонецЕсли;
	
	Описание_рус.УстановитьHTML(Номенклатура.ДополнительноеОписаниеНоменклатуры_ru, Вложения);
	//Описание_укр.ПолучитьHTML(ДокХТМЛ, Вложения);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СфПоУмолчаниюСтрокуХТМЛ(СтильПодСтроки)
	
	СтрокаХТМЛ = "
	|<html>
	|<head>
	|<style type=""text/css"">
	|body{margin:0;padding:8px;}
	|p{line-height:1.15;margin:0;white-space:pre-wrap;}
	|ol,ul{margin-top:0;margin-bottom:0;}
	|img{border:none;}
	|li>p{display:inline;}
	|</style>
	|</head>
	|<body>
	|<p><span style=""" + СтильПодСтроки + """>введите описание</span></p>
	|</body>
	|</html>";
	
	Возврат СтрокаХТМЛ;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьКартинки(Номенклатура) Экспорт
	
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_КартинкиНоменклатуры
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КартинкиНоменклатуры.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВТ_КартинкиНоменклатуры.Ссылка = Номенклатура.ОсновноеИзображение
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоОсновноеИзображение
		|ИЗ
		|	ВТ_КартинкиНоменклатуры КАК ВТ_КартинкиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_КартинкиНоменклатуры.Ссылка.Объект = Номенклатура.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоОсновноеИзображение УБЫВ,
		|	Ссылка"
		;
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Возврат Выборка.ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
	
	
	Возврат Новый Массив();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКартинки(ТекущаяНоменклатура)
	
	НаборКартинок = ПолучитьКартинки(ТекущаяНоменклатура);
	
	КоличествоКартинок = НаборКартинок.Количество();
	КоличествоОтображаемыхКартинок = Мин(КоличествоКартинок, 1);
	
	КартинкаТовара = "";
	КартинкаБольшаяСобсвенная = "";
	
	КартинкаТовараАдрес = "";
	КартинкаБольшаяТовараАдрес = "";
	
	МассивСобственныхКартинок       = Новый СписокЗначений;
	МассивСобственныхКартинокСсылки = новый СписокЗначений;	
	Для Индекс = 0 По НаборКартинок.Количество() - 1 Цикл
		//МассивСобственныхКартинок.Добавить(ПоместитьВоВременноеХранилище(НаборКартинок.Получить(Индекс).Хранилище.Получить(), ЭтаФорма.УникальныйИдентификатор));
		МассивСобственныхКартинокСсылки.Добавить(НаборКартинок.Получить(Индекс));
	КонецЦикла;
	
	Если КоличествоОтображаемыхКартинок > 0 Тогда
		
		//КоличествоНаборовКартинок = 1;
		//
		//Если ТекущийНаборКартинок > КоличествоНаборовКартинок - 1 Тогда
		//	
		//	ТекущийНаборКартинок = КоличествоНаборовКартинок - 1;
		//	
		//КонецЕсли;
		//
		//Если ТекущийНаборКартинок < 0 Тогда
		//	
		//	ТекущийНаборКартинок = 0;
		//	
		//КонецЕсли;
		
		
		ИмяКартинки = "КартинкаТовара";
		
		Адрес = ПоместитьВоВременноеХранилище(НаборКартинок.Получить(0).Хранилище.Получить(), ЭтаФорма.УникальныйИдентификатор);
		
		ЭтаФорма[ИмяКартинки] = 
		"<html>
		|<head>
		|</head>
		|<body>
		|<img src = " + Адрес + " width=""220px""
		|</body>
		|</html>"
		;
		//КартинкаБольшая = Картинка1;
		КартинкаБольшаяСобсвенная = 
		"<html>
		|<head>
		|</head>
		|<body>
		|<img src = " + Адрес + " width=""300px""
		|</body>
		|</html>"
		;
		
		КартинкаБольшаяСоственногоТовараАдрес = Адрес;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвойства(ТекущаяНоменклатура)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",ТекущаяНоменклатура);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Свойства.Загрузить(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовараПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// + 003676 ДДГ 10 ноя 2020
	Если МассивСобственныхКартинокСсылки.Количество() < 1 Тогда
		Возврат;
	КонецЕсли;
	// - 003676 ДДГ 10 ноя 2020
	
	КартинкаБольшаяСобсвеннаяВрем = МассивСобственныхКартинокСсылки[0].Значение;
	Если ЗначениеЗаполнено(КартинкаБольшаяСобсвеннаяВрем) Тогда
		
		КартинкаБольшаяТовараАдрес = ПоместитьВоВременноеХранилище(КартинкаБольшаяСобсвеннаяВрем.Хранилище.Получить(), Новый УникальныйИдентификатор);
		
		
		
		МассивКартинокТекущие = новый Массив;
		//ОткрытьЗначение(ПолучитьИзВременногоХранилища(КартинкаБольшаяАдрес));
		ПараметрыДляФормы = Новый Структура;
		ПараметрыДляФормы.Вставить("АдресКартинки"  , КартинкаБольшаяТовараАдрес);
		ПараметрыДляФормы.Вставить("МассивКартинок" , МассивСобственныхКартинок);
		ПараметрыДляФормы.Вставить("МассивКартинокСсылки" , МассивСобственныхКартинокСсылки);
		ПараметрыДляФормы.Вставить("СсылкаНаТовар" , Элементы.НоменклатураПоставщиков.ТекущаяСтрока);
		
		ОткрытьФормуМодально("Обработка.РабочееМестоМенеджераИМ.Форма.ФормаПросмотраКартинки", ПараметрыДляФормы);		
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаПоставщики = Поставщики.Добавить();
	СтрокаПоставщики.Наименование = "DEPS";
	
	СтрокаПоставщики = Поставщики.Добавить();
	СтрокаПоставщики.Наименование = "DRONUA";
	
	СтрокаПоставщики = Поставщики.Добавить();
	СтрокаПоставщики.Наименование = "MTI";
	
	СтрокаПоставщики = Поставщики.Добавить();
	СтрокаПоставщики.Наименование = "VIATEC";
	
	СтрокаПоставщики = Поставщики.Добавить();
	СтрокаПоставщики.Наименование = "DCLINK";
	
	ОбновитьОтображениеТаблицы();
	
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	Номенклатура.Ссылка КАК Категория,
|	0 КАК НомерКартинки,
|	Номенклатура.Ссылка.ЭтоГруппа КАК ЭтоГруппа
|ИЗ
|	Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|	Номенклатура.Ссылка В ИЕРАРХИИ(&КаталогИМ)
|ИТОГИ ПО
|	Категория ИЕРАРХИЯ
|АВТОУПОРЯДОЧИВАНИЕ";
Запрос.УстановитьПараметр("КаталогИМ", Константы.КатологТоваровИнтернетМагазина.Получить());

РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

// Для фильтрации используем метод НайтиСтроки
СтруктураОтбора = Новый Структура;
СтруктураОтбора.Вставить("ЭтоГруппа", Истина);
//Сообщить(ТипЗнч(РезультатЗапроса));
//РезультатЗапроса = РезультатЗапроса.НайтиСтроки(СтруктураОтбора);

КоллекцияЭлементовДерева = ДеревоКатегорий.ПолучитьЭлементы();
КоллекцияЭлементовДерева.Очистить();
УровеньГруппировки = 1;
МассивКатегорий = новый Массив;

ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, РезультатЗапроса, УровеньГруппировки,МассивКатегорий);

КонецПроцедуры

Процедура ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, ДеревоЗначений,УровеньГруппировки,МассивКатегорий) Экспорт
	
	//МассивКатегорий.Добавить(Константы.КатологТоваровИнтернетМагазина.Получить());
	
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Если (Константы.КатологТоваровИнтернетМагазина.Получить() = строка.Категория И
			УровеньГруппировки=2) или Строка.ЭтоГруппа = ложь или МассивКатегорий.Найти(строка.Категория) <>  Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		ЭлементДерева = КоллекцияЭлементовДерева.Добавить();
		
		ЗаполнитьЗначенияСвойств(ЭлементДерева, Строка);
		МассивКатегорий.Добавить(строка.Категория);

		Если Строка.Строки.Количество() > 0 Тогда
			
			ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементДерева.ПолучитьЭлементы(), Строка,УровеньГруппировки+1,МассивКатегорий);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ПоставщикиПриИзмененииНаСервере()
	
	ОбновитьОтображениеТаблицы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПоставщикиПриИзменении(Элемент)
	ПоставщикиПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоставщикиПриИзменении(Неопределено);
	
	Если Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеМенеджера Тогда 	
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеМенеджера);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеЛогистики Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеКладовщиков);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеЗакупщика Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеЗакупщиков);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеСервисногоИнженера Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеСервисныхИнженеров);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеЦентраОбслуживанияАбонентов Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("Статус", Перечисления.СтатусыЗаказаИМ.ВРаботеМЦОА);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.Завершен Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.Завершен);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.Отклонен Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.Отклонено);
	Иначе
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ПустаяСсылка());
		
	КонецЕсли;
	УстановитьПараметрДинамическогоСписка();

КонецПроцедуры



&НаКлиенте
Процедура ПеренестиВКатегорию(Команда)
	
	
	ОткрытьФормуМодально("Обработка.РабочееМестоМенеджераИМ.Форма.ФормаДеревоКатегорий",ПодготовитьТаблицуПереноса());		
	
	ОбновитьОтображениеТаблицы();
КонецПроцедуры

&НаСервере
Функция ПодготовитьТаблицуПереноса()
	
	ВыделенныеСтроки =  ЭтаФорма.Элементы.НоменклатураПоставщиков.ВыделенныеСтроки;
	СписокЗначений 	 = новый СписокЗначений;
	Для Каждого строка из ВыделенныеСтроки Цикл 
		СписокЗначений.Добавить(строка.ссылка);
	КонецЦикла;
	
	ПараметрыДляПереноса = новый Структура;
	ПараметрыДляПереноса.Вставить("Товары",СписокЗначений);
	
	Возврат ПараметрыДляПереноса;
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеТаблицы()
	
	ТаблицаПоставщик = Поставщики.Выгрузить(Новый Структура("Использовать",Истина));
	
	СписокПоставщиков = Новый СписокЗначений;
	СписокПоставщиков.ЗагрузитьЗначения(ТаблицаПоставщик.ВыгрузитьКолонку("Наименование"));
	
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("НоменклатураИМ", Константы.КатологТоваровИнтернетМагазина.Получить());
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("ТипЦенИМ",Константы.ТипЦенИнтернетМагазина.Получить());
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("СписокЗначений",?(СписокПоставщиков.Количество(),СписокПоставщиков,0));
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("Категория",Категория);

КонецПроцедуры
&НаКлиенте
Процедура ОбновитьОтображениеТаблицыНаКлиенте()
	

	
	СписокПоставщиков = Новый СписокЗначений;

	
	
	
	//
	//Запрос = новый запрос;
	//Запрос.Текст =  "ВЫБРАТЬ
	//                |	НоменклатураПоставщиков.Ссылка КАК Наименование,
	//                |	НоменклатураПоставщиков.Ссылка,
	//                |	НоменклатураПоставщиков.Код,
	//                |	НоменклатураПоставщиков.Артикул,
	//                |	НоменклатураПоставщиков.DepsId,
	//                |	НоменклатураПоставщиков.EcoID,
	//                |	НоменклатураПоставщиков.MTIID,
	//                |	НоменклатураПоставщиков.ViaTekId,
	//                |	НоменклатураПоставщиков.IDCerebro,
	//                |	ВЫБОР
	//                |		КОГДА НоменклатураПоставщиков.DepsId <> """"
	//                |			ТОГДА ""DEPS""
	//                |		КОГДА НоменклатураПоставщиков.EcoID <> """"
	//                |			ТОГДА ""DRONUA""
	//                |		КОГДА НоменклатураПоставщиков.MTIID <> """"
	//                |			ТОГДА ""MTI""
	//                |		КОГДА НоменклатураПоставщиков.ViaTekId <> """"
	//                |			ТОГДА ""VIATEC""
	//                |		КОГДА НоменклатураПоставщиков.IDCerebro <> """"
	//                |			ТОГДА ""DCLINK""
	//                |	КОНЕЦ КАК Поставщик,
	//                |	НоменклатураПоставщиков.НеПоказыватьНаСайте КАК СкрытНаСайте,
	//                |	НоменклатураПоставщиков.Ссылка В ИЕРАРХИИ (&НоменклатураИМ) КАК ВыгруженНаСайт,
	//                |	ВЫБОР
	//                |		КОГДА НоменклатураПоставщиков.DepsId <> """"
	//                |			ТОГДА НоменклатураПоставщиков.DepsId
	//                |		КОГДА НоменклатураПоставщиков.EcoID <> """"
	//                |			ТОГДА НоменклатураПоставщиков.EcoID
	//                |		КОГДА НоменклатураПоставщиков.MTIID <> """"
	//                |			ТОГДА НоменклатураПоставщиков.MTIID
	//                |		КОГДА НоменклатураПоставщиков.ViaTekId <> """"
	//                |			ТОГДА НоменклатураПоставщиков.ViaTekId
	//                |		КОГДА НоменклатураПоставщиков.IDCerebro <> """"
	//                |			ТОГДА НоменклатураПоставщиков.IDCerebro
	//                |	КОНЕЦ КАК IDПоставщика,
	//                |	ЦеныНоменклатурыСрезПоследних.Цена,
	//                |	ТоварыНаСкладахПоставщиковСрезПоследних.Количество КАК КоличествоУПоставщика,
	//                |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоВКомпании,
	//                |	НоменклатураПоставщиков.Родитель КАК Категория
	//                |ИЗ
	//                |	Справочник.Номенклатура КАК НоменклатураПоставщиков
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦенИМ) КАК ЦеныНоменклатурыСрезПоследних
	//                |		ПО (ЦеныНоменклатурыСрезПоследних.Номенклатура = НоменклатураПоставщиков.Ссылка)
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыНаСкладахПоставщиков.СрезПоследних КАК ТоварыНаСкладахПоставщиковСрезПоследних
	//                |		ПО (ТоварыНаСкладахПоставщиковСрезПоследних.Номенклатура = НоменклатураПоставщиков.Ссылка)
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	//                |		ПО (ТоварыНаСкладахОстатки.Номенклатура = НоменклатураПоставщиков.Ссылка)
	//                |ГДЕ
	//                |	ВЫБОР
	//                |			КОГДА НоменклатураПоставщиков.DepsId <> """"
	//                |				ТОГДА ""DEPS""
	//                |			КОГДА НоменклатураПоставщиков.EcoID <> """"
	//                |				ТОГДА ""DRONUA""
	//                |			КОГДА НоменклатураПоставщиков.MTIID <> """"
	//                |				ТОГДА ""MTI""
	//                |			КОГДА НоменклатураПоставщиков.ViaTekId <> """"
	//                |				ТОГДА ""VIATEC""
	//                |			КОГДА НоменклатураПоставщиков.IDCerebro <> """"
	//                |				ТОГДА ""DCLINK""
	//                |			ИНАЧЕ """"
	//                |		КОНЕЦ <> """"
	//                |	И ВЫБОР
	//                |			КОГДА НоменклатураПоставщиков.DepsId <> """"
	//                |				ТОГДА ""DEPS""
	//                |			КОГДА НоменклатураПоставщиков.EcoID <> """"
	//                |				ТОГДА ""DRONUA""
	//                |			КОГДА НоменклатураПоставщиков.MTIID <> """"
	//                |				ТОГДА ""MTI""
	//                |			КОГДА НоменклатураПоставщиков.ViaTekId <> """"
	//                |				ТОГДА ""VIATEC""
	//                |			КОГДА НоменклатураПоставщиков.IDCerebro <> """"
	//                |				ТОГДА ""DCLINK""
	//                |		КОНЕЦ В (&СписокЗначений)
	//                |	И (ЕСТЬNULL(ТоварыНаСкладахПоставщиковСрезПоследних.Количество, 0) <> 0
	//                |			ИЛИ ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) <> 0)";
	//
	//Запрос.УстановитьПараметр("НоменклатураИМ",Константы.КатологТоваровИнтернетМагазина.Получить());
	//Запрос.УстановитьПараметр("ТипЦенИМ",Константы.ТипЦенИнтернетМагазина.Получить());
	//Запрос.УстановитьПараметр("СписокЗначений",СписокПоставщиков);
	
	
	//НоменклатураПоставщиков1.Загрузить(Запрос.Выполнить().Выгрузить());
	Попытка
		Категогия = Элементы.ДеревоКатегорий.ТекущиеДанные.Категория;
	Исключение
		Категогия = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	//Сообщить(Категогия);
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("НоменклатураИМ", Константы.КатологТоваровИнтернетМагазина.Получить());
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("ТипЦенИМ",Константы.ТипЦенИнтернетМагазина.Получить());
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("СписокЗначений",СписокПоставщиков);
	НоменклатураПоставщиков.Параметры.УстановитьЗначениеПараметра("Категория",Категогия);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоставщиков1ПриАктивизацииСтроки(Элемент)
	Попытка
		//свойства.Отбор.Элементы.Очистить();
		//ЭлементОтбора = Свойства.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект");
		//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.Использование  = Истина;
		//ЭлементОтбора.ПравоеЗначение = Элементы.НоменклатураПоставщиков1.ТекущиеДанные.ссылка; 
		
		ОбновитьКартинки(Элементы.НоменклатураПоставщиков1.ТекущиеДанные.ссылка);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	НоменклатураОб = Элементы.НоменклатураПоставщиков.ТекущиеДанные.Ссылка.ПолучитьОбъект();
	НоменклатураОб.ДополнительноеОписаниеНоменклатуры    = СформироватьОписаниеУкр();
	НоменклатураОб.ДополнительноеОписаниеНоменклатуры_ru = СформироватьОписаниеРус();
	НоменклатураОб.Наименование    = Наименование_укр; 
	НоменклатураОб.Наименование_ru = Наименование_рус;
	
	НоменклатураОб.Записать();
	
	СохранитьСвойста(НоменклатураОб.Ссылка);
	
	НоменклатураПоставщиковПриАктивизацииСтроки(Неопределено);
	
	Предупреждение("Збереження змін в товарі виконано успішно!",,"Увага!");
КонецПроцедуры

&НаКлиенте
Функция СфСоответствиеЭлементовСтиля(СтрокаСтиля)
	
	СоотвСтиля = Новый Соответствие;
	
	МассивСтиля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаСтиля, ";");
	
	Для Каждого ПодСтрокаСтиля Из МассивСтиля Цикл
		
		МассивПодСтрокСтиля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПодСтрокаСтиля, ":");
		
		ВсегоПодСтрок = МассивПодСтрокСтиля.Количество();
		
		Если ВсегоПодСтрок < 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЭлемента = СокрЛП(МассивПодСтрокСтиля[0]);
		ЗначениеЭлемента = Неопределено;
		
		Если ВсегоПодСтрок > 1 Тогда
			ЗначениеЭлемента = МассивПодСтрокСтиля[1];
		КонецЕсли;
		
		Если ВсегоПодСтрок > 2 Тогда
			МассивПодСтрокСтиля.Удалить(0);
			ЗначениеЭлемента = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивПодСтрокСтиля, ";");
		КонецЕсли;
		
		Если ЗначениеЭлемента <> Неопределено Тогда
			ЗначениеЭлемента = СокрЛП(ЗначениеЭлемента);
		КонецЕсли;
		
		СоотвСтиля.Вставить(ИмяЭлемента, ЗначениеЭлемента);
		
	КонецЦикла;
	
	Возврат СоотвСтиля;
	
КонецФункции

&НаКлиенте
Функция СформироватьОписаниеУкр()
	ИмяШрифта = Справочники.Константы.НайтиЗначение("ДопОписаниеШрифтПоУмолчанию", "Montserrat");
	
	ШрифтПоУмолчанию = ИмяШрифта + ", sans-serif";
	
	РазмерШрифтаПоУмолчанию = Справочники.Константы.НайтиЗначение("ДопОписаниеРазмерШрифтаПоУмолчанию", "13pt");
	
	ЗаменитьШрифт  = Истина;
	ЗаменитьРазмер = Истина;
	СтильПодСтрокиПоУмолчанию
	= "font-family: " + ШрифтПоУмолчанию
	+ ";font-size: " + РазмерШрифтаПоУмолчанию
	+ ";font-style: normal;font-weight: normal;text-decoration: none;"
	;
	
	СтрокаHTMLУкр = "";
	ВложенияУкр   = новый Структура;
	
	Описание_укр.ПолучитьHTML(СтрокаHTMLУкр,ВложенияУкр);
	
	
	ЧтениеХТМЛ = Новый ЧтениеHTML; 
	ЧтениеХТМЛ.УстановитьСтроку(СтрокаHTMLУкр);
	
	ПостроительДОМ = Новый ПостроительDOM;	
	ДокументХТМЛ = ПостроительДОМ.Прочитать(ЧтениеХТМЛ);
	
	ЭлементыПараграфы = ДокументХТМЛ.ПолучитьЭлементыПоИмени("p");
	
	Для Каждого Элемент Из ЭлементыПараграфы Цикл
		
		ДочерниеУзлы = Элемент.ДочерниеУзлы;
		
		Если ДочерниеУзлы.Количество() < 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыПереводыСтрок = Элемент.ПолучитьЭлементыПоИмени("br");
		
		Если ЭлементыПереводыСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыПодСтроки = Элемент.ПолучитьЭлементыПоИмени("span");
		
		Если ЭлементыПодСтроки.Количество() < 1 Тогда
			
			НовыйЭлементПодСтрока = ДокументХТМЛ.СоздатьЭлемент("span");
			
			Для Каждого ДочернийУзел Из ДочерниеУзлы Цикл
				Элемент.УдалитьДочерний(ДочернийУзел);
				НовыйЭлементПодСтрока.ДобавитьДочерний(ДочернийУзел);
			КонецЦикла;
			
			Элемент.ДобавитьДочерний(НовыйЭлементПодСтрока);
			
			ЭлементыПодСтроки = Элемент.ПолучитьЭлементыПоИмени("span");
			
		КонецЕсли;
		
		Для Каждого ЭлементПодСтрока Из ЭлементыПодСтроки Цикл
			
			СтрокаСтиля = ЭлементПодСтрока.ПолучитьАтрибут("style");
			
			Если СтрокаСтиля = Неопределено Тогда
				ЭлементПодСтрока.УстановитьАтрибут("style", СтильПодСтрокиПоУмолчанию);
				Продолжить;
			КонецЕсли;
			
			СоотвСтиля  = СфСоответствиеЭлементовСтиля(СтрокаСтиля);
			
			Если СоотвСтиля.Количество() < 1 Тогда
				ЭлементПодСтрока.УстановитьАтрибут("style", СтильПодСтрокиПоУмолчанию);
				Продолжить;
			КонецЕсли;
			
			ОбновитьАтрибут = Ложь;
			
			ШрифтСтиля = СоотвСтиля.Получить("font-family");
			
			Если ШрифтСтиля = Неопределено Тогда
				СоотвСтиля.Вставить("font-family", ШрифтПоУмолчанию);
				ОбновитьАтрибут = Истина;
			ИначеЕсли ЗаменитьШрифт И ШрифтСтиля <> ШрифтПоУмолчанию Тогда
				СоотвСтиля.Вставить("font-family", ШрифтПоУмолчанию);
				ОбновитьАтрибут = Истина;
			КонецЕсли;
			
			РазмерШрифта = СоотвСтиля.Получить("font-size");
			
			Если РазмерШрифта = Неопределено Тогда
				СоотвСтиля.Вставить("font-size", РазмерШрифтаПоУмолчанию);
				ОбновитьАтрибут = Истина;
			ИначеЕсли ЗаменитьРазмер И РазмерШрифта <> РазмерШрифтаПоУмолчанию Тогда
				СоотвСтиля.Вставить("font-size", РазмерШрифтаПоУмолчанию);
				ОбновитьАтрибут = Истина;
			КонецЕсли;
			
			Если ОбновитьАтрибут Тогда
				
				МассивСтиля = Новый Массив;
				
				Для Каждого КлючЗначение Из СоотвСтиля Цикл
					МассивСтиля.Добавить(КлючЗначение.Ключ + ": " + КлючЗначение.Значение);
				КонецЦикла;
				
				НоваяСтрокаСтиля = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивСтиля, ";");
				ЭлементПодСтрока.УстановитьАтрибут("style", НоваяСтрокаСтиля);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписьДОМ  = Новый ЗаписьDOM;
	ЗаписьХТМЛ = Новый ЗаписьHTML;
	ЗаписьХТМЛ.УстановитьСтроку();
	
	ЗаписьДОМ.Записать(ДокументХТМЛ, ЗаписьХТМЛ);
	
	СтрокаHTMLУкр = ЗаписьХТМЛ.Закрыть();
	
	Возврат СтрокаHTMLУкр; 	
КонецФункции

&НаКлиенте
Функция СформироватьОписаниеРус()
	ИмяШрифта = Справочники.Константы.НайтиЗначение("ДопОписаниеШрифтПоУмолчанию", "Montserrat");
	
	ШрифтПоУмолчанию = ИмяШрифта + ", sans-serif";
	
	РазмерШрифтаПоУмолчанию = Справочники.Константы.НайтиЗначение("ДопОписаниеРазмерШрифтаПоУмолчанию", "13pt");
	
	ЗаменитьШрифт  = Истина;
	ЗаменитьРазмер = Истина;
	СтильПодСтрокиПоУмолчанию
	= "font-family: " + ШрифтПоУмолчанию
	+ ";font-size: " + РазмерШрифтаПоУмолчанию
	+ ";font-style: normal;font-weight: normal;text-decoration: none;"
	;
	
	СтрокаHTMLРус = "";
	Вложения   = новый Структура;
	
	Описание_рус.ПолучитьHTML(СтрокаHTMLРус,Вложения);
	
	
	ЧтениеХТМЛ = Новый ЧтениеHTML; 
	ЧтениеХТМЛ.УстановитьСтроку(СтрокаHTMLРус);
	
	ПостроительДОМ = Новый ПостроительDOM;	
	ДокументХТМЛ = ПостроительДОМ.Прочитать(ЧтениеХТМЛ);
	
	ЭлементыПараграфы = ДокументХТМЛ.ПолучитьЭлементыПоИмени("p");
	
	Для Каждого Элемент Из ЭлементыПараграфы Цикл
		
		ДочерниеУзлы = Элемент.ДочерниеУзлы;
		
		Если ДочерниеУзлы.Количество() < 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыПереводыСтрок = Элемент.ПолучитьЭлементыПоИмени("br");
		
		Если ЭлементыПереводыСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыПодСтроки = Элемент.ПолучитьЭлементыПоИмени("span");
		
		Если ЭлементыПодСтроки.Количество() < 1 Тогда
			
			НовыйЭлементПодСтрока = ДокументХТМЛ.СоздатьЭлемент("span");
			
			Для Каждого ДочернийУзел Из ДочерниеУзлы Цикл
				Элемент.УдалитьДочерний(ДочернийУзел);
				НовыйЭлементПодСтрока.ДобавитьДочерний(ДочернийУзел);
			КонецЦикла;
			
			Элемент.ДобавитьДочерний(НовыйЭлементПодСтрока);
			
			ЭлементыПодСтроки = Элемент.ПолучитьЭлементыПоИмени("span");
			
		КонецЕсли;
		
		Для Каждого ЭлементПодСтрока Из ЭлементыПодСтроки Цикл
			
			СтрокаСтиля = ЭлементПодСтрока.ПолучитьАтрибут("style");
			
			Если СтрокаСтиля = Неопределено Тогда
				ЭлементПодСтрока.УстановитьАтрибут("style", СтильПодСтрокиПоУмолчанию);
				Продолжить;
			КонецЕсли;
			
			СоотвСтиля  = СфСоответствиеЭлементовСтиля(СтрокаСтиля);
			
			Если СоотвСтиля.Количество() < 1 Тогда
				ЭлементПодСтрока.УстановитьАтрибут("style", СтильПодСтрокиПоУмолчанию);
				Продолжить;
			КонецЕсли;
			
			ОбновитьАтрибут = Ложь;
			
			ШрифтСтиля = СоотвСтиля.Получить("font-family");
			
			Если ШрифтСтиля = Неопределено Тогда
				СоотвСтиля.Вставить("font-family", ШрифтПоУмолчанию);
				ОбновитьАтрибут = Истина;
			ИначеЕсли ЗаменитьШрифт И ШрифтСтиля <> ШрифтПоУмолчанию Тогда
				СоотвСтиля.Вставить("font-family", ШрифтПоУмолчанию);
				ОбновитьАтрибут = Истина;
			КонецЕсли;
			
			РазмерШрифта = СоотвСтиля.Получить("font-size");
			
			Если РазмерШрифта = Неопределено Тогда
				СоотвСтиля.Вставить("font-size", РазмерШрифтаПоУмолчанию);
				ОбновитьАтрибут = Истина;
			ИначеЕсли ЗаменитьРазмер И РазмерШрифта <> РазмерШрифтаПоУмолчанию Тогда
				СоотвСтиля.Вставить("font-size", РазмерШрифтаПоУмолчанию);
				ОбновитьАтрибут = Истина;
			КонецЕсли;
			
			Если ОбновитьАтрибут Тогда
				
				МассивСтиля = Новый Массив;
				
				Для Каждого КлючЗначение Из СоотвСтиля Цикл
					МассивСтиля.Добавить(КлючЗначение.Ключ + ": " + КлючЗначение.Значение);
				КонецЦикла;
				
				НоваяСтрокаСтиля = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивСтиля, ";");
				ЭлементПодСтрока.УстановитьАтрибут("style", НоваяСтрокаСтиля);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписьДОМ  = Новый ЗаписьDOM;
	ЗаписьХТМЛ = Новый ЗаписьHTML;
	ЗаписьХТМЛ.УстановитьСтроку();
	
	ЗаписьДОМ.Записать(ДокументХТМЛ, ЗаписьХТМЛ);
	
	СтрокаHTMLУкр = ЗаписьХТМЛ.Закрыть();
	
	Возврат СтрокаHTMLУкр; 
КонецФункции


&НаСервереБезКонтекста
Процедура УстановитьЦенуНаСервере(Номенклатура,Цена)
	ДокументОбъект      = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	
	ИндексСтрокиТаблицыЦен = 0;
	
	СтрокаЦены = ДокументОбъект.ТипыЦен.Добавить();
	СтрокаЦены.ТипЦен = Константы.ТипЦенИнтернетМагазина.Получить();
	
	
	СтрокаТовары = ДокументОбъект.Товары.Добавить();
	СтрокаТовары.Номенклатура = Номенклатура;
	СтрокаТовары.ТипЦен = Константы.ТипЦенИнтернетМагазина.Получить();
	СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
	
	
	СтрокаТовары.Цена = Окр(Цена+0.5,0,РежимОкругления.Окр15как20)-1;
	СтрокаТовары.Валюта               = СтрокаТовары.ТипЦен.ВалютаЦены;
	СтрокаТовары.ЕдиницаИзмерения     = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
	СтрокаТовары.ПроцентСкидкиНаценки = СтрокаТовары.ТипЦен.ПроцентСкидкиНаценки;
	СтрокаТовары.СпособРасчетаЦены    = СтрокаТовары.ТипЦен.СпособРасчетаЦены;
	СтрокаТовары.ТипЦен =  СтрокаТовары.ТипЦен;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьЦену(Команда)
	Цена = Элементы.НоменклатураПоставщиков.ТекущиеДанные.Цена;
	Если ВвестиЧисло(Цена,) Тогда 	
		УстановитьЦенуНаСервере(Элементы.НоменклатураПоставщиков.ТекущиеДанные.Ссылка,Цена);
	КонецЕсли;
	
	ПоставщикиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСвойста(Номенклатура)
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.объект.установить(Номенклатура);
	НаборЗаписей.Очистить();
	
	Для Каждого Строка из Свойства Цикл 
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Номенклатура;
		Запись.Свойство = Строка.Свойство;
		Запись.Значение = Строка.значение;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПокупателейПриАктивизацииСтроки(Элемент)
	ПоказатьСтруктуруПодчиненности(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтруктуруПодчиненности(Элемент)
	Попытка
		ДокументСсылка = Элемент.текущаяСтрока;
	Исключение
		ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
	КонецПопытки;
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДляТекущего(Команда)
	
	ТекущийДокумент = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
		ДокументСсылка = ТекущийДокумент;
	Иначе
		Возврат;
	КонецЕсли;
	
	//ВывестиСтруктуруПодчиненности();
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = ДанныеТекущейСтроки.Ссылка;
	
	Если ОсновнойДокументЕщеДоступен(ДокументСсылка) Тогда
		ВыполнитьОбновлениеДереваДокументов();
	Иначе
		ЗакрытьФормуСПредупреждением("ru = 'Документ, для которого сформирован отчет о структуре
		|подчиненности был удален, или же стал недоступен.'");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСтруктуруПодчиненности()
	
	
	Если ДокументСсылка = Неопределено 
		Или ДокументСсылка.Пустая() Тогда
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеДереваДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеДереваДокументов()
	
	ВывестиДеревоДокументов();
	РазвернутьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьТаблицуДокументов()
	
	ЭлементыДерева = ДеревоДокументов.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл
		
		Элементы.ДеревоДокументов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ВывестиДеревоДокументов()
	
	ДанныеДерева = ДеревоДокументов.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	мДерево = ДанныеДерева;	
	мУжеВСписке.Очистить();
	ВывестиРодительскиеДокументы(ДокументСсылка);
	
	ВывестиПодчиненныеДокументы(мДерево, мКэшПраваДоступаКМетаданным);
	ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка);
	
	//ВывестиДокументыОплатыПлатежныхПозиций(ДанныеДерева);
	
КонецПроцедуры // ВывестиДеревоДокументов()

// бит_ASubbotina Функция добавляет элементы в список документов из табличных частей
//
// Параметры:
//  СписокРеквизитов     - СписокЗначений
//  МетаданныеДокумента  - ОбъектМетаданных
//  МетаданныеДокументы  - КоллекцияОбъектовМетаданных
//
&НаСервере
Процедура ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы)
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Исключение
		КонецПопытки;
		
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					И МетаданныеДокументы.Содержит(МетаданныеЗначения)
					И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры // ДополнитьСписокДокументовПоТабличнымЧастям()

// бит_ASubbotina Функция добавляет элементы в список документов 
//
// Параметры:
//  СписокРеквизитов     	- СписокЗначений
//  ДокументСсылка          - ДокументСсылка
//  ИмяТабЧастиРодителя  	- Строка
//
&НаСервере
Процедура ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДопУсловияПоДоговоруТч.Ссылка,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Проведен,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ПометкаУдаления,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Представление,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ВалютаДокумента,
	|	NULL КАК СуммаДокумента
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору." + ИмяТабЧастиРодителя + " КАК бит_ДопУсловияПоДоговоруТч
	|ГДЕ
	|	бит_ДопУсловияПоДоговоруТч.ДокументПланирования = &ДокументПланирования
	|";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаДокумент = Выборка.Ссылка;
		ВывестиРодительскиеДокументы(СсылкаНаДокумент);
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСтрокуРодителя()

// Процедура выполняет вывод родительских документов.
//
&НаСервере
Процедура ВывестиРодительскиеДокументы(ДокументСсылка)
	
	МетаданныеДокумента 	= ДокументСсылка.Метаданные();
	СписокРеквизитов 		= Новый СписокЗначений;
	МетаданныеДокументы 	= Метаданные.Документы; 
	мКэшМетаданныеРеквизита = Новый соответствие;
	
	РеквизитыТчПодчинённые = Ложь;
	ИмяТабЧастиРодителя    = ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка);
	
	ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита);
	Если Не РеквизитыТчПодчинённые Тогда 		
		ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);		
	КонецЕсли; // если надо выводить реквизиты табличной части в качестве родителей
	Если СписокРеквизитов.Количество() = 0 И ИмяТабЧастиРодителя <> Неопределено Тогда
		ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя);	
	КонецЕсли;
	
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов);		
	КонецЕсли;
	
	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокаДерева = мДерево.ПолучитьЭлементы().Добавить();
	Иначе
		СтрокаДерева = мДерево.Добавить();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
	| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		
		СтрокаДерева.Ссылка   		 = Выборка.Ссылка;
		СтрокаДерева.Проведен 		 = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		
		// Установим индекс пиктограммы текущего состояния документа.
		УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
		
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		СтрокаДерева.СуммаДокумента  = Выборка.СуммаДокумента;
		СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		
	Иначе
		
		СтрокаДерева.Ссылка= ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		СтрокаДерева.СуммаДокумента 	   = ДокументСсылка.СуммаДокумента;
		
	КонецЕсли;
	
	мДерево = СтрокаДерева;
	
КонецПроцедуры // ВывестиРодительскиеДокументы()

// Процедура осуществляет вывод родительских документов с ограничением по уровню в дереве.
//
&НаСервере
Процедура ВывестиБезРодителей(СписокДокументов, ВывестиПодчиненные = Ложь)
	
	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = мДерево.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = мДерево;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Выборка  = Запрос.Выполнить().Выбрать();
		ЕСли Выборка.Следующий() Тогда		
			
			Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
				
				СтрокаДерева = СтрокиДерева.Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				
				// Установим индекс пиктограммы текущего состояния документа.
				УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
				
				СтрокаДерева.ДокументПредставление = Выборка.Представление;
				СтрокаДерева.СуммаДокумента 	   = Выборка.СуммаДокумента;
				СтрокаДерева.ВалютаДокумента 	   = Выборка.ВалютаДокумента;
				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
				
				Если ВывестиПодчиненные Тогда
					ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	мДерево = СтрокаДерева;
	
КонецПроцедуры // ВывестиБезРодителей()

// Процедура осуществляет вывод подчиненных документов.
//
&НаСервере
Процедура ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;	
	// бит_DKravchenko изменение кода. Начало. 15.01.2010{{ 
	Таблица = ПолучитьСписокПодчиненныхДокументов(ТекущийДокумент, мКэшПраваДоступаКМетаданным);
	// бит_DKravchenko изменение кода. Конец. 15.01.2010}} 
	КэшПоТипамДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;			
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
		
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);		
	КонецЦикла;
	
	Если КэшПоТипамДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
		|ВЫБРАТЬ ", "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ") + "
		|Дата, Ссылка, Представление, Проведен, ПометкаУдаления, 
		|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"], "СуммаДокумента", "NULL") + " КАК СуммаДокумента,
		|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДокумента"], "ВалютаДокумента", "NULL") + " КАК ВалютаДокумента
		|ИЗ Документ." + КлючИЗначение.Ключ + "
		|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
		
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = СтрокаДерева;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
			
			НоваяСтрока = СтрокиДерева.Добавить();
			НоваяСтрока.Ссылка 				  = Выборка.Ссылка;
			НоваяСтрока.ДокументПредставление = Выборка.Представление;
			НоваяСтрока.СуммаДокумента 		  = Выборка.СуммаДокумента;
			НоваяСтрока.ВалютаДокумента 	  = Выборка.ВалютаДокумента;
			НоваяСтрока.Проведен 			  = Выборка.Проведен;
			НоваяСтрока.ПометкаУдаления 	  = Выборка.ПометкаУдаления;		
			
			// Установим индекс пиктограммы текущего состояния документа.
			УстановитьИндексПиктограммыСостоянияДокументаСервер(НоваяСтрока);
			
			мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			ВывестиПодчиненныеДокументы(НоваяСтрока,мКэшПраваДоступаКМетаданным);
			
			ТемпДерево = мДерево;
			мДерево    = НоваяСтрока;
			ВывестиПодчинённыеИзТабличныхЧастей(НоваяСтрока.Ссылка);
			мДерево = ТемпДерево;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиПодчиненныеДокументы()

// бит_DFedotov Процедура находит по платежным позициям документы оплаты и выводит их в дерево
//
// Параметры:
//	ДанныеДерева - ДанныеФормыКоллекцияЭлементовДерева
//	

// бит_DFedotov Процедура выводит найденные документы оплаты по платежным позициям в дерево
//	Вызывается рекурсивно.
//
// Параметры:
//	ЭлементыСтроки - ДанныеФормыКоллекцияЭлементовДерева
//	СоответствиеДокументов - Соответствие
//
&НаСервере
Процедура ВывестиДокументыОплаты(ЭлементыСтроки, СоответствиеДокументов)
	
	Для Каждого ТекСтрока Из ЭлементыСтроки Цикл
		
		ДокументОплаты = СоответствиеДокументов[ТекСтрока.Ссылка];
		
		ПодчиненныеСтроки = ТекСтрока.ПолучитьЭлементы();
		
		Если НЕ ДокументОплаты = Неопределено Тогда
			
			МетаданныеДокумента = ДокументОплаты.Метаданные();
			
			ИмяДокумента = МетаданныеДокумента.Имя;
			
			Если мКэшРеквизитовДокумента[ИмяДокумента] = Неопределено Тогда
				ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
			КонецЕсли;
			
			НоваяСтрока = ПодчиненныеСтроки.Добавить();
			
			НоваяСтрока.Ссылка = ДокументОплаты;
			НоваяСтрока.ДокументПредставление = Строка(ДокументОплаты);
			НоваяСтрока.СуммаДокумента = ?(мКэшРеквизитовДокумента[ИмяДокумента]["СуммаДокумента"], ДокументОплаты.СуммаДокумента, 0);
			НоваяСтрока.ВалютаДокумента = ?(мКэшРеквизитовДокумента[ИмяДокумента]["ВалютаДокумента"], ДокументОплаты.ВалютаДокумента, Неопределено);
			НоваяСтрока.Проведен = ДокументОплаты.Проведен;
			НоваяСтрока.ПометкаУдаления = ДокументОплаты.ПометкаУдаления;
			
			// Установим индекс пиктограммы текущего состояния документа.
			УстановитьИндексПиктограммыСостоянияДокументаСервер(НоваяСтрока);
			
			мУжеВСписке.Вставить(ДокументОплаты, Истина);
			ВывестиПодчиненныеДокументы(НоваяСтрока,мКэшПраваДоступаКМетаданным);
		КонецЕсли;
		
		ВывестиДокументыОплаты(ПодчиненныеСтроки, СоответствиеДокументов);
		
	КонецЦикла;
	
КонецПроцедуры

// бит_ASubbotina Процедура выводит подчинённые записанные в табличных частях
//
// Параметры:
//  Параметр1  - Тип_описание
//  Параметр2  - Тип_описание
//
&НаСервере
Процедура ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка)
	
	РеквизитыТчПодчинённые = Ложь;
	
	Если Не РеквизитыТчПодчинённые Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов 	= Новый СписокЗначений;
	МетаданныеДокументы = Метаданные.Документы;
	
	ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);
	ВывестиБезРодителей(СписокРеквизитов, Истина);
	
КонецПроцедуры // ВывестиПодчинённыеИзТабличныхЧастей()

Функция ПолучитьСписокПодчиненныхДокументов(ДокументОснование, мКэшПраваДоступаКМетаданным, ИмяКритерия = "СвязанныеДокументы") Экспорт
	
	ТекстЗапроса = "";
	
	ТаблицаДокументов 	 = Новый ТаблицаЗначений;
	ТипДокументОснование = ТипЗнч(ДокументОснование);
	СоставКритерия		 = Метаданные.КритерииОтбора[ИмяКритерия].Состав;
	
	Для Каждого ЭлементСостава ИЗ СоставКритерия Цикл
		
		Если Не ЭлементСостава.Тип.СодержитТип(ТипДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным
		,мКэшПраваДоступаКМетаданным);
		Если Не СтруктураПутьКДанным.ЕстьДоступКМетаданным Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." 
		+ СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
		
		ИмяТЧ 		 = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
		|ВЫБРАТЬ") + "
		|" + СтруктураПутьКДанным.ВидОбъекта   + ".Ссылка ИЗ " + ИмяОбъекта 						+ "."
		+ СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " 	  + СтруктураПутьКДанным.ВидОбъекта + "
		|" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
		|";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТаблицаДокументов = РезультатЗапроса.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПолучитьСписокПодчиненныхДокументов()

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным, мКэшПраваДоступаКМетаданным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	ЕстьДоступКМетаданным = мКэшПраваДоступаКМетаданным.Получить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта);
	Если ЕстьДоступКМетаданным = неопределено Тогда
		Если Структура.ТипОбъекта = "Документ" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Документы[Структура.ВидОбъекта]);
		ИначеЕсли Структура.ТипОбъекта = "Задача" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Задачи[Структура.ВидОбъекта]);
		Иначе
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Справочники[Структура.ВидОбъекта]);
		КонецЕсли;
	КонецЕсли;                                                          
	
	Структура.Вставить("ЕстьДоступКМетаданным", ЕстьДоступКМетаданным);
	мКэшПраваДоступаКМетаданным.Вставить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта,ЕстьДоступКМетаданным);        
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()


// Процедура дополняет кэш метаданных для документа.
//
&НаСервереБезКонтекста
Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента)
	
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;		
		РеквизитыДокумента.Вставить("СуммаДокумента" , МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента")  <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаДокумента", МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено);		
		
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура УстановитьИндексПиктограммыСостоянияДокументаСервер(ДанныеТекущейСтроки)
	
	// Установим индекс пиктограммы текущего состояния документа:
	// 0 - Проведен
	// 1 - помечен на удаление
	// 2 - непроведен
	
	Если ДанныеТекущейСтроки.Проведен Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 0;
		
	ИначеЕсли ДанныеТекущейСтроки.ПометкаУдаления Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 1;
		
	Иначе
		ДанныеТекущейСтроки.ИндексПиктограммы = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка)
	
	Если (Метаданные.Документы.Найти("бит_ЗаявкаНаРасходованиеСредств") <> Неопределено И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.бит_ЗаявкаНаРасходованиеСредств")) 
		ИЛИ (Метаданные.Документы.Найти("бит_ПланируемоеПоступлениеДенежныхСредств") <> Неопределено И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.бит_ПланируемоеПоступлениеДенежныхСредств")) Тогда
		ИмяТабЧастиРодителя = "ГрафикПлатежей";
		
	ИначеЕсли (Метаданные.Документы.Найти("бит_ЗаявкаНаЗатраты") <> Неопределено И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.бит_ЗаявкаНаЗатраты")) Тогда
		ИмяТабЧастиРодителя = "ГрафикНачислений";
		
	Иначе
		ИмяТабЧастиРодителя = Неопределено;	
		
	КонецЕсли;
	
	Возврат ИмяТабЧастиРодителя;
	
КонецФункции // ПолучитьИмяТабличнойЧастиДляПоискаРодителя()

&НаСервере
Процедура ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита)
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = мКэшМетаданныеРеквизита.Получить(ТекущийТип);
			Если МетаданныеРеквизита = неопределено Тогда
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				мКэшМетаданныеРеквизита.Вставить(ТекущийТип,МетаданныеРеквизита);
			КонецЕсли;
			
			Если МетаданныеРеквизита<>Неопределено 
				И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
				И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры // ДополнитьСписокДокументовПоРеквизитам()

&НаКлиенте
Процедура ЗакрытьФормуСПредупреждением(ТекстПредупреждения)
	
	ЭтаФорма.Закрыть();
	
	Предупреждение(ТекстПредупреждения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОсновнойДокументЕщеДоступен(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	Представление 
	|ИЗ 
	|	Документ." + ДокументСсылка.Метаданные().Имя + " 
	|ГДЕ 
	|	Ссылка = &ТекущийДокумент";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДокументДоступен = ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
	Возврат ДокументДоступен;
	
КонецФункции

&НаКлиенте
Процедура СтраницыРаботыССзаказамиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеМенеджера Тогда 	
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеМенеджера);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеЛогистики Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеКладовщиков);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеЗакупщика Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеЗакупщиков);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеСервисногоИнженера Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ВРаботеСервисныхИнженеров);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.ВРаботеЦентраОбслуживанияАбонентов Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("Статус", Перечисления.СтатусыЗаказаИМ.ВРаботеМЦОА);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.Завершен Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.Завершен);
		
	ИначеЕсли Элементы.СтраницыРаботыССзаказами.ТекущаяСтраница = Элементы.Отклонен Тогда 
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.Отклонено);
	Иначе
		ЗаказыПокупателей.Параметры.УстановитьЗначениеПараметра("СтатусИМ", Перечисления.СтатусыЗаказаИМ.ПустаяСсылка());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПозиции(Команда)
	
	Сообщить("фывфыв");
	ВыполнитьПоиск();
	НоменклатураПоставщиковПриАктивизацииСтроки(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск() Экспорт 
	
	РазмерПорции = 50000;
	
	РезультатПоиска = "Идет поиск";
	//Элементы.РезультатПоиска.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;;
	
	Результат = НайтиГруппыКроссовНаСервере(РазмерПорции);
	
	
	
	Если Результат = "Слишком много результатов, уточните запрос" Тогда
		
		Если РазмерПорции = "99999" Тогда
			//полнотекстовый поиск возвращает усеченный вариант в любом случае
			//.СлишкомМногоРезультатов()
			//бессмысленно увеличивать размер порции
			
		Иначе
			
			//если по размеру порции в 1000 мы ничего не нашли, то предложим увеличить выдачу
			
			ТекстВопроса = "Найдено более тысячи групп номенклатуры";
			
			СписокОтветов = Новый СписокЗначений;
			СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Выдать все группы (медленно)");
			СписокОтветов.Добавить(КодВозвратаДиалога.Нет, "Вернуться к строке поиска и уточнить запрос");
			
			//Ответ = Вопрос(ТекстВопроса, СписокОтветов, , КодВозвратаДиалога.Нет, "Большое количество результатов");
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаПроКоличествоРезультатов", ЭтаФорма,РазмерПорции), ТекстВопроса,СписокОтветов,,КодВозвратаДиалога.Нет,"Большое количество результатов");
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	//Если Результат = "Поиск завершен" Тогда
	//	Элементы.РезультатПоиска.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;;
	//Иначе
	//	
	//	Элементы.РезультатПоиска.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
	//КонецЕсли;
	
	
	РезультатПоиска = Результат;
	
	
	
КонецПроцедуры

&НаКлиенте
Функция НайтиГруппыКроссовНаСервере(РазмерПорции)
	
	МассивНоменклатуры = Новый Массив();
	
	
	Если СтрокаПоиска = "" Тогда
		
		Результат = Новый Массив();
		
	КонецЕсли;
	
	
	
	Результат = Обработки.РабочееМестоМенеджераИМ.ПолнотекстовыйПоискТоваров(СтрокаПоиска, МассивНоменклатуры, РазмерПорции);
	
	//Сообщить(МассивНоменклатуры.Количество());
	//Сообщить(РазмерПорции);
	
	Если МассивНоменклатуры.Количество() Тогда 
		//Сообщить("вавыаываыва");
		СписокОтбора = новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(МассивНоменклатуры);
		//Сообщить(СписокОтбора.Количество());
		
		ПользовательскиеНастройкиКомпоновкиДанных = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		ОтборКомпоновкиДанных = ПользовательскиеНастройкиКомпоновкиДанных.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки = "dfcece9d-5077-440b-b6b3-45a5cb4538eb";
		
		ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокОтбора;
		
		НоменклатураПоставщиков.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройкиКомпоновкиДанных);
	КонецЕсли;
	
	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СсылкаНаСайтеПоставщикаНажатие(Элемент)
	ЗапуститьПриложение(Элементы.НоменклатураПоставщиков.ТекущаяСтрока.СсылкаНаСайте);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоставщиковИнтернетМагазинаПриАктивизацииСтроки(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.НоменклатураПоставщиковИнтернетМагазина.ТекущаяСтрока) Тогда 
		
		УстановитьПараметрДинамическогоСпискаНоменклатураНайденная(
			Элементы.НоменклатураПоставщиковИнтернетМагазина.ТекущаяСтрока.Ссылка);	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДинамическогоСпискаНоменклатураНайденная(НоменклатураПоставщика = Неопределено)

	Если НЕ ЗначениеЗаполнено(НоменклатураПоставщика) Тогда
		
		НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Артикул", "");
		НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Наименование", "");
		НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("АртикулПоставщика", "");
		НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		
	Иначе
		
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Элементы.НоменклатураНадпись.Заголовок = "<Номенклатура на створена, або не прив'язана>";
		НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Артикул", НоменклатураПоставщика.Артикул);
		НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Наименование", НоменклатураПоставщика.Наименование);
	    НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("АртикулПоставщика", НоменклатураПоставщика.Модель);
		
		Если ЗначениеЗаполнено(НоменклатураПоставщика.Номенклатура) Тогда 
			НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Номенклатура", НоменклатураПоставщика.Номенклатура);
		Иначе
			НоменклатураНайденная.Параметры.УстановитьЗначениеПараметра("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		КонецЕсли;	
			
	КонецЕсли;

КонецПроцедуры
 

&НаКлиенте
Процедура НоменклатураНадписьНажатие(Элемент)
	НоменклатураПоставщика = Элементы.НоменклатураПоставщиковИнтернетМагазина.ТекущаяСтрока;
	Если Номенклатура.Пустая() Тогда 
		
		
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить("Створити");
		СписокЗначений.Добавить("Прив'язати");
		
		Ответ = Вопрос("Прив'язати або створити номенклатуру",СписокЗначений,,,"Виконайте дію");
		
		Если Ответ = "Створити" Тогда 
			
			
			ОбНоменклатура                         = Справочники.Номенклатура.СоздатьЭлемент();
			ОбНоменклатура.АртикулПоставщика       = НоменклатураПоставщика.Артикул; 
			ОбНоменклатура.МодельПроизводителя     = НоменклатураПоставщика.Модель; 
			ОбНоменклатура.Наименование            = НоменклатураПоставщика.Наименование;
			ОбНоменклатура.Наименование_ru         = НоменклатураПоставщика.Наименование;
			ОбНоменклатура.Наименование_en         = "";
			ОбНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("шт.");
			ОбНоменклатура.ВидНоменклатуры         = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");
			ОбНоменклатура.СтавкаНДС               = Перечисления.СтавкиНДС.НДС20;
			ОбНоменклатура.Записать();
			
			НовЕдиница 				= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			НовЕдиница.Наименование = "шт";
			НовЕдиница.Владелец 	= ОбНоменклатура.Ссылка;
			НовЕдиница.Коэффициент  = 1;
			НовЕдиница.ЕдиницаПоКлассификатору = ОбНоменклатура.БазоваяЕдиницаИзмерения;
			НовЕдиница.Записать();
			
			ОбНоменклатура.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
			ОбНоменклатура.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;
			
			
			ОбНоменклатура.Записать();
			ПривязатьКартинкуКНоменклатуре(НоменклатураПоставщика,ОбНоменклатура);

			
			Номенклатура = ОбНоменклатура.Ссылка;
			
			ОткрытьФормуМодально("Обработка.РабочееМестоМенеджераИМ.Форма.ФормаДеревоКатегорийНоменклатураПоставщика",ПодготовитьТаблицуПереносаДляНоменклатурыПоставщика());	
			
			//ОбНоменклатура.Записать();
			НоменклатураПоставщикаОб = НоменклатураПоставщика.ПолучитьОбъект();
			НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
			НоменклатураПоставщикаОб.Записать();
			
			НоменклатураПоставщиковИнтернетМагазинаПриАктивизацииСтроки(Неопределено);

			
	
			
		Иначе 
			
			
			
			Номенклатура = Справочники.Номенклатура.ПолучитьФормуВыбора().ОткрытьМодально();
			
			//ОбНоменклатура.Записать();
			НоменклатураПоставщикаОб = НоменклатураПоставщика.ПолучитьОбъект();
			НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
			НоменклатураПоставщикаОб.Записать();
			НоменклатураПоставщиковИнтернетМагазинаПриАктивизацииСтроки(Неопределено);
		КонецЕсли;
	Иначе
		ОткрытьЗначение(Номенклатура);
	КонецЕсли;
КонецПроцедуры

Функция ПодготовитьТаблицуПереносаДляНоменклатурыПоставщика()
	
	
	СписокЗначений 	 = новый СписокЗначений;
	СписокЗначений.Добавить(Номенклатура);
	
	ПараметрыДляПереноса = новый Структура;
	ПараметрыДляПереноса.Вставить("Товары",СписокЗначений);
	
	Возврат ПараметрыДляПереноса;
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрДинамическогоСписка()
	
	НоменклатураПоставщиковСписок.Параметры.УстановитьЗначениеПараметра("Номенклатура", Номенклатура);
	НоменклатураПоставщиковСписок.Параметры.УстановитьЗначениеПараметра("Наименование", Номенклатура.Наименование);
	НоменклатураПоставщиковСписок.Параметры.УстановитьЗначениеПараметра("Артикул", Номенклатура.АртикулПоставщика);
	НоменклатураПоставщиковСписок.Параметры.УстановитьЗначениеПараметра("МодельПоставщика", Номенклатура.МодельПроизводителя);

КонецПроцедуры

&НаКлиенте
Процедура ПривязатьНоменклатуруПоставщика(Команда)
		НоменклатураПоставщика = Справочники.im_НоменклатураПоставщиков.ПолучитьФормуВыбора().ОткрытьМодально();
		
		Если не ЗначениеЗаполнено(Номенклатура) Тогда 
			Номенклатура = Элементы.НоменклатураПоставщиков.ТекущиеДанные.Ссылка;
		КонецЕсли;
		Если ЗначениеЗаполнено(НоменклатураПоставщика) Тогда 
				//ОбНоменклатура.Записать();
			НоменклатураПоставщикаОб = НоменклатураПоставщика.ПолучитьОбъект();
			НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
			НоменклатураПоставщикаОб.Записать();
			Элементы.НоменклатураПоставщиковСписок.Обновить();

		Иначе
			
		КонецЕсли;
		 Элементы.НоменклатураПоставщиковСписок.Обновить();
		КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНайденнаяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НоменклатураПоставщика = Элементы.НоменклатураПоставщиковИнтернетМагазина.ТекущаяСтрока;
	Если ЗначениеЗаполнено(НоменклатураПоставщика) Тогда 
		Номенклатура = НоменклатураПоставщика.Номенклатура;
	КонецЕсли;
	Если Номенклатура.Пустая() Тогда 
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить("Створити");
		СписокЗначений.Добавить("Прив'язати");
		СписокЗначений.Добавить("Відмінити");
		
		Ответ = Вопрос("Прив'язати або створити номенклатуру",СписокЗначений,,,"Виконайте дію");
		
		Если Ответ = "Створити" Тогда 	
			ОбНоменклатура                         = Справочники.Номенклатура.СоздатьЭлемент();
			ОбНоменклатура.АртикулПоставщика       = НоменклатураПоставщика.Артикул; 
			ОбНоменклатура.МодельПроизводителя     = НоменклатураПоставщика.Модель; 
			ОбНоменклатура.Наименование            = НоменклатураПоставщика.Наименование;
			ОбНоменклатура.Наименование_ru         = НоменклатураПоставщика.Наименование;
			ОбНоменклатура.Наименование_en         = "";
			ОбНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("шт.");
			ОбНоменклатура.ВидНоменклатуры         = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");
			ОбНоменклатура.СтавкаНДС			   = Перечисления.СтавкиНДС.НДС20;
			ОбНоменклатура.Записать();
			
			НовЕдиница 				= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			НовЕдиница.Наименование = "шт";
			НовЕдиница.Владелец 	= ОбНоменклатура.Ссылка;
			НовЕдиница.Коэффициент  = 1;
			НовЕдиница.ЕдиницаПоКлассификатору = ОбНоменклатура.БазоваяЕдиницаИзмерения;
			НовЕдиница.Записать();
			
			ОбНоменклатура.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
			ОбНоменклатура.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;
			
			
			ОбНоменклатура.Записать();
			ПривязатьКартинкуКНоменклатуре(НоменклатураПоставщика,ОбНоменклатура);

			
			Номенклатура = ОбНоменклатура.Ссылка;
			
			ОткрытьФормуМодально("Обработка.РабочееМестоМенеджераИМ.Форма.ФормаДеревоКатегорийНоменклатураПоставщика",ПодготовитьТаблицуПереносаДляНоменклатурыПоставщика());	
			
			//ОбНоменклатура.Записать();
			НоменклатураПоставщикаОб = НоменклатураПоставщика.ПолучитьОбъект();
			НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
			НоменклатураПоставщикаОб.Записать();
			
			НоменклатураПоставщиковИнтернетМагазинаПриАктивизацииСтроки(Неопределено);

			
			//НоменклатураПоставщиковИнтернетМагазинаПриАктивизацииСтроки(Неопределено);
			УстановитьЦенуНаСервере(Номенклатура.ссылка,НоменклатураПоставщика.РРЦ);

		ИначеЕсли Ответ = "Прив'язати" Тогда 
			
			
			
			Номенклатура = Элементы.НоменклатураНайденная.ТекущиеДанные.ссылка;
			
			//ОбНоменклатура.Записать();
			НоменклатураПоставщикаОб = НоменклатураПоставщика.ПолучитьОбъект();
			НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
			НоменклатураПоставщикаОб.Записать();
			НоменклатураПоставщиковИнтернетМагазинаПриАктивизацииСтроки(Неопределено);
			
			Номенклатура = НоменклатураПоставщикаОб.Номенклатура;
			
			ПривязатьКартинкуКНоменклатуре(НоменклатураПоставщика,Номенклатура.ПолучитьОбъект());
			УстановитьЦенуНаСервере(Номенклатура.ссылка,НоменклатураПоставщика.РРЦ);

		КонецЕсли;
		
		
		
	Иначе
		ОткрытьЗначение(Номенклатура);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоставщиковСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	НоменклатураПоставщика = Элементы.НоменклатураПоставщиковСписок.ТекущиеДанные.ссылка;
	
	Если ЗначениеЗаполнено(НоменклатураПоставщика) Тогда 
		
		Если ЗначениеЗаполнено(НоменклатураПоставщика.Номенклатура) Тогда 
			ОткрытьЗначение(НоменклатураПоставщика);
		Иначе
			
			СпиокВариантовОтвета = новый СписокЗначений;
			СпиокВариантовОтвета.Добавить("Так");
			СпиокВариантовОтвета.Добавить("Ні");
			Ответ = Вопрос("Вы намагаєтесь прив'язати номенклатуру постачальника до номенклатури. Продавжити?",СпиокВариантовОтвета);
			
			Если Ответ = "Так" Тогда 
				
				НоменклатураПоставщика = Элементы.НоменклатураПоставщиковСписок.ТекущиеДанные.ссылка;
				
				Если ЗначениеЗаполнено(НоменклатураПоставщика) Тогда 
					//ОбНоменклатура.Записать();
					НоменклатураПоставщикаОб = НоменклатураПоставщика.ПолучитьОбъект();
					НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
					НоменклатураПоставщикаОб.Записать();
					Элементы.НоменклатураПоставщиковСписок.Обновить();
					
				Иначе
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	Ответ = Вопрос("Створити номенклатуру",РежимДиалогаВопрос.ДаНетОтмена,,,"Виконайте дію");
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СписокЗначений 	 = новый СписокЗначений;
		Для Каждого Строка из Элементы.НоменклатураПоставщиковИнтернетМагазина.ВыделенныеСтроки Цикл 
			
			если Строка.Номенклатура.Пустая() Тогда 
				ОбНоменклатура                         = Справочники.Номенклатура.СоздатьЭлемент();
				ОбНоменклатура.АртикулПоставщика       = Строка.Артикул;
				ОбНоменклатура.МодельПроизводителя     = Строка.Модель;
				ОбНоменклатура.Наименование            = Строка.Наименование;
				ОбНоменклатура.Наименование_ru         = Строка.Наименование;
				ОбНоменклатура.Наименование_en         = "";
				ОбНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
				ОбНоменклатура.ВидНоменклатуры         = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");
				ОбНоменклатура.СтавкаНДС			   = Перечисления.СтавкиНДС.НДС20;
				ОбНоменклатура.Записать();
				
				НовЕдиница 				= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
				НовЕдиница.Наименование = "шт";
				НовЕдиница.Владелец 	= ОбНоменклатура.Ссылка;
				НовЕдиница.Коэффициент  = 1;
				НовЕдиница.ЕдиницаПоКлассификатору = ОбНоменклатура.БазоваяЕдиницаИзмерения;
				НовЕдиница.Записать();
				
				ОбНоменклатура.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
				ОбНоменклатура.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;		
				
				// t.me/konstantyn_buhantsev [6 лютого 2025 р.] --> 
				Бренд = Справочники.Бренды.НайтиПоНаименованию(Строка.Бренд);
				Если НЕ ЗначениеЗаполнено(Бренд) Тогда
					БрендОбъект = Справочники.Бренды.СоздатьЭлемент();
					БрендОбъект.Наименование = Строка.Бренд;
					БрендОбъект.Записать();
					Бренд = БрендОбъект.Ссылка;
				КонецЕсли;
				ОбНоменклатура.Бренд = Бренд;
				// <-- t.me/konstantyn_buhantsev [6 лютого 2025 р.] 
				
				ОбНоменклатура.Записать();		
				ПривязатьКартинкуКНоменклатуре(Строка,ОбНоменклатура);

				Номенклатура = ОбНоменклатура.Ссылка;
				НоменклатураПоставщикаОб = Строка.ПолучитьОбъект();
				НоменклатураПоставщикаОб.Номенклатура = Номенклатура;
				НоменклатураПоставщикаОб.Записать();
				
				УстановитьЦенуНаСервере(ОбНоменклатура.ссылка,Строка.РРЦ);				
				СписокЗначений.Добавить(Номенклатура);
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыДляПереноса = новый Структура;
		ПараметрыДляПереноса.Вставить("Товары",СписокЗначений);
		ОткрытьФормуМодально("Обработка.РабочееМестоМенеджераИМ.Форма.ФормаДеревоКатегорийНоменклатураПоставщика",ПараметрыДляПереноса);
		
		Элементы.НоменклатураПоставщиковИнтернетМагазина.Обновить();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Вставити вміст обробника.
	Категория = Элементы.ДеревоКатегорий.ТекущиеДанные.Категория;

	ОбновитьОтображениеТаблицы();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьВыбранныеНаСервере()
	Для Каждого Строка из Элементы.НоменклатураПоставщиковСписок.ВыделенныеСтроки Цикл 
		НоменклатураСсылка = Элементы.НоменклатураПоставщиковСписок.ДанныеСтроки(Строка).Ссылка;
		СтрокаОб = НоменклатураСсылка.получитьОбъект();
		СтрокаОб.Номенклатура = Номенклатура;
		СтрокаОб.записать();
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьВыбранные(Команда)
	ПривязатьВыбранныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийПриИзменении(Элемент)
	
	Категория = Элементы.ДеревоКатегорий.ТекущиеДанные.Категория;

	ОбновитьОтображениеТаблицы();


КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийКатегорияПриИзменении(Элемент)
	ОбновитьОтображениеТаблицы();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуруПоставщика(Команда)
	ОткрытьЗначение(Элементы.НоменклатураПоставщиковСписок.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьКартинкуКНоменклатуре(НоменклатураПоставщика,ОбНоменклатура)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщика,
	               |	im_НоменклатураПоставщиков.Поставщик
	               |ИЗ
	               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |ГДЕ
	               |	im_НоменклатураПоставщиков.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",ОбНоменклатура.ссылка);
	
	РезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатаЗапроса.Количество()<2 Тогда 
	
	Если НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.VIATEC Тогда 
		
		Url = "viatec.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИмяФайла = НоменклатураПоставщика.Изображениия[0].URL;
			HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(ИмяФайла,"https://viatec.ua",""),Заголовки);
			
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;
			
			
			Если Ответ.КодСостояния <> 200 Тогда
				Возврат;
			КонецЕсли; 
			//ХранилищеДопИнфо = ПолучитьКартинку(ОбНоменклатура.Ссылка,""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта");
			//Если ХранилищеДопИнфо <> Неопределено Тогда 
			//	ОбНоменклатура.ОсновноеИзображение = ХранилищеДопИнфо;
			//	ОбНоменклатура.Записать();	
			//Иначе
			
			если не ЗначениеЗаполнено(ОбНоменклатура.ОсновноеИзображение) Тогда 
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
				ОбНоменклатура.Записать();
			Иначе
				ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	ИначеЕсли НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.Deps Тогда 
		Url = "deps.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИмяФайла = НоменклатураПоставщика.Изображениия[0].URL;
			HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(ИмяФайла,"https://deps.ua",""),Заголовки);
			
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			Фото    =  Ответ.ПолучитьТелоКакДвоичныеДанные() ;
			
			
			Если Ответ.КодСостояния <> 200 Тогда
				Возврат;
			КонецЕсли; 
			//ХранилищеДопИнфо = ПолучитьКартинку(ОбНоменклатура.Ссылка,""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта");
			//Если ХранилищеДопИнфо <> Неопределено Тогда 
			//	ОбНоменклатура.ОсновноеИзображение = ХранилищеДопИнфо;
			//	ОбНоменклатура.Записать();	
			//Иначе
			
			если не ЗначениеЗаполнено(ОбНоменклатура.ОсновноеИзображение) Тогда 
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
				ОбНоменклатура.Записать();
			Иначе
				ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	ИначеЕсли НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK Тогда 
		Url = "source.dclink.com.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИндексКартинки = 1;
			Для Каждого URLКартинки из НоменклатураПоставщика.Изображениия Цикл  
				
				ИмяФайла  = URLКартинки.URL;
				HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(ИмяФайла,"https://source.dclink.com.ua",""),Заголовки);
				
				Ответ 	= Соединение.Получить(HTTPЗапрос);	
				Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;
				
				
				Если Ответ.КодСостояния <> 200 Тогда
					Возврат;
				КонецЕсли; 
				
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				
				Если ИндексКартинки=1 Тогда  
					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
					ОбНоменклатура.Записать();	
				КонецЕсли;
				ИндексКартинки = ИндексКартинки+1;
			КонецЦикла;
			ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			
		КонецЕсли;
	ИначеЕсли НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.Renklod Тогда
		ИмяФайла = НоменклатураПоставщика.Изображениия[0].url;
		МассивСтрок = СтрЗаменить(ИмяФайла,"/",Символы.ПС);
		Url = СтрПолучитьСтроку(МассивСтрок,3);
		
		Соединение = Новый HTTPСоединение("b2b.renklod.com.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИндексКартинки = 1;
			Для Каждого URLКартинки из НоменклатураПоставщика.Изображениия Цикл  
				
				ИмяФайла  = URLКартинки.URL;
				HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(ИмяФайла,"https://"+Url,""),Заголовки);
				
				Ответ 	= Соединение.Получить(HTTPЗапрос);	
				Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;
				
				
				Если Ответ.КодСостояния <> 200 Тогда
					Возврат;
				КонецЕсли; 
				
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				
				Если ИндексКартинки=1 Тогда  
					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
					ОбНоменклатура.Записать();	
				КонецЕсли;
				ИндексКартинки = ИндексКартинки+1;
			КонецЦикла;
			ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			
		КонецЕсли;
		ИначеЕсли НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.МТИ Тогда 
		Url = "products.mti.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИндексКартинки = 1;
			Для Каждого URLКартинки из НоменклатураПоставщика.Изображениия Цикл  
				
				ИмяФайла  = URLКартинки.URL;
				HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(ИмяФайла,"https://products.mti.ua",""),Заголовки);
				
				Ответ 	= Соединение.Получить(HTTPЗапрос);	
				Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;
				
				
				Если Ответ.КодСостояния <> 200 Тогда
					Возврат;
				КонецЕсли; 
				
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				
				Если ИндексКартинки=1 Тогда  
					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
					ОбНоменклатура.Записать();	
				КонецЕсли;
				ИндексКартинки = ИндексКартинки+1;
			КонецЦикла;
			ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			
		КонецЕсли;
		ИначеЕсли НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.ERC Тогда 
		Url = "erc.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИндексКартинки = 1;
			Для Каждого URLКартинки из НоменклатураПоставщика.Изображениия Цикл  
				
				ИмяФайла  = URLКартинки.URL;
				HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(СтрЗаменить(ИмяФайла,"http://www.erc.ua",""),"https://erc.ua",""),Заголовки);
				
				Ответ 	= Соединение.Получить(HTTPЗапрос);	
				Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;
				
				Если Ответ.КодСостояния = 301 Тогда 
					НовыйИмяФайла = Ответ.Заголовки["Location"];
					НовыйUrl      = СтрПолучитьСтроку(СтрЗаменить(Стрзаменить(Стрзаменить(Ответ.Заголовки["Location"],"http://",""),"https://",""),"/",символы.ПС),1);	
					Соединение = Новый HTTPСоединение(НовыйUrl,,,,,,Новый ЗащищенноеСоединениеOpenSSL);

					ИмяФайла  = URLКартинки.URL;
				    HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(СтрЗаменить(НовыйИмяФайла,"http://"+НовыйUrl,""),"https://"+НовыйUrl,""),Заголовки);
				
				    Ответ 	= Соединение.Получить(HTTPЗапрос);	
				    Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;

					
				КонецЕсли;
				
				
				Если Ответ.КодСостояния <> 200 Тогда
					Возврат;
				КонецЕсли; 
				
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				
				Если ИндексКартинки=1 Тогда  
					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
					ОбНоменклатура.Записать();	
				КонецЕсли;
				ИндексКартинки = ИндексКартинки+1;
			КонецЦикла;
			ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			
		КонецЕсли;

	ИначеЕсли НоменклатураПоставщика.Поставщик = Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract Тогда 
		Url = "b2b.yugcontract.ua";	 //https://b2b.yugcontract.ua/fileslibrary/products/1800055/3204817.png
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки  = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		
		
		Если НоменклатураПоставщика.Изображениия.Количество() Тогда
			ИндексКартинки = 1;
			Для Каждого URLКартинки из НоменклатураПоставщика.Изображениия Цикл  
				
				ИмяФайла  = URLКартинки.URL;
				HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить(ИмяФайла,"https://b2b.yugcontract.ua",""),Заголовки);
				
				Ответ 	= Соединение.Получить(HTTPЗапрос);	
				Фото    = Ответ.ПолучитьТелоКакДвоичныеДанные() ;
				
				
				Если Ответ.КодСостояния <> 200 Тогда
					Возврат;
				КонецЕсли; 
				
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Наименование = "1";
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект    = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла  = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта";
				НовыйОбъект.Записать();
				
				Если ИндексКартинки=1 Тогда  
					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
					ОбНоменклатура.Записать();	
				КонецЕсли;
				ИндексКартинки = ИндексКартинки+1;
			КонецЦикла;
			ЗарегистрироватИзображенияНаВыгрузку(ОбНоменклатура.Ссылка);
			
		КонецЕсли;

		
	КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватИзображенияНаВыгрузку(Номенклаутра)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеДополнительнойИнформации.Ссылка
	               |ИЗ
	               |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	               |ГДЕ
	               |	ХранилищеДополнительнойИнформации.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка из РезультатЗапроса Цикл  
		
		ОбКартинка = строка.Ссылка.ПолучитьОбъект();
		ОбКартинка.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппПриАктивизацииСтроки(Элемент)
	
	ТекущаяГруппа = Элементы.ДеревоГрупп.ТекущаяСтрока;
	
	КоллекцияЭлементовОтбора = НоменклатураПоставщиковИнтернетМагазина.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		Если ЭлементОтбора.Представление = "Родитель" Тогда
			Если НЕ ЗначениеЗаполнено(ТекущаяГруппа) Тогда
				КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
			Иначе
				ЭлементОтбора.ПравоеЗначение = ТекущаяГруппа;
			КонецЕсли;	
			Возврат;
		КонецЕсли; 		
	КонецЦикла; 		
	
	Если НЕ ЗначениеЗаполнено(ТекущаяГруппа) Тогда
		Возврат;
	КонецЕсли;	
		
	Элемент = КоллекцияЭлементовОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	Элемент.ПравоеЗначение = ТекущаяГруппа;
	
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Элемент.Представление = "Родитель";
	Элемент.Использование = Истина;		
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоставщиковОбработкаЗапросаОбновления()
	НоменклатураПоставщиковПриАктивизацииСтроки(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанЭлементНоменклатурыПоставщиков" Тогда
	
		УстановитьПараметрДинамическогоСпискаНоменклатураНайденная(Элементы.НоменклатураПоставщиковИнтернетМагазина.ТекущаяСтрока);	
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Функция ПолучмитБренд(Наименование)
	
	
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаСоздатьПакетДокументов(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ЗаказПокупателя = Элементы.ЗаказыПокупателей.ТекущаяСтрока;
		Если ЕстьЧекПоЗаказу(ЗаказПокупателя) Тогда
			Сообщить("По заказу є чек");
			Возврат;
		КонецЕсли;

		НачатьТранзакцию();
		Чек = СоздатьЧекККМНаСервере(ЗаказПокупателя);	
		
		Результат = Истина;
		Ответ     = "";
		ФормаДокумента = Чек.ПолучитьФорму("ФормаРегистрацииПродаж");
		
		Чек.ПровестиИРаспечататьЧек(Ответ, Ложь, ФормаДокумента);
		Если Чек.ЧекПробитНаККМ Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Сообщить("Не вдалось створити чек");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЧекККМНаСервере(ЗаказПокупателя) Экспорт
	
	Чек 					= Документы.ЧекККМ.СоздатьДокумент();
	Чек.Дата				= ТекущаяДата();
	Чек.ЗаказПокупателя 	= ЗаказПокупателя;
	Чек.ДокументОснование 	= ЗаказПокупателя;
	Чек.ВидОперации 		= Перечисления.ВидыОперацийЧекККМ.Продажа;
	Чек.КассаККМ			= Константы.КассаККМБезналичные.Получить();
	Чек.Комментарий			= "#Створено з обробки робоче місце ІМ";
	Чек.Организация			= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9"));
	Чек.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
	Чек.СтатусЧека			= Перечисления.СтатусыЧековККМ.Пробитый;
	Чек.Склад				= ЗаказПокупателя.СкладГруппа;
	
	Чек.Товары.Загрузить(ЗаказПокупателя.Товары.Выгрузить());
	
	НовСтр 				= Чек.Оплата.Добавить();
	НовСтр.ВидОплаты 	= Справочники.ВидыОплатЧекаККМ.НайтиПоКоду("00002");
	НовСтр.Сумма 		= ЗаказПокупателя.СуммаДокумента;
	
	Чек.Записать();
	
	Возврат Чек;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЧекККМ(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаСоздатьПакетДокументов", ЭтаФорма),"Створити пакет документів?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЧекПоЗаказу(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Поле1
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции


мУжеВСписке 				= Новый Соответствие;
мКэшРеквизитовДокумента 	= Новый Соответствие;
мКэшПраваДоступаКМетаданным	= Новый Соответствие;

