
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
 
	 
 КонецПроцедуры
 
 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаОтбор.Скрыть();
	ЗаВесьПериод = Истина; 
	
	ЗаВесьПериодПриИзменении(Неопределено);
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗаполнения");
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	КомпановщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпановщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					
КонецПроцедуры
 

&НаКлиенте
Процедура Заполнить(Команда)
		ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЗаявкиНаРасходованиеНаличные.Очистить();
	ЗаявкиНаРасходованиеБезналичные.Очистить();

	ИнициализироватьКомпоновкуДанных(Ложь);

	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗаполнения");	
	
	Если ЗаВесьПериод Тогда   
		
			
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Дата(2000,1,1);
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Дата(2050,1,1);
		ЭД.Использование = Истина;

				
	Иначе 
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Период.ДатаНачала;
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Период.ДатаОкончания;
		ЭД.Использование = Истина;
	
		
	КонецЕсли;
	
	ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФормаОплаты");
	ЭД.Значение = Перечисления.ВидыДенежныхСредств.Безналичные;
	ЭД.Использование = Истина;

	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпановщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ = ЗаявкиНаРасходованиеБезналичные.Выгрузить();
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ЗаявкиНаРасходованиеБезналичные.Загрузить(ТЗ);	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	КомпановщикНастроек = Неопределено;
	ИнициализироватьКомпоновкуДанных(Ложь);
	
	
	Если ЗаВесьПериод Тогда   
		
			
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Дата(2000,1,1);
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Дата(2050,1,1);
		ЭД.Использование = Истина;

				
	Иначе 
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Период.ДатаНачала;
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Период.ДатаОкончания;
		ЭД.Использование = Истина;
	
		
	КонецЕсли;
	
	ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФормаОплаты");
	ЭД.Значение = Перечисления.ВидыДенежныхСредств.Наличные;
	ЭД.Использование = Истина;


	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпановщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ = ЗаявкиНаРасходованиеНаличные.Выгрузить();
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ЗаявкиНаРасходованиеНаличные.Загрузить(ТЗ);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеДокументНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.ЗаявкиНаРасходованиеНаличные.ТекущиеДанные.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗаявкиНаРасходованиеДокумент" 
		или Поле.Имя = "ЗаявкиНаРасходованиеБезналичныеДокумент" Тогда 
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
	
	Если Поле.Имя = "ЗаявкиНаРасходованиеНомерРеестра"
		или Поле.Имя = "ЗаявкиНаРасходованиеБезналичныеНомерРеестра"Тогда 
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Реестр);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаВесьПериодПриИзменении(Элемент)
	Если ЗаВесьПериод Тогда 
		Элементы.Период.Доступность = Ложь;
	Иначе
		Элементы.Период.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРеестрНаОплату(Команда)
	КонецПроцедуры

&НаСервере
Функция СоздатьРеестрНаОплатуНаСервере(ФормаОплаты) 
	
	Реестр        = Документы.РеестрПлатежей.СоздатьДокумент();
	Реестр.ФормаОплаты = ФормаОплаты;
	Реестр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Реестр.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Черновик;
	
	Если ФормаОплаты = Перечисления.ВидыДенежныхСредств.Наличные Тогда 
		Для Каждого Строка из ЗаявкиНаРасходованиеНаличные цикл
			Если Строка.использовать тогда 
				//Если не НайтиРеестр(строка.Документ) Тогда 
					Реестр.Дата                  = ТекущаяДата();
					СтрокаРеестра                = Реестр.ЗаявкиНаРасходованиеДС.Добавить();
					СтрокаРеестра.Заявка         = строка.Документ;
					СтрокаРеестра.СуммаДокумента = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СуммаКОплате   = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СтатьяДДС      = строка.Документ.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
					СтрокаРеестра.Проект         = строка.Документ.РасшифровкаПлатежа[0].Проект;
					Реестр.Записать();
					строка.НомерРеестра = Реестр.Номер; 
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Для Каждого Строка из ЗаявкиНаРасходованиеБезналичные цикл
			Если Строка.использовать тогда 
				//Если не НайтиРеестр(строка.Документ) Тогда 
					Реестр.Дата   		 		 = ТекущаяДата();
					СтрокаРеестра		 		 = Реестр.ЗаявкиНаРасходованиеДС.Добавить();
					СтрокаРеестра.Заявка 		 = строка.Документ;
					СтрокаРеестра.СуммаДокумента = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СуммаКОплате   = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СтатьяДДС      = строка.Документ.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
					СтрокаРеестра.Проект         = строка.Документ.РасшифровкаПлатежа[0].Проект;
					Реестр.Записать();
					строка.НомерРеестра = Реестр.Номер; 
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Реестр.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиРеестр(Заявка)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеестрПлатежейЗаявкиНаРасходованиеДС.Ссылка
	               |ИЗ
	               |	Документ.РеестрПлатежей.ЗаявкиНаРасходованиеДС КАК РеестрПлатежейЗаявкиНаРасходованиеДС
	               |ГДЕ
	               |	РеестрПлатежейЗаявкиНаРасходованиеДС.Заявка = &Заявка
	               |	И РеестрПлатежейЗаявкиНаРасходованиеДС.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Заявка",Заявка);
	
	Возврат Запрос.Выполнить().Выгрузить().Количество();
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокЗаявок(Результат, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для Каждого Строка из ЗаявкиНаРасходованиеНаличные цикл
		Строка.использовать = истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Строка из ЗаявкиНаРасходованиеНаличные цикл
		Строка.использовать = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеестрНаОплатуНаличные(Команда)
	Реестр = СоздатьРеестрНаОплатуНаСервере(Перечисления.ВидыДенежныхСредств.Наличные);	
	ПоказатьЗначение(Новый ОписаниеОповещения("ОбновитьСписокЗаявок",ЭтаФорма),Реестр);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеестрНаОплатуБезналичные(Команда)
	Реестр = СоздатьРеестрНаОплатуНаСервере(Перечисления.ВидыДенежныхСредств.Безналичные);	
	ПоказатьЗначение(Новый ОписаниеОповещения("ОбновитьСписокЗаявок",ЭтаФорма),Реестр);
КонецПроцедуры

Функция ПолучитьОстатокПоЗаявке(Заявка)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДенежныеСредстваКВыплатеОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки КАК ДенежныеСредстваКВыплатеОстатки
	               |ГДЕ
	               |	ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходование = &ЗаявкаНаРасходованиеДенежныхСредств";
	Запрос.УстановитьПараметр("ЗаявкаНаРасходованиеДенежныхСредств",Заявка);
	
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапрос.Количество() Тогда 
		Возврат РезультатЗапрос[0].СуммаОстаток;
		
	КонецЕсли;
	Возврат 0;	
КонецФункции

&НаСервере
Процедура ОтправитьПисьмоНаСервере(ИмяТч)
	
	Если ИмяТч = "ЗаявкиБезнал" Тогда
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Использовать", Истина);
		стрПоиска.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		
		НайденныеСтроки = ЗаявкиНаРасходованиеБезналичные.НайтиСтроки(стрПоиска);
		
	ИначеЕсли ИмяТч = "ЗаявкиНал" Тогда	
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Использовать", Истина);
		стрПоиска.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		
		НайденныеСтроки = ЗаявкиНаРасходованиеНаличные.НайтиСтроки(стрПоиска);
		
	ИначеЕсли ИмяТч = "ЗаявкиРеестр" Тогда	
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Использовать", Истина);
		стрПоиска.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		
		НайденныеСтроки = ЗаявкиНаРасходованиеНаличные.НайтиСтроки(стрПоиска);
		
	КонецЕсли;
	
	ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
	ПутьСохранения = Неопределено;
	
	СоответсвиеОрганизацииИЗаявки = Новый Соответствие;
	
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		Если СоответсвиеОрганизацииИЗаявки[НайденнаяСтрока.Документ.Организация] = Неопределено Тогда
			МассЗаявок = Новый Массив;
			МассЗаявок.Добавить(НайденнаяСтрока.Документ);
			СоответсвиеОрганизацииИЗаявки.Вставить(НайденнаяСтрока.Документ.Организация, МассЗаявок);
		Иначе
			СоответсвиеОрганизацииИЗаявки[НайденнаяСтрока.Документ.Организация].Добавить(НайденнаяСтрока.Документ);
		КонецЕсли;

	КонецЦикла;
	
	УчЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень");
	Для Каждого ЗаявкиИОтправители из СоответсвиеОрганизацииИЗаявки Цикл
		
		СписокПолучателей = Новый СписокЗначений;
		ЗаполнитьПоОрганизации(СписокПолучателей, ЗаявкиИОтправители.Ключ);
		
		ТемаПисьма 	= "Заявки узгодженні";
		ТекстПисьма = "Список заявок: <br>" ;
		Для Каждого стрЗаявка из ЗаявкиИОтправители.Значение Цикл
			
			ТекстПисьма = ТекстПисьма + " №" + стрЗаявка.Номер + ". від " + Формат(стрЗаявка.Дата, "ДЛФ=В") + "; <br> " ;
			
		КонецЦикла;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", ТемаПисьма);
		СтрПисьма.Вставить("УчетнаяЗапись", УчЗапись);
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(, ПользовательОтправкиПоПочте);
		
	КонецЦикла;
	
	Сообщить("Листи надіслано");

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоЗаявкиБезнал(Команда)	
	ОтправитьПисьмоНаСервере("ЗаявкиБезнал");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоЗаявкиНал(Команда)	
	ОтправитьПисьмоНаСервере("ЗаявкиНал");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоЗаявкиРеестр(Команда)	
	ОтправитьПисьмоНаСервере("ЗаявкиРеестр");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОрганизации(СписокПолучателей, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизациитчБухгалтера.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ Пользователи
		|ИЗ
		|	Справочник.Организации.тчБухгалтера КАК ОрганизациитчБухгалтера
		|ГДЕ
		|	ОрганизациитчБухгалтера.Ссылка = &Организация
		|	И ОрганизациитчБухгалтера.Активный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Email
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				Пользователи.Пользователь
		|			ИЗ
		|				Пользователи КАК Пользователи)
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПолучателей.Добавить(Выборка.Email);
	КонецЦикла;
	
КонецПроцедуры

