Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПЕЧАТЬ
//

// Формирует запрос по документу и связанным регистрам сведений
//
// Параметры: 
//  Режим - строка, может принимать значения:
//			"ПоРеквизитамДокумента"
//			"ПоТабличнойЧастиДокумента"
//
// Возвращаемое значение:
//  Результат запроса с данными об организации или о работниках из табличной части
//
Функция СформироватьЗапросДляПечати(Режим)
    
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	 Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);
	Запрос.УстановитьПараметр("Организация",	 Организация);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомандировкиОрганизаций.Дата КАК ДатаДок,
		|	КомандировкиОрганизаций.Номер КАК НомерДок,
		|	ВЫБОР КОГДА (ФИОФизЛиц.Фамилия) ЕСТЬ NULL  ТОГДА КомандировкиОрганизаций.ФизЛицо.Наименование ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество КОНЕЦ КАК Работник,
		|	ВЫБОР КОГДА (ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.Наименование) ЕСТЬ NULL  ТОГДА """" ИНАЧЕ ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КОНЕЦ КАК ДокументСерия,
		|	ВЫБОР КОГДА (ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.Наименование) ЕСТЬ NULL  ТОГДА """" ИНАЧЕ ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КОНЕЦ КАК ДокументНомер,
		|	КомандировкиОрганизаций.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|	КомандировкиОрганизаций.СтранаНазначения,
		|	КомандировкиОрганизаций.ОрганизацияНазначения,
		|	КомандировкиОрганизаций.ДатаНачала,
		|	КомандировкиОрганизаций.ДатаОкончания,
		|	КомандировкиОрганизаций.Цель,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Представление КАК ДолжностьРуководителя,
		|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследних.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОРуководителя,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	Работники.Сотрудник.Код КАК ТабельныйНомер,
		|	Работники.ПодразделениеОрганизации КАК ПодразделениеРаботника,
		|	Работники.Должность
		|ИЗ
		|	Документ.ОплатаПоСреднемуЗаработку КАК КомандировкиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО КомандировкиОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента) КАК ФИОФизЛиц
		|		ПО КомандировкиОрганизаций.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаДокумента) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|		ПО КомандировкиОрганизаций.Сотрудник.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаДокумента) КАК Работники
		|		ПО КомандировкиОрганизаций.Сотрудник = Работники.Сотрудник
		|
		|ГДЕ
		|	КомандировкиОрганизаций.Ссылка = &ДокументСсылка";

	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечати()


#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой 
// командировочного удостоверения
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьУдостоверение()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КомандировкиОрганизации_Удостоверение";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// получаем данные для печати
	ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	
	// запоминаем области макета
	Макет = ПолучитьМакет("Удостоверение");
	ОбластьМакета		= Макет.ПолучитьОбласть("Форма");

	ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки.
	ОбластьМакета.Параметры.Продолжительность = ?(НЕ ЗначениеЗаполнено(ВыборкаДляШапки.ДатаОкончания),"",Цел((ВыборкаДляШапки.ДатаОкончания - ВыборкаДляШапки.ДатаНачала + 1) / 86400)+1);
	
	ТабДокумент.Вывести(ОбластьМакета);



	Возврат ТабДокумент;

КонецФункции // ПечатьУдостоверение()	

Функция ПечатьСредняя() Экспорт
	ТабельныйНомер = Сотрудник.Код;

	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Средняя");
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ЭтотОбъект);
	ОбластьШапка.Параметры.ТабельныйНомер = ТабельныйНомер;
	ОбластьШапка.Параметры.КодПоДРФО = Сотрудник.Физлицо.КодПоДРФО; 
	ОбластьШапка.Параметры.Дата = Формат(Дата,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаНачала = Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаОкончания = Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодРасчетаСреднегоНачало = Формат(ПериодРасчетаСреднегоНачало,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодРасчетаСреднегоКонец = Формат(ПериодРасчетаСреднегоКонец,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьШапка);
	ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаСреднего");
	
	табСредняяКоэф = РасчетСреднего.Выгрузить();
	
	Если ДатаНачала >= ПроведениеРасчетов.ДатаИзмененияПорядка100_486() Тогда
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ПревышениеПремии", Истина);
		МассивСтрок = табСредняяКоэф.НайтиСтроки(ОтборСтрок);
		Если Не МассивСтрок = Неопределено Тогда
			Для Каждого МассивСтрока Из МассивСтрок Цикл
				табСредняяКоэф.Удалить(МассивСтрока)
			КонецЦикла	
		КонецЕсли;
	КонецЕсли;	
	
	табСредняяКоэф.Свернуть("БазовыйПериодНачало,БазовыйПериодКонец","КоэффициентПовышенияОкладов");
    табСредняяКоэф.Сортировать("БазовыйПериодНачало Убыв");
	Коэф = КоэффициентПовышенияОкладов;
	КоэфТек = 1;
	Для Каждого СтрКоэф Из табСредняяКоэф Цикл
		Коэф = Коэф * КоэфТек;
		КоэфТек = СтрКоэф.КоэффициентПовышенияОкладов;
		СтрКоэф.КоэффициентПовышенияОкладов = Коэф;
	КонецЦикла;
    табСредняяКоэф.Сортировать("БазовыйПериодНачало");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОплатаПоСреднемуЗаработку.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ОплатаПоСреднемуЗаработку.ВидРасчета КАК ВидРасчета,
	|	СУММА(ОплатаПоСреднемуЗаработку.Результат) КАК Результат,
	|	СУММА(ОплатаПоСреднемуЗаработку.КалендарныеДни) КАК КалендарныеДни,
	|	СУММА(ОплатаПоСреднемуЗаработку.ОтработаноДней) КАК ОтработаноДней,
	|	СУММА(ОплатаПоСреднемуЗаработку.ОтработаноЧасов) КАК ОтработаноЧасов
	|ИЗ
	|	Документ.ОплатаПоСреднемуЗаработку.РасчетСреднего КАК ОплатаПоСреднемуЗаработку
	|ГДЕ
	|	ОплатаПоСреднемуЗаработку.Ссылка.Ссылка = &парамСсылка
	|//ТекстУсловие
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПоСреднемуЗаработку.ВидРасчета,
	|	ОплатаПоСреднемуЗаработку.БазовыйПериодНачало
	|УПОРЯДОЧИТЬ ПО
	|	ОплатаПоСреднемуЗаработку.ВидРасчета,
	|	ОплатаПоСреднемуЗаработку.БазовыйПериодНачало
	|ИТОГИ ПО
	|   ОБЩИЕ,
	|	БазовыйПериодНачало,
	|	ВидРасчета
	|";
	
	Запрос.УстановитьПараметр("парамСсылка", Ссылка);
	Если ДатаНачала >= ПроведениеРасчетов.ДатаИзмененияПорядка100_486() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТекстУсловие",	"	
			|   И ОплатаПоСреднемуЗаработку.ПревышениеПремии = ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТекстУсловие",	"")	
	КонецЕсли;
	
	табСредняя = Запрос.Выполнить().Выгрузить();
	Рез = Запрос.Выполнить();
	Результат = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидРасчета");
	
	ОбластьШапкаРасетСреднего_Начало 	 = Макет.ПолучитьОбласть("ШапкаСредней|Начало");
	ОбластьШапкаРасетСреднего_ВидРасчета = Макет.ПолучитьОбласть("ШапкаСредней|ВидРасчета");
	ОбластьШапкаРасетСреднего_Конец 	 = Макет.ПолучитьОбласть("ШапкаСредней|Конец");
	
	СтрокаСреднего_Начало				 = Макет.ПолучитьОбласть("СтрокаСреднего|Начало");
	СтрокаСреднего_ВидРасчета            = Макет.ПолучитьОбласть("СтрокаСреднего|ВидРасчета");
	СтрокаСреднего_Конец                 = Макет.ПолучитьОбласть("СтрокаСреднего|Конец");
	
	ТабДокумент.Вывести(ОбластьШапкаРасетСреднего_Начало);
	
	КоличествоВставляемыхОбластей = 0;
	Пока Результат.Следующий() Цикл
		ОбластьШапкаРасетСреднего_ВидРасчета.Параметры.ВидРасчета = Результат.ВидРасчета;
		ТабДокумент.Присоединить(ОбластьШапкаРасетСреднего_ВидРасчета);
		КоличествоВставляемыхОбластей = КоличествоВставляемыхОбластей + 1;
	КонецЦикла;
	ОбластьДляОбъединения = ТабДокумент.Область(15,5,15,5+КоличествоВставляемыхОбластей-1);
	ОбластьДляОбъединения.Объединить();
	
	ТабДокумент.Присоединить(ОбластьШапкаРасетСреднего_Конец);
	
	ИндКоэф = 0;
	ИтогоНачислено = 0;
	ВыборкаПериод = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "БазовыйПериодНачало");
	Пока ВыборкаПериод.Следующий() Цикл
		СтрКоєф = табСредняяКоэф[ИндКоэф];
		СтрокаСреднего_Начало.Параметры.Год   =	Формат(Год(ВыборкаПериод.БазовыйПериодНачало),"ЧГ=0");
		СтрокаДатыМесяца = "";
		Если СтрКоєф.БазовыйПериодНачало <> НачалоМесяца(СтрКоєф.БазовыйПериодНачало)
			ИЛИ СтрКоєф.БазовыйПериодКонец <> НачалоДня(КонецМесяца(СтрКоєф.БазовыйПериодКонец)) Тогда
			СтрокаДатыМесяца = " ("+День(СтрКоєф.БазовыйПериодНачало)+"-"+День(СтрКоєф.БазовыйПериодКонец)+")";
		КонецЕсли;
		СтрокаСреднего_Начало.Параметры.Месяц = Формат(СтрКоєф.БазовыйПериодНачало, "ДФ='ММММ';Л =" + Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать))+СтрокаДатыМесяца;
		ТабДокумент.Вывести(СтрокаСреднего_Начало);
		
		ВыборкаВидРасчета = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидРасчета");
		Пока ВыборкаВидРасчета.Следующий() Цикл
			
			СтрокаСреднего_ВидРасчета.Параметры.Результат = ВыборкаВидРасчета.Результат;
			ИтогоНачислено = ИтогоНачислено + ВыборкаВидРасчета.Результат;
			ТабДокумент.Присоединить(СтрокаСреднего_ВидРасчета);
			
			СтрокаСреднего_Конец.Параметры.КоэффициентПовышенияОкладов = СтрКоєф.КоэффициентПовышенияОкладов;
			
		КонецЦикла;
		
		СтрокаСреднего_Конец.Параметры.ОтработаноДней = ВыборкаПериод.ОтработаноДней;	
		СтрокаСреднего_Конец.Параметры.ОтработаноЧасов = ВыборкаПериод.ОтработаноЧасов;	
		СтрокаСреднего_Конец.Параметры.КалендарныеДни = ВыборкаПериод.КалендарныеДни;	
		
		ТабДокумент.Присоединить(СтрокаСреднего_Конец);	
		ИндКоэф = ИндКоэф + 1;
	КонецЦикла;
	
	ОбластьИтогиСреднего_Начало			= Макет.ПолучитьОбласть("ИтогиСреднего|Начало");
	ОбластьИтогиСреднего_ВидРасчета		= Макет.ПолучитьОбласть("ИтогиСреднего|ВидРасчета");
	ОбластьИтогиСреднего_Конец			= Макет.ПолучитьОбласть("ИтогиСреднего|Конец");
	
	ОбластьИтогиСреднего_ВидРасчета.Параметры.Результат		= табСредняя.Итог("Результат");
	
	ТабДокумент.Вывести(ОбластьИтогиСреднего_Начало);
	Результат.Сбросить();
	ВыборкаВидРасчета = Результат;
    Пока ВыборкаВидРасчета.Следующий() Цикл
		ОбластьИтогиСреднего_ВидРасчета.Параметры.Результат = ВыборкаВидРасчета.Результат;
		ТабДокумент.Присоединить(ОбластьИтогиСреднего_ВидРасчета);
	КонецЦикла;
	
	Выборка = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
	Пока Выборка.Следующий() Цикл
		ОбластьИтогиСреднего_Конец.Параметры.ОтработаноДней		= Выборка.ОтработаноДней;
		ОбластьИтогиСреднего_Конец.Параметры.ОтработаноЧасов	= Выборка.ОтработаноЧасов;
		ОбластьИтогиСреднего_Конец.Параметры.КалендарныеДни		= Выборка.КалендарныеДни;
	КонецЦикла;
	ТабДокумент.Присоединить(ОбластьИтогиСреднего_Конец);
	
	Если ДатаНачала >= ПроведениеРасчетов.ДатаИзмененияПорядка100_486() Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СУММА(ОплатаПоСреднемуЗаработку.Результат) КАК ПревышениеПремии,
		|	ОплатаПоСреднемуЗаработку.Ссылка 
		|ИЗ
		|	Документ.ОплатаПоСреднемуЗаработку.РасчетСреднего КАК ОплатаПоСреднемуЗаработку
		|ГДЕ
		|	ОплатаПоСреднемуЗаработку.Ссылка.Ссылка = &парамСсылка
		|	И ОплатаПоСреднемуЗаработку.ПревышениеПремии = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	ОплатаПоСреднемуЗаработку.Ссылка
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьИтогСОграничением				= Макет.ПолучитьОбласть("ИтогСОграничением");
		Если Выборка.Следующий() Тогда
			ОбластьИтогСОграничением.Параметры.ПревышениеПремии		= Формат(-Выборка.ПревышениеПремии, "ЧДЦ=2");
			ОбластьИтогСОграничением.Параметры.ВсегоНачислено		= Формат(ИтогоНачислено, "ЧДЦ=2");
			ОбластьИтогСОграничением.Параметры.ВсегоНачисленоСУчетомОграничения = Формат(ИтогоНачислено + Выборка.ПревышениеПремии, "ЧДЦ=2");
			ТабДокумент.Вывести(ОбластьИтогСОграничением);
		КонецЕсли;	
		
	КонецЕсли;

	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
		ОбластьШапка2.Параметры.СредняяТекст = НСтр("ru='Среднедневная (по рабочим дням):';uk='Середньоденна (по робочих днях):'",КодЯзыкаПечать);
	ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
		ОбластьШапка2.Параметры.СредняяТекст = НСтр("ru='Среднечасовая (по рабочим часам):';uk='Середньогодинна (по робочих годинах):'",КодЯзыкаПечать);
	ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
		ОбластьШапка2.Параметры.СредняяТекст = НСтр("ru='Среднедневная (по календарным дням с вычетом праздников):';uk='Середньоденна (по календарних днях з вирахуванням свят):'",КодЯзыкаПечать);
	ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
		ОбластьШапка2.Параметры.СредняяТекст = НСтр("ru='Среднедневная (по календарным дням без вычета праздников):';uk='Середньоденна (по календарних днях без вирахування свят):'",КодЯзыкаПечать);
	КонецЕсли;
	ОбластьШапка2.Параметры.СуммаСредней = СуммаСредней;
	ТабДокумент.Вывести(ОбластьШапка2);
	
	ОбластьСтроки2 = Макет.ПолучитьОбласть("СтрокаНачисления");
	
	Для Каждого СтрокаТЧ Из Начисления Цикл
		ОбластьСтроки2.Параметры.Заполнить(СтрокаТЧ);
		ТабДокумент.Вывести(ОбластьСтроки2);
	КонецЦикла;
	
	ОбластьИтогиНачислений = Макет.ПолучитьОбласть("ИтогиНачислений");
	ОбластьИтогиНачислений.Параметры.НормаДней = Начисления.Итог("НормаДней");
	ОбластьИтогиНачислений.Параметры.НормаЧасов = Начисления.Итог("НормаЧасов");
	ОбластьИтогиНачислений.Параметры.КалендарныеДни = Начисления.Итог("КалендарныеДни");
	ОбластьИтогиНачислений.Параметры.Результат = Начисления.Итог("Результат");
    ТабДокумент.Вывести(ОбластьИтогиНачислений);

	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Ответственный = Ответственный.ФизЛицо.Наименование;
	ТабДокумент.Вывести(ОбластьПодвал);	
	
	Возврат ТабДокумент;	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если  ИмяМакета = "Удостоверение" Тогда
		ТабДокумент = ПечатьУдостоверение()
	ИначеЕсли  ИмяМакета = "Средняя" Тогда
		ТабДокумент = ПечатьСредняя()
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,НСтр("ru='Начисление оплаты по среднему ';uk='Нарахування оплати по середньому '")),Ссылка);

КонецФункции // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	Возврат Новый Структура("Удостоверение, Средняя","Удостоверение", НСтр("ru='Расчет средней';uk='Розрахунок середньої'"));
КонецФункции // ПолучитьСтруктуруПечатныхФорм()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ТБЛИЧНОЙ ЧАСТИ РасчетСреднего
// Расчитывает сумму средней по значениям в ТЧ РасчетСреднего 
//
Функция РасчитатьСреднюю() Экспорт
	
	СуммаСредней = 0;
	ОплачиваемоеВремя = 0;
	
	Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
		ОплачиваемоеВремя = РасчетСреднего.Итог("ОтработаноДней");
		
	ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
		ОплачиваемоеВремя = РасчетСреднего.Итог("ОтработаноЧасов");
		
	Иначе
		ОплачиваемоеВремя = РасчетСреднего.Итог("КалендарныеДни");
		
	КонецЕсли;
	
	Если ОтражатьВРеглУчете Тогда
		СуммаСредней = ?(ОплачиваемоеВремя = 0 , 0, РасчетСреднего.Итог("Результат") / ОплачиваемоеВремя);
	Иначе
		СуммаСредней = ?(ОплачиваемоеВремя = 0 , 0, РасчетСреднего.Итог("РезультатУпр") / ОплачиваемоеВремя);
	КонецЕсли;
	
КонецФункции  // РасчитатьСреднюю()

Функция АвтозаполнениеРасчетСреднего() Экспорт
	Перем ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета;  
	Перем ДатаПриемаПервыйРабочийДень;

	Если ДатаНачала < ПроведениеРасчетов.ДатаИзмененияПорядка100() Тогда
		//	1. Проверка если данных для расчета средней ещ нет (человек мало проработал, начисляем по окладу)
		//
		Если  НачалоДня(ДобавитьМесяц(ПериодРасчетаСреднегоНачало,1)-1) >= ПериодРасчетаСреднегоКонец Тогда
			ПолучитьДанныеОбОтработанномВремени(ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета);
			Если ОтработаноЗа2Мес = 0 И ОтработаноЗа4Мес = 0 Тогда
				// проработал меньше целого месяца
				// если есть за что платить, пользователю прийдется заполнить эти суммы вручную
				//
				СоздатьСтрокуРасчетСреднего( ПланыВидовРасчета.СреднийЗаработок.ПоОкладу, 1, НачалоМесяца(ПериодРасчетаСреднегоНачало), КонецМесяца(ПериодРасчетаСреднегоНачало));
				
				Записать();
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;

		// 2. Данные для расчета есть - рассчитываем
		//
		
		// Сначала определим коэффициент увеличения оклада 
		// если он вдруг поменялся за время пока за человеком 
		// сохранялась средняя ЗП
		КоэффициентПовышенияОкладов = 1;
		Если ДатаНачала < ПроведениеРасчетов.ДатаИзмененияПорядка100() Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр( "парамСотрудник",	Сотрудник );
			Запрос.УстановитьПараметр( "парамНачало",		КонецДня(ПериодРасчетаСреднегоКонец) + 1 );
			Запрос.УстановитьПараметр( "парамКонец",		ДатаОкончания );
			ТекстЗапроса = " 
			|ВЫБРАТЬ
			|	КоэффициентПовышения.Период,
			|	КоэффициентПовышения.Коэффициент
			|ИЗ РегистрСведений.КоэффициентыПовышенияОкладов КАК	КоэффициентПовышения		
			|ГДЕ	КоэффициентПовышения.Сотрудник	= &парамСотрудник
			|	И	КоэффициентПовышения.Период >= &парамНачало
			|	И	КоэффициентПовышения.Период <= &парамКонец
			|";
			Запрос.Текст = ТекстЗапроса;
			Выборка = Запрос.Выполнить().Выбрать();
			Коэф = 1;
			Пока Выборка.Следующий() Цикл
				Коэф = Коэф * Выборка.Коэффициент;
			КонецЦикла;
			КоэффициентПовышенияОкладов = Коэф;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр( "парамСотрудник",	Сотрудник );
		Запрос.УстановитьПараметр( "парамНачало",		ПериодРасчетаСреднегоНачало );
		Запрос.УстановитьПараметр( "парамКонец",		ПериодРасчетаСреднегоКонец );
		
		//	ВТВремя
		Если Истина Тогда
			//	Описание:
			// 		таблица периодов для расчета средней
			//		
			Начало = ПериодРасчетаСреднегоНачало;
			Конец = ПериодРасчетаСреднегоКонец;
			Запрос.УстановитьПараметр( "парамНачало1", Начало );
			Запрос.УстановитьПараметр( "парамКонец1", Мин( КонецМесяца(Начало), Конец ) );
			ТекстЗапросаВТ = " 
			|	ВЫБРАТЬ
			|		&парамНачало1	КАК БазовыйПериодНачало,
			|		&парамКонец1	КАК БазовыйПериодКонец
			|ПОМЕСТИТЬ ВТВремя	
			|";
			
			Начало = ДобавитьМесяц(НачалоМесяца(Начало),1);
			Инд = 2;
			Пока Начало <= Конец Цикл
				
				Запрос.УстановитьПараметр( "парамНачало"+Инд    , Начало );
				Запрос.УстановитьПараметр( "парамКонец"+Инд    , Мин( КонецМесяца(Начало), Конец ) );
				ТекстЗапросаВТ = ТекстЗапросаВТ + " 
				|	ОБЪЕДИНИТЬ	  
				|	ВЫБРАТЬ
				|		&парамНачало"+Инд+"	КАК БазовыйПериодНачало,
				|		&парамКонец"+Инд+"	КАК БазовыйПериодКонец
				|";	  
				Инд = Инд + 1;
				Начало = ДобавитьМесяц(НачалоМесяца(Начало),1);
				
			КонецЦикла;
			
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТВремя = "ВТВремя";
			
			ТекстЗапросаВТ =" 
			|	ОБЪЕДИНИТЬ *  
			|	ИЗ ВТВремя
			|";	  
			Запрос.Текст = ТекстЗапросаВТ;
		КонецЕсли;
		
		//	ВТКоэффициент
		Если Истина Тогда
			
			ТаблицаКоэф = Новый ТаблицаЗначений;
			ТаблицаКоэф.Колонки.Добавить("ПериодНачало",Новый ОписаниеТипов("Дата"));
			ТаблицаКоэф.Колонки.Добавить("ПериодКонец",Новый ОписаниеТипов("Дата"));
			ТаблицаКоэф.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("Число"));
			
			Если ДатаНачала < ПроведениеРасчетов.ДатаИзмененияПорядка100() Тогда
				//	Описание:
				// 		таблица с коффициентами для оклада и периодами (нижняя граница)
				//		
				ТекстЗапросаВТ = " 
				|	ВЫБРАТЬ
				|		КоэффициентПовышения.Период			КАК ПериодНачало,
				|		КоэффициентПовышения.Коэффициент	КАК Коэффициент,
				|		МИНИМУМ(
				|			ВЫБОР	КОГДА КоэффициентПовышения1.Период ЕСТЬ NULL 
				|						ТОГДА &парамКонец 	
				|					ИНАЧЕ ДОБАВИТЬКДАТЕ(КоэффициентПовышения1.Период,СЕКУНДА,-1) 
				|			КОНЕЦ ) КАК ПериодКонец
				//|ПОМЕСТИТЬ ВТКоэффициент	
				|	ИЗ (
				|			ВЫБРАТЬ
				|				&парамНачало	КАК Период,
				|				1	КАК Коэффициент
				|	
				|	    	ОБЪЕДИНИТЬ 
				|			ВЫБРАТЬ
				|				КоэффициентПовышения.Период,
				|				КоэффициентПовышения.Коэффициент
				|			ИЗ РегистрСведений.КоэффициентыПовышенияОкладов КАК	КоэффициентПовышения		
				|			ГДЕ		КоэффициентПовышения.Сотрудник	= &парамСотрудник
				|				И	КоэффициентПовышения.Период > &парамНачало
				|	)КАК КоэффициентПовышения
				|	
				|	
				|	ЛЕВОЕ СОЕДИНЕНИЕ  РегистрСведений.КоэффициентыПовышенияОкладов 	КАК КоэффициентПовышения1
				|	ПО		КоэффициентПовышения1.Сотрудник	= &парамСотрудник
				|		И	КоэффициентПовышения1.Период > КоэффициентПовышения.Период
				|	
				|	СГРУППИРОВАТЬ ПО
				|		КоэффициентПовышения.Период,
				|		КоэффициентПовышения.Коэффициент
				|УПОРЯДОЧИТЬ ПО
				|	ПериодНачало УБЫВ		
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Выборка = Запрос.Выполнить().Выбрать();
				НачалоМесяцаПериода = Дата(1,1,1);
				КоэффициентПоНачалуМесяца = 1;
				Пока Выборка.Следующий()Цикл
					СтрокаКоэф = ТаблицаКоэф.Добавить();
					СтрокаКоэф.ПериодНачало = Выборка.ПериодНачало;
					СтрокаКоэф.ПериодКонец = Выборка.ПериодКонец;
					Если НачалоМесяца(Выборка.ПериодНачало) = НачалоМесяцаПериода Тогда
						СтрокаКоэф.Коэффициент = КоэффициентПоНачалуМесяца*Выборка.Коэффициент;
						КоэффициентПоНачалуМесяца = КоэффициентПоНачалуМесяца * Выборка.Коэффициент;
					Иначе
						СтрокаКоэф.Коэффициент = Выборка.Коэффициент;
						КоэффициентПоНачалуМесяца = Выборка.Коэффициент;
					КонецЕсли;	
					НачалоМесяцаПериода = НачалоМесяца(Выборка.ПериодНачало);
				КонецЦикла;
			Иначе
				СтрокаТаблицы = ТаблицаКоэф.Добавить();
				СтрокаТаблицы.ПериодНачало = ПериодРасчетаСреднегоНачало;
				СтрокаТаблицы.ПериодКонец = ПериодРасчетаСреднегоКонец;
				СтрокаТаблицы.Коэффициент = 1;
			КонецЕсли;			
			Запрос.УстановитьПараметр("ТаблицаКоэф",ТаблицаКоэф);
			ТекстЗапросаВТ = " 
			|	ВЫБРАТЬ
			|		КоэффициентПовышения.ПериодНачало			КАК ПериодНачало,
			|		КоэффициентПовышения.Коэффициент	КАК Коэффициент,
			|		КоэффициентПовышения.ПериодКонец			КАК ПериодКонец
			|ПОМЕСТИТЬ ВТКоэффициент	
			|ИЗ &ТаблицаКоэф КАК КоэффициентПовышения";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТКоэффициент = "ВТКоэффициент";
		КонецЕсли;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА КоэффициентПериоды.ПериодНачало >= ВсеПериоды.БазовыйПериодНачало И КоэффициентПериоды.ПериодНачало <= ВсеПериоды.БазовыйПериодКонец ТОГДА КоэффициентПериоды.Коэффициент ИНАЧЕ 1 КОНЕЦ	КАК Коэффициент,
		|	НАЧАЛОПЕРИОДА(ВЫБОР КОГДА КоэффициентПериоды.ПериодНачало <= ВсеПериоды.БазовыйПериодНачало ТОГДА ВсеПериоды.БазовыйПериодНачало ИНАЧЕ КоэффициентПериоды.ПериодНачало КОНЕЦ, МЕСЯЦ)	КАК БазовыйПериодНачало,
		|	КОНЕЦПЕРИОДА(ВЫБОР КОГДА КоэффициентПериоды.ПериодКонец <= ВсеПериоды.БазовыйПериодКонец ТОГДА КоэффициентПериоды.ПериодКонец ИНАЧЕ ВсеПериоды.БазовыйПериодКонец КОНЕЦ, МЕСЯЦ)	КАК БазовыйПериодКонец
		|ПОМЕСТИТЬ ВТРасчетСредней
		|ИЗ ВТВремя КАК ВсеПериоды
		|	
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициент КАК КоэффициентПериоды
		|ПО		ВсеПериоды.БазовыйПериодНачало <= КоэффициентПериоды.ПериодКонец
		|И		КоэффициентПериоды.ПериодНачало <= ВсеПериоды.БазовыйПериодКонец	
		|	
		|;
		|ВЫБРАТЬ 
		|	МАКСИМУМ(ВТРасчетСредней.Коэффициент),
		|	ВТРасчетСредней.БазовыйПериодНачало,
		|	ВТРасчетСредней.БазовыйПериодКонец 
		|ИЗ ВТРасчетСредней КАК ВТРасчетСредней
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРасчетСредней.БазовыйПериодНачало,
		|	ВТРасчетСредней.БазовыйПериодКонец
		|УПОРЯДОЧИТЬ ПО 
		|	ВТРасчетСредней.БазовыйПериодНачало УБЫВ";	
		Запрос.Текст = ТекстЗапроса;
		
		мЕстьПремии = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьПремии;
		мЕстьГодоваяПремия = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьГодоваяПремия;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку, Выборка.Коэффициент, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
			Если мЕстьПремии  Тогда
				СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоПремиям, 0, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
				СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям, 0, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
			КонецЕсли;
			Если мЕстьГодоваяПремия Тогда
				СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии, 0, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		//	1. Проверка если данных для расчета средней ещ нет (человек мало проработал, начисляем по окладу)
		//
		Если  НачалоДня(ДобавитьМесяц(ПериодРасчетаСреднегоНачало,1)-1) >= ПериодРасчетаСреднегоКонец Тогда
			ПолучитьДанныеОбОтработанномВремени(ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета);
			Если ОтработаноЗа2Мес = 0 И ОтработаноЗа4Мес = 0 Тогда
				// проработал меньше целого месяца
				// если есть за что платить, пользователю прийдется заполнить эти суммы вручную
				//
				СоздатьСтрокуРасчетСреднего( ПланыВидовРасчета.СреднийЗаработок.ПоОкладу, 1, НачалоМесяца(ДатаНачала), КонецМесяца(ДатаНачала));
				
				Записать();
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;

		// 2. Данные для расчета есть - рассчитываем
		//
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр( "парамСотрудник",	Сотрудник );
		Запрос.УстановитьПараметр( "парамНачало",		ПериодРасчетаСреднегоНачало );
		Запрос.УстановитьПараметр( "парамКонец",		ПериодРасчетаСреднегоКонец );
		
		//	ВТВремя
		Если Истина Тогда
			//	Описание:
			// 		таблица периодов для расчета средней
			//		
			Начало = ПериодРасчетаСреднегоНачало;
			Конец = ПериодРасчетаСреднегоКонец;
			Запрос.УстановитьПараметр( "парамНачало1", Начало );
			Запрос.УстановитьПараметр( "парамКонец1", Мин( КонецМесяца(Начало), Конец ) );
			ТекстЗапросаВТ = " 
			|	ВЫБРАТЬ
			|		&парамНачало1	КАК БазовыйПериодНачало,
			|		&парамКонец1	КАК БазовыйПериодКонец
			|ПОМЕСТИТЬ ВТВремя	
			|";
			
			Начало = ДобавитьМесяц(НачалоМесяца(Начало),1);
			Инд = 2;
			Пока Начало <= Конец Цикл
				
				Запрос.УстановитьПараметр( "парамНачало"+Инд    , Начало );
				Запрос.УстановитьПараметр( "парамКонец"+Инд    , Мин( КонецМесяца(Начало), Конец ) );
				ТекстЗапросаВТ = ТекстЗапросаВТ + " 
				|	ОБЪЕДИНИТЬ	  
				|	ВЫБРАТЬ
				|		&парамНачало"+Инд+"	КАК БазовыйПериодНачало,
				|		&парамКонец"+Инд+"	КАК БазовыйПериодКонец
				|";	  
				Инд = Инд + 1;
				Начало = ДобавитьМесяц(НачалоМесяца(Начало),1);
				
			КонецЦикла;
			
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТВремя = "ВТВремя";
						
			ТекстЗапросаВТ =" 
			|	ОБЪЕДИНИТЬ *  
			|	ИЗ ВТВремя
			|";	  
			Запрос.Текст = ТекстЗапросаВТ;
		КонецЕсли;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВсеПериоды.БазовыйПериодНачало)	КАК БазовыйПериодНачало,
		|	КОНЕЦПЕРИОДА(ВсеПериоды.БазовыйПериодКонец)	КАК БазовыйПериодКонец
		|ИЗ ВТВремя КАК ВсеПериоды
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВсеПериоды.БазовыйПериодНачало,
		|	ВсеПериоды.БазовыйПериодКонец
		|УПОРЯДОЧИТЬ ПО 
		|	ВсеПериоды.БазовыйПериодНачало УБЫВ";	
		Запрос.Текст = ТекстЗапроса;
		
		
		мЕстьПремии = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьПремии;
		мЕстьГодоваяПремия = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьГодоваяПремия;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку, 1, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
			Если мЕстьПремии  Тогда
				СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоПремиям, 0, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
				СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям, 0, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
			КонецЕсли;
			Если мЕстьГодоваяПремия Тогда
				СоздатьСтрокуРасчетСреднего(ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии, 0, Выборка.БазовыйПериодНачало, Выборка.БазовыйПериодКонец);
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	Записать();
	
КонецФункции  // АвтозаполнениеРасчетСреднего()


Функция РассчитатьРасчетСреднего(КомментироватьРасчет = Ложь) Экспорт
	
	// очистить расчитываемые поля в ТЧ РасчетСреднего
	Для каждого ТекущаяСтрока Из РасчетСреднего Цикл
		
		Если ТекущаяСтрока.Авторасчет Тогда
			ТекущаяСтрока.Результат = 0;
			ТекущаяСтрока.РезультатПолный = 0;
			
			ТекущаяСтрока.ОтработаноДней = 0;
			ТекущаяСтрока.ОтработаноЧасов = 0;
			ТекущаяСтрока.КалендарныеДни = 0;
			ТекущаяСтрока.НормаДней = 0;
			ТекущаяСтрока.НормаЧасов = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПревышениеПремии", Ложь);
	КопияРасчетСреднего = РасчетСреднего.Выгрузить();
	ИзмКопияРасчетСреднего = КопияРасчетСреднего.Скопировать(Отбор);
	РасчетСреднего.Загрузить(ИзмКопияРасчетСреднего);
	
	Записать();

	Если ДатаНачала < ПроведениеРасчетов.ДатаИзмененияПорядка100() Тогда
	
		// 1. Если расчет по Окладу
		//
		Если  РасчетСреднего.Количество() > 0 И РасчетСреднего[0].ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоОкладу Тогда
			
			ПараметрыОклада = ПроведениеРасчетов.ПолучитьПараметыОклада(ДатаНачала, Сотрудник, ОтражатьВРеглУчете, ОтражатьВУпрУчете);
			РасчетСреднего[0].Результат			= ПараметрыОклада["Оклад"];
			РасчетСреднего[0].РезультатУпр		= ПараметрыОклада["ОкладУпр"];
			РасчетСреднего[0].ОтработаноДней	= ПараметрыОклада["НормаДней"];
			РасчетСреднего[0].ОтработаноЧасов	= ПараметрыОклада["НормаЧасов"];
			РасчетСреднего[0].КалендарныеДни	= ПараметрыОклада["КалендарныеДни"];
			
			РасчитатьСреднюю();
			Записать();
			Возврат Истина;
			
		КонецЕсли;
		
		// 2. Стандартный расчет
	    //
		НачатьТранзакцию();
		Прочитать();
		ВыборкаПоСредним = СформироватьЗапросПоРасчетСреднего().Выбрать();
		ЗафиксироватьТранзакцию();
		
		// Создадим рабочие наборы записей
		Отказ = Ложь;
		НаборСредних = РегистрыРасчета.РасчетСреднегоЗаработка.СоздатьНаборЗаписей();
		НаборСредних.Отбор.Регистратор.Значение = Ссылка;
		Пока ВыборкаПоСредним.Следующий() Цикл
			
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоСредним, Отказ);
			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоСредним, НаборСредних);
			КонецЕсли;
			
		КонецЦикла;
		НаборСредних.Записать();
		
		Если Отказ Тогда
			
			// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
			// Удаляем движения
			НаборСредних.Очистить();
			НаборСредних.Записать();
			
			Возврат Не Отказ;
			
		КонецЕсли;
		
		ОсновнойВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		тКоэффициентПовышенияОкладов = КоэффициентПовышенияОкладов;
		ПредыдущийПериодОсновногоВидаРасчета = Дата(1,1,1);
		нКоэффициентПовышенияОкладов = 0;
		ДанныеДляСредней = ПроведениеРасчетов.РассчитатьСреднююПорядок100(Ссылка,КомментироватьРасчет); 
		Выборка = ДанныеДляСредней.Выборка.Выбрать();  
		Если КомментироватьРасчет Тогда
			
			табБазаСКомментариями = Новый ТаблицаЗначений;
			табБазаСКомментариями.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("Авторасчет",Новый ОписаниеТипов("Булево"));
			табБазаСКомментариями.Колонки.Добавить("ВидРасчета",Новый ОписаниеТипов("ПланВидовРасчетаСсылка.СреднийЗаработок"));
			табБазаСКомментариями.Колонки.Добавить("ВидРасчетаРазрез",Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"));
			табБазаСКомментариями.Колонки.Добавить("БазовыйПериодНачало",Новый ОписаниеТипов("Дата"));
			табБазаСКомментариями.Колонки.Добавить("БазовыйПериодКонец",Новый ОписаниеТипов("Дата"));
			табБазаСКомментариями.Колонки.Добавить("КоэффициентПовышенияОкладов",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("УсловиеБольшеНуля",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("Результат",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("Результат1",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("РезультатУпр",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("РезультатПолный",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноДней",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноЧасов",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноДнейБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноЧасовБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаДней",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаЧасов",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаДнейБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаЧасовБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("КалендарныеДни",Новый ОписаниеТипов("Число"));
			
			Пока Выборка.Следующий() Цикл
				
				табНоваяСтрока = табБазаСКомментариями.Добавить();
				табНоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
				табНоваяСтрока.Авторасчет = Выборка.Авторасчет;
				табНоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
				табНоваяСтрока.ВидРасчетаРазрез = Выборка.ВидРасчетаРазрез;
	    		табНоваяСтрока.БазовыйПериодНачало = Выборка.БазовыйПериодНачало;
				табНоваяСтрока.БазовыйПериодКонец = Выборка.БазовыйПериодКонец;
				табНоваяСтрока.КоэффициентПовышенияОкладов = Выборка.КоэффициентПовышенияОкладов;
				табНоваяСтрока.УсловиеБольшеНуля = Выборка.УсловиеБольшеНуля;
				табНоваяСтрока.Результат = Выборка.Результат;
				табНоваяСтрока.Результат1 = Выборка.Результат1;
				табНоваяСтрока.РезультатУпр = Выборка.РезультатУпр;
				табНоваяСтрока.РезультатПолный = Выборка.РезультатПолный;
				табНоваяСтрока.ОтработаноДней = Выборка.ОтработаноДней;
				табНоваяСтрока.ОтработаноЧасов = Выборка.ОтработаноЧасов;
				табНоваяСтрока.ОтработаноДнейБаза = Выборка.ОтработаноДнейБаза;
				табНоваяСтрока.ОтработаноЧасовБаза = Выборка.ОтработаноЧасовБаза;
				табНоваяСтрока.НормаДней = Выборка.НормаДней;
				табНоваяСтрока.НормаЧасов = Выборка.НормаЧасов;
				табНоваяСтрока.НормаДнейБаза = Выборка.НормаДнейБаза;
				табНоваяСтрока.НормаЧасовБаза = Выборка.НормаЧасовБаза;
				табНоваяСтрока.КалендарныеДни = Выборка.КалендарныеДни;
				
			КонецЦикла;	
			
			Выборка.Сбросить();
			
			Запрос = Новый Запрос;
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	БазаСКомментариями.НомерСтроки КАК НомерСтроки,
			|	БазаСКомментариями.Авторасчет КАК Авторасчет,
			|	БазаСКомментариями.ВидРасчета КАК ВидРасчета,
			|	БазаСКомментариями.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	БазаСКомментариями.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	БазаСКомментариями.КоэффициентПовышенияОкладов КАК КоэффициентПовышенияОкладов,
			|	БазаСКомментариями.УсловиеБольшеНуля КАК УсловиеБольшеНуля,
			|	БазаСКомментариями.Результат КАК Результат,
			|	БазаСКомментариями.Результат1 КАК Результат1,
			|	БазаСКомментариями.РезультатУпр КАК РезультатУпр,
			|	БазаСКомментариями.РезультатПолный КАК РезультатПолный,
			|	БазаСКомментариями.ОтработаноДней КАК ОтработаноДней,
			|	БазаСКомментариями.ОтработаноЧасов КАК ОтработаноЧасов,
			|	БазаСКомментариями.ОтработаноДнейБаза КАК ОтработаноДнейБаза,
			|	БазаСКомментариями.ОтработаноЧасовБаза КАК ОтработаноЧасовБаза,
			|	БазаСКомментариями.НормаДней КАК НормаДней,
			|	БазаСКомментариями.НормаЧасов КАК НормаЧасов,
			|	БазаСКомментариями.НормаДнейБаза КАК НормаДнейБаза,
			|	БазаСКомментариями.НормаЧасовБаза КАК НормаЧасовБаза,
			|	БазаСКомментариями.КалендарныеДни КАК КалендарныеДни
			|ПОМЕСТИТЬ ВТБазаСреднего
			|ИЗ
			|	&табБазаСКомментариями КАК БазаСКомментариями
			|
			|ИНДЕКСИРОВАТЬ ПО НомерСтроки
			|";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("табБазаСКомментариями",табБазаСКомментариями);
			Запрос.Выполнить();
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	БазаСКомментариями.НомерСтроки КАК НомерСтроки,
			|	БазаСКомментариями.Авторасчет КАК Авторасчет,
			|	БазаСКомментариями.ВидРасчета КАК ВидРасчета,
			|	БазаСКомментариями.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	БазаСКомментариями.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	БазаСКомментариями.КоэффициентПовышенияОкладов КАК КоэффициентПовышенияОкладов,
			|	БазаСКомментариями.УсловиеБольшеНуля КАК УсловиеБольшеНуля,
			|	СУММА(БазаСКомментариями.Результат) КАК Результат,
			|	БазаСКомментариями.Результат1 КАК Результат1,
			|	СУММА(БазаСКомментариями.РезультатУпр) КАК РезультатУпр,
			|	СУММА(БазаСКомментариями.РезультатПолный) КАК РезультатПолный,
			|	МАКСИМУМ(БазаСКомментариями.ОтработаноДней) КАК ОтработаноДней,
			|	МАКСИМУМ(БазаСКомментариями.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	МАКСИМУМ(БазаСКомментариями.НормаДней) КАК НормаДней,
			|	МАКСИМУМ(БазаСКомментариями.НормаЧасов) КАК НормаЧасов,
			|	МАКСИМУМ(БазаСКомментариями.КалендарныеДни) КАК КалендарныеДни
			|ИЗ
			|	ВТБазаСреднего КАК БазаСКомментариями
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаСКомментариями.НомерСтроки,
			|	БазаСКомментариями.Авторасчет,
			|	БазаСКомментариями.ВидРасчета,
			|	БазаСКомментариями.БазовыйПериодНачало,
			|	БазаСКомментариями.БазовыйПериодКонец,
			|	БазаСКомментариями.КоэффициентПовышенияОкладов,
			|	БазаСКомментариями.УсловиеБольшеНуля,
			|	БазаСКомментариями.Результат1
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки УБЫВ";
			
			Запрос.Текст = ТекстЗапроса;
			Выборка = Запрос.Выполнить().Выбрать();
			
			КомментарийРасчетаСредней = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='Расчет средней с ';uk='Розрахунок середньої з '") + Формат(ПериодРасчетаСреднегоНачало,"ДФ='МММ гггг'")+ НСтр("ru=' по ';uk='до '") + Формат(ПериодРасчетаСреднегоКонец,"ДФ='МММ гггг'"));
			
			мКоэффициентПовышенияОкладов = 1;
			ПериодИзмененияКоэффициента = Формат(ПериодРасчетаСреднегоКонец,"ДФ='МММ гггг'"); 
			ТаблицаКомментариев = Новый ТаблицаЗначений;
			ТаблицаКомментариев.Колонки.Добавить("НомерСтроки");
			ТаблицаКомментариев.Колонки.Добавить("ВидРасчета");
			ТаблицаКомментариев.Колонки.Добавить("БазовыйПериод");
			ТаблицаКомментариев.Колонки.Добавить("БазовыеНачисления");
			ТаблицаКомментариев.Колонки.Добавить("МассивРасшифровок");
			ТаблицаКомментариев.Колонки.Добавить("ОтработаноДней");
			ТаблицаКомментариев.Колонки.Добавить("мКоэффициентПовышенияОкладов");
			ТаблицаКомментариев.Колонки.Добавить("Коэффициент");
			ТаблицаКомментариев.Колонки.Добавить("ФормулаСКоэффициентом");
			ТаблицаКомментариев.Колонки.Добавить("ФормулаПропорционально");
			ТаблицаКомментариев.Колонки.Добавить("ПериодИзмененияКоэффициента");
		КонецЕсли;	
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = РасчетСреднего.Получить( Выборка.НомерСтроки - 1 );
			
			Если НЕ СтрокаТабличнойЧасти.Авторасчет Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ВидРасчета = ОсновнойВидРасчета И нКоэффициентПовышенияОкладов > 0 И ПредыдущийПериодОсновногоВидаРасчета = Выборка.БазовыйПериодНачало Тогда
				СтрокаТабличнойЧасти.Результат				= Окр(Выборка.Результат,2) * нКоэффициентПовышенияОкладов;
				СтрокаТабличнойЧасти.РезультатУпр			= Окр(Выборка.РезультатУпр,2) * нКоэффициентПовышенияОкладов;
			Иначе	
				СтрокаТабличнойЧасти.Результат				= Окр(Выборка.Результат,2) * тКоэффициентПовышенияОкладов;
				СтрокаТабличнойЧасти.РезультатУпр			= Окр(Выборка.РезультатУпр,2) * тКоэффициентПовышенияОкладов;
			КонецЕсли;
			СтрокаТабличнойЧасти.РезультатПолный		= Выборка.РезультатПолный;
			
			СтрокаТабличнойЧасти.ОтработаноДней			= Выборка.ОтработаноДней;
			СтрокаТабличнойЧасти.ОтработаноЧасов		= Выборка.ОтработаноЧасов;
			Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками
				И СтрокаТабличнойЧасти.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку Тогда
				СтрокаТабличнойЧасти.КалендарныеДни		= 1 + День(Выборка.БазовыйПериодКонец) - День(Выборка.БазовыйПериодНачало);
			Иначе
				СтрокаТабличнойЧасти.КалендарныеДни		= Выборка.КалендарныеДни;
			КонецЕсли;
			СтрокаТабличнойЧасти.НормаДней				= Выборка.НормаДней;
			СтрокаТабличнойЧасти.НормаЧасов				= Выборка.НормаЧасов;
			
			Если Выборка.ВидРасчета = ОсновнойВидРасчета Тогда
				нКоэффициентПовышенияОкладов = тКоэффициентПовышенияОкладов;
				тКоэффициентПовышенияОкладов = тКоэффициентПовышенияОкладов * Выборка.КоэффициентПовышенияОкладов;
				Если КомментироватьРасчет Тогда
					Если тКоэффициентПовышенияОкладов <> 1 И мКоэффициентПовышенияОкладов = 1 Тогда
						мКоэффициентПовышенияОкладов = тКоэффициентПовышенияОкладов;
					КонецЕсли;
					ПериодИзмененияКоэффициента = Выборка.БазовыйПериодНачало;
					ТекстКомментарияКоэффициента = НСтр("ru='Коэффициент повышения оклада = ';uk='Коефіцієнт підвищення окладу = '") + нКоэффициентПовышенияОкладов;
				КонецЕсли;
				ПредыдущийПериодОсновногоВидаРасчета = Выборка.БазовыйПериодНачало;
			КонецЕсли;
			Если КомментироватьРасчет Тогда
				СтруктураПоиска = Новый Структура("НомерСтроки,ВидРасчета");
				СтруктураПоиска.ВидРасчета = СтрокаТабличнойЧасти.ВидРасчета;
				СтруктураПоиска.НомерСтроки = СтрокаТабличнойЧасти.НомерСтроки;
				
				МассивРасшифровок = Новый Массив;
				
				ТекстКомментарийБазовыеНачисления = НСтр("ru='	Базовые начисления составили: ';uk='	Базові нарахування склали: '") + ОКР(Выборка.Результат,2,0);
				МассивКомментарии = табБазаСКомментариями.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого СтрокаМассиваКомментарии из МассивКомментарии Цикл
					ТекстКомментария = ""; 
					ТекстКомментарияОтработанноеВремя = "";
					ТекстКомментарияФормулаПропорционально = "";
					Если СтрокаМассиваКомментарии.ОтработаноДней <> 0 Тогда
						ТекстКомментарияОтработанноеВремя = НСтр("ru='Отработано: дней - ';uk='Відпрацьовано: днів - '") +  СтрокаМассиваКомментарии.ОтработаноДней + НСтр("ru=', часов - ';uk=', годин - '") + СтрокаМассиваКомментарии.ОтработаноЧасов
					КонецЕсли;	
					Если Выборка.Результат <> 0 и СтрокаМассиваКомментарии.Результат <> 0 Тогда
						Если Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии Тогда
							ТекстКомментария = НСтр("ru='Годовая премия';uk='Річна премія'") + ": " + ОКР(СтрокаМассиваКомментарии.Результат,2,0);
						Иначе	
							ТекстКомментария = СтрокаМассиваКомментарии.ВидРасчетаРазрез.Наименование + ": " + ОКР(СтрокаМассиваКомментарии.Результат,2,0)
						КонецЕсли;	
						МассивРасшифровок.Добавить(ТекстКомментария);
					КонецЕсли;
					Если (Выборка.Результат <> Выборка.РезультатПолный) И (Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска) И 
						(СтрокаМассиваКомментарии.Результат1 = 2 ИЛИ СтрокаМассиваКомментарии.Результат1 = 1) И (СтрокаМассиваКомментарии.УсловиеБольшеНуля = 1)
						Тогда
						Если ВидУчетаВремениДляСредней  = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда 
							ТекстКомментарияФормулаПропорционально = "" + СтрокаМассиваКомментарии.РезультатПолный + "*" + "(" + СтрокаМассиваКомментарии.ОтработаноЧасовБаза + "/" + СтрокаМассиваКомментарии.НормаЧасовБаза + ")"; 	
						Иначе
							ТекстКомментарияФормулаПропорционально = "" + СтрокаМассиваКомментарии.РезультатПолный + "*" + "(" + СтрокаМассиваКомментарии.ОтработаноДнейБаза + "/" + СтрокаМассиваКомментарии.НормаДнейБаза + ")"; 	
						КонецЕсли;	
					КонецЕсли	
				КонецЦикла;
				Если мКоэффициентПовышенияОкладов <> 1 И (Выборка.БазовыйПериодНачало < ПериодИзмененияКоэффициента ИЛИ КоэффициентПовышенияОкладов <> 1) Тогда 
					ТекстКомментарияФормулаСКоэффициентом = НСтр("ru='Результат: ';uk='Результат: '") + Выборка.Результат + "*" + мКоэффициентПовышенияОкладов + " = " + ОКР(мКоэффициентПовышенияОкладов * Выборка.Результат,2,0);
				КонецЕсли;
				
				Если Выборка.Результат <> 0 Тогда
					НоваяСтрока = ТаблицаКомментариев.Добавить();
					НоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
					НоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
					НоваяСтрока.БазовыйПериод = Выборка.БазовыйПериодНачало;
					НоваяСтрока.БазовыеНачисления = ТекстКомментарийБазовыеНачисления;
					НоваяСтрока.МассивРасшифровок = МассивРасшифровок;
					НоваяСтрока.ОтработаноДней = ТекстКомментарияОтработанноеВремя;
					НоваяСтрока.мКоэффициентПовышенияОкладов = мКоэффициентПовышенияОкладов;
					Если мКоэффициентПовышенияОкладов <> 1 И (Выборка.БазовыйПериодНачало < ПериодИзмененияКоэффициента ИЛИ КоэффициентПовышенияОкладов <> 1) Тогда 
	               		НоваяСтрока.Коэффициент = ТекстКомментарияКоэффициента;
						НоваяСтрока.ФормулаСКоэффициентом = ТекстКомментарияФормулаСКоэффициентом;
						НоваяСтрока.ПериодИзмененияКоэффициента = ПериодИзмененияКоэффициента;
					КонецЕсли;
					НоваяСтрока.ФормулаПропорционально = ТекстКомментарияФормулаПропорционально;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		Если КомментироватьРасчет Тогда
			
			ТаблицаКомментариев.Сортировать("НомерСтроки Возр");
			
			Для Каждого СтрокаКомментария из ТаблицаКомментариев Цикл
				КомментарийНомерСтроки = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='Номер строки: ';uk='Номер рядка: '") + СтрокаКомментария.НомерСтроки, КомментарийРасчетаСредней);
				КомментарийВидаРасчета = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Вид расчета: ';uk='	Вид розрахунку: '") +  СтрокаКомментария.ВидРасчета, КомментарийНомерСтроки);
				ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Базовый период: ';uk='	Базовий період: '") + Формат(СтрокаКомментария.БазовыйПериод,"ДФ='МММ гггг'"), КомментарийВидаРасчета);
				КомментарийБазовыеНачисления = ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.БазовыеНачисления, КомментарийВидаРасчета,,,,Ложь);
				Если СтрокаКомментария.МассивРасшифровок.Количество() > 0 Тогда
					Для Каждого СтрокаМассива из СтрокаКомментария.МассивРасшифровок Цикл
						КомментарийВидаРасчетаРазрез = ПроведениеРасчетов.КомментарийРасчета(СтрокаМассива,КомментарийБазовыеНачисления,,,,Ложь)	
					КонецЦикла;	
				КонецЕсли;
				Если СтрокаКомментария.мКоэффициентПовышенияОкладов <> 1 Тогда
					Если СтрокаКомментария.ПериодИзмененияКоэффициента <> Неопределено И (СтрокаКомментария.ПериодИзмененияКоэффициента > СтрокаКомментария.БазовыйПериод ИЛИ КоэффициентПовышенияОкладов <> 1) Тогда  
						КомментарийКоэффициент = ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.Коэффициент,КомментарийВидаРасчета,,,,Ложь);
						ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.ФормулаСКоэффициентом,КомментарийКоэффициент);
					КонецЕсли;
				КонецЕсли;
				Если СтрокаКомментария.ВидРасчета = ОсновнойВидРасчета и СтрокаКомментария.ОтработаноДней <> "" Тогда
					ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.ОтработаноДней,КомментарийВидаРасчета);		
				КонецЕсли;
				Если СтрокаКомментария.ФормулаПропорционально <> "" Тогда
					ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.ФормулаПропорционально,КомментарийВидаРасчетаРазрез);		
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;
	Иначе
		// 1. Если расчет по Окладу
		//
		Если  РасчетСреднего.Количество() > 0 И РасчетСреднего[0].ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоОкладу Тогда
			
			ПараметрыОклада = ПроведениеРасчетов.ПолучитьПараметыОклада1213(ДатаНачала, Сотрудник, ОтражатьВРеглУчете, ОтражатьВУпрУчете);
			РасчетСреднего[0].Результат			= ПараметрыОклада["Оклад"];
			РасчетСреднего[0].РезультатУпр		= ПараметрыОклада["ОкладУпр"];
			РасчетСреднего[0].ОтработаноДней	= ПараметрыОклада["НормаДней"];
			РасчетСреднего[0].ОтработаноЧасов	= ПараметрыОклада["НормаЧасов"];
			РасчетСреднего[0].КалендарныеДни	= ПараметрыОклада["КалендарныеДни"];
			
			РасчитатьСреднюю();
			Записать();
			Возврат Истина;
			
		КонецЕсли;
		
		// 2. Стандартный расчет
	    //
		НачатьТранзакцию();
		Прочитать();
		ВыборкаПоСредним = СформироватьЗапросПоРасчетСреднего().Выбрать();
		ЗафиксироватьТранзакцию();
		
		// Создадим рабочие наборы записей
		Отказ = Ложь;
		НаборСредних = РегистрыРасчета.РасчетСреднегоЗаработка.СоздатьНаборЗаписей();
		НаборСредних.Отбор.Регистратор.Значение = Ссылка;
		Пока ВыборкаПоСредним.Следующий() Цикл
			
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоСредним, Отказ);
			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоСредним, НаборСредних);
			КонецЕсли;
			
		КонецЦикла;
		НаборСредних.Записать();
		
		Если Отказ Тогда
			
			// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
			// Удаляем движения
			НаборСредних.Очистить();
			НаборСредних.Записать();
			
			Возврат Не Отказ;
			
		КонецЕсли;
		
		ОсновнойВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		ДанныеДляСредней = ПроведениеРасчетов.РассчитатьСреднююПорядок100(Ссылка,КомментироватьРасчет); 
		ТаблицаПревышений = ДанныеДляСредней.ТаблицаПревышений;
		Выборка = ДанныеДляСредней.Выборка.Выбрать();  
		Если КомментироватьРасчет Тогда
			
			табБазаСКомментариями = Новый ТаблицаЗначений;
			табБазаСКомментариями.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("Авторасчет",Новый ОписаниеТипов("Булево"));
			табБазаСКомментариями.Колонки.Добавить("ВидРасчета",Новый ОписаниеТипов("ПланВидовРасчетаСсылка.СреднийЗаработок"));
			табБазаСКомментариями.Колонки.Добавить("ВидРасчетаРазрез",Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"));
			табБазаСКомментариями.Колонки.Добавить("БазовыйПериодНачало",Новый ОписаниеТипов("Дата"));
			табБазаСКомментариями.Колонки.Добавить("БазовыйПериодКонец",Новый ОписаниеТипов("Дата"));
			табБазаСКомментариями.Колонки.Добавить("УсловиеБольшеНуля",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("Результат",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("Результат1",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("РезультатУпр",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("РезультатПолный",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноДней",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноЧасов",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноДнейБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноЧасовБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаДней",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаЧасов",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаДнейБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("НормаЧасовБаза",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("КалендарныеДни",Новый ОписаниеТипов("Число"));
			табБазаСКомментариями.Колонки.Добавить("ОтработаноВБазовомПериодеПремии",Новый ОписаниеТипов("Число"));
			
			Пока Выборка.Следующий() Цикл
				
				табНоваяСтрока = табБазаСКомментариями.Добавить();
				табНоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
				табНоваяСтрока.Авторасчет = Выборка.Авторасчет;
				табНоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
				табНоваяСтрока.ВидРасчетаРазрез = Выборка.ВидРасчетаРазрез;
	    		табНоваяСтрока.БазовыйПериодНачало = Выборка.БазовыйПериодНачало;
				табНоваяСтрока.БазовыйПериодКонец = Выборка.БазовыйПериодКонец;
				табНоваяСтрока.УсловиеБольшеНуля = Выборка.УсловиеБольшеНуля;
				табНоваяСтрока.Результат = Выборка.Результат;
				табНоваяСтрока.Результат1 = Выборка.Результат1;
				табНоваяСтрока.РезультатУпр = Выборка.РезультатУпр;
				табНоваяСтрока.РезультатПолный = Выборка.РезультатПолный;
				табНоваяСтрока.ОтработаноДней = Выборка.ОтработаноДней;
				табНоваяСтрока.ОтработаноЧасов = Выборка.ОтработаноЧасов;
				табНоваяСтрока.ОтработаноДнейБаза = Выборка.ОтработаноДнейБаза;
				табНоваяСтрока.ОтработаноЧасовБаза = Выборка.ОтработаноЧасовБаза;
				табНоваяСтрока.НормаДней = Выборка.НормаДней;
				табНоваяСтрока.НормаЧасов = Выборка.НормаЧасов;
				табНоваяСтрока.НормаДнейБаза = Выборка.НормаДнейБаза;
				табНоваяСтрока.НормаЧасовБаза = Выборка.НормаЧасовБаза;
				табНоваяСтрока.КалендарныеДни = Выборка.КалендарныеДни;
				табНоваяСтрока.ОтработаноВБазовомПериодеПремии = Выборка.ОтработаноВБазовомПериодеПремии;
				
			КонецЦикла;	
			
			Выборка.Сбросить();
			
			Запрос = Новый Запрос;
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	БазаСКомментариями.НомерСтроки КАК НомерСтроки,
			|	БазаСКомментариями.Авторасчет КАК Авторасчет,
			|	БазаСКомментариями.ВидРасчета КАК ВидРасчета,
			|	БазаСКомментариями.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	БазаСКомментариями.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	БазаСКомментариями.УсловиеБольшеНуля КАК УсловиеБольшеНуля,
			|	БазаСКомментариями.Результат КАК Результат,
			|	БазаСКомментариями.Результат1 КАК Результат1,
			|	БазаСКомментариями.РезультатУпр КАК РезультатУпр,
			|	БазаСКомментариями.РезультатПолный КАК РезультатПолный,
			|	БазаСКомментариями.ОтработаноДней КАК ОтработаноДней,
			|	БазаСКомментариями.ОтработаноЧасов КАК ОтработаноЧасов,
			|	БазаСКомментариями.ОтработаноДнейБаза КАК ОтработаноДнейБаза,
			|	БазаСКомментариями.ОтработаноЧасовБаза КАК ОтработаноЧасовБаза,
			|	БазаСКомментариями.НормаДней КАК НормаДней,
			|	БазаСКомментариями.НормаЧасов КАК НормаЧасов,
			|	БазаСКомментариями.НормаДнейБаза КАК НормаДнейБаза,
			|	БазаСКомментариями.НормаЧасовБаза КАК НормаЧасовБаза,
			|	БазаСКомментариями.КалендарныеДни КАК КалендарныеДни,
			|	БазаСКомментариями.ОтработаноВБазовомПериодеПремии КАК ОтработаноВБазовомПериодеПремии
			|ПОМЕСТИТЬ ВТБазаСреднего
			|ИЗ
			|	&табБазаСКомментариями КАК БазаСКомментариями
			|
			|ИНДЕКСИРОВАТЬ ПО НомерСтроки
			|";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("табБазаСКомментариями",табБазаСКомментариями);
			Запрос.Выполнить();
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	БазаСКомментариями.НомерСтроки КАК НомерСтроки,
			|	БазаСКомментариями.Авторасчет КАК Авторасчет,
			|	БазаСКомментариями.ВидРасчета КАК ВидРасчета,
			|	БазаСКомментариями.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	БазаСКомментариями.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	БазаСКомментариями.УсловиеБольшеНуля КАК УсловиеБольшеНуля,
			|	СУММА(БазаСКомментариями.Результат) КАК Результат,
			|	БазаСКомментариями.Результат1 КАК Результат1,
			|	СУММА(БазаСКомментариями.РезультатУпр) КАК РезультатУпр,
			|	СУММА(БазаСКомментариями.РезультатПолный) КАК РезультатПолный,
			|	МАКСИМУМ(БазаСКомментариями.ОтработаноДней) КАК ОтработаноДней,
			|	МАКСИМУМ(БазаСКомментариями.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	МАКСИМУМ(БазаСКомментариями.НормаДней) КАК НормаДней,
			|	МАКСИМУМ(БазаСКомментариями.НормаЧасов) КАК НормаЧасов,
			|	МАКСИМУМ(БазаСКомментариями.КалендарныеДни) КАК КалендарныеДни,
			|	МАКСИМУМ(БазаСКомментариями.ОтработаноВБазовомПериодеПремии) КАК ОтработаноВБазовомПериодеПремии
			|ИЗ
			|	ВТБазаСреднего КАК БазаСКомментариями
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаСКомментариями.НомерСтроки,
			|	БазаСКомментариями.Авторасчет,
			|	БазаСКомментариями.ВидРасчета,
			|	БазаСКомментариями.БазовыйПериодНачало,
			|	БазаСКомментариями.БазовыйПериодКонец,
			|	БазаСКомментариями.УсловиеБольшеНуля,
			|	БазаСКомментариями.Результат1
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки УБЫВ";
			
			Запрос.Текст = ТекстЗапроса;
			Выборка = Запрос.Выполнить().Выбрать();
			
			КомментарийРасчетаСредней = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='Расчет средней с ';uk='Розрахунок середньої з '") + Формат(ПериодРасчетаСреднегоНачало,"ДФ='МММ гггг'")+ НСтр("ru=' по ';uk='до '") + Формат(ПериодРасчетаСреднегоКонец,"ДФ='МММ гггг'"));
			
			ТаблицаКомментариев = Новый ТаблицаЗначений;
			ТаблицаКомментариев.Колонки.Добавить("НомерСтроки");
			ТаблицаКомментариев.Колонки.Добавить("ВидРасчета");
			ТаблицаКомментариев.Колонки.Добавить("БазовыйПериод");
			ТаблицаКомментариев.Колонки.Добавить("БазовыеНачисления");
			ТаблицаКомментариев.Колонки.Добавить("МассивРасшифровок");
			ТаблицаКомментариев.Колонки.Добавить("ОтработаноДней");
			ТаблицаКомментариев.Колонки.Добавить("ФормулаПропорционально");
		КонецЕсли;	
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = РасчетСреднего.Получить( Выборка.НомерСтроки - 1 );
			
			Если НЕ СтрокаТабличнойЧасти.Авторасчет И НЕ СтрокаТабличнойЧасти.ПревышениеПремии Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.Результат				= Окр(Выборка.Результат,2);
			СтрокаТабличнойЧасти.РезультатУпр			= Окр(Выборка.РезультатУпр,2);
			
			СтрокаТабличнойЧасти.РезультатПолный		= Выборка.РезультатПолный;
			
			СтрокаТабличнойЧасти.ОтработаноДней			= Выборка.ОтработаноДней;
			СтрокаТабличнойЧасти.ОтработаноЧасов		= Выборка.ОтработаноЧасов;
			Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками
				И СтрокаТабличнойЧасти.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку Тогда
				СтрокаТабличнойЧасти.КалендарныеДни		= 1 + День(Выборка.БазовыйПериодКонец) - День(Выборка.БазовыйПериодНачало);
			Иначе
				СтрокаТабличнойЧасти.КалендарныеДни		= Выборка.КалендарныеДни;
			КонецЕсли;
			СтрокаТабличнойЧасти.НормаДней				= Выборка.НормаДней;
			СтрокаТабличнойЧасти.НормаЧасов				= Выборка.НормаЧасов;
			
			Если КомментироватьРасчет Тогда
				СтруктураПоиска = Новый Структура("НомерСтроки,ВидРасчета");
				СтруктураПоиска.ВидРасчета = СтрокаТабличнойЧасти.ВидРасчета;
				СтруктураПоиска.НомерСтроки = СтрокаТабличнойЧасти.НомерСтроки;
				
				МассивРасшифровок = Новый Массив;
				
				ТекстКомментарийБазовыеНачисления = НСтр("ru='	Базовые начисления составили: ';uk='	Базові нарахування склали: '") + ОКР(Выборка.Результат,2,0);
				МассивКомментарии = табБазаСКомментариями.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого СтрокаМассиваКомментарии из МассивКомментарии Цикл
					ТекстКомментария = ""; 
					ТекстКомментарияОтработанноеВремя = "";
					ТекстКомментарияФормулаПропорционально = "";
					Если СтрокаМассиваКомментарии.ОтработаноДней <> 0 Тогда
						ТекстКомментарияОтработанноеВремя = НСтр("ru='Отработано: дней - ';uk='Відпрацьовано: днів - '") +  СтрокаМассиваКомментарии.ОтработаноДней + НСтр("ru=', часов - ';uk=', годин - '") + СтрокаМассиваКомментарии.ОтработаноЧасов
					КонецЕсли;	
					Если Выборка.Результат <> 0 и СтрокаМассиваКомментарии.Результат <> 0 Тогда
						ТекстКомментария = СтрокаМассиваКомментарии.ВидРасчетаРазрез.Наименование + ": " + ОКР(СтрокаМассиваКомментарии.Результат,2,0);
						МассивРасшифровок.Добавить(ТекстКомментария);
					КонецЕсли;
						Если (Выборка.Результат <> Выборка.РезультатПолный) И 
						(Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска ИЛИ Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям
						ИЛИ Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям ИЛИ Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска
						ИЛИ Выборка.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии) И 
						(СтрокаМассиваКомментарии.Результат1 = 2 ИЛИ СтрокаМассиваКомментарии.Результат1 = 1) И (СтрокаМассиваКомментарии.УсловиеБольшеНуля = 1)
						Тогда
							ТекстКомментарияФормулаПропорционально = "" + СтрокаМассиваКомментарии.РезультатПолный + "*" + "(" + СтрокаМассиваКомментарии.ОтработаноДнейБаза + "/" + СтрокаМассиваКомментарии.ОтработаноВБазовомПериодеПремии + ")"; 	
					КонецЕсли;	
				КонецЦикла;
				
				Если Выборка.Результат <> 0 Тогда
					НоваяСтрока = ТаблицаКомментариев.Добавить();
					НоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
					НоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
					НоваяСтрока.БазовыйПериод = Выборка.БазовыйПериодНачало;
					НоваяСтрока.БазовыеНачисления = ТекстКомментарийБазовыеНачисления;
					НоваяСтрока.МассивРасшифровок = МассивРасшифровок;
					НоваяСтрока.ОтработаноДней = ТекстКомментарияОтработанноеВремя;
					НоваяСтрока.ФормулаПропорционально = ТекстКомментарияФормулаПропорционально;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		Если КомментироватьРасчет Тогда
			
			ТаблицаКомментариев.Сортировать("НомерСтроки Возр");
			
			Для Каждого СтрокаКомментария из ТаблицаКомментариев Цикл
				КомментарийНомерСтроки = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='Номер строки: ';uk='Номер рядка: '") + СтрокаКомментария.НомерСтроки, КомментарийРасчетаСредней);
				КомментарийВидаРасчета = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Вид расчета: ';uk='	Вид розрахунку: '") +  СтрокаКомментария.ВидРасчета, КомментарийНомерСтроки);
				ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Базовый период: ';uk='	Базовий період: '") + Формат(СтрокаКомментария.БазовыйПериод,"ДФ='МММ гггг'"), КомментарийВидаРасчета);
				КомментарийБазовыеНачисления = ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.БазовыеНачисления, КомментарийВидаРасчета,,,,Ложь);
				Если СтрокаКомментария.МассивРасшифровок.Количество() > 0 Тогда
					Для Каждого СтрокаМассива из СтрокаКомментария.МассивРасшифровок Цикл
						КомментарийВидаРасчетаРазрез = ПроведениеРасчетов.КомментарийРасчета(СтрокаМассива,КомментарийБазовыеНачисления,,,,Ложь)	
					КонецЦикла;	
				КонецЕсли;
				Если СтрокаКомментария.ВидРасчета = ОсновнойВидРасчета и СтрокаКомментария.ОтработаноДней <> "" Тогда
					ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.ОтработаноДней,КомментарийВидаРасчета);		
				КонецЕсли;
				Если СтрокаКомментария.ФормулаПропорционально <> "" Тогда
					ПроведениеРасчетов.КомментарийРасчета(СтрокаКомментария.ФормулаПропорционально,КомментарийВидаРасчетаРазрез);		
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ДатаНачала >= ПроведениеРасчетов.ДатаИзмененияПорядка100_486() Тогда
		Если ТаблицаПревышений.Количество() > 0 Тогда
			Для НомерСтрокиПремии = 0 По ТаблицаПревышений.Количество() - 1 Цикл 
				ДополнительнаяСтрока = РасчетСреднего.Добавить();
				ДополнительнаяСтрока.Авторасчет = Истина;
				ДополнительнаяСтрока.ПревышениеПремии = Истина;
				ДополнительнаяСтрока.БазовыйПериодНачало = ТаблицаПревышений[НомерСтрокиПремии].БазовыйПериодПремииНачало;
				ДополнительнаяСтрока.БазовыйПериодКонец = ТаблицаПревышений[НомерСтрокиПремии].БазовыйПериодПремииКонец;
				ДополнительнаяСтрока.Результат = ТаблицаПревышений[НомерСтрокиПремии].РезультатПолный - ТаблицаПревышений[НомерСтрокиПремии].Результат;
				ДополнительнаяСтрока.ВидРасчета = ТаблицаПревышений[НомерСтрокиПремии].ВидРасчета; 
				Если КомментироватьРасчет Тогда
					КомментарийНомерСтроки = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='Номер строки (ограничение суммы премии): ';uk='Номер рядка (обмеження суми премії): '") + ДополнительнаяСтрока.НомерСтроки, КомментарийРасчетаСредней);
					КомментарийВидаРасчета = ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Вид расчета: ';uk='	Вид розрахунку: '") +  ТаблицаПревышений[НомерСтрокиПремии].ВидРасчета, КомментарийНомерСтроки);
				    ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Базовый период премии: ';uk='	Базовий період премії: '") + Формат(ТаблицаПревышений[НомерСтрокиПремии].БазовыйПериодПремииНачало,"ДФ='МММ гггг'")+" - " + Формат(ТаблицаПревышений[НомерСтрокиПремии].БазовыйПериодПремииКонец,"ДФ='МММ гггг'"), КомментарийВидаРасчета);
					ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Сумма премии без ограничения: ';uk='  Сума премії без обмеження: '") + ТаблицаПревышений[НомерСтрокиПремии].Результат, КомментарийВидаРасчета);
					ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='	Фактическая сумма премии: ';uk='  Фактична сума премії: '") +  ТаблицаПревышений[НомерСтрокиПремии].РезультатПолный, КомментарийВидаРасчета);
					ПроведениеРасчетов.КомментарийРасчета(НСтр("ru='  При расчете средней премия уменьшена на ';uk='  При розрахунку середньої премію зменшено на '") +  -ДополнительнаяСтрока.Результат, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	НаборСредних.Очистить();
	НаборСредних.Записать();
	
	РасчитатьСреднюю();
	Записать();
	
КонецФункции  // РассчитатьРасчетСреднего()

Функция СоздатьСтрокуРасчетСреднего( ВидРасч, Коэффициент, БазовыйПериодНачало, БазовыйПериодКонец) 
	
	// строку втавляем на первую позицию, потому что коэффициент считали в обратном порядке
	СтрокаТабличнойЧасти =  РасчетСреднего.Вставить(0);
	
	СтрокаТабличнойЧасти.Авторасчет 			= Истина;
	СтрокаТабличнойЧасти.ВидРасчета 			= ВидРасч;
	СтрокаТабличнойЧасти.БазовыйПериодНачало 	= БазовыйПериодНачало;
	СтрокаТабличнойЧасти.БазовыйПериодКонец 	= БазовыйПериодКонец;
	СтрокаТабличнойЧасти.КоэффициентПовышенияОкладов = Коэффициент;
	
КонецФункции  // СоздатьСтрокуРасчетСреднего()


Процедура ПолучитьПериодПоРаботнику() Экспорт
	Перем ДатаОкончанияСобытия;
	Перем ДатаПриемаПервыйРабочийДень;
	Перем ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета;
	
	ДатаНачалаСобытия = ДатаНачала;
	ДатаПриема = ПолучитьДанныеОПриеме(ДатаПриемаПервыйРабочийДень);
	Если ДатаПриема > ДатаНачалаСобытия Тогда
		ТекстПредупреждения = НСтр("ru='Дата начала события меньше даты приема работника в организацию!';uk='Дата початку події менше дати прийняття працівника в організацію!'");
		#Если Клиент Тогда
			Предупреждение(ТекстПредупреждения);
		#Иначе
			Сообщить(ТекстПредупреждения, СтатусСообщения.Информация);
		#КонецЕсли
		Возврат
	КонецЕсли;
	
	ГрафикРаботы = ПолучитьДанныеОбОтработанномВремени(ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета);
	ПериодПолучен = Ложь;
	
	// Получим период
	// -1- работает дольше 2-х месяцев
	// -2- работает меньше 2 месяцев, но дольше 1-го месяца
	// -3- работает меньше целого месяца, но в командировку не в первый рабочий день - заполняеи реальный период с даты приема
	// -4- в командировку в первый рабочий день, нет начисленной зарплаты
		
	Если НачалоМесяца(ДатаНачалаСобытия) = НачалоМесяца(ДатаПриема) Тогда
		// -3-4- 
		ПериодРасчетаСреднегоНачало	= ДатаПриема;	
		ПериодРасчетаСреднегоКонец	= Макс(НачалоДня(ДатаНачалаСобытия-1),ДатаПриема);
		ПериодПолучен = Истина;
	Иначе
		
		Если ОтработаноЗа2Мес Тогда
			ПериодПолучен = Истина;
			// -2-3-
			ПериодРасчетаСреднегоНачало	= Макс(ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -ЧислоМесяцев),ДатаПриема);
			ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДатаНачалаСобытия)-1);
				
				
		КонецЕсли;
		
		Если НЕ ПериодПолучен И ОтработаноЗа4Мес Тогда
			ПериодПолучен = Истина;
			
			Если ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -4)>= ДатаПриема Тогда
				// -1- работает дольше 2-и месяцев
				ПериодРасчетаСреднегоНачало	= ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -4);
				ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия,-2))-1);
				
			ИначеЕсли КонецМесяца(ДобавитьМесяц(ДатаНачалаСобытия, -3)) >= ДатаПриема Тогда
				//-2-3-
				Если ДатаПриемаПервыйРабочийДень Тогда
					// -2- работает меньше 4 месяцев, но дольше 3-го месяца
					// если дата приема первый рабочий день месяца, то месяц считаем целым
					ПериодРасчетаСреднегоНачало	= ДатаПриема;	
					ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия,-2))-1);
					
				ИначеЕсли ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -3) > ДатаПриема Тогда
					// -2- работает меньше 2 месяцев, но дольше 1-го месяца
					// если дата приема не первый рабочий день месяца, но есть целые отработанные месяцы
					ПериодРасчетаСреднегоНачало	= ДобавитьМесяц(НачалоМесяца(ДатаПриема),1);
					ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия,-2))-1);;
					
				Иначе
					// -3- работает меньше 3 ех целых месяцев, и в 2 последних месяца ничего не заработал 
					//    - заполняем период с даты приема до конца месяца приема
					ПериодРасчетаСреднегоНачало	= ДатаПриема;	
					ПериодРасчетаСреднегоКонец	= НачалоДня(КонецМесяца(ДатаПриема));
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПериодПолучен Тогда
			// -4- расчет по окладу
			ПериодРасчетаСреднегоНачало	= ДатаПриема;
			ПериодРасчетаСреднегоКонец	= ДатаПриема;
			ПериодПолучен = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Получим Вид учета времени для средней
	Если ГрафикРаботы.СуммированныйУчетРабочегоВремени 
		ИЛИ ОсновнойВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоЧасам
		ИЛИ ОсновнойВидРасчета = ПланыВидовРасчета.Начисления.ТарифЧасовой
		Тогда
		ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам;
		
	Иначе
		ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням;
		
	КонецЕсли;
	
КонецПроцедуры // ПолучитьПериодПоРаботнику()

Процедура ПолучитьПериодПоРаботнику1213() Экспорт
	Перем ДатаОкончанияСобытия;
	Перем ДатаПриемаПервыйРабочийДень;
	Перем ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета;
	
	ДатаНачалаСобытия = ДатаНачала;
	ДатаПриема = ПолучитьДанныеОПриеме(ДатаПриемаПервыйРабочийДень);
	Если ДатаПриема > ДатаНачалаСобытия Тогда
		ТекстПредупреждения = НСтр("ru='Дата начала события меньше даты приема работника в организацию!';uk='Дата початку події менше дати прийняття працівника в організацію!'");
		#Если Клиент Тогда
			Предупреждение(ТекстПредупреждения);
		#Иначе
			Сообщить(ТекстПредупреждения, СтатусСообщения.Информация);
		#КонецЕсли
		Возврат
	КонецЕсли;

	ГрафикРаботы = ПолучитьДанныеОбОтработанномВремени(ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета);
	ПериодПолучен = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ДатаПриема) Тогда
		Возврат;
	КонецЕсли;	
	
	// Получим период
	// -1- работает дольше 2-х месяцев
	// -2- работает меньше 2 месяцев, но дольше 1-го месяца
	// -3- в командировку в первый рабочий месяц, оплата по окладу, даже если есть заработок
	Если НачалоМесяца(ДатаНачалаСобытия) = НачалоМесяца(ДатаПриема) Тогда
		// -3- 
		ПериодРасчетаСреднегоНачало	= ДатаПриема;	
		ПериодРасчетаСреднегоКонец	= Макс(НачалоДня(ДатаНачалаСобытия-1),ДатаПриема);
		ПериодПолучен = Истина;
	Иначе
		
		Если ОтработаноЗа2Мес Тогда
			ПериодПолучен = Истина;
			ПериодРасчетаСреднегоНачало	= Макс(ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -ЧислоМесяцев),ДатаПриема);
			ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДатаНачалаСобытия)-1);
		КонецЕсли;
		
		Если НЕ ПериодПолучен И ОтработаноЗа4Мес Тогда
			ПериодПолучен = Истина;
			
			Если ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -4)>= ДатаПриема Тогда
				// -1- работает дольше 2-и месяцев
				ПериодРасчетаСреднегоНачало	= ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -4);
				ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия,-2))-1);
				
			ИначеЕсли КонецМесяца(ДобавитьМесяц(ДатаНачалаСобытия, -3)) >= ДатаПриема
				И ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -4) <= ДатаПриема Тогда
					ПериодРасчетаСреднегоНачало	= ДатаПриема;	
					ПериодРасчетаСреднегоКонец	= НачалоДня(НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия,-2))-1);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПериодПолучен Тогда
			// -3- расчет по окладу
			ПериодРасчетаСреднегоНачало	= ДатаПриема;
			ПериодРасчетаСреднегоКонец	= ДатаПриема;
			ПериодПолучен = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Получим Вид учета времени для средней
	Если ГрафикРаботы.СуммированныйУчетРабочегоВремени 
		ИЛИ ОсновнойВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоЧасам
		ИЛИ ОсновнойВидРасчета = ПланыВидовРасчета.Начисления.ТарифЧасовой
		Тогда
		ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам;
		
	Иначе
		ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням;
		
	КонецЕсли;
	
КонецПроцедуры // ПолучитьПериодПоРаботнику()

Функция		ПолучитьДанныеОПриеме(ДатаПриемаПервыйРабочийДень)
	
	ЭтоПервыйРабочийДень = Ложь;
	ДатаПриема = Дата('00010101');
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСотрудник",		Сотрудник );
	Запрос.УстановитьПараметр("парамФизЛицо",		Сотрудник.ФизЛицо );
	
	Если ОтражатьВРеглУчете Тогда
	
		ТекстЗапроса = "
		|	ВЫБРАТЬ
		|       ПриемРаботников.ДатаПриема КАК ДатаПриема,
		|		СУММА(ЕСТЬNULL(Графики.ОсновноеЗначение,0)) КАК ОтработаноДнейСНачалаМесяца
		|   ИЗ (
		|		ВЫБРАТЬ 
		|          	МИНИМУМ(Работники.Период) КАК ДатаПриема
		|		ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники
		|   	ГДЕ Работники.Сотрудник = &парамСотрудник
		|       ) КАК ПриемРаботников
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники 
		|   	ПО		Работники.Сотрудник = &парамСотрудник
		|			И	Работники.Период = ПриемРаботников.ДатаПриема
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК Графики
		|   	ПО  	Графики.Дата >= НАЧАЛОПЕРИОДА(Работники.Период, МЕСЯЦ)
		|			И	Графики.Дата < Работники.Период
		|			И	Графики.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|			// индивидуальные графики и табели не анализируем, так как нас интерисует только норма времени
		|			И	ВЫБОР КОГДА Работники.ГрафикРаботы.ГрафикРаботыНормыВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|						ТОГДА  Работники.ГрафикРаботы.ГрафикРаботыНормыВремени
		|                     ИНАЧЕ Работники.ГрафикРаботы
		|				КОНЕЦ = Графики.ГрафикРаботы
		|    СГРУППИРОВАТЬ ПО
		|       ПриемРаботников.ДатаПриема
		|";
		
	Иначе
		
		ТекстЗапроса = "
		|	ВЫБРАТЬ
		|       ПриемРаботников.ДатаПриема КАК ДатаПриема,
		|		СУММА(ЕСТЬNULL(Графики.ОсновноеЗначение,0)) КАК ОтработаноДнейСНачалаМесяца
		|   ИЗ (
		|		ВЫБРАТЬ 
		|          	МИНИМУМ(Работники.Период) КАК ДатаПриема
		|		ИЗ РегистрСведений.Работники КАК Работники
		|   	ГДЕ Работники.ФизЛицо = &парамФизЛицо
		|       ) КАК ПриемРаботников
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники 
		|   	ПО		Работники.ФизЛицо = &парамФизЛицо
		|			И	Работники.Период = ПриемРаботников.ДатаПриема
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК Графики
		|   	ПО  	Графики.Дата >= НАЧАЛОПЕРИОДА(Работники.Период, МЕСЯЦ)
		|			И	Графики.Дата < Работники.Период
		|			И	Графики.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|			// индивидуальные графики и табели не анализируем, так как нас интерисует только норма времени
		|			И	ВЫБОР КОГДА Работники.ГрафикРаботы.ГрафикРаботыНормыВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|						ТОГДА  Работники.ГрафикРаботы.ГрафикРаботыНормыВремени
		|                     ИНАЧЕ Работники.ГрафикРаботы
		|				КОНЕЦ = Графики.ГрафикРаботы
		|    СГРУППИРОВАТЬ ПО
		|       ПриемРаботников.ДатаПриема
        |";
		
	КонецЕсли;	
		
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаПриема = Выборка.ДатаПриема;
		ДатаПриемаПервыйРабочийДень = Выборка.ОтработаноДнейСНачалаМесяца = 0;
	КонецЕсли;

	Возврат ДатаПриема;
	
КонецФункции  // ПолучитьДанныеОПриеме()

Функция		ПолучитьДанныеОбОтработанномВремени(ОтработаноЗа2Мес, ОтработаноЗа4Мес, ОсновнойВидРасчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",	ДатаНачала );
	Запрос.УстановитьПараметр("парамСотрудник",		Сотрудник );
	Запрос.УстановитьПараметр("парамФизЛицо",		Сотрудник.ФизЛицо );
	
	Если ОтражатьВРеглУчете Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ОсновноеНачисление.ВидРасчета				КАК ОсновнойВидРасчета,
		|	Работники.ГрафикРаботы						КАК ГрафикРаботы,
		|	ЕСТЬNULL(Время2Месяца.ОтработаноЧасов,0)	КАК ОтработаноЗа2Мес,
		|	ЕСТЬNULL(Время4Месяца.ОтработаноЧасов,0)	КАК ОтработаноЗа4Мес
		|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &парамСотрудник) КАК Работники
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ (
		|	ВЫБРАТЬ
		|		СУММА(Начисления.ОтработаноЧасов)	КАК ОтработаноЧасов
		|   ИЗ РегистрРасчета.Начисления КАК Начисления
		|   ГДЕ		Начисления.Сотрудник = &парамСотрудник
		|		И	Начисления.ПериодРегистрации < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
		|       И	Начисления.ПериодДействия >= ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -2)
		|       И	Начисления.ПериодДействия < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
		|) КАК Время2Месяца
		|ПО   ИСТИНА
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ (
		|	ВЫБРАТЬ
		|		СУММА(Начисления.ОтработаноЧасов)	КАК ОтработаноЧасов
		|   ИЗ РегистрРасчета.Начисления КАК Начисления
		|   ГДЕ		Начисления.Сотрудник = &парамСотрудник
		|		И	Начисления.ПериодРегистрации < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
		|       И	Начисления.ПериодДействия >= ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -4)
		|       И	Начисления.ПериодДействия <= КОНЕЦПЕРИОДА( ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -3), МЕСЯЦ)
		|) КАК Время4Месяца
		|ПО   ИСТИНА
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &парамСотрудник И ВидРасчетаИзмерение <> ВидРасчета) КАК ОсновноеНачисление 
		|ПО   ИСТИНА
		|
		|";
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ОсновноеНачисление.ВидРасчета КАК ОсновнойВидРасчета,
		               |	Работники.ГрафикРаботы КАК ГрафикРаботы,
		               |	ЕСТЬNULL(Время2Месяца.ОтработаноЧасов, 0) КАК ОтработаноЗа2Мес,
		               |	ЕСТЬNULL(Время4Месяца.ОтработаноЧасов, 0) КАК ОтработаноЗа4Мес
		               |ИЗ
		               |	РегистрСведений.Работники.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &парамФизЛицо) КАК Работники
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			СУММА(Начисления.ОтработаноЧасов) КАК ОтработаноЧасов
		               |		ИЗ
		               |			РегистрРасчета.Начисления КАК Начисления
		               |		ГДЕ
		               |			Начисления.Сотрудник = &парамСотрудник
		               |			И Начисления.ПериодРегистрации < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
		               |			И Начисления.ПериодДействия >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -2)
		               |			И Начисления.ПериодДействия < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)) КАК Время2Месяца
		               |		ПО (ИСТИНА)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			СУММА(Начисления.ОтработаноЧасов) КАК ОтработаноЧасов
		               |		ИЗ
		               |			РегистрРасчета.Начисления КАК Начисления
		               |		ГДЕ
		               |			Начисления.Сотрудник = &парамСотрудник
		               |			И Начисления.ПериодРегистрации < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
		               |			И Начисления.ПериодДействия >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -4)
		               |			И Начисления.ПериодДействия <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -3), МЕСЯЦ)) КАК Время4Месяца
		               |		ПО (ИСТИНА)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		               |				&ДатаНачалаСобытия,
		               |				Сотрудник = &парамСотрудник
		               |					И ВидРасчетаИзмерение <> ВидРасчета) КАК ОсновноеНачисление
		               |		ПО (ИСТИНА)";		
	КонецЕсли;	
		
		
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОсновнойВидРасчета = Выборка.ОсновнойВидРасчета;
		ГрафикРаботы = Выборка.ГрафикРаботы;
		ОтработаноЗа2Мес = Выборка.ОтработаноЗа2Мес;
		ОтработаноЗа4Мес = Выборка.ОтработаноЗа4Мес;
    КонецЕсли;
		
	Возврат ГрафикРаботы;
	
КонецФункции


Функция ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Знач Сотрудники = Неопределено) Экспорт
	
	// проверять необходимость перерасчета не будем,
	// если процедура запущена, то будем заполнять и пересчитывать
	
	//////////////////////////////////////////////////////////////////////////////////
	// Выполним заполнение данных из перерасчитываемого документа
 	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,
		"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный"); // кроме указанных
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	
	// ТЧ Начисления
	Если Истина Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПерерассчитываемыйДокумент", ПерерассчитываемыйДокумент);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Начисления.Сотрудник,
		|	Начисления.Назначение,
		|	Начисления.ВидРасчета,
		|	Начисления.ДатаНачала,
		|	Начисления.ДатаОкончания,
		|	Начисления.БазовыйПериодНачало,
		|	Начисления.БазовыйПериодКонец,
		|	Начисления.Показатель1,
		|	Начисления.Показатель2,
		|	Начисления.Показатель3,
		|	Начисления.Показатель4,
		|	Начисления.Показатель5,
		|	Начисления.Показатель6,
		|	Начисления.ГрафикРаботы,
		|	Начисления.ПодразделениеОрганизации,
		|	Начисления.Подразделениеупр,
		|	Начисления.ВидУчетаВремениДляСредней,
		|	Начисления.НормаДнейЗаМесяц,
		|	Начисления.НормаЧасовЗаМесяц,
		|	-Начисления.Результат КАК Результат,
		|	-Начисления.РезультатУпр КАК РезультатУпр,
		|	-Начисления.ОплаченоДнейЧасов КАК ОплаченоДнейЧасов,
		|	-Начисления.ОтработаноДней КАК ОтработаноДней,
		|	-Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
		|	-Начисления.КалендарныеДни КАК КалендарныеДни,
		|	-Начисления.НормаДней КАК НормаДней,
		|	-Начисления.НормаЧасов КАК НормаЧасов,
		|	ИСТИНА КАК Сторно,
		|	Начисления.Ссылка КАК СторнируемыйДокумент,
		|   ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.НеИзменять) КАК Состояние,
		|	Начисления.Авторасчет КАК Авторасчет
		|ИЗ
		|	Документ."+Метаданные().Имя+".Начисления КАК Начисления
		|ГДЕ
		|	Начисления.Ссылка = &ПерерассчитываемыйДокумент
		|	И (НЕ Начисления.Сторно)
		|	И Начисления.Ссылка.Проведен";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			// сторно-строка
			ЗаполнитьЗначенияСвойств(Начисления.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	// Сторнировать расчет средней не надо, так как при их расчете все расчитывается заново
	
	//////////////////////////////////////////////////////////////////////////////////
	// Выполним заполнение новых данных, по ПериодуРегистрации указанному 
	// в перерасчитываемом документе, по всем табличным частям
	Записать();
	АвтозаполнениеРасчетСреднего();
	РассчитатьРасчетСреднего();

	АвтозаполнениеНачисления();
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьПоПерерассчитываемомуДокументу()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ТБЛИЧНОЙ ЧАСТИ Начисления

Процедура АвтозаполнениеНачисления() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамРегистратор",	Ссылка);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаНачала",			ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",		ДатаОкончания);
	Запрос.УстановитьПараметр("парамСотрудник",		Сотрудник);
	Запрос.УстановитьПараметр("парамФизЛицо",		Сотрудник.ФизЛицо);
	Запрос.УстановитьПараметр("парамВидРасчета",	ВидРасчета);
	
	//	ВТДанныеКалендаря
	Если Истина Тогда
		//	Описание:
		// 		данные календараря по месяцам 
		//		график работника на дату начала отпуска
		//		
		Если ОтражатьВРеглУчете Тогда
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ДанныеКалендаря.ДатаМесяца    		КАК ДатаМесяца,
			|		Работники.Сотрудник    				КАК Назначение,
			|		ДанныеКалендаря.ГрафикРаботы		КАК ГрафикРаботы,
			|		ДанныеКалендаря.НормаДнейЗаМесяц	КАК НормаДнейЗаМесяц,
			|		ДанныеКалендаря.НормаЧасовЗаМесяц	КАК НормаЧасовЗаМесяц
			|
			|ПОМЕСТИТЬ ВТДанныеКалендаря	
			|   ИЗ Документ."+Ссылка.Метаданные().Имя+" КАК Основной
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &парамСотрудник ИЛИ Сотрудник.ОсновноеНазначение = &парамСотрудник ) КАК Работники
			|	ПО ИСТИНА
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ (
			|		ВЫБРАТЬ
			|			ГрафикиРаботы.ГрафикРаботы						КАК ГрафикРаботы,
			|			НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ )		КАК ДатаМесяца,
			|			СУММА( ГрафикиРаботы.ОсновноеЗначение )			КАК НормаДнейЗаМесяц,
			|			СУММА( ГрафикиРаботы.ДополнительноеЗначение )	КАК НормаЧасовЗаМесяц
			|		ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
			|		ГДЕ ГрафикиРаботы.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
			|		И	ГрафикиРаботы.Дата >= НАЧАЛОПЕРИОДА( &ДатаНачала, МЕСЯЦ )	
			|		И	ГрафикиРаботы.Дата <= НАЧАЛОПЕРИОДА( &ДатаОкончания, МЕСЯЦ )	
			|		СГРУППИРОВАТЬ ПО
			|			ГрафикиРаботы.ГрафикРаботы,
			|			НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ )
			|	) КАК ДанныеКалендаря
			|	ПО		ДанныеКалендаря.ГрафикРаботы = Работники.ГрафикРаботы	
			|
			|ГДЕ Основной.Ссылка = &парамРегистратор	
			|";
		Иначе
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ДанныеКалендаря.ДатаМесяца    		КАК ДатаМесяца,
			|		&парамСотрудник    				КАК Назначение,
			|		ДанныеКалендаря.ГрафикРаботы		КАК ГрафикРаботы,
			|		ДанныеКалендаря.НормаДнейЗаМесяц	КАК НормаДнейЗаМесяц,
			|		ДанныеКалендаря.НормаЧасовЗаМесяц	КАК НормаЧасовЗаМесяц
			|
			|ПОМЕСТИТЬ ВТДанныеКалендаря	
			|   ИЗ Документ."+Ссылка.Метаданные().Имя+" КАК Основной
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &парамФизЛицо) КАК Работники
			|	ПО ИСТИНА
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ (
			|		ВЫБРАТЬ
			|			ГрафикиРаботы.ГрафикРаботы						КАК ГрафикРаботы,
			|			НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ )		КАК ДатаМесяца,
			|			СУММА( ГрафикиРаботы.ОсновноеЗначение )			КАК НормаДнейЗаМесяц,
			|			СУММА( ГрафикиРаботы.ДополнительноеЗначение )	КАК НормаЧасовЗаМесяц
			|		ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
			|		ГДЕ ГрафикиРаботы.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
			|		И	ГрафикиРаботы.Дата >= НАЧАЛОПЕРИОДА( &ДатаНачала, МЕСЯЦ )	
			|		И	ГрафикиРаботы.Дата <= НАЧАЛОПЕРИОДА( &ДатаОкончания, МЕСЯЦ )	
			|		СГРУППИРОВАТЬ ПО
			|			ГрафикиРаботы.ГрафикРаботы,
			|			НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ )
			|	) КАК ДанныеКалендаря
			|	ПО		ДанныеКалендаря.ГрафикРаботы = Работники.ГрафикРаботы	
			|
			|ГДЕ Основной.Ссылка = &парамРегистратор	
			|";
       КонецЕсли;
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТДанныеКалендаря = "ВТДанныеКалендаря";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Истина КАК Авторасчет,
	|	Основной.Дата,
	|	Основной.ПериодРегистрации,
	|	Основной.Организация,
	|	Основной.Ссылка,
	|	Основной.Сотрудник,
	|	ВЫБОР КОГДА Основной.ДатаНачала >= ДанныеКалендаря.ДатаМесяца ТОГДА Основной.ДатаНачала ИНАЧЕ ДанныеКалендаря.ДатаМесяца КОНЕЦ	КАК ДатаНачала,
	|	ВЫБОР КОГДА Основной.ДатаОкончания <= КОНЕЦПЕРИОДА(ДанныеКалендаря.ДатаМесяца, МЕСЯЦ) ТОГДА Основной.ДатаОкончания ИНАЧЕ КОНЕЦПЕРИОДА(ДанныеКалендаря.ДатаМесяца, МЕСЯЦ) КОНЕЦ	КАК ДатаОкончания,
	|	ВЫБОР КОГДА Основной.ДатаНачала >= ДанныеКалендаря.ДатаМесяца ТОГДА Основной.ДатаНачала ИНАЧЕ ДанныеКалендаря.ДатаМесяца КОНЕЦ	КАК БазовыйПериодНачало,
	|	ВЫБОР КОГДА Основной.ДатаОкончания <= КОНЕЦПЕРИОДА(ДанныеКалендаря.ДатаМесяца, МЕСЯЦ) ТОГДА Основной.ДатаОкончания ИНАЧЕ КОНЕЦПЕРИОДА(ДанныеКалендаря.ДатаМесяца, МЕСЯЦ) КОНЕЦ	КАК БазовыйПериодКонец,
	|	ВЫБОР КОГДА "+?(ОтражатьВРеглУчете,"Работники.Сотрудник = Основной.Сотрудник","&парамСотрудник = Основной.Сотрудник")+" ТОГДА Основной.СуммаСредней ИНАЧЕ 0 КОНЕЦ КАК СуммаСредней,
	|	Основной.ВидУчетаВремениДляСредней,
	|  	Основной.ПериодРасчетаСреднегоНачало	КАК ПериодРасчетаСреднегоНачало,
	|  	Основной.ПериодРасчетаСреднегоКонец		КАК ПериодРасчетаСреднегоКонец,
	|
	|	&парамВидРасчета						КАК ВидРасчета,
	|
	|	"+?(ОтражатьВРеглУчете,"Работники.Сотрудник","&парамСотрудник")+" 						КАК Назначение,
	|	Работники.ПодразделениеОрганизации			КАК ПодразделениеОрганизации,
	|	РаботникиУпр.Подразделение 					КАК ПодразделениеУпр,
	|	ДанныеКалендаря.ГрафикРаботы 				КАК ГрафикРаботы,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц         	КАК НормаЧасовЗаМесяц,
	|	ДанныеКалендаря.НормаДнейЗаМесяц         	КАК НормаДнейЗаМесяц
	|
	|ИЗ Документ."+Ссылка.Метаданные().Имя+" КАК Основной
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &парамСотрудник ИЛИ Сотрудник.ОсновноеНазначение = &парамСотрудник ) КАК Работники
	|ПО		ИСТИНА
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &парамФизЛицо ) КАК РаботникиУпр
	|ПО		ИСТИНА
	|
	|// данные нормы календаря
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеКалендаря КАК ДанныеКалендаря
	|ПО		"+?(ОтражатьВРеглУчете,"ДанныеКалендаря.Назначение = Работники.Сотрудник","ДанныеКалендаря.Назначение = &парамСотрудник")+"	
	|
	|ГДЕ Основной.Ссылка = &парамРегистратор	
	|	И  (ЕСТЬNULL(Работники.ЗанимаемыхСтавок,1) > 0
	|	ИЛИ  ЕСТЬNULL(РаботникиУпр.ЗанимаемыхСтавок,1) > 0)
	|";
	
	Запрос.Текст = ТекстЗапроса;

	Выборка = Запрос.Выполнить().Выбрать();
	
	// каждый цикл это назначение
	Пока Выборка.Следующий() Цикл
		
		// строка движений
		НоваяСтрока = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		// Реквизиты
		ПроведениеРасчетов.ПроставитьДанныеСтроки(Сотрудник, Выборка.Назначение, НоваяСтрока.ДатаНачала, Ссылка, НоваяСтрока);
		Если Сотрудник = Выборка.Назначение Тогда
			
			НоваяСтрока.Показатель1	= Выборка.СуммаСредней;
			Если ВидРасчета = ПланыВидовРасчета.Начисления.Командировка Тогда
				Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
					НоваяСтрока.Состояние	= Перечисления.СостоянияРаботникаОрганизации.НеИзменять;
				Иначе	
					НоваяСтрока.Состояние = Перечисления.СостоянияРаботникаОрганизации.Командировка;
				КонецЕсли;	
				НоваяСтрока.ПроизошедшееСобытие	= Истина;
			ИначеЕсли ВидРасчета = ПланыВидовРасчета.Начисления.ОплатаПоСреднемуМоб Тогда
				Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
					НоваяСтрока.Состояние	= Перечисления.СостоянияРаботникаОрганизации.НеИзменять;
				Иначе	
					НоваяСтрока.Состояние = Перечисления.СостоянияРаботникаОрганизации.Мобилизован;
				КонецЕсли;	
			Иначе
				Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
					НоваяСтрока.Состояние	= Перечисления.СостоянияРаботникаОрганизации.НеИзменять;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Записать();
	
КонецПроцедуры  // АвтозаполнениеНачисления()

Процедура РассчитатьНачисления( Сотрудники, КомментироватьРасчет = Ложь ) Экспорт
	
	//массивы для хранения индексов строк табличных частей,
	//используются для расчета по одному сотруднику
	МассивИндексыСтрокНачисления = Новый Массив();
	
	Отказ = Ложь;
	// Перечитаем объект и соберем данные для заполнения наборов записей регистров
	НачатьТранзакцию();
	Прочитать();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям().Выбрать();
	ЗафиксироватьТранзакцию();
	
	// Создадим рабочие наборы записей
	НаборОсновныеНачисления = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();
	НаборОсновныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		
		ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента,ВыборкаПоНачислениям, Отказ);
		Если НЕ Отказ Тогда
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, НаборОсновныеНачисления);
			МассивИндексыСтрокНачисления.Добавить(ВыборкаПоНачислениям.НомерСтроки-1);
			
		КонецЕсли;
		
	КонецЦикла;
	НаборОсновныеНачисления.Записать();
	
	Если Отказ Тогда
		
		// Если есть какие-то проблемы - удаляем движения (тут нет транзакции) 
		// Удаляем движения
		НаборОсновныеНачисления.Очистить();
		НаборОсновныеНачисления.Записать();
		
		Возврат;
		
	КонецЕсли;
	
	// Получим дополнительные записи, имеющие признак сторно, которые необходимо добавить 
	// в текущий набор для того, чтобы в результате сохранения получился максимальный 
	// фактический период действия
	ТаблицаСторноЗаписей = НаборОсновныеНачисления.ПолучитьДополнение();
	ТаблицаСторноЗаписей.Колонки.Удалить("ПериодРегистрации");
	ТаблицаСторноЗаписей.Колонки.ПериодРегистрацииСторно.Имя = "ПериодРегистрации";
	ТаблицаСторноЗаписей.Колонки.Удалить("ПериодДействияНачало");
	ТаблицаСторноЗаписей.Колонки.ПериодДействияНачалоСторно.Имя = "ПериодДействияНачало";
	ТаблицаСторноЗаписей.Колонки.Удалить("ПериодДействияКонец");
	ТаблицаСторноЗаписей.Колонки.ПериодДействияКонецСторно.Имя = "ПериодДействияКонец";
	Для каждого СтрокаСторно Из ТаблицаСторноЗаписей Цикл
		
		// Заполним записи в наборе записей регистра
		Движение = НаборОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаСторно);
		Движение.Сторно						= Истина;
		Движение.Авторасчет					= Истина;
		
		// и в табличной части
		Движение = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаСторно);
		Движение.ДатаНачала		= СтрокаСторно.ПериодДействияНачало;   
		Движение.ДатаОкончания	= СтрокаСторно.ПериодДействияКонец; 
		Движение.Сторно						= Истина;
		Движение.Авторасчет					= Истина;

		МассивИндексыСтрокНачисления.Добавить(Движение.НомерСтроки-1);
		
	КонецЦикла;
	НаборОсновныеНачисления.Записать();
		
	// рассчитываем записи
	// при этом передаем не только набор записей регистра расчета, но и набор записей регисра 
	// накопления со сведениями об отработанном времени
	ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("Начисления", 
														НаборОсновныеНачисления, 
														Начисления, 
														МассивИндексыСтрокНачисления, 
														Сотрудники, 
														КомментироватьРасчет);
	
	// Удаляем движения
	НаборОсновныеНачисления.Очистить();
	НаборОсновныеНачисления.Записать();
	
	Записать();
	
КонецПроцедуры  // РассчитатьНачисления



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	МассивВидовВремени = Новый Массив;
	МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("ПочасовоеОтклонение",	МассивВидовВремени);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОплатаПоСреднемуЗаработку.Организация 				КАК ОбособленноеПодразделение,
	|	ОплатаПоСреднемуЗаработку.ОтражатьВРеглУчете		КАК ОтражатьВРеглУчете,
	|	ОплатаПоСреднемуЗаработку.ОтражатьВУпрУчете			КАК ОтражатьВУпрУчете,
	|	ОплатаПоСреднемуЗаработку.Дата						КАК Дата,
	|	ОплатаПоСреднемуЗаработку.ПериодРегистрации			КАК ПериодРегистрации,
	|	ОплатаПоСреднемуЗаработку.Организация				КАК Организация,
	|	ОплатаПоСреднемуЗаработку.Ссылка					КАК Ссылка,
	|	ОплатаПоСреднемуЗаработку.Сотрудник					КАК Сотрудник,
	|	ОплатаПоСреднемуЗаработку.СуммаСредней				КАК СуммаСредней,
	|	ОплатаПоСреднемуЗаработку.ВидУчетаВремениДляСредней	КАК ВидУчетаВремениДляСредней,
	|	ОплатаПоСреднемуЗаработку.ВидРасчета				КАК ВидРасчета,
	|	ОплатаПоСреднемуЗаработку.ДатаНачала				КАК ДатаНачала,
	|	ОплатаПоСреднемуЗаработку.ДатаОкончания				КАК ДатаОкончания,
	|	ОплатаПоСреднемуЗаработку.ВидРасчета.СпособРасчета	КАК СпособРасчета,
	|	
	|   ОплатаПоСреднемуЗаработку.ПериодРасчетаСреднегоНачало	КАК ПериодРасчетаСреднегоЗаработкаНачало,
	|   ОплатаПоСреднемуЗаработку.ПериодРасчетаСреднегоКонец	КАК ПериодРасчетаСреднегоЗаработкаКонец
	|
	|ИЗ Документ."+Ссылка.Метаданные().Имя+" КАК ОплатаПоСреднемуЗаработку
	|
	|ГДЕ ОплатаПоСреднемуЗаработку.Ссылка = &ДокументСсылка
	|";
	
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоНачислениям()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("парамСписокПочасовыхОтклонений", ПроведениеРасчетов.ПолучитьСписокНачисленийПочасовыхОтклонений());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтрокиНачисления.Ссылка.Организация,
	|	СтрокиНачисления.Ссылка.ПериодРегистрации,
	|	СтрокиНачисления.НомерСтроки,  
	|	СтрокиНачисления.Авторасчет,
	|   ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления) КАК КодОперации,
	|
	|	СтрокиНачисления.Сотрудник,
	|	СтрокиНачисления.Назначение,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.ВидРасчета.СпособРасчета		КАК СпособРасчета,
    |
	|	КОНЕЦПЕРИОДА(СтрокиНачисления.Ссылка.ПериодРегистрации, МЕСЯЦ)	КАК Период,
	|	СтрокиНачисления.Ссылка.ПериодРегистрации						КАК ПериодВзаиморасчетов,
	|	СтрокиНачисления.ВидРасчета.СчетУчета			КАК СчетУчета,
	|	СтрокиНачисления.Результат						КАК СуммаВзаиморасчетов,
	|	СтрокиНачисления.РезультатУпр					КАК СуммаВзаиморасчетовУпр,
	|
	|	СтрокиНачисления.ДатаНачала,
	|	СтрокиНачисления.ДатаОкончания,
	|	СтрокиНачисления.БазовыйПериодНачало,
	|	СтрокиНачисления.БазовыйПериодКонец,
	|	СтрокиНачисления.ДатаНачала			КАК ПериодДействияНачало,
	|	СтрокиНачисления.ДатаОкончания		КАК ПериодДействияКонец,
	|
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.РезультатУпр,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.КалендарныеДни,
	|
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ГрафикРаботы,
	|   ВЫБОР	КОГДА СтрокиНачисления.ГрафикРаботы ССЫЛКА Справочник.ГрафикиРаботы
	|			ТОГДА NULL
	|			ИНАЧЕ СтрокиНачисления.Сотрудник
	|	КОНЕЦ						КАК ГрафикРаботыСотрудник,
	|	СтрокиНачисления.ГрафикРаботы.СуммированныйУчетРабочегоВремени КАК СуммированныйУчетРабочегоВремени,
	|	СтрокиНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидИспользованияРабочегоВремени, 
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.НормаЧасовЗаМесяц,
	|	СтрокиНачисления.НормаДнейЗаМесяц,
	|	СтрокиНачисления.ВидУчетаВремениДляСредней,
	|	СтрокиНачисления.СпособОтраженияВБухучете,
	|	СтрокиНачисления.СпособОтраженияВУпрУчете,
	|	СтрокиНачисления.Сторно
	|
	|ИЗ Документ."+Ссылка.Метаданные().Имя+".Начисления КАК СтрокиНачисления
	|
	|ГДЕ СтрокиНачисления.Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачислениям()

Функция СформироватьЗапросПоРасчетСреднего()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтрокаРасчетСреднего.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	СтрокаРасчетСреднего.Ссылка.Сотрудник КАК Сотрудник,
	|	СтрокаРасчетСреднего.Ссылка.Организация КАК Организация,
	|
	|	СтрокаРасчетСреднего.НомерСтроки,
	|	СтрокаРасчетСреднего.Авторасчет,
	|	СтрокаРасчетСреднего.ВидРасчета,
	|	СтрокаРасчетСреднего.БазовыйПериодНачало,
	|	СтрокаРасчетСреднего.БазовыйПериодКонец,
	|	СтрокаРасчетСреднего.КоэффициентПовышенияОкладов,
	|
	|	СтрокаРасчетСреднего.ОтработаноДней,
	|	СтрокаРасчетСреднего.ОтработаноЧасов,
	|	СтрокаРасчетСреднего.НормаДней,
	|	СтрокаРасчетСреднего.НормаЧасов,
	|	СтрокаРасчетСреднего.КалендарныеДни,
	|
	|	СтрокаРасчетСреднего.Результат,
	|	СтрокаРасчетСреднего.РезультатУпр,
	|	СтрокаРасчетСреднего.РезультатПолный
	|ИЗ Документ."+Ссылка.Метаданные().Имя+".РасчетСреднего КАК СтрокаРасчетСреднего
	|
	|ГДЕ СтрокаРасчетСреднего.Ссылка = &ДокументСсылка
    |УПОРЯДОЧИТЬ ПО
    |	НомерСтроки
    |";

	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоРасчетСреднего()

Функция СформироватьЗапросСостояния()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|	ТЧНачисления.Сотрудник КАК Сотрудник,
	|	ТЧНачисления.Назначение КАК Назначение,
	|	ТЧНачисления.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР КОГДА ТЧНачисления.ДатаОкончания <> &ПустаяДата ТОГДА КОНЕЦПЕРИОДА(ТЧНачисления.ДатаОкончания, ДЕНЬ) ИНАЧЕ &ПустаяДата КОНЕЦ КАК ДатаОкончания,
	|	ТЧНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ТЧНачисления.ПодразделениеУпр КАК ПодразделениеУпр,
	|	ТЧНачисления.Сторно КАК Сторно,
	|	ТЧНачисления.Состояние КАК Состояние,
	|	ТЧНачисления.ПроизошедшееСобытие КАК ПроизошедшееСобытие,
	|	ВЫБОР КОГДА (ДругиеСтроки.НомерСтроки) ЕСТЬ NULL  ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПровестипоУпр
	|
	|ИЗ	Документ.ОплатаПоСреднемуЗаработку.Начисления КАК ТЧНачисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|(ВЫБРАТЬ ПЕРВЫЕ 1
	|   Строки.НомерСтроки,
	|   Строки.Сотрудник,
	|   Строки.ДатаНачала
	|ИЗ Документ.ОплатаПоСреднемуЗаработку.Начисления КАК Строки
	|ГДЕ	Строки.Ссылка = &ДокументСсылка	) КАК ДругиеСтроки
	|ПО	ДругиеСтроки.Сотрудник = ТЧНачисления.Сотрудник 
	| И	ДругиеСтроки.НомерСтроки < ТЧНачисления.НомерСтроки
	| И	ДругиеСтроки.ДатаНачала = ТЧНачисления.ДатаНачала
	|
	|ГДЕ	ТЧНачисления.Ссылка = &ДокументСсылка
	|" ;

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

	
КонецФункции	


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ) Экспорт

	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана организация, по которой выполняется начисление!';uk='Не вказана організація, по якій виконується нарахування!'"), Отказ);
	КонецЕсли;

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не выбрано физическое лицо!';uk='Не обране фізична особа!'"), Отказ);
	КонецЕсли;

	// ДатаНачала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана дата начала оплачиваемого события!';uk='Не вказана дата початку оплачуваної події!'"), Отказ);
	КонецЕсли;
	
	// ДатаОкончания
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана дата окончания оплачиваемого события!';uk='Не вказана дата закінчення оплачуваної події!'"), Отказ);
	КонецЕсли;
	
	//
	Если ВыборкаПоШапкеДокумента.ДатаОкончания < ВыборкаПоШапкеДокумента.ДатаНачала Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Дата окончания оплачиваемого события не должна быть меньше даты начала!';uk='Дата закінчення оплачуваної події не повинна бути менша дати початку!'"), Отказ);
	КонецЕсли; 
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан вид расчета!';uk='Не зазначений вид розрахунку!'"), Отказ);
	КонецЕсли;
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан период регистрации!';uk='Не зазначений період реєстрації!'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									НСтр("ru='"" табл. части ""Начисления"": ';uk='"" табл. частини ""Нарахування"": '");
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан вид расчета!';uk='не зазначений вид розрахунку!'"), Отказ);
	КонецЕсли;
	
	// Дата начала 
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата начала начисления!';uk='не зазначена дата початку нарахування!'"), Отказ);
	Иначе
		// Дата окончания 
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата окончания начисления!';uk='не зазначена дата закінчення нарахування!'"), Отказ);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ДатаОкончания < ВыборкаПоСтрокамДокумента.ДатаНачала Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата окончания начисления не должна быть меньше даты начала!';uk='дата закінчення нарахування не повинна бути менша дати початку!'"), Отказ);
			Иначе	
				Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаОкончания) <> НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='даты начала и окончания должны принадлежать одному месяцу!';uk='дати початку і закінчення повинні належати одному місяцю!'"), Отказ);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	// Подразделение
	Если ОтражатьВРеглУчете И НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указано подразделение организации!';uk='не вказаний підрозділ організації!'"), Отказ);
	КонецЕсли;
	
	Если НЕ ВыборкаПоСтрокамДокумента.Сторно И  (ВыборкаПоСтрокамДокумента.ДатаНачала < ВыборкаПоШапкеДокумента.ДатаНачала ИЛИ ВыборкаПоСтрокамДокумента.ДатаНачала > КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания) 
		ИЛИ ВыборкаПоСтрокамДокумента.ДатаОкончания < ВыборкаПоШапкеДокумента.ДатаНачала ИЛИ ВыборкаПоСтрокамДокумента.ДатаОкончания > КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания)) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='период начисления выходит за временные границы оплачиваемого события!';uk='період нарахування виходить за часові межі події, що оплачується!'"), Ложь);
	КонецЕсли; 

КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

Процедура ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									НСтр("ru='"" табл. части ""Расчет среднего"": ';uk='"" табл. частини ""Розрахунок середнього"": '");
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан вид расчета среднего заработка!';uk='не зазначений вид розрахунку середнього заробітку!'"), Отказ);
	КонецЕсли;
	
	// Дата начала базового периода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата начала базового периода!';uk='не зазначена дата початку базового періоду!'"), Отказ);
		// Дата окончания базового периода
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодКонец) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата окончания базового периода!';uk='не зазначена дата закінчення базового періоду!'"), Отказ);
	ИначеЕсли ВыборкаПоСтрокамДокумента.БазовыйПериодКонец < ВыборкаПоСтрокамДокумента.БазовыйПериодНачало Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата начала базового периода не может быть больше даты окончания базового периода!';uk='дата початку базового періоду не може бути більше дати закінчення базового періоду!'"), Отказ);
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРасчетСреднего()

Процедура ПроверитьЗаполнениеСтрокиСостояния(ВыборкаПоСтрокамДокумента, Отказ)
	
	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	НСтр("ru='"" табл. части ""Начисления"": ';uk='"" табл. частини ""Нарахування"": '");

	// Состояние
	Если Не ВыборкаПоСтрокамДокумента.Сторно И НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Состояние) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указано состояние работника!';uk='не вказаний стан працівника!'"), Отказ);
	КонецЕсли;
	
	Если ОтражатьвУпрУчете Тогда
		Уволен = Ложь;
		УжеРаботает = РегистрыСведений.Работники.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаНачала, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.ФизЛицо));
		Для каждого Место из УжеРаботает Цикл
			Если Место.ЗанимаемыхСтавок = 0 Тогда
				Уволен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если УжеРаботает.Количество()=0 ИЛИ Уволен Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='работник не принят на работу на предприятие!';uk='працівник не прийнятий на роботу на підприємство!'"),Отказ);
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.Состояние <> Перечисления.СостоянияРаботникаОрганизации.НеИзменять
			И ВыборкаПоСтрокамДокумента.Сотрудник.ВидЗанятости <> Перечисления.ВидыЗанятостиВОрганизации.Совместительство Тогда 
			События = РегистрыСведений.СостояниеРаботников.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаНачала, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.ФизЛицо));
			Если События.Количество()>0 Тогда
				Если События[0].Период = ВыборкаПоСтрокамДокумента.ДатаНачала Тогда 
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в упр. кадровом учете начало события противоречит документу ';uk='в упр. кадровому обліку початок події суперечить документу '")+События[0].Регистратор+"!", Отказ);
				КонецЕсли;	
			КонецЕсли;
			
			Если ВыборкаПоСтрокамДокумента.ПроизошедшееСобытие Тогда
				События = РегистрыСведений.СостояниеРаботников.СрезПоследних(КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания), Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.ФизЛицо));
				Если События.Количество()>0 Тогда
					Если События[0].Период = КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда 
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в упр. кадровом учете окончание события противоречит документу ';uk='в упр. кадровому обліку закінчення події суперечить документу '")+События[0].Регистратор+"!", Отказ);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

		
	КонецЕсли;
	
	Если ОтражатьВРеглУчете Тогда
		Уволен = Ложь;
		УжеРаботает = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаНачала, Новый Структура("Сотрудник, Организация", Сотрудник, Организация));
		Для каждого Место из УжеРаботает Цикл
			Если Место.ЗанимаемыхСтавок = 0 Тогда
				Уволен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если УжеРаботает.Количество()=0 ИЛИ Уволен Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='работник не принят на работу в организацию!';uk='працівник не прийнятий на роботу в організацію!'"), Отказ);
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.Состояние <> Перечисления.СостоянияРаботникаОрганизации.НеИзменять Тогда
			События = РегистрыСведений.СостояниеРаботниковОрганизаций.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаНачала, Новый Структура("Сотрудник, Организация", ВыборкаПоСтрокамДокумента.Сотрудник, Организация));
			Если События.Количество()>0 Тогда
				Если События[0].Период = ВыборкаПоСтрокамДокумента.ДатаНачала Тогда 
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в регл. кадровом учете начало события противоречит документу ';uk='у регл. кадровому обліку початок події суперечить документу '")+События[0].Регистратор+"!", Отказ);
				КонецЕсли;	
			КонецЕсли;
			
			Если ВыборкаПоСтрокамДокумента.ПроизошедшееСобытие Тогда
				События = РегистрыСведений.СостояниеРаботниковОрганизаций.СрезПоследних(КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания), Новый Структура("Сотрудник, Организация", ВыборкаПоСтрокамДокумента.Сотрудник, Организация));
				Если События.Количество()>0 Тогда
					Если События[0].Период = КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда 
						ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в регл. кадровом учете окончание события противоречит документу ';uk='у регл. кадровому обліку закінчення події суперечить документу '")+События[0].Регистратор+"!", Отказ);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	
КонецПроцедуры


Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
	
 	Движение.ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоСтрокамДокумента.ВидРасчета, ВыборкаПоСтрокамДокумента.СуммированныйУчетРабочегоВремени);

КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений

Процедура ДобавитьСтрокуРасчетаСреднего(ВыборкаПоСтрокамДокумента, НаборРасчетСреднего)
	
	Движение = НаборРасчетСреднего.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента);
	
КонецПроцедуры 

Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоСтрокамДокумента)
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоСтрокамДокумента);
	
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;

КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента)
	
	// начало
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоШапкеДокумента);
	
	Движение.Актуальность				= Истина;
	Движение.ВидРасчетаИзмерение		= ВыборкаПоШапкеДокумента.ВидРасчета;
	Движение.Период						= ВыборкаПоШапкеДокумента.ДатаНачала;
	Движение.Показатель1				= ВыборкаПоШапкеДокумента.СуммаСредней;
	Движение.Показатель2				= 100;
	Движение.ВидУчетаВремениДляСредней	= ВыборкаПоШапкеДокумента.ВидУчетаВремениДляСредней;
	
	
	// конец
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоШапкеДокумента);
	
	Движение.Актуальность				= Ложь;
	Движение.ВидРасчетаИзмерение		= ВыборкаПоШапкеДокумента.ВидРасчета;
	Движение.Период						= КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания);
	Движение.Показатель1				= ВыборкаПоШапкеДокумента.СуммаСредней;
	Движение.Показатель2				= 100;
	Движение.ВидУчетаВремениДляСредней	= ВыборкаПоШапкеДокумента.ВидУчетаВремениДляСредней;

КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

Процедура ДобавитьСтрокуСостояний(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		
		Если ВыборкаПоСтрокамДокумента.Состояние = Перечисления.СостоянияРаботникаОрганизации.НеИзменять Тогда
			Возврат;
		КонецЕсли;
		
		Движение = Движения.СостояниеРаботниковОрганизаций.Добавить();

		// Свойства
		Движение.Период = НачалоДня(ВыборкаПоСтрокамДокумента.ДатаНачала);
	
		// Измерения
		Движение.Сотрудник = ВыборкаПоСтрокамДокумента.Назначение;
		Движение.Организация = ВыборкаПоШапкеДокумента.Организация;

		// Ресурсы
		Движение.Состояние = ВыборкаПоСтрокамДокумента.Состояние;
		
		
		Если ВыборкаПоСтрокамДокумента.ПроизошедшееСобытие Тогда
			Движение = Движения.СостояниеРаботниковОрганизаций.Добавить();

			// Свойства
			Движение.Период = КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания);
		
			// Измерения
			Движение.Сотрудник = ВыборкаПоСтрокамДокумента.Назначение;
			Движение.Организация = ВыборкаПоШапкеДокумента.Организация;

			// Ресурсы
			Движение.Состояние = Перечисления.СостоянияРаботникаОрганизации.Работает;
		КонецЕсли;			

		
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете Тогда
		
		Если ВыборкаПоСтрокамДокумента.Состояние = Перечисления.СостоянияРаботникаОрганизации.НеИзменять Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ВыборкаПоСтрокамДокумента.ПровестиПоУпр Тогда
			Возврат;
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.Назначение.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство Тогда
			Возврат;
		КонецЕсли;	
		
		Движение = Движения.СостояниеРаботников.Добавить();

		// Свойства
		Движение.Период = НачалоДня(ВыборкаПоСтрокамДокумента.ДатаНачала);
	
		// Измерения
		Движение.ФизЛицо = ВыборкаПоСтрокамДокумента.ФизЛицо;

		// Ресурсы
		Движение.Состояние = ВыборкаПоСтрокамДокумента.Состояние;
		
		Если ВыборкаПоСтрокамДокумента.ПроизошедшееСобытие Тогда
			Движение = Движения.СостояниеРаботников.Добавить();

			// Свойства
			Движение.Период = КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания);
		
			// Измерения
			Движение.ФизЛицо = ВыборкаПоСтрокамДокумента.ФизЛицо;

			// Ресурсы
			Движение.Состояние = Перечисления.СостоянияРаботникаОрганизации.Работает;
		КонецЕсли;	
		
	КонецЕсли;	

	
КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
	Если НЕ Отказ Тогда
		
		////////////////////////////////////////////////////////////////////////
		// основные Начисления
		Если ВыборкаПоШапкеДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Тогда
			ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента);
			
		Иначе
			ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям().Выбрать();
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ);
				Если НЕ Отказ Тогда
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, Движения.Начисления);
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоНачислениям)
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////
		// Расчет средней
		ВыборкаПоСредним = СформироватьЗапросПоРасчетСреднего().Выбрать();
		Пока ВыборкаПоСредним.Следующий() Цикл
			
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоСредним, Отказ);
			Если НЕ Отказ Тогда
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоСредним, Движения.РасчетСреднегоЗаработка);
			КонецЕсли;
			
		КонецЦикла;
		
		////////////////////////////////////////////////////////////////////////
		// Состояния работников
		// получим реквизиты табличной части
		Выборка = СформироватьЗапросСостояния().Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиСостояния(Выборка, Отказ);
			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуСостояний(ВыборкаПоШапкеДокумента, Выборка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаменыОрганизаций") Тогда	
		
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням;
		
		Сотрудник = Основание.Сотрудник;
		Назначение = Основание.ЗаменаСотрудник;
		Организация = Основание.Организация;
		ВидРасчета = ПланыВидовРасчета.Начисления.ДоплатаДоСреднегоЗаработка;
		ДатаНачала = Основание.ДатаНачала;
		ДатаОкончания = Основание.ДатаОкончания;
		
		ЧислоМесяцев = 2;
		ПолучитьПериодПоРаботнику();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицо(ЭтотОбъект);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

