
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	Префикс = Константы.ПрефиксНумерацииДокументов.Получить();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	КодУзлаОбмена = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		СкладПоУмолчанию = Константы.СкладПоУмолчанию.Получить();
		Если ЗначениеЗаполнено(СкладПоУмолчанию) И СкладПоУмолчанию <> ДанныеЗаполнения.СкладПолучатель Тогда
			Возврат;
		КонецЕсли;
		ПеремещениеТоваров = ДанныеЗаполнения;
		Склад = ПеремещениеТоваров.СкладПолучатель;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПеремещениеТоваров", ПеремещениеТоваров);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ПеремещениеТоваровТовары.Количество КАК КоличествоЗаказ
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &ПеремещениеТоваров
		|";
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;

КонецПроцедуры

