
&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	ПараметрыФормы = НайтиНоменклатуруНаСервере(СтрокаПоиска);
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ПросмотрФото", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция НайтиНоменклатуруНаСервере(СтрокаПоиска)
	ТаблицаНоменклатур = ПроцедурыОбменаДанными.НайтиНоменклатуру(СтрокаПоиска);
	Если ТаблицаНоменклатур.Количество() > 0 Тогда 
		Номенклатура = ТаблицаНоменклатур[0].УИД;
		
		ПараметрыОтбора = Новый Структура("УИД",Номенклатура);
		
		МассивСкладов = ТаблицаНоменклатур.НайтиСтроки(ПараметрыОтбора);
		МестаХранения.Очистить();
		Для Каждого Элемент из МассивСкладов Цикл
			
		 НовСтрока = МестаХранения.Добавить();
		 НовСтрока.УИД = Элемент.УИД;
		 //НовСтрока.Склад = Элемент.Склад;
		 //НовСтрока.РядИПолка = Элемент.РядИПолка;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("УИД,Наименование,Склады",ТаблицаНоменклатур[0].УИД,ТаблицаНоменклатур[0].Наименование,МестаХранения);
		Возврат ПараметрыФормы
	Иначе
		Сообщить("Не знайдено жодної номенклатури з таким Найменуванням або артиклом!");
		Возврат Неопределено
	КонецЕсли;
Конецфункции

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьНоменклатуруБезФото();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруБезФото ()
	СписокБезКартинок.Очистить();
	Склады.Очистить();
	ТаблицаКартинок = ПроцедурыОбменаДанными.ПолучитьТаблицуБезФото();
	Склады.Загрузить(ТаблицаКартинок);
	ТаблицаКартинок.Свернуть("УИД,Наименование,Артикул");
	СписокБезКартинок.Загрузить(ТаблицаКартинок);
КонецПроцедуры

&НаКлиенте
Процедура СписокБезКартинокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СписокБезКартинок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОтбора = Новый Структура("УИД",ТекДанные.УИД);
	МассивСкладов = Склады.НайтиСтроки(ПараметрыОтбора);
	
		МестаХранения.Очистить();
		Для Каждого Элемент из МассивСкладов Цикл
			
		 НовСтрока = МестаХранения.Добавить();
		 НовСтрока.УИД = Элемент.УИД;
		 НовСтрока.Склад = Элемент.Склад;
		 НовСтрока.РядИПолка = Элемент.РядИПолка;
		КонецЦикла;
	
	ПараметрыФормы = Новый Структура("УИД,Наименование,Склады",ТекДанные.УИД,ТекДАнные.Наименование,МестаХранения );
	ОткрытьФорму("ОбщаяФорма.ПросмотрФотоДок", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОтправитьВсеФотоНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотоДляВыгрузки.НомерФото КАК ИмяФайла,
		|	ФотоДляВыгрузки.ДатаСоздания КАК ДатаСоздания,
		|	ФотоДляВыгрузки.Фото КАК Фото,
		|	ФотоДляВыгрузки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ФотоДляВыгрузки КАК ФотоДляВыгрузки";

	//Запрос.УстановитьПараметр("НомерДетали",	НомерДеталиЧислом);

	РезультатЗапроса	= Запрос.Выполнить();

	ТаблицаРезультата	= РезультатЗапроса.Выгрузить();

	ХранилищеТаблицы	= Новый ХранилищеЗначения(ТаблицаРезультата);
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси();

	Если Прокси = Неопределено Тогда
		Возврат ;
	КонецЕсли;

	

	ОтветСервера = Прокси.ЗагрузитьФото( ХранилищеТаблицы);

	Для Каждого СтрокиОтвета Из ОтветСервера Цикл
		МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД	= СтрокиОтвета.УИД;
		МенеджерЗаписи.НомерФото	= СтрокиОтвета.Номерфото;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	Сообщить("Всі фотографії відправлені!");
	
	
	//Возврат ОтветСервера;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсеФото(Команда)
	ОтправитьВсеФотоНаСервере();
	
КонецПроцедуры
