
&НаСервере
Функция УстановитьСоединение() Экспорт
	
	Попытка
		ссл = Новый ЗащищенноеСоединениеOpenSSL;
		//всОпред = Новый WSОпределения("http://10.110.10.10:82/BZ/ws/LicenseServer.1cws?wsdl", "СервисЛицензирования", "GiveMeLicense",,,);
		всОпред = Новый WSОпределения("http://vr-task.com:82/BZ/ws/LicenseServer.1cws?wsdl", "СервисЛицензирования", "GiveMeLicense",,,);
		Прокси = Новый WSПрокси(всОпред, "http://localhost/LicenseServer/", "LicenseServer", "LicenseServerSoap",,,);
	Исключение
		Прокси = Неопределено;
	КонецПопытки;
	
	Возврат Прокси;
	
КонецФункции

&НаСервере
Функция ПроверитьСвязьССервером() Экспорт
	
	Попытка
		ссл = Новый ЗащищенноеСоединениеOpenSSL;
		//всОпред = Новый WSОпределения("http://10.110.10.10:82/BZ/ws/LicenseServer.1cws?wsdl", "СервисЛицензирования", "GiveMeLicense",,,);
		всОпред = Новый WSОпределения("http://vr-task.com:82/BZ/ws/LicenseServer.1cws?wsdl", "СервисЛицензирования", "GiveMeLicense",,,);
		Прокси = Новый WSПрокси(всОпред, "http://localhost/LicenseServer/", "LicenseServer", "LicenseServerSoap",,,);
		Прокси = Истина;
	Исключение
		Прокси = Неопределено;
	КонецПопытки;
	
	Возврат Прокси;
	
КонецФункции

&НаСервере
Функция Чтение(СтрокаДляЧтения) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаДляЧтения);	
	СтруктураДанных = ПрочитатьJSON (ЧтениеJSON);	
	ЧтениеJSON.Закрыть();
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция Запись(СтруктураДляЗаписи) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДляЗаписи);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	Возврат СериализованнаяСтрока;
	
КонецФункции

&НаСервере
функция ПроверитьЛицензию(ИдентификаторЛицензирования) Экспорт
	Если ЗначениеЗаполнено(ИдентификаторЛицензирования)	 Тогда
		Прокси = УстановитьСоединение();
		
		Доступно = Неопределено;
		ДатаПолученияЛицензии = Неопределено;
		ДатаОкончанияЛицензии = Неопределено;
		ДатаДосупа = Неопределено;
		
		Если Прокси <> Неопределено Тогда
			
			Прокси.Пользователь = "СервисЛицензирования";
			Прокси.Пароль = "GiveMeLicense";
			
			СтруктураGUID = Новый Структура;
			СтруктураGUID.Вставить("GUID", Строка(ИдентификаторЛицензирования));
			
			Попытка
				
				ОтветJSON = Прокси.ChekLicense(Запись(СтруктураGUID));
				СтруктураОтвет = Чтение(ОтветJSON);
				ОтветДоступно = СтруктураОтвет.Доступно;
				
				Если ОтветДоступно = "Да" Тогда
					Доступно = Истина;	
				Иначе 
					Доступно = Ложь;
				КонецЕсли;
				
				ДатаПолученияЛицензии = СтруктураОтвет.ДатаПолученияЛицензии;
				ДатаОкончанияЛицензии = Дата(СтруктураОтвет.ДатаОкончанияЛицензии);
				ДатаДосупа = НачалоДня(ТекущаяДата());
				
			Исключение
				
				ОшибкаПолучениеДанныхПоЛицензии = Истина;

			КонецПопытки;
			
		Иначе
			Доступно = Истина;
			ДатаДосупа = НачалоДня(ТекущаяДата());
			НетПрокси = Истина;
		КонецЕсли;
		
		СтатусЛицензии = СтатусЛицензии(ИдентификаторЛицензирования,Доступно,ДатаОкончанияЛицензии,ОшибкаПолучениеДанныхПоЛицензии,НетПрокси);
		
		Возврат Новый Структура("Доступно, ДатаОкончанияЛицензии, ДатаПолученияЛицензии, ДатаДосупа, СтатусЛицензии",Доступно,ДатаОкончанияЛицензии,ДатаПолученияЛицензии,ДатаДосупа,СтатусЛицензии);
	КонецЕсли;

КонецФункции

&НаСервере
функция ПроверитьЛицензиюВсе(ИдентификаторЛицензирования) Экспорт
	Если ЗначениеЗаполнено(ИдентификаторЛицензирования)	 Тогда
		Прокси = УстановитьСоединение();
		
		Доступно = Неопределено;
		ДатаОкончанияЛицензии = Неопределено;
		ДатаДосупа = Неопределено;
		
		Имя_Лицензии = Неопределено;
		Телефон_Лицензии = Неопределено;
		EMail_Лицензии = Неопределено;
		Комментарий_Лицензии = Неопределено;
		ДатаПолученияЛицензии = Неопределено;
		
		НетПрокси = Ложь;
		ОшибкаПолучениеДанныхПоЛицензии = Ложь;
		
		Если Прокси <> Неопределено Тогда
			
			Прокси.Пользователь = "СервисЛицензирования";
			Прокси.Пароль = "GiveMeLicense";
			
			СтруктураGUID = Новый Структура;
			СтруктураGUID.Вставить("GUID", Строка(ИдентификаторЛицензирования));
			
			Попытка
				
				ОтветJSON = Прокси.ChekLicenseAll(Запись(СтруктураGUID));
				СтруктураОтвет = Чтение(ОтветJSON);
				ОтветДоступно = СтруктураОтвет.Доступно;
				
				Телефон_Лицензии     = СтруктураОтвет.Телефон;
				Имя_Лицензии         = СтруктураОтвет.Имя;             
				EMail_Лицензии       = СтруктураОтвет.EMail;
				Комментарий_Лицензии  = СтруктураОтвет.Комментарий;
				ДатаПолученияЛицензии = СтруктураОтвет.ДатаПолученияЛицензии;
				
				Если ОтветДоступно = "Да" Тогда
					Доступно = Истина;	
				Иначе
					Доступно = Ложь;
				КонецЕсли;
				
				ДатаОкончанияЛицензии =  Дата(СтруктураОтвет.ДатаОкончанияЛицензии);
				ДатаДосупа = НачалоДня(ТекущаяДата());
				
			Исключение
				
				ОшибкаПолучениеДанныхПоЛицензии = Истина;
				
			КонецПопытки;
			
		Иначе
			Доступно = Истина;
			ДатаДосупа = НачалоДня(ТекущаяДата());
			
			НетПрокси = Истина;
		КонецЕсли;
		
		СтатусЛицензии = СтатусЛицензии(ИдентификаторЛицензирования,Доступно,ДатаОкончанияЛицензии,ОшибкаПолучениеДанныхПоЛицензии,НетПрокси);
		
		Возврат Новый Структура("Доступно, ДатаОкончанияЛицензии,ДатаПолученияЛицензии, ДатаДосупа, СтатусЛицензии,Имя_Лицензии,Телефон_Лицензии,EMail_Лицензии,Комментарий_Лицензии,НетПрокси,ОшибкаПолучениеДанныхПоЛицензии",Доступно,ДатаОкончанияЛицензии,ДатаПолученияЛицензии,ДатаДосупа,СтатусЛицензии,Имя_Лицензии,Телефон_Лицензии,EMail_Лицензии,Комментарий_Лицензии,НетПрокси,ОшибкаПолучениеДанныхПоЛицензии);
	КонецЕсли;

КонецФункции

&НаСервере
функция СтатусЛицензии(ИдентификаторЛицензирования,Доступно,ДатаОкончанияЛицензии,ОшибкаПолучениеДанныхПоЛицензии = Неопределено,НетПрокси = Неопределено) Экспорт
	
	Если НетПрокси = Истина Тогда 
		Заголовок = "Не пов'язаний з сервером ліцензування.";
		ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла; 
		
	ИначеЕсли ОшибкаПолучениеДанныхПоЛицензии = Истина Тогда
		Заголовок = "Помилка отримання даних за ліцензією.";
		ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла; 
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ИдентификаторЛицензирования) Тогда
		
		Заголовок = "Надано доступ на час отримання ліцензії!";
		ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла; 

	Иначе
		
 		Если Доступно Тогда
			
			Заголовок = "Використання доступно до "+ Формат(ДатаОкончанияЛицензии,"ДФ=dd.MM.yyyy");
			ЦветТекста = ЦветаСтиля.ЦветАкцента;
			
		Иначе
			
			Заголовок = "Використання не доступне з "+?(ЗначениеЗаполнено(ДатаОкончанияЛицензии), Формат(ДатаОкончанияЛицензии,"ДФ=dd.MM.yyyy"),"не встановлено.");
			ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;

		КонецЕсли;
		
	КонецЕсли;
	
	ИдентификаторЛицензированияНадпись =  Строка(ИдентификаторЛицензирования);
	

	
	Возврат Новый Структура("Заголовок, ЦветТекста, ИдентификаторЛицензированияНадпись",Заголовок,ЦветТекста,ИдентификаторЛицензированияНадпись);
КонецФункции

&НаСервере
Функция ЗарегистрироватьЛицензиюОтправитьДанныеНаСервер(Идентификатор,Имя = Неопределено,Телефон = Неопределено,EMail = Неопределено,Комментарий = Неопределено) Экспорт

	Прокси = ЛицензированиеСервер.УстановитьСоединение();
	
	Если Прокси <> Неопределено Тогда
		
		Прокси.Пользователь = "СервисЛицензирования";
		Прокси.Пароль = "GiveMeLicense";
		
		СтруктураОбновленияКИ = Новый Структура;
		СтруктураОбновленияКИ.Вставить("Имя", Имя);				
		СтруктураОбновленияКИ.Вставить("Телефон", Телефон);
		СтруктураОбновленияКИ.Вставить("EMail", EMail); 
		СтруктураОбновленияКИ.Вставить("GUID", Строка(Идентификатор));
		СтруктураОбновленияКИ.Вставить("Комментарий", Комментарий);

		Попытка
			ОтветJSON = Прокси.RegisterLicense(Запись(СтруктураОбновленияКИ));
			СтруктураОтвет = Чтение(ОтветJSON);
			Если НЕ СтруктураОтвет.Ответ Тогда
				Сообщить("Не вдалося оновити контактну інформацію на сервері ліцензування!");
				Возврат Ложь;
			Иначе
				Сообщить("Ліцензія зареєстрована!");

				Возврат Истина;
			КонецЕсли;
					
		Исключение
			Сообщить("Не вдалося оновити контактну інформацію на сервері ліцензування!");
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Сообщить("Немає доступу до сервера ліцензування! Перевірте підключення до мережі Інтернет!");
	КонецЕсли;
	
КонецФункции











