
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСообщения = "";
	Для каждого Способ Из Способы Цикл
		Если НЕ ЗначениеЗаполнено(Способ.Коэффициент) Тогда
			СтрокаСообщения = СтрокаСообщения +Символы.ПС+
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru=' строка %1: не заполнен коэффициент';uk=' рядок %1: не заповнений коефіцієнт'"), Способ.НомерСтроки);
		КонецЕсли; 
	КонецЦикла; 
	
	Если не ПустаяСтрока(СтрокаСообщения) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Обнаружены ошибки в заполнении способов отражения расходов:';uk='Виявлено помилки в заповненні способів відображення витрат:'")+СтрокаСообщения,Отказ); 
	КонецЕсли; 
	
КонецПроцедуры
