
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыНакопления.ТопливоДляАвтомобилей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	   
	Для Каждого стр Из Данные Цикл
		Если ЗначениеЗаполнено(стр.ВыданоТоплива) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ВидДвижения 			= ВидДвиженияНакопления.Приход;
			Запись.Активность   		= Истина;
			Запись.Регистратор  		= Ссылка;
			Запись.Период       		= стр.Период;
			Запись.Автомобиль    		= Автомобиль;
			Запись.Количество	  		= стр.ВыданоТоплива;
			НаборЗаписей.Записать();	
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.РасходТопливаЛитров) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ВидДвижения 			= ВидДвиженияНакопления.Расход;
			Запись.Активность   		= Истина;
			Запись.Регистратор  		= Ссылка;
			Запись.Период       		= стр.Период;
			Запись.Автомобиль    		= Автомобиль;
			Запись.Количество	  		= стр.РасходТопливаЛитров;
			НаборЗаписей.Записать();	
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей = РегистрыНакопления.КилометражПоМаршрутнымЛистам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	   
	Для Каждого стр Из Данные Цикл
		Если ЗначениеЗаполнено(стр.ВыданоТоплива) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Активность   		= Истина;
			Запись.Регистратор  		= Ссылка;
			Запись.Период       		= стр.Период;
			Запись.Автомобиль    		= Автомобиль;
			Запись.СтоимостьАренды	  	= стр.СтоимостьАренды;
			Запись.Удержание	  		= стр.Удержание;
			Запись.Количество	  		= стр.КилометражУтвержденный;
			НаборЗаписей.Записать();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
	Если СуществуютДокументыМаршрутныйЛист() Тогда
		//Отказ = Истина;
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СуществуютДокументыМаршрутныйЛист()
	
	СумествуютДокументыЗаДанныйПериод = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛист.Ссылка КАК Документ
		|ИЗ
		|	Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(МаршрутныйЛист.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
		|	И МаршрутныйЛист.Ссылка <> &Ссылка
		|	И МаршрутныйЛист.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СумествуютДокументыЗаДанныйПериод = Истина;
		Сообщить("Документ за такий період вже існує - " + ВыборкаДетальныеЗаписи.Документ);
	КонецЕсли;

	Возврат СумествуютДокументыЗаДанныйПериод;
	
КонецФункции
