
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыОбменаТоваровПокупателей.Новый Тогда
		Возврат;
	КонецЕсли;
	
	//Товары на Складах
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура;
	//приход
	СтруктураПолей.Вставить("Номенклатура"                       , "Номенклатура");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"                   , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Услуга"                             , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                              , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                           , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Количество"                         , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("КоличествоДок"                      , "Количество");
	СтруктураПолей.Вставить("Качество"                           , "Качество");
	СтруктураПолей.Вставить("Склад"                              , "Ссылка.СкладПрихода");
	СтруктураПолей.Вставить("НомерСтроки"                        , "НомерСтроки");
	СтруктураПолей.Вставить("СерияНоменклатуры"         		 , "СерияНоменклатурыПолученна");
	СтруктураПолей.Вставить("ВидСклада"							 , "Ссылка.СкладПрихода.ВидСклада");
	СтруктураПолей.Вставить("ЗаказПокупателя"                    , "Ссылка.ЗаказПокупателя");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"			     , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("НоменклатурнаяГруппа"			     , "Номенклатура.НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("Регистратор"			     	     , "Ссылка");
		
	РезультатЗапросаПоТоварамПриход = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	ТаблицаПоТоварам = РезультатЗапросаПоТоварамПриход.Выгрузить();
	
	СтруктТаблицДокумента = Новый Структура;
	КопияТовары = ТаблицаПоТоварам.Скопировать();
	КопияТовары.Колонки.ЗаказПокупателя.Имя = "Сделка";
	СтруктТаблицДокумента.Вставить("ТаблицаТовары", КопияТовары);
	
	ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыНаСкладах, СтруктТаблицДокумента);
	
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество", Справочники.Качество.Новый);
	ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыНаСкладах, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
	
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура;
	//Расход
	СтруктураПолей.Вставить("Номенклатура"                       , "Номенклатура");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"                   , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Услуга"                             , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                              , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                           , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Количество"                         , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	СтруктураПолей.Вставить("КоличествоДок"                      , "Количество");
	СтруктураПолей.Вставить("Качество"                           , "Качество");
	СтруктураПолей.Вставить("Склад"                              , "Ссылка.СкладСписания");
	СтруктураПолей.Вставить("НомерСтроки"                        , "НомерСтроки");
	СтруктураПолей.Вставить("СерияНоменклатуры"         		 , "СерияНоменклатурыОтдана");
	СтруктураПолей.Вставить("ВидСклада"							 , "Ссылка.СкладСписания.ВидСклада");
	СтруктураПолей.Вставить("ЗаказПокупателя"                    , "Ссылка.ЗаказПокупателя");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"			     , "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("НоменклатурнаяГруппа"			     , "Номенклатура.НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("Регистратор"			     	     , "Ссылка");
		
	РезультатЗапросаПоТоварамПриход = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей);
	
	ТаблицаПоТоварам = РезультатЗапросаПоТоварамПриход.Выгрузить();
	
	СтруктТаблицДокумента = Новый Структура;
	КопияТовары = ТаблицаПоТоварам.Скопировать();
	КопияТовары.Колонки.ЗаказПокупателя.Имя = "Сделка";
	СтруктТаблицДокумента.Вставить("ТаблицаТовары", КопияТовары);
	
	ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыНаСкладах, СтруктТаблицДокумента);
	
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество", Справочники.Качество.Новый);
	ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыНаСкладах, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Организация 		= ДанныеЗаполнения.Организация;
		ЗаказПокупателя 	= ДанныеЗаполнения;
		Покупатель			= ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента	= ДанныеЗаполнения.ДоговорКонтрагента;
		Статус				= Перечисления.СтатусыОбменаТоваровПокупателей.Новый;
		СкладСписания		= Неопределено;
		
		МассКачество = Новый Массив;
		МассКачество.Добавить(Справочники.Качество.Новый);
		
		Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить());
		Товары.ЗагрузитьКолонку(МассКачество,"Качество")
		
	КонецЕсли;
	
	инд = 0;
	Для Каждого стрТовары из Товары Цикл
		
		стрТовары.СерияНоменклатурыПолученна = ДанныеЗаполнения.Товары[инд].СерияНоменклатуры;
		
		инд = инд +1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
КонецПроцедуры
