
&НаКлиенте
Процедура ОК(Команда)
	
	Если Доступно Тогда 
		ЧерезКнопкуОК = Истина;
		ПроверитьПароль();
		Закрыть();
		ЧерезКнопкуОК = Ложь;
	Иначе 
		Сообщить("Немає доступу!");
	КонецЕсли;
	
	

КонецПроцедуры

&НаСервере
Функция ПроверитьПароль()
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Сообщить("Вкажіть користувача");
		Возврат Ложь;
	КонецЕсли;
	
	ПарольНеверный = Ложь;
	ЗапретДоступа = Ложь;
	//ПарольАдминистратора = "gfhjkm911";
	//Если (ИмяСобытия = "ВходВПрограмму" И (Пароль = Пользователь.Пароль ИЛИ Пароль = ПарольАдминистратора))
	//	ИЛИ (ИмяСобытия = "ОткрытиеФормыНастроек" И Пароль = "911911") Тогда
	СтруктураОтвета = Разработка.ПроверитьПарольПользователя(Пользователь, Пароль);
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
		СтруктураОтвета.Свойство("ЗапретДоступа", ЗапретДоступа);
		СтруктураОтвета.Свойство("ПарольНеверный", ПарольНеверный);
		Если ЗапретДоступа Тогда
			Сообщить(СтруктураОтвета.ТекстОшибки);
		КонецЕсли;
	Иначе // если нет интернета, можно проверять с локальным паролем
		ПарольНеверный = (Пароль <> Константы.ПарольДляВходаНаУстройстве.Получить());
	КонецЕсли;
	Если ПарольНеверный = Истина Тогда
		Сообщить("Невірний пароль");
	КонецЕсли;
	АутентификацияПройдена = НЕ(ЗапретДоступа ИЛИ ПарольНеверный);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = Константы.ПользовательПоУмолчанию.Получить();
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ЗапросПользователи = Новый Запрос;
		ЗапросПользователи.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|";
		ВыборкаПользователей = ЗапросПользователи.Выполнить().Выбрать();
		Если НЕ ВыборкаПользователей.Следующий() Тогда
			Константы.ПользовательПоУмолчанию.Установить(Справочники.Пользователи.ПустаяСсылка());
			Отказ = Истина;
		ИначеЕсли ВыборкаПользователей.Количество() = 1 Тогда
			Пользователь = ВыборкаПользователей.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяСобытия") Тогда
		ИмяСобытия = Параметры.ИмяСобытия;
		
		Если ИмяСобытия = "ОткрытиеФормыНастроек" Тогда
			Пользователь = "Администратор";
			Элементы.Пользователь.ТолькоПросмотр = Истина;
			АутентификацияПройдена = Ложь;
			Элементы.ОК.Заголовок = "Увійти в налаштування >>>";
			ЭтотОбъект.Заголовок = "";
		ИначеЕсли ИмяСобытия = "ВходВПрограмму" Тогда
			//Пользователь = Константы.ПользовательУстройства.Получить();
			//Элементы.Пользователь.ТолькоПросмотр = Истина;
			АутентификацияПройдена = Ложь;
			ЧерезКнопкуОК = Ложь;
			Элементы.ОК.Заголовок = "Увійти >>>";
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ИмяСобытия = "ОткрытиеФормыНастроек" Тогда
		
		Если АутентификацияПройдена Тогда
			//ОткрытьФорму("ОбщаяФорма.Администрирование");
		Иначе
			Если ЧерезКнопкуОК Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ВходВПрограмму" Тогда
		
		Если АутентификацияПройдена Тогда
			//ПроцедурыОбменаДанными.ПолныйОбмен();
			УстановитьПользователяСеанса();
		Иначе
			Если ЧерезКнопкуОК Тогда
				Отказ = Истина;
			Иначе
				ЗавершитьРаботуСистемы(Ложь);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователяСеанса()
	
	Константы.ПользовательПоУмолчанию.Установить(Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЛицензию(Команда)
	Прокси = ЛицензированиеСервер.ПроверитьСвязьССервером();
	
	Если Прокси = Неопределено Тогда 
		Сообщить("Не вдалося встановити WS-з'єднання із сервером ліцензування. Перевірте підключення до інтернету");
		
	Иначе
		
		Ответ = Новый Структура("НетПрокси,ОшибкаПолучениеДанныхПоЛицензии,Доступно,ДатаОкончанияЛицензии,СтатусЛицензии",Ложь,Ложь,Истина,Дата("2040.03.23 10:45:25"),Новый Структура("Заголовок,ЦветТекста","Все супер",WebЦвета.АкварельноСиний));//ЛицензированиеСервер.ПроверитьЛицензиюВсе(ИдентификаторУстройства);
		
		Если Ответ.НетПрокси Тогда 
			Сообщить("Не вдалося встановити WS-з'єднання із сервером ліцензування. Перевірте підключення до інтернету");
			
			
		ИначеЕсли Ответ.ОшибкаПолучениеДанныхПоЛицензии Тогда 			
			Сообщить("Помилка отримання даних за ліцензією.");
		Иначе
			Доступно     = Ответ.Доступно;
			ДатаОкончанияЛицензии = Ответ.ДатаОкончанияЛицензии;
			
			Элементы.НадписьДоступностьЛицензии.Заголовок = Ответ.СтатусЛицензии.Заголовок;
			Элементы.НадписьДоступностьЛицензии.ЦветТекста = Ответ.СтатусЛицензии.ЦветТекста;
			
			Если Доступно Тогда 
				Элементы.Пароль.ТолькоПросмотр       = Ложь;
				Элементы.Пользователь.ТолькоПросмотр = Ложь;
				Элементы.ОК.Видимость                = Истина;
				
				Элементы.ПроверитьЛицензию.Видимость = Ложь;
				Элементы.ИдентификаторУстройства.Видимость = Ложь;
				
			Иначе 
				Элементы.Пароль.ТолькоПросмотр       = Истина;
				Элементы.Пользователь.ТолькоПросмотр = Истина;
				Элементы.ОК.Видимость                = Ложь;
				
				Элементы.ПроверитьЛицензию.Видимость = Истина;
				Элементы.ИдентификаторУстройства.Видимость = Истина;
				
				
			КонецЕсли;
			
			УстановитьКонстантыЛицензирования(ДатаОкончанияЛицензии,ДатаОкончанияЛицензии,Доступно,Ответ.СтатусЛицензии.Заголовок);
			
			Сообщить("Дані по ліцензії отримано");
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
функция ПроверкаЛицезии()
	//+NovashIV_18.01.2023
	
	ИдентификаторУстройства = ПолучитьИндификаторУстройства();
	
	Прокси = ЛицензированиеСервер.ПроверитьСвязьССервером();
	
	Если ЗначениеЗаполнено(ИдентификаторУстройства) и Прокси = Истина Тогда //Если есть индификатор лицезии и есть связь с сервером лицензирования
		Ответ = ЛицензированиеСервер.ПроверитьЛицензию(ИдентификаторУстройства);
		Доступно     = Ответ.Доступно;
		ДатаОкончанияЛицензии = Ответ.ДатаОкончанияЛицензии;
		
		Элементы.НадписьДоступностьЛицензии.Заголовок = Ответ.СтатусЛицензии.Заголовок;
		Элементы.НадписьДоступностьЛицензии.ЦветТекста = Ответ.СтатусЛицензии.ЦветТекста;

		Если Доступно Тогда 
			Элементы.Пароль.ТолькоПросмотр       = Ложь;
			Элементы.Пользователь.ТолькоПросмотр = Ложь;
			Элементы.ОК.Видимость                = Истина;
			
			Элементы.ПроверитьЛицензию.Видимость = Ложь;
			Элементы.ИдентификаторУстройства.Видимость = Ложь;

		Иначе 
			Элементы.Пароль.ТолькоПросмотр       = Истина;
			Элементы.Пользователь.ТолькоПросмотр = Истина;
			Элементы.ОК.Видимость                = Ложь;
			
			Элементы.ПроверитьЛицензию.Видимость = Истина;
			Элементы.ИдентификаторУстройства.Видимость = Истина;


		КонецЕсли;
		
				
		УстановитьКонстантыЛицензирования(ДатаОкончанияЛицензии,Ответ.ДатаПолученияЛицензии,Доступно,Ответ.СтатусЛицензии.Заголовок);
		 
	 ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторУстройства) и Прокси = Истина Тогда //Если нету индификатора лицезии и есть связь с сервером лицензирования
		 
		СтатусЛицензии = ЛицензированиеСервер.СтатусЛицензии(Неопределено,Истина,ТекущаяДата(),Ложь,Ложь);
		Элементы.НадписьДоступностьЛицензии.Заголовок = СтатусЛицензии.Заголовок;
		Элементы.НадписьДоступностьЛицензии.ЦветТекста = СтатусЛицензии.ЦветТекста;

		Доступно     = Истина;
		ДатаОкончанияЛицензии = КонецДня(ТекущаяДата());
		
		УстановитьКонстантыЛицензирования(ДатаОкончанияЛицензии,ДатаОкончанияЛицензии,Доступно,СтатусЛицензии.Заголовок);

	ИначеЕсли ЗначениеЗаполнено(ИдентификаторУстройства) и Прокси = Неопределено Тогда //Если есть индификатор лицезии и нету связь с сервером лицензирования
		Структура = ПолучитьКонстантыЛицензирования();

		Доступно = Структура.Доступно;
		ДатаОкончанияЛицензии   = Структура.ДатаОкончанияЛицензии;
		СтатусЛицензии          = Структура.СтатусЛицензии;
		
		Если Доступно Тогда 
			Элементы.Пароль.ТолькоПросмотр       = Ложь;
			Элементы.Пользователь.ТолькоПросмотр = Ложь;
			Элементы.ОК.Видимость                = Истина;
		Иначе 
			Элементы.Пароль.ТолькоПросмотр       = Истина;
			Элементы.Пользователь.ТолькоПросмотр = Истина;
			Элементы.ОК.Видимость                = Ложь;
			
		КонецЕсли;

	Иначе 
		Сообщить("Помилка! Зверніться до розробника!")
	КонецЕсли;
	
	//-NovashIV_18.01.2023
КонецФункции

&НаСервере
функция ПолучитьИндификаторУстройства()
	Возврат Константы.ИдентификаторУстройства.Получить()
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверкаЛицезии();
КонецПроцедуры

&НаСервере
функция УстановитьКонстантыЛицензирования(мДатаОкончанияЛицензии,мДатаПолученияЛицензии,мДоступно,мНадписьДоступностьЛицензии)
	
	
	//запись константы
	Если ЗначениеЗаполнено(мДатаОкончанияЛицензии) Тогда 
		Константы.ДатаОкончанияЛицензии.Установить(мДатаОкончанияЛицензии);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мДатаПолученияЛицензии) Тогда 
		Константы.ДатаПолученияЛицензии.Установить(мДатаПолученияЛицензии);
	КонецЕсли;

	Если ЗначениеЗаполнено(мДоступно) Тогда 
		Константы.Доступно_Лицензии.Установить(мДоступно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мНадписьДоступностьЛицензии) Тогда 
		Константы.НадписьДоступностьЛицензии.Установить(мНадписьДоступностьЛицензии);
	КонецЕсли;

		
		
КонецФункции

Функция ПолучитьКонстантыЛицензирования()
	Возврат Новый Структура("Доступно,ДатаОкончанияЛицензии,СтатусЛицензии",Константы.Доступно_Лицензии.Получить(),Константы.ДатаОкончанияЛицензии.Получить(),Константы.НадписьДоступностьЛицензии.Получить());
КонецФункции