
Процедура ОбработкаПроверкиВыполнения(Результат)
	
	Если Наименование = "Проставить способы доставки" Тогда 
		Результат = Истина;
		////Для Каждого СтрокаТовары из ЭтотОбъект.ЗаказПокупателя.Товары Цикл
		////	Если не ЗначениеЗаполнено(СтрокаТовары.СпособДоставки) Тогда 
		////		Результат = Ложь;
		////	КонецЕсли;
		////КонецЦикла;
		Если не ЗначениеЗаполнено(ЭтотОбъект.ЗаказПокупателя.СпособДоставки) Тогда 
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Выполнена и не Наименование = "Система ждет выполнения дочерних БП" Тогда
		Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Наименование = "Пришел ответ на запрос. Свяжитесь с клиентом" 
		или Наименование = "Напоминание по объекту: Событие" 
		или Наименование = "Связаться с клиентом по запчастям из системы ожидания" 
		или Наименование = "Возврат жалобы на качество приемки на доработку" 
		Или Наименование = "Возврат жалобы на цену на доработку" 
		или Наименование = "Жалобы" 
		или Наименование = "Проставить цену по запросу" 
		или Наименование = "Сформировать заказы по запросу"
		или Наименование = "Проверить наличие возвращенных запчастей" 
		или Наименование = "Вернуть деньги клиенту на расчетный счет" 
		или Наименование = "Запрос на подтверждение заявки" 
		или Наименование = "Запрос на списание по инвентаризации" 
		или Наименование = "Вернуть деньги клиенту на карту"
		или Наименование = "Проверить документы по возврату" 
		или Наименование = "Проверить наличие возвращенных запчастей"   
		или Наименование = "Вернуть деньги клиенту на произвольный счет или карту" 
		или Наименование = "Сформировать пакет документов по перемещению ДС в кассу или на карту"
		или Наименование = "Сформировать пакет документов по перемещению со счета на счет"
		или Наименование = "Привязать входящую платежку к внутреннему перемещению ДС" 
		или Наименование = "Оформить документы на перемещение ДС" 
		или Наименование = "Получить деньги в кассу"
		или Наименование = "Подтвердить снятие запчасти" 
		или Наименование = "Подтвердить внутреннее перемещение ДС"
		или Наименование = "Подтвердить формирование документов по инвентаризации"
		
		Тогда
		
	иначе
		Если не ТипЗнч(БизнесПроцесс) = тип("БизнесПроцессСсылка.БП_ПеремещениеТовараПоДокументу") Тогда  
			
			Если Наименование = "Уточнить у покупателя продление резерва" или Наименование = "Напоминание по объекту: Событие" Тогда 
				ЗаказПокупателяДляЗаписи = ЗаказПокупателя;
				
			Иначе
				
				Если ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.БП_ПеремещениеТовара") Тогда 
					ЗаказПокупателяДляЗаписи = БизнесПроцесс.ЗаказПокупателя;
					СтатусЗаказа = БизнесПроцесс.РодительскийБизнесПроцес.РодительскийБизнесПроцес.СтатусЗаказа;	
				Иначе
					
					Попытка
						Если ТипЗнч("БизнесПроцесс") = Тип("БизнесПроцессСсылка.БП_ОбработкаЗаказа") Тогда 
							ЗаказПокупателяДляЗаписи = БизнесПроцесс.ЗаказПокупателя;
							СтатусЗаказа = БизнесПроцесс.СтатусЗаказа;
						ИначеЕсли ТипЗнч("БизнесПроцесс") = Тип("БизнесПроцессСсылка.БП_ОбработкаСтрокиЗаказа") Тогда 
							ЗаказПокупателяДляЗаписи = БизнесПроцесс.РодительскийБизнесПроцес.ЗаказПокупателя;
							СтатусЗаказа = БизнесПроцесс.РодительскийБизнесПроцес.СтатусЗаказа;
						КонецЕсли;
					Исключение
						ЗаказПокупателяДляЗаписи = БизнесПроцесс.РодительскийБизнесПроцес.ЗаказПокупателя;
						СтатусЗаказа = БизнесПроцесс.РодительскийБизнесПроцес.СтатусЗаказа;
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			////Если Выполнена Тогда 
			////	Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
			////	Менеджер.Активность        = Истина;
			////	Менеджер.Период            = ТекущаяДата();
			////	Менеджер.СодержаниеСобытия = ЭтотОбъект.Наименование;
			////	Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.Задача;
			////	Менеджер.Ответственный     = ПараметрыСеанса.ТекущийПользователь;
			////	Менеджер.ЗаказПокупателя   = ЗаказПокупателяДляЗаписи;
			////	Менеджер.СсылкаНаОбъект    = ЭтотОбъект.Ссылка;
			////	Менеджер.Статус 		   = СтатусЗаказа;
			////	Менеджер.Записать();
			////КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
	#Если Клиент Тогда 
		Если Выполнена Тогда 
			////Оповестить("УНР_ОбновлениеСпискаЗадач",,ЭтотОбъект.ссылка);
		КонецЕсли;
	#Конецесли
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	ДатаВремяВыполненияЗадачи = ТекущаяДата();
	
	Если Наименование = "Проставить цену по запросу" Тогда 
	КонецЕсли;
	
	Если Наименование = "Отправить заказ клиенту" Тогда 
		
		Для Каждого СтрокаТовары из ТоварыКВыдачеКлиенту цикл
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РеализацияТоваровУслугТовары.Ссылка
			               |ИЗ
			               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			               |ГДЕ
			               |	РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
			               |	И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
			               |	И РеализацияТоваровУслугТовары.Ссылка.Сделка = &Сделка";
			Запрос.УстановитьПараметр("Номенклатура",СтрокаТовары.Номенклатура);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",СтрокаТовары.ХарактеристикаНоменклатуры);
			Запрос.УстановитьПараметр("Сделка",ЗаказПокупателя);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			Если РезультатЗапроса.Количество() Тогда 
			Иначе
				Сообщить("Вы не можете отправить данный товар, так как его нет в Реализации товаров и услуг.",СтатусСообщения.Важное);
				Отказ  = Истина;
			
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;		
КонецПроцедуры
