
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТекстВопроса = "Процедура оновлення залишків номенклатури може зайняти тривалий час. Продовжити?";
	ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Залишки");

КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекУзел = "";
	Если Не Разработка.ВерсияКлиентаОбновлена(, ТекУзел) Тогда
		ПоказатьПредупреждение(, "Оновiть додаток! " + ТекУзел);
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Разработка.ОбновитьОстаткиНоменклатуры();
	КонецЕсли;

КонецПроцедуры
