
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	Префикс = Константы.ПрефиксНумерацииДокументов.Получить();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	КодУзлаОбмена = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код;
	СуммаДокумента = Товары.Итог("Сумма");

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаказПоставщику = ДанныеЗаполнения;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиЗаказовПоставщикамМобильные.Склад КАК Склад,
		|	ОстаткиЗаказовПоставщикамМобильные.Контрагент КАК Контрагент,
		|	ОстаткиЗаказовПоставщикамМобильные.Номенклатура КАК Номенклатура,
		|	ОстаткиЗаказовПоставщикамМобильные.Количество КАК КоличествоЗаказ
		|ИЗ
		|	РегистрСведений.ОстаткиЗаказовПоставщикамМобильные КАК ОстаткиЗаказовПоставщикамМобильные
		|ГДЕ
		|	ОстаткиЗаказовПоставщикамМобильные.ЗаказПоставщику = &ЗаказПоставщику
		|";
		ТаблицаОстатковЗаказа = Запрос.Выполнить().Выгрузить();
		Товары.Загрузить(ТаблицаОстатковЗаказа);
		Если ТаблицаОстатковЗаказа.Количество() > 0 Тогда
			Склад = ТаблицаОстатковЗаказа[0].Склад;
			Контрагент = ТаблицаОстатковЗаказа[0].Контрагент;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

