Функция ОтправитьДокументыВчасно(ПечДокумент, Заголовок) Экспорт
	
	Если ПечДокумент = Неопределено тогда
		Возврат Истина;
	КонецЕсли;
	
	ИДСеанса = Строка(НомерСеансаИнформационнойБазы());
	
	ПВХ_ИДСеанса      = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ID Сеанса");
	ПВХ_ВремХранилище = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ВремХранилище");
	
	ТекОбъект = Неопределено;
	Выборка = РегистрыСведений.ЗначенияСвойствОбъектов.Выбрать(Новый Структура("Свойство",ПВХ_ИДСеанса));
    Пока Выборка.Следующий() Цикл
        Запись = Выборка.ПолучитьМенеджерЗаписи();
        // изменим
        Запись.Прочитать();
		Если Запись.Значение = ИДСеанса Тогда
			ТекОбъект = Запись.Объект;
	        // и тут же удалим
	        Запись.Удалить();
		КонецЕсли;
    КонецЦикла;	
	
	Если ТекОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РегистрыСведений.ЗначенияСвойствОбъектов.Выбрать(Новый Структура("Свойство",ПВХ_ВремХранилище));
	Если Выборка.Следующий() Тогда
        Запись = Выборка.ПолучитьМенеджерЗаписи();
        // изменим
        Запись.Прочитать();
		
		АдресХранилища = Запись.Значение;
        // и тут же удалим
        Запись.Удалить();
	Иначе
		Возврат Ложь;
    КонецЕсли;	
	
	Структура = ПолучитьИзВременногоХранилища("e1cib/tempstorage/"+АдресХранилища);
	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Структура.ТабличныйДокумент = ПечДокумент;
	ПоместитьВоВременноеХранилище(Структура,"e1cib/tempstorage/"+АдресХранилища);
	
	Возврат Истина;
	
КонецФункции

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Процедура ЗагрузитьСчетаИзВчасно() 
	
	// запрос по структуре параметров отбора
	Организация = Справочники.Организации.НайтиПоКоду("000000000", Истина);
	Токен = Справочники.НастройкиПодключенияКAPI.НайтиПоНаименованию("Вчасно Токен").Пароль;
	//Токен = "53oAv1Pf--_FP3O_CTw1OYqWfZ81Ed5DlIws";
	Если Не ЗначениеЗаполнено(Организация) ИЛИ Не ЗначениеЗаполнено(Токен) Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураПараметровЗапросаСтатусов = Новый Структура;
	КоличествоПовторныхЗапросов = 10;
	
	Если истина Тогда
		//НачПериода = НачалоНедели(ТекущаяДата());
		//НачПериода = НачалоГода(ТекущаяДата()) - 60*60*24*14;
		НачПериода = НачалоДня(ТекущаяДата());
		КонПериода = КонецДня(ТекущаяДата());
		
		СтруктураПараметровЗапросаСтатусов.Вставить("date"+"_sent"+"_from", Формат(НачПериода, "ДФ=yyyy-MM-dd")); 
		СтруктураПараметровЗапросаСтатусов.Вставить("date"+"_sent"+"_to"  , Формат(КонПериода, "ДФ=yyyy-MM-dd")); 
	КонецЕсли;
	
	РезультатЗапроса = Неопределено;
	
	Прокси = Неопределено;
	Хост						 = "edo.vchasno.ua";
	НТТРВчасно = Новый HTTPСоединение(Хост,,,,Прокси,60,Новый ЗащищенноеСоединениеOpenSSL());  	// #106 
	ПространствоИменИсходящих	 = "/api/v1/documents";
	ПространствоИменВходящих	 = "/api/v1/incoming-documents";
	ПространствоИменДокументов	 = "/api/v2/documents";
	ПространствоИменЗагрузки	 = "/api/v2/download-documents";
	ПространствоИмен = ПространствоИменВходящих;
	ПространствоИмен = СтрЗаменить(ПространствоИмен, "/v1/", "/v2/"); // теперь так...
	Текст = Новый ТекстовыйДокумент;
	ЗаголовокHTTP = Новый Соответствие(); 
	ЗаголовокHTTP.Вставить("Authorization", "Token " + СокрЛП(Токен));
	ЗаголовокHTTP.Вставить("Vendor"		  , "Mastakov");
	ЗаголовокHTTP.Вставить("Accept"		  , "application/xml");
	
	ПараметрыЗапросаСтатусов = "";
	Если СтруктураПараметровЗапросаСтатусов.Количество() > 0 Тогда
		ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + "?";
		Для Каждого Эл Из СтруктураПараметровЗапросаСтатусов Цикл
			ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + Эл.Ключ+"="+Эл.Значение+"&";
		КонецЦикла;
		ПараметрыЗапросаСтатусов = Лев(ПараметрыЗапросаСтатусов, СтрДлина(ПараметрыЗапросаСтатусов)-1);
	КонецЕсли;
	
	Отказ = Ложь;
	Курсор = ""; 
	
	Пока Курсор <> Неопределено Цикл 
		
		//ОбработкаПрерыванияПользователя();
		
		Если Курсор <> "" Тогда
			
			Если Найти(ПараметрыЗапросаСтатусов, "?") = 0 Тогда
				ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + "?";
			КонецЕсли;
			
			Поз = Найти(ПараметрыЗапросаСтатусов, "cursor=");
			
			Если Поз = 0 Тогда
				Если СтруктураПараметровЗапросаСтатусов.Количество() > 0 Тогда
					ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + "&";
				КонецЕсли;
				ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + "cursor="+Курсор;
			Иначе
				ПараметрыЗапросаСтатусов = Лев(ПараметрыЗапросаСтатусов, Поз-1)+"cursor="+Курсор; 
			КонецЕсли;
			
		КонецЕсли;
		
		ЗапросHTTP = Новый HTTPЗапрос(ПространствоИмен+ПараметрыЗапросаСтатусов, ЗаголовокHTTP);
		//Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
		тмпОтвет = ПолучитьИмяВременногоФайла("txt");
		ОтветHTTP = НТТРВчасно.Получить(ЗапросHTTP, тмпОтвет);
		КодОтвета = ОтветHTTP.КодСостояния;
		
		Если КодОтвета < 300 Тогда // корректный код возврата  	
			
			Текст.Прочитать(тмпОтвет);
			ФайлОтвета = Новый Файл(тмпОтвет);
			
			Если ФайлОтвета.Существует() Тогда
				
				ТекстОтвета = Новый ТекстовыйДокумент();
				ТекстОтвета.Прочитать(тмпОтвет,КодировкаТекста.UTF8);
				
				Если ТекстОтвета.КоличествоСтрок() > 0 Тогда
					ОтветСервера = ТекстОтвета.ПолучитьТекст();	
				КонецЕсли;	
				
				Попытка
					
					Структура = ПолучитьСтруктуруИзХМЛ(ОтветСервера);	
					Курсор_ = "";	
					
					Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство("response") И Структура.response.Свойство("next_cursor") И Структура.response.next_cursor.Свойство("___Текст_") Тогда 
						Курсор_ = Структура.response.next_cursor.___Текст_;
					КонецЕсли;
					Если Курсор_ = "" Тогда
						Курсор = Неопределено;
					Иначе 
						Курсор = Курсор_;
					КонецЕсли;
					
					Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство("response") И Структура.response.Свойство("documents") И Структура.response.documents.Свойство("document") И ТипЗнч(Структура.response.documents.document) = Тип("Массив") Тогда 
						
						Для Каждого стрСтруктуры Из Структура.response.documents.document Цикл
							
							//Если стрСтруктуры.Свойство("category") И стрСтруктуры.category.Свойство("___Текст_") И стрСтруктуры.category.___Текст_ <> "2" Тогда
							//	Продолжить;
							//КонецЕсли;
							Если (стрСтруктуры.Свойство("title") И стрСтруктуры.title.Свойство("___Текст_") И Найти(стрСтруктуры.title.___Текст_, "Рахунок") <> 0) 
								ИЛИ  (стрСтруктуры.Свойство("category") И стрСтруктуры.category.Свойство("___Текст_") И стрСтруктуры.category.___Текст_ = "2") Тогда
							
								Если стрСтруктуры.Свойство("status_text") И стрСтруктуры.status_text.Свойство("___Текст_") И стрСтруктуры.status_text.___Текст_ = "Відхилений" Тогда
									Продолжить;
								КонецЕсли;
							
								Если стрСтруктуры.Свойство("number") 
									И стрСтруктуры.number.Свойство("___Текст_")
									И стрСтруктуры.number.___Текст_ <> ""
									И стрСтруктуры.Свойство("date")  
									И стрСтруктуры.date.Свойство("___Текст_") 
									И стрСтруктуры.date.___Текст_ <> "" Тогда
									
									НомерДок = стрСтруктуры.number.___Текст_;
									ДатаДок = ПолучитьДатуИзСтроки(стрСтруктуры.date.___Текст_);	
									
									Счет = НайтиДокументПоНомеруИДате(НомерДок, ДатаДок, Организация);
									
									Если ЗначениеЗаполнено(Счет) Тогда 
										
										Продолжить;
										
									Иначе 
										
										нДок = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
										нДок.Организация = Организация;
										нДок.Дата = ДатаДок;
										нДок.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
										нДок.Описание = НомерДок;
										нДок.НомерВходящегоДокумента = НомерДок;
										нДок.Комментарий = "Завантажено із вчасно";
										СуммаДокумента = 0;
										Если стрСтруктуры.Свойство("amount") И стрСтруктуры.amount.Свойство("___Текст_") И стрСтруктуры.amount.___Текст_ <> "" Тогда
											СуммаДокумента = Число(стрСтруктуры.amount.___Текст_)/100;
										КонецЕсли;
										нДок.СуммаДокумента = СуммаДокумента;
										мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
										УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(нДок, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, нДок.РасшифровкаПлатежа);
										//ЦФО = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновноеПодразделение");
										нДок.ФормаОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
										нДок.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Черновик;
										Если стрСтруктуры.Свойство("edrpou_owner") И стрСтруктуры.edrpou_owner.Свойство("___Текст_") И стрСтруктуры.edrpou_owner.___Текст_ <> "" Тогда
											Контрагент = НайтиКонтрагентаПоКодуЕДРПОУ(стрСтруктуры.edrpou_owner.___Текст_);
											Если Контрагент <> Неопределено Тогда
												нДок.Контрагент = Контрагент;	
											КонецЕсли;	
										КонецЕсли;
										Если стрСтруктуры.Свойство("amount") И стрСтруктуры.amount.Свойство("___Текст_") И стрСтруктуры.amount.___Текст_ <> "" Тогда
											нДок.СуммаДокумента = Число(стрСтруктуры.amount.___Текст_)/100;
										КонецЕсли;
										Если нДок.РасшифровкаПлатежа.Количество() > 0 Тогда 
											нДок.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаДокумента;
											нДок.РасшифровкаПлатежа[0].СуммаПлатежа = СуммаДокумента;
											нДок.РасшифровкаПлатежа[0].КратностьВзаиморасчетов = 1;
											нДок.РасшифровкаПлатежа[0].КурсВзаиморасчетов = 1;
										КонецЕсли;	
										
										Попытка
											нДок.Записать(РежимЗаписиДокумента.Запись,);
											Если стрСтруктуры.Свойство("id") 
												И стрСтруктуры.id.Свойство("___Текст_")
												И стрСтруктуры.id.___Текст_ <> "" Тогда
												
												Расширение = "";
												Если стрСтруктуры.Свойство("extension") И стрСтруктуры.extension.Свойство("___Текст_") И стрСтруктуры.extension.___Текст_  <> "" Тогда
													Расширение = стрСтруктуры.extension.___Текст_;
												КонецЕсли;

												//ПолучитьФайлДокумента(стрСтруктуры.id.___Текст_, , нДок.Ссылка);
												ПолучитьФайлДокументаНовый(стрСтруктуры.id.___Текст_, , нДок.Ссылка, Расширение, нДок.Ссылка);
											КонецЕсли;		
										Исключение
										КонецПопытки;	
									КонецЕсли;
								КонецЕсли;
							КонецЕсли
						КонецЦикла;
// н ЛИВ						
					ИначеЕсли ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство("response") И Структура.response.Свойство("documents") И Структура.response.documents.Свойство("document") И ТипЗнч(Структура.response.documents.document) = Тип("Структура") Тогда

						стрСтруктуры = Структура.response.documents.document;
						Если (стрСтруктуры.Свойство("title") И стрСтруктуры.title.Свойство("___Текст_") И Найти(стрСтруктуры.title.___Текст_, "Рахунок") <> 0) 
							ИЛИ  (стрСтруктуры.Свойство("category") И стрСтруктуры.category.Свойство("___Текст_") И стрСтруктуры.category.___Текст_ = "2") Тогда
						
							Если стрСтруктуры.Свойство("status_text") И стрСтруктуры.status_text.Свойство("___Текст_") И стрСтруктуры.status_text.___Текст_ = "Відхилений" Тогда
								Продолжить;
							КонецЕсли;
						
							Если стрСтруктуры.Свойство("number") 
								И стрСтруктуры.number.Свойство("___Текст_")
								И стрСтруктуры.number.___Текст_ <> ""
								И стрСтруктуры.Свойство("date")  
								И стрСтруктуры.date.Свойство("___Текст_") 
								И стрСтруктуры.date.___Текст_ <> "" Тогда
								
								НомерДок = стрСтруктуры.number.___Текст_;
								ДатаДок = ПолучитьДатуИзСтроки(стрСтруктуры.date.___Текст_);	
								
								Счет = НайтиДокументПоНомеруИДате(НомерДок, ДатаДок, Организация);
								
								Если ЗначениеЗаполнено(Счет) Тогда 
									
									Продолжить;
									
								Иначе 
									
									нДок = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
									нДок.Организация = Организация;
									нДок.Дата = ДатаДок;
									нДок.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
									нДок.Описание = НомерДок;
									нДок.НомерВходящегоДокумента = НомерДок;
									нДок.Комментарий = "Завантажено із вчасно";
									СуммаДокумента = 0;
									Если стрСтруктуры.Свойство("amount") И стрСтруктуры.amount.Свойство("___Текст_") И стрСтруктуры.amount.___Текст_ <> "" Тогда
										СуммаДокумента = Число(стрСтруктуры.amount.___Текст_)/100;
									КонецЕсли;
									нДок.СуммаДокумента = СуммаДокумента;
									мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
									УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(нДок, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, нДок.РасшифровкаПлатежа);
									//ЦФО = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновноеПодразделение");
									нДок.ФормаОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
									нДок.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Черновик;
									Если стрСтруктуры.Свойство("edrpou_owner") И стрСтруктуры.edrpou_owner.Свойство("___Текст_") И стрСтруктуры.edrpou_owner.___Текст_ <> "" Тогда
										Контрагент = НайтиКонтрагентаПоКодуЕДРПОУ(стрСтруктуры.edrpou_owner.___Текст_);
										Если Контрагент <> Неопределено Тогда
											нДок.Контрагент = Контрагент;	
										КонецЕсли;	
									КонецЕсли;
									Если стрСтруктуры.Свойство("amount") И стрСтруктуры.amount.Свойство("___Текст_") И стрСтруктуры.amount.___Текст_ <> "" Тогда
										нДок.СуммаДокумента = Число(стрСтруктуры.amount.___Текст_)/100;
									КонецЕсли;
									Если нДок.РасшифровкаПлатежа.Количество() > 0 Тогда 
										нДок.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаДокумента;
										нДок.РасшифровкаПлатежа[0].СуммаПлатежа = СуммаДокумента;
										нДок.РасшифровкаПлатежа[0].КратностьВзаиморасчетов = 1;
										нДок.РасшифровкаПлатежа[0].КурсВзаиморасчетов = 1;
									КонецЕсли;	
									
									Попытка
										нДок.Записать(РежимЗаписиДокумента.Запись,);
										Если стрСтруктуры.Свойство("id") 
											И стрСтруктуры.id.Свойство("___Текст_")
											И стрСтруктуры.id.___Текст_ <> "" Тогда
											
											Расширение = "";
											Если стрСтруктуры.Свойство("extension") И стрСтруктуры.extension.Свойство("___Текст_") И стрСтруктуры.extension.___Текст_  <> "" Тогда
												Расширение = стрСтруктуры.extension.___Текст_;
											КонецЕсли;

											//ПолучитьФайлДокумента(стрСтруктуры.id.___Текст_, , нДок.Ссылка);
											ПолучитьФайлДокументаНовый(стрСтруктуры.id.___Текст_, , нДок.Ссылка, Расширение, нДок.Ссылка);
										КонецЕсли;		
									Исключение
									КонецПопытки;	
								КонецЕсли;
							КонецЕсли;
						КонецЕсли
// к ЛИВ						
					КонецЕсли;
				Исключение
					//ОбщегоНазначения.СообщитьОбОшибке("Неудачная попытка чтения ответа сервиса: "+ОписаниеОшибки(), Отказ);
				КонецПопытки;
			Иначе 
				ОбщегоНазначения.СообщитьОбОшибке("Не найден файл ответа сервиса: "+тмпОтвет, Отказ);
			КонецЕсли;
			
		Иначе
			
			Курсор = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруИзХМЛ(ТекстХМЛ) 
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(ТекстХМЛ);
	
	СтруктураХМЛ = Новый Структура;
	
	РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, СтруктураХМЛ);
	
	ЧтениеХМЛ.Закрыть();
	
	Возврат СтруктураХМЛ;
	
КонецФункции

Процедура РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, ТекущийЭлемент) 
	
	СтруктураАтрибутов = Новый Структура;
	
	ТекущийЭлемент.Вставить("___Атрибуты_", СтруктураАтрибутов);
	
	Пока ЧтениеХМЛ.ПрочитатьАтрибут() Цикл
		СтруктураАтрибутов.Вставить(ЧтениеХМЛ.Имя, ЧтениеХМЛ.Значение);
	КонецЦикла;
	
	Пока ЧтениеХМЛ.Прочитать()
		И ЧтениеХМЛ.ТипУзла <> ТипУзлаXML.КонецЭлемента
		Цикл
		
		Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяЭлемента   = ЧтениеХМЛ.Имя;
			НовыйЭлемент  = Новый Структура;
			СтарыйЭлемент = ИзвлечьСвойствоИзСтруктуры(ТекущийЭлемент, ИмяЭлемента);
			
			Если СтарыйЭлемент = Неопределено Тогда
				ТекущийЭлемент.Вставить(ИмяЭлемента, НовыйЭлемент);
			ИначеЕсли ТипЗнч(СтарыйЭлемент) = Тип("Массив") Тогда
				СтарыйЭлемент.Добавить(НовыйЭлемент);
			Иначе
				МассивЭлементов = Новый Массив;
				МассивЭлементов.Добавить(СтарыйЭлемент);
				МассивЭлементов.Добавить(НовыйЭлемент);
				ТекущийЭлемент.Вставить(ИмяЭлемента, МассивЭлементов);
			КонецЕсли;
			
			РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, НовыйЭлемент);
			
		ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ТекущийЭлемент.Вставить("___Текст_", ЧтениеХМЛ.Значение);
			
			//ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			//Возврат;
			
		КонецЕсли ;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИзвлечьСвойствоИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено, ЗаполнитьПоУмолчаниюЕслиПусто = Ложь) 
	
	ЗначениеСвойства = ЗначениеПоУмолчанию;
	
	Если ИсходнаяСтруктура.Свойство(ИмяСвойства) Тогда
		ЗначениеСвойства = ИсходнаяСтруктура[ИмяСвойства];
	КонецЕсли;
	
	Если ЗаполнитьПоУмолчаниюЕслиПусто И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ЗначениеСвойства = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Функция НайтиДокументПоНомеруИДате(Номер, Дата, Организация)
	
	Рез = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеСредств КАК Док
	|ГДЕ
	|	(Док.Описание ПОДОБНО &Номер
	|			ИЛИ Док.НомерВходящегоДокумента ПОДОБНО &Номер)
	|	И Док.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И Док.Организация = &Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = ВыборкаДетальныеЗаписи.Документ; 
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции	

Функция ВернутьЗаполнитьОКПОорганизации(Организация = Неопределено) 
	
	//_ОКПО = СоответствиеЕДРПОУОрганизаций.Получить(Организация);
	
	ТекЕДРПОУ = Новый Структура;
	
	//спПоказателей = Новый СписокЗначений;
	//спПоказателей.Добавить("КодПоЕДРПОУ","КодПоЕДРПОУ");
	//структураПоказателей = РегламентированнаяОтчетность.ПолучитьСведенияОбОрганизации(Организация,ТекущаяДата(),спПоказателей);
	//структураПоказателей.Свойство("КодПоЕДРПОУ",ТекЕДРПОУ);
	//СоответствиеЕДРПОУОрганизаций.Вставить(Организация, ТекЕДРПОУ);
	
	Возврат ТекЕДРПОУ;
	
КонецФункции // ВернутьОКПОорганизации()

Функция НайтиКонтрагентаПоКодуЕДРПОУ(КодЕДРПОУКонтрагента)
	
	Рез = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.КодПоЕДРПОУ = &КодПоЕДРПОУ
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("КодПоЕДРПОУ", КодЕДРПОУКонтрагента);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = ВыборкаДетальныеЗаписи.Контрагент; 
	КонецЦикла;
	
	Если Рез = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодПоЕДРПОУ = &КодПоЕДРПОУ";
		Запрос.УстановитьПараметр("КодПоЕДРПОУ", КодЕДРПОУКонтрагента);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Рез = ВыборкаДетальныеЗаписи.Контрагент; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(Стр)
	
	Результат = СокрЛП(Стр);
	
	Поз = Найти(Результат, ".");
	Если Поз>0 Тогда
		Результат = Лев(Результат, Поз-1);
	КонецЕсли;
	Поз = Найти(Результат, "+");
	Если Поз>0 Тогда
		Результат = Лев(Результат, Поз-1);
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "-", "");
	Результат = СтрЗаменить(Результат, ":", "");
	Результат = СтрЗаменить(Результат, "T", "");
	
	Попытка
		Результат = Дата(Результат);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура ПолучитьФайлДокумента(url, ИмяПараметра=Неопределено, ЗаявкаНаРасходованиеСредств) 
	
	ИмяПараметра = "original_url";
	//url = "6702ef1c-7598-44af-82c9-7fd37ae54894";
	//Если СоответствиеСтрокСИД.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ИмяПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Токен = Справочники.НастройкиПодключенияКAPI.НайтиПоНаименованию("Вчасно Токен").Пароль;
	Прокси = Неопределено;
	Хост						 = "edo.vchasno.ua";
	НТТРВчасно = Новый HTTPСоединение(Хост,,,,Прокси,60,Новый ЗащищенноеСоединениеOpenSSL());  	// #106 
	ПространствоИменИсходящих	 = "/api/v1/documents";
	ПространствоИменВходящих	 = "/api/v1/incoming-documents";
	ПространствоИменДокументов	 = "/api/v2/documents";
	ПространствоИменЗагрузки	 = "/api/v2/download-documents";
	ПространствоИмен = ПространствоИменВходящих;
	ПространствоИмен = СтрЗаменить(ПространствоИмен, "/v1/", "/v2/"); // теперь так...
	
	ПространствоИмен = ПространствоИменЗагрузки;
	
	Текст = Новый ТекстовыйДокумент;
	
	ЗаголовокHTTP = Новый Соответствие(); 
	
	ЗаголовокHTTP.Вставить("Authorization", "Token " + СокрЛП(Токен));
	ЗаголовокHTTP.Вставить("Vendor"		  , "Mastakov");
	//ЗаголовокHTTP.Вставить("content-type", "application/xml"); //???
	ЗаголовокHTTP.Вставить("Accept", "application/xml");
	
	ПараметрыЗапросаСтатусов = "?";
	
	//Для Каждого Эл Из СоответствиеСтрокСИД Цикл
	//	
	//	ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + "ids="+Эл.Ключ+"&";
	//	          /api/v2/download-documents?ids=b170de83-1f29-45ba-b5c6-073d0507c848
	//КонецЦикла;
	ПараметрыЗапросаСтатусов = ПараметрыЗапросаСтатусов + "ids="+url+"&";
	
	ПараметрыЗапросаСтатусов = Лев(ПараметрыЗапросаСтатусов, СтрДлина(ПараметрыЗапросаСтатусов)-1);
	
	Отказ = Ложь;
	
	ЗапросHTTP = Новый HTTPЗапрос(ПространствоИмен+ПараметрыЗапросаСтатусов, ЗаголовокHTTP);
	
	//Если РежимОтладки Тогда
	//	Сообщить("Запрос ссылок по "+ИмяПараметра+" ["+ТекущаяДата()+"]: "+ПространствоИмен+ПараметрыЗапросаСтатусов); // отладка				
	//КонецЕсли;
	//Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
	тмпОтвет = ПолучитьИмяВременногоФайла("txt");
	ОтветHTTP = НТТРВчасно.Получить(ЗапросHTTP, тмпОтвет);
	КодОтвета = ОтветHTTP.КодСостояния;
	Текст.Прочитать(тмпОтвет);
	
	ФайлОтвета = Новый Файл(тмпОтвет);
	Если ФайлОтвета.Существует() Тогда
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(тмпОтвет,КодировкаТекста.UTF8);
		Если ТекстОтвета.КоличествоСтрок() > 0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		КонецЕсли;	
		
		_ЧтениеXML = Новый ЧтениеXML;
		
		Попытка
			_ЧтениеXML.УстановитьСтроку(ОтветСервера);
			
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Неудачная попытка чтения ответа сервиса: "+ОписаниеОшибки(), Отказ);
		КонецПопытки;
		
	Иначе 
		ОбщегоНазначения.СообщитьОбОшибке("Не найден файл ответа сервиса: "+тмпОтвет, Отказ);
	КонецЕсли;

	Если КодОтвета < 300 Тогда // корректный код возврата  	
		
		Попытка
			УдалитьФайлы(КаталогВременныхФайлов(), тмпОтвет);
		Исключение
			
		КонецПопытки;
		
		Попытка
			
			ЗаполнитьСсылкиНаФайлыВСтроках(url, _ЧтениеXML, ИмяПараметра, ЗаявкаНаРасходованиеСредств);	
			
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Неудачная попытка чтения ответа сервиса: "+ОписаниеОшибки(), Отказ);
		КонецПопытки;
		
	Иначе
		
		Поз = Найти(Лев(ОтветСервера, 5), "xml");
		Если Поз = 0 Тогда
			//ОбщегоНазначения.СообщитьОбОшибке("Неудачная попытка разбора ответа сервиса (Код состояния = "+КодОтвета+"): ", Отказ);
			//ОбщегоНазначения.СообщитьОбОшибке(ОтветСервера);
			РезультатЗапроса = Ложь;
		Иначе
			//ОбработатьОписаниеОшибки(_ЧтениеXML, КодОтвета);
		КонецЕсли;
		
		Курсор = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиНаФайлыВСтроках(url, _ЧтениеXML, ИмяПараметра, ЗаявкаНаРасходованиеСредств)

	Отказ = Ложь;	
	
	МассивСсылокДокумента = Новый Массив;
	
	НаборПараметровОтвета = Новый Структура("id, extension, archive_url, original_url, pdf_url, xml_to_pdf_url, status");
	
	ПостроительД = Новый ПостроительDOM;
	Содержимое	 = ПостроительД.Прочитать(_ЧтениеXML);
	УзелЗаголовка = Содержимое.ПервыйДочерний;
	Если УзелЗаголовка = Неопределено Тогда
		//ОбщегоНазначения.СообщитьОбОшибке("Не обнаружены узлы в ответе сервиса", Отказ);
	ИначеЕсли УзелЗаголовка.ИмяУзла <> "response" Тогда
		//ОбщегоНазначения.СообщитьОбОшибке("Не обнаружен узел заголовка ответа в ответе сервиса", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УзелДокументов = Неопределено;
	
	КоличествоГотовых 	= 0;
	КоличествоВсего 	= 0;
	
	Для Каждого ДочернийУзел Из УзелЗаголовка.ДочерниеУзлы Цикл
		тИмяУзла = ДочернийУзел.ИмяУзла;
		Если тИмяУзла = "documents" Тогда
			УзелДокументов = ДочернийУзел;
		ИначеЕсли тИмяУзла = "ready" Тогда
			Если ЗначениеЗаполнено(ДочернийУзел.ТекстовоеСодержимое) Тогда
				КоличествоГотовых = Число(ДочернийУзел.ТекстовоеСодержимое);
			КонецЕсли;
		ИначеЕсли тИмяУзла = "total" Тогда
			Если ЗначениеЗаполнено(ДочернийУзел.ТекстовоеСодержимое) Тогда
				КоличествоВсего = Число(ДочернийУзел.ТекстовоеСодержимое);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если УзелДокументов = Неопределено Тогда
		//ОбщегоНазначения.СообщитьОбОшибке("Не обнаружены узлы в заголове ответа сервиса", Отказ);
	//ИначеЕсли КоличествоВсего = 0 ИЛИ КоличествоГотовых = 0 Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Не обнаружено готовых ссылок", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Узел из УзелДокументов.ДочерниеУзлы Цикл	
		Если Узел.ИмяУзла = "document" Тогда
			СтруктураСсылокДокумента = Новый Структура;
			ПараметрыДокумента = Узел.ДочерниеУзлы;
			Для Каждого ПараметрДокумента Из ПараметрыДокумента Цикл
				Если НаборПараметровОтвета.Свойство(ПараметрДокумента.ИмяУзла) Тогда
					СтруктураСсылокДокумента.Вставить(ПараметрДокумента.ИмяУзла, ПараметрДокумента.ТекстовоеСодержимое);
				Иначе 
					//ОбщегоНазначения.СообщитьОбОшибке("Получен неожиданный параметр: "+ПараметрДокумента.ИмяУзла);
				КонецЕсли;
			КонецЦикла;
			МассивСсылокДокумента.Добавить(СтруктураСсылокДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСсылокДокумента.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтоТекст = Истина;
	
	Если ИмяПараметра = "xml_to_pdf_url" Тогда
		СуффиксЗапроса = "xml-to-pdf";
		ИмяКолонки = "СсылкаНаПДФ";
		ЭтоТекст = Ложь;
	ИначеЕсли ИмяПараметра = "archive_url" Тогда
		СуффиксЗапроса = "archive";
		ИмяКолонки = "СсылкаНаАрхив";
		ЭтоТекст = Ложь;
	ИначеЕсли ИмяПараметра = "original_url" Тогда
		СуффиксЗапроса = "original";
		ИмяКолонки = "СсылкаНаОригиналДокумента";
		ЭтоТекст = Ложь;
	ИначеЕсли ИмяПараметра = "pdf/print_url" Тогда
		ИмяПараметра = "original_url";
		СуффиксЗапроса = "pdf/print";
		ИмяКолонки = "СсылкаНаПДФ";
		ЭтоТекст = Ложь;
	Иначе // ??
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из МассивСсылокДокумента Цикл
		тИДВчасно = Эл.id;
		Если НЕ ЗначениеЗаполнено(тИДВчасно) Тогда
			Продолжить;
		КонецЕсли;
		
		//тСтатус = Эл.status; // ??
		
		тСсылкаНаФайл = Эл[ИмяПараметра];
		
		Если ЗначениеЗаполнено(тСсылкаНаФайл) Тогда
			
			////СтрокаТЧ = СоответствиеСтрокСИД.Получить(тИДВчасно);
			
			////Если СтрокаТЧ = Неопределено Тогда
				//ОбщегоНазначения.СообщитьОбОшибке("Не найдена строка ТЧ по ИДВчасно = '"+тИДВчасно+"'");
			////Иначе 
				
				//ИмяЗагруженногоФайла = ПолучитьОригиналДокумента(ПространствоИменДокументов, тИДВчасно, КаталогЗагруженныхФайлов, СуффиксЗапроса, ЭтоТекст);
				ПространствоИменДокументов	 = "/api/v2/documents";
				КаталогЗагруженныхФайлов = "C:\VR\Vchasno\";
				ИмяЗагруженногоФайла = ПолучитьОригиналДокумента(ПространствоИменДокументов, тИДВчасно, КаталогЗагруженныхФайлов, СуффиксЗапроса, ЭтоТекст, ЗаявкаНаРасходованиеСредств);
				
				Если ЗначениеЗаполнено(ИмяЗагруженногоФайла) Тогда
					Сообщить("Успешно получен по ИДВчасно '"+тИДВчасно+"' файл: "+ИмяЗагруженногоФайла, СтатусСообщения.Информация);
					Если ЗначениеЗаполнено(ИмяКолонки) Тогда
						Если ИмяПараметра = "archive_url" Тогда
							////СтрокаТЧ[ИмяКолонки] = тСсылкаНаФайл;
						Иначе
							////СтрокаТЧ[ИмяКолонки] = ИмяЗагруженногоФайла;
						КонецЕсли;
						//СтрокаТЧ.Пометка = Истина; // отмечаем для обновления только по отмеченным (ниже)
					КонецЕсли;
				КонецЕсли;
				
				////СоответствиеСтрокСИД.Удалить(тИДВчасно);
				
			////КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОригиналДокумента(ПространствоИмен, ИДВчасно, КаталогДляСохранения, СуффиксЗапроса="original", ЭтоТекст=Истина, ЗаявкаНаРасходованиеСредств) Экспорт
	
	Результат = Неопределено;
	
	Отказ = Ложь;
	
	Токен = Справочники.НастройкиПодключенияКAPI.НайтиПоНаименованию("Вчасно Токен").Пароль;
	Прокси = Неопределено;
	Хост						 = "edo.vchasno.ua";
	НТТРВчасно = Новый HTTPСоединение(Хост,,,,Прокси,60,Новый ЗащищенноеСоединениеOpenSSL());  	// #106 
	ПространствоИменИсходящих	 = "/api/v1/documents";
	ПространствоИменВходящих	 = "/api/v1/incoming-documents";
	ПространствоИменДокументов	 = "/api/v2/documents";
	ПространствоИменЗагрузки	 = "/api/v2/download-documents";
	//ПространствоИмен = ПространствоИменВходящих;
	//ПространствоИмен = СтрЗаменить(ПространствоИмен, "/v1/", "/v2/"); // теперь так...
	
	Текст = Новый ТекстовыйДокумент;
	
	ЗаголовокHTTP = Новый Соответствие(); 
	
	ЗаголовокHTTP.Вставить("Authorization", "Token " + СокрЛП(Токен));
	ЗаголовокHTTP.Вставить("Vendor"		  , "Mastakov");
	
	ПараметрыЗапросаСтатусов = "/"+ИДВчасно+"/"+СуффиксЗапроса;
	
	ЗапросHTTP = Новый HTTPЗапрос(ПространствоИмен+ПараметрыЗапросаСтатусов, ЗаголовокHTTP);
	
	//Если РежимОтладки Тогда
	//	Сообщить("Запрос файла по ссылке ["+ТекущаяДата()+"]: "+ПространствоИмен+ПараметрыЗапросаСтатусов); // отладка					
	//КонецЕсли;
	
	тмпОтвет = ПолучитьИмяВременногоФайла("xml");
	
	ОтветHTTP = НТТРВчасно.Получить(ЗапросHTTP, тмпОтвет);
	
	КодОтвета = ОтветHTTP.КодСостояния;
	
	ФайлОтвета = Новый Файл(тмпОтвет);
	
	Если ФайлОтвета.Существует() Тогда
		
		Текст.Прочитать(тмпОтвет);
		
		Если КодОтвета < 300 Тогда // корректный код возврата  	
		
			Если Текст.КоличествоСтрок() > 0 Тогда
				тИмяФайла = "";
				Если ОтветHTTP.Заголовки.Получить("content-disposition") <> Неопределено Тогда
					тИмяФайла = ОтветHTTP.Заголовки["content-disposition"];
					Поз = Найти(тИмяФайла, Символ(34));
					Если Поз > 0 Тогда
						тИмяФайла = Сред(тИмяФайла, Поз+1);
						Поз = Найти(тИмяФайла, Символ(34));
						Если Поз > 0 Тогда
							тИмяФайла = Лев(тИмяФайла, Поз-1);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если тИмяФайла = "" Тогда
					тИмяФайла = тмпОтвет;
					Поз = Найти(тИмяФайла, "\");
					Пока Поз > 0 Цикл
						тИмяФайла = Сред(тИмяФайла, Поз+1);
						Поз = Найти(тИмяФайла, "\");
					КонецЦикла;
				КонецЕсли;
				
				тИмя = тИмяФайла;
				тИмяФайла = КаталогДляСохранения + тИмяФайла;
				
				Если ЭтоТекст Тогда
					Попытка
						//Текст.Записать(тИмяФайла, КодировкаТекста.ANSI , );
					Исключение
						//Сообщить("Неудачная попытка получения файла "+тИмяФайла+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
					КонецПопытки;
				Иначе
					Попытка
						//ПереместитьФайл(тмпОтвет, тИмяФайла);
						
						ПрисоединенныйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();

						ПрисоединенныйФайл.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
						ПрисоединенныйФайл.ИмяФайла = тИмя;
						ПрисоединенныйФайл.Наименование = тИмя;
						ПрисоединенныйФайл.Объект = ЗаявкаНаРасходованиеСредств;
						ДФайл = Новый ДвоичныеДанные(тмпОтвет);
						ПрисоединенныйФайл.Хранилище = Новый ХранилищеЗначения(ДФайл, Новый СжатиеДанных);
						Попытка
							ПрисоединенныйФайл.Записать();
						Исключение
						КонецПопытки;
						
					Исключение
						//Сообщить("Неудачная попытка получения файла "+тИмяФайла+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
					КонецПопытки;
				КонецЕсли;
				// проверка
				_Файл = Новый Файл(тИмяФайла);
				Если _Файл.Существует() И _Файл.ЭтоФайл() Тогда
					Результат = тИмяФайла;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Результат) Тогда
					//Сообщить("Не найден полученный файл "+тИмяФайла, СтатусСообщения.Внимание);
				КонецЕсли;
				
			Иначе 
				//Сообщить("Получения пустой ответ по ИДВчасно: "+ИДВчасно, СтатусСообщения.Внимание);
			КонецЕсли;
		Иначе
			
			ТекстОтвета = Новый ТекстовыйДокумент();
			ТекстОтвета.Прочитать(тмпОтвет,КодировкаТекста.UTF8);
			Если ТекстОтвета.КоличествоСтрок() > 0 Тогда
				ОтветСервера = ТекстОтвета.ПолучитьТекст();	
			КонецЕсли;	
			
			_ЧтениеXML = Новый ЧтениеXML;
			
			Попытка
				_ЧтениеXML.УстановитьСтроку(ОтветСервера);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Неудачная попытка чтения ответа сервиса: "+ОписаниеОшибки(), Отказ);
			КонецПопытки;
			
			Если НЕ Отказ Тогда
			
				Поз = Найти(Лев(ОтветСервера, 5), "xml");
				Если Поз = 0 Тогда
					//ОбщегоНазначения.СообщитьОбОшибке("Неудачная попытка разбора ответа сервиса (Код состояния = "+КодОтвета+"): ", Отказ);
					//ОбщегоНазначения.СообщитьОбОшибке(ОтветСервера);
				Иначе
					//ОбработатьОписаниеОшибки(_ЧтениеXML, КодОтвета);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Не найден файл ответа сервиса: "+тмпОтвет);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьФайлДокументаНовый(url, ИмяПараметра=Неопределено, ЗаявкаНаРасходованиеСредств, Расширение, Заявка) 
	
	Токен = Справочники.НастройкиПодключенияКAPI.НайтиПоНаименованию("Вчасно Токен").Пароль;

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", Токен);

	//Ответ = "C:\VR\Vchasno\";
	Ответ = "";
	мСерверЕДО = "edo.vchasno.ua";
	тИДВчасно = url;
	ФайлСохранен = Ложь; 			
	Если Расширение = ".pdf" Тогда
		ФайлСохранен = HTTP("GET", "https", мСерверЕДО, , "/api/v2/documents/" + тИДВчасно + "/pdf/print", Заголовки, , , Ответ, "", Заявка);
	ИначеЕсли Расширение = ".xml" Тогда
		Запрос = Новый Соответствие;
		Запрос.Вставить("force", Истина);
		ФайлСохранен = HTTP("POST", "https", мСерверЕДО, , "/api/v2/documents/" + тИДВчасно + "/xml-to-pdf", Заголовки, "JSON", Запрос, Ответ, "", Заявка);
	КонецЕсли;		
	
	Если Не ФайлСохранен Тогда
		ФайлСохранен = HTTP("GET", "https", мСерверЕДО, , "/api/v2/documents/" + тИДВчасно + "/original", Заголовки, , , Ответ, "", Заявка);
	КонецЕсли;
				
КонецПроцедуры

Функция HTTP(Метод, Схема, Сервер, Порт = Неопределено, АдресРесурса, ЗаголовкиЗапроса = Неопределено, ТипЗапроса = Неопределено, Запрос = Неопределено, Ответ, ПолеСообщения = "", Заявка) Экспорт

	мСчетчикЗапросов = 1;	
	Результат = Истина;                       
	
	Если Порт = Неопределено Тогда
		Порт = ?(Схема = "http", 80, 443);
	КонецЕсли;
	
	Прокси = Неопределено;
	HTTPСоединение = Новый HTTPСоединение(Сервер, Порт, , , Прокси, , ?(Схема = "http", Неопределено, Новый ЗащищенноеСоединениеOpenSSL));
	URL = Метод + ": " + Схема + "://" + Сервер + ":" + Порт + АдресРесурса;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ?(ЗаголовкиЗапроса = Неопределено, Новый Соответствие, ЗаголовкиЗапроса));
	
	Если ТипЗапроса = "form-data" Тогда
		Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
		
		Файл = Новый Файл(Запрос);
		
		Поток = Новый ПотокВПамяти;
		ЗаписьДанных = Новый ЗаписьДанных(Поток, , , Символы.ВК + Символы.ПС, "");
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename=""" + Файл.Имя + """");
		ЗаписьДанных.ЗаписатьСтроку("Content-Type: application/pdf");
		ЗаписьДанных.ЗаписатьСтроку("");
		ЗаписьДанных.Записать(Новый ДвоичныеДанные(Запрос)); 
		ЗаписьДанных.ЗаписатьСтроку("");
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");
		ЗаписьДанных.Закрыть();
		
		Данные = Поток.ЗакрытьИПолучитьДвоичныеДанные();	
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(Данные);
	ИначеЕсли ТипЗапроса = "Text" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "text/plain");
	ИначеЕсли ТипЗапроса = "JavaScript" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/javascript");
	ИначеЕсли ТипЗапроса = "JSON" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Запрос);
		
		ТелоЗапросаКакСтрока = ЗаписьJSON.Закрыть();
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаКакСтрока, , ИспользованиеByteOrderMark.НеИспользовать);		
	ИначеЕсли ТипЗапроса = "HTML" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "text/html");
	ИначеЕсли ТипЗапроса = "XML" Тогда
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/xml");
	КонецЕсли;
	
	Попытка
		Если Метод = "GET" Тогда
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли Метод = "POST" Тогда
			HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли Метод = "PUT" Тогда
			HTTPОтвет = HTTPСоединение.Записать(HTTPЗапрос);
		ИначеЕсли Метод = "PATCH" Тогда
			HTTPОтвет = HTTPСоединение.Изменить(HTTPЗапрос);
		ИначеЕсли Метод = "DELETE" Тогда
			HTTPОтвет = HTTPСоединение.Удалить(HTTPЗапрос);
		ИначеЕсли Метод = "HEAD" Тогда
			HTTPОтвет = HTTPСоединение.ПолучитьЗаголовки(HTTPЗапрос);
		Иначе
			HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(Метод, HTTPЗапрос);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		Ответ = ОписаниеОшибки();		
	КонецПопытки;
	
	Если Результат Тогда
		
		ЗаголовкиОтвета = Новый Соответствие;
		Для Каждого ЗаголовокОтвета Из HTTPОтвет.Заголовки Цикл
			ЗаголовкиОтвета.Вставить(НРег(ЗаголовокОтвета.Ключ), ЗаголовокОтвета.Значение);
		КонецЦикла;
		
		Если HTTPОтвет.КодСостояния >= 200 И HTTPОтвет.КодСостояния < 299 Тогда
			Если ЗаголовкиОтвета["content-disposition"] <> Неопределено И Найти(ЗаголовкиОтвета["content-disposition"], "Attachment") Тогда
				Ответ = Ответ + "-";
				
				ИмяФайла = ЗаголовкиОтвета["content-disposition"];
				ИмяФайла = СтрЗаменить(ИмяФайла, "Attachment; filename=", "");
				ИмяФайла = СтрЗаменить(ИмяФайла, """", "");
				ИмяФайла = Прав(ИмяФайла, 255 - СтрДлина(Ответ));
				
				Ответ = Ответ + ИмяФайла;
				
				//HTTPОтвет.ПолучитьТелоКакДвоичныеДанные().Записать(Ответ);
				
				Попытка
					ПрисоединенныйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
					ПрисоединенныйФайл.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
					ПрисоединенныйФайл.ИмяФайла = ИмяФайла;
					ПрисоединенныйФайл.Наименование = ИмяФайла;
					ПрисоединенныйФайл.Объект = Заявка;
					ДФайл = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
					//ДФайл = Новый ДвоичныеДанные(тмпОтвет);
					ПрисоединенныйФайл.Хранилище = Новый ХранилищеЗначения(ДФайл, Новый СжатиеДанных);
					Попытка
						ПрисоединенныйФайл.Записать();
					Исключение
					КонецПопытки;
					
				Исключение
					//Сообщить("Неудачная попытка получения файла "+тИмяФайла+" : "+ОписаниеОшибки(), СтатусСообщения.Внимание);
				КонецПопытки;
				
			ИначеЕсли Найти(ЗаголовкиОтвета["content-type"], "application/json") Тогда
				ТелоОтветаКакСтрока = HTTPОтвет.ПолучитьТелоКакСтроку();
				Если ПустаяСтрока(ТелоОтветаКакСтрока) Тогда
					ТелоОтветаКакСтрока = "{}";
				КонецЕсли;
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТелоОтветаКакСтрока);
				
				Ответ = ПрочитатьJSON(ЧтениеJSON, Истина);
			КонецЕсли; 	
		ИначеЕсли HTTPОтвет.КодСостояния >= 300 И HTTPОтвет.КодСостояния < 399 Тогда
			Перенаправление = ЗаголовкиОтвета["location"];
			Разделитель = Найти(Перенаправление, "://");
			Схема = Лев(Перенаправление, Разделитель - 1);
			
			Перенаправление = Сред(Перенаправление, Разделитель + 3);
			Разделитель = Найти(Перенаправление, "/");
			АдресРесурса = Сред(Перенаправление, Разделитель);
			
			Перенаправление = Лев(Перенаправление, Разделитель - 1);
			Разделитель = Найти(Перенаправление, ":");
			Если Разделитель Тогда
				Сервер = Лев(Перенаправление, Разделитель - 1);
				Порт = +Сред(Перенаправление, Разделитель + 1);
			Иначе
				Сервер = Перенаправление;
				Порт = Неопределено;
			КонецЕсли;
			
			Возврат HTTP(Метод, Схема, Сервер, Порт, АдресРесурса, ЗаголовкиЗапроса, ТипЗапроса, Запрос, Ответ, ПолеСообщения, Заявка);		
		Иначе
			Результат = Ложь;
			
			Если Найти(ЗаголовкиОтвета["content-type"], "application/json") Тогда
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
				
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				
				ЗаписатьJSON(ЗаписьJSON, ПрочитатьJSON(ЧтениеJSON, Истина));
				Ответ = ЗаписьJSON.Закрыть();
			Иначе
				Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// medoc

Процедура ЗагрузитьСчетаИзMedoc(Организация) 
	
	//Организация = Справочники.Организации.НайтиПоКоду("000000000", Истина);
	КодЯзыкаПечать  =  Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),  "РежимФормированияПечатныхФорм"));
	СведенияОПоставщике  =  УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация,  ТекущаяДата(), , , КодЯзыкаПечать);
	Если Организация.ЮрФизЛицо  =  Перечисления.ЮрФизЛицо.ЮрЛицо Тогда			
		Если ЗначениеЗаполнено(СведенияОПоставщике.КодПоЕДРПОУ) Тогда
			КодПоЕДРПОУ  =  СокрЛП(СведенияОПоставщике.КодПоЕДРПОУ);
		КонецЕсли;
	КонецЕсли;	
	ДанныеДляОбработки = Новый Структура;
	ДанныеДляОбработки.Вставить("edrpou", КодПоЕДРПОУ);	
	ДанныеДляОбработки.Вставить("ТекущаяЗадача", "GetOrgCode");
	НастройкиАПИ = Справочники.НастройкиПодключенияКAPI.НайтиПоНаименованию("medoc");
	Сервер = НастройкиАПИ.Адрес;
	Если Найти(Сервер, "https") > 0 Тогда
		Протокол = "https";
	Иначе 
		Протокол = "http";
	КонецЕсли;
	Сервер = СтрЗаменить(Сервер, Протокол, ""); 
	Сервер = СтрЗаменить(Сервер, "://", "");
	Порт = 63777;
	Если НастройкиАПИ.ДопСвойства.Количество() > 0 Тогда
		Порт = Число(НастройкиАПИ.ДопСвойства[0].ДопСвойство);
	КонецЕсли;
	
	ИдОрг = "781";
	ЗащищенноеСоединение = Ложь;
	Таймаут              = 7;
	
	Если (Протокол = "https" Или Протокол = "ftps") И ЗащищенноеСоединение = Неопределено Тогда
		ЗащищенноеСоединение = Истина;
	КонецЕсли;
	
	ДанныеДляОбработки.Вставить("Протокол", СокрЛП(Протокол));
	ДанныеДляОбработки.Вставить("Сервер", СокрЛП(Сервер));
	ДанныеДляОбработки.Вставить("Порт", Порт); 
	
	//orgId = ПереходНаМодульОбъектаСервер( ДанныеДляОбработки );
	orgId = ОтправкаЗапроса( ДанныеДляОбработки, "");
	ДанныеДляОбработки.Вставить("idOrg", orgId);  
	//НачПериода = ТекущаяДата();
	НачПериода = ТекущаяДата() - 60*60*24*20;
	КонПериода = ТекущаяДата();	
	ДанныеДляОбработки.ТекущаяЗадача = "GetPrimaryReestr";
	ДанныеДляОбработки.Вставить("dateFrom", Формат(НачПериода,"ДФ=yyyy/MM/dd"));  
	ДанныеДляОбработки.Вставить("dateEnd", Формат(КонПериода,"ДФ=yyyy/MM/dd"));  
	
	ТекРеестрВходящиеДок = ОтправкаЗапроса(ДанныеДляОбработки, "");
	
	ТЗЗаявки = Новый ТаблицаЗначений;
	ТЗЗаявки.Колонки.Добавить("Документ");
	ТЗЗаявки.Колонки.Добавить("Код");
	
	Для каждого ТекЗнач Из ТекРеестрВходящиеДок Цикл

		Если ТекЗнач.doc_type <> 10103 Тогда 
			Продолжить;
		КонецЕсли;
		
		НомерДок = СокрЛП(ТекЗнач.doc_num);
		ДатаДок = Дата(СокрЛП(ТекЗнач.doc_date));	
		Счет = НайтиДокументПоНомеруИДате(НомерДок, ДатаДок, Организация);
		Если ЗначениеЗаполнено(Счет) Тогда 
			Продолжить;
		КонецЕсли; 
		
		нДок = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
		нДок.Организация = Организация;
		нДок.Дата = ДатаДок;
		нДок.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		нДок.Описание = НомерДок;
		нДок.НомерВходящегоДокумента = НомерДок;
		нДок.Комментарий = "Завантажено із medoc";
		СуммаДокумента = ТекЗнач.docsum;
		нДок.СуммаДокумента = СуммаДокумента;
		мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(нДок, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, нДок.РасшифровкаПлатежа);
		//ЦФО = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновноеПодразделение");
		нДок.ФормаОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
		нДок.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Черновик;
		Если ТекЗнач.partner_edrpou <> "" Тогда
			Контрагент = НайтиКонтрагентаПоКодуЕДРПОУ(ТекЗнач.partner_edrpou);
			Если Контрагент <> Неопределено Тогда
				нДок.Контрагент = Контрагент;	
			КонецЕсли;	
		КонецЕсли;
		Если нДок.РасшифровкаПлатежа.Количество() > 0 Тогда 
			нДок.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаДокумента;
			нДок.РасшифровкаПлатежа[0].СуммаПлатежа = СуммаДокумента;
			нДок.РасшифровкаПлатежа[0].КратностьВзаиморасчетов = 1;
			нДок.РасшифровкаПлатежа[0].КурсВзаиморасчетов = 1;
		КонецЕсли;	
		
		Попытка
			нДок.Записать(РежимЗаписиДокумента.Запись,);
            нстр = ТЗЗаявки.Добавить();
			нстр.Документ = нДок.Ссылка;
			нстр.Код = СокрЛП(ТекЗнач.cardcode);
		Исключение
			ЗаписьЖурналаРегистрации( НСтр("ru = 'Документ не записан medoc';uk = 'Документ не записаний medoc'") );
		КонецПопытки;	
		
	КонецЦикла;
		
	ДанныеДляОбработки.ТекущаяЗадача = "PrintDocPDF";

	Для Каждого стр Из ТЗЗаявки Цикл
		
		ОтветСтруктура = ОтправкаЗапроса(ДанныеДляОбработки, СтрЗаменить(строка(стр.Код),Символы.НПП,""));
		
		Для Каждого ТекОтветСтруктура Из ОтветСтруктура Цикл

			Если ТекОтветСтруктура.Свойство("FileName") И ТекОтветСтруктура.Свойство("File") Тогда
				
				СтрокаBase64 = ТекОтветСтруктура.File; 
				ДвоичныеДанные = Base64Значение(СтрокаBase64);
				ИмяФайла = ТекОтветСтруктура.FileName;
				ПрисоединенныйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				ПрисоединенныйФайл.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
				ПрисоединенныйФайл.ИмяФайла = ИмяФайла;
				ПрисоединенныйФайл.Наименование = ИмяФайла;
				ПрисоединенныйФайл.Объект = стр.Документ;
				ПрисоединенныйФайл.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных);
				Попытка
					ПрисоединенныйФайл.Записать();
				Исключение
				КонецПопытки;
				
			КонецЕсли;	

		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправкаЗапроса(ДанныеДляОбработки, КардКод)   
	
	НастройкиПрокси = Неопределено;
	ЗащищенноеСоединение = Ложь;
	Протокол = ДанныеДляОбработки.Протокол; 
	Сервер = ДанныеДляОбработки.Сервер; 
	Порт = ДанныеДляОбработки.Порт;
	ЗащищенноеСоединение = Ложь;
	Таймаут              = 7;
	
	Если (Протокол = "https" Или Протокол = "ftps") И ЗащищенноеСоединение = Неопределено Тогда
		ЗащищенноеСоединение = Истина;
	КонецЕсли;
	
	Если ЗащищенноеСоединение = Истина Тогда
		//ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	ИначеЕсли ЗащищенноеСоединение = Ложь Тогда
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Прокси = Неопределено;
	Попытка	  
		Соединение = Новый HTTPСоединение(
		Сервер, 
		Порт, 
		"", 
		"",
		Прокси, 
		Таймаут, 
		ЗащищенноеСоединение);
	Исключение  
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'"));
		Возврат Ложь;
	КонецПопытки;   
	
	Попытка
		
		Если ДанныеДляОбработки.ТекущаяЗадача = "PrintDocPDF" Тогда // Отримання документа в PDF форматі 
			
			//ПутьНаСервере = "/api/Info/PrintDocPDF?cardCode="+ДанныеДляОбработки.cardCode; 
			//ПутьНаСервере = "/api/Info/PrintDocPDF?cardCode=162849"; 
			ПутьНаСервере = "/api/Info/PrintDocPDF?cardCode="+КардКод; 
			
			ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
			Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
			
			Если Ответ.КодСостояния = 200 Тогда 
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
				
				ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
				
				//Для Каждого ТекОтветСтруктура Из ОтветСтруктура Цикл
					
					//Если ТекОтветСтруктура.Свойство("FileName") И ТекОтветСтруктура.Свойство("File") Тогда
						
						//СтрокаBase64 = ТекОтветСтруктура.File; // Ваша строка Base64
						//ДвоичныеДанные = Base64Значение(СтрокаBase64);
						//
						////ИмяФайла = "C:\Users\Public\Документы\Файл.pdf"; // Укажите путь к файлу
						//ПутьКФайлу = "C:\VR\IL\Medoc\мой_файл.pdf";
						//ИмяФайла = ТекОтветСтруктура.FileName;
						//ПрисоединенныйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
						//ПрисоединенныйФайл.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
						//ПрисоединенныйФайл.ИмяФайла = ИмяФайла;
						//ПрисоединенныйФайл.Наименование = ИмяФайла;
						//ПрисоединенныйФайл.Объект = Справочники.Номенклатура.НайтиПоКоду("000063992");
						//ПрисоединенныйФайл.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных);
						//Попытка
						//	ПрисоединенныйФайл.Записать();
						//Исключение
						//КонецПопытки;
						
					//КонецЕсли;	
					//КонецЕсли;
					
					//Файл.
					
					
					//Если Не ТекОтветСтруктура.Attachment Тогда
					//	 Возврат ТекОтветСтруктура;
					//	Прервать;
					//КонецЕсли;	
					
				//КонецЦикла;
				
				Возврат ОтветСтруктура;
				
			Иначе
				//СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
				Возврат Неопределено;
			КонецЕсли; 
			
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			
	////			Для Каждого ТекОтветСтруктура Из ОтветСтруктура Цикл 
	////				Если Не ТекОтветСтруктура.Attachment Тогда
	////					 Возврат ТекОтветСтруктура;
	////					Прервать;
	////				КонецЕсли;	
	////				
	////			КонецЦикла;
	////			
	////			Возврат "";
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли; 

			
		ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetOrgCode" Тогда // Пошук і отримання ідентифікатора установи за заданими ЄДРПОУ установи та номером філії
			
			Если ДанныеДляОбработки.Свойство("dept") Тогда
				ПутьНаСервере = "/api/System/GetOrgCode?edrpou="+ДанныеДляОбработки.edrpou+"&dept="+ДанныеДляОбработки.dept; 
			Иначе	
				ПутьНаСервере = "/api/System/GetOrgCode?edrpou="+ДанныеДляОбработки.edrpou; 
			КонецЕсли; 
			
			ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
			Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
			
			Если Ответ.КодСостояния = 200 Тогда 
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
				
				ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
				
				Если ОтветСтруктура.Свойство("Value") Тогда
					Возврат ОтветСтруктура.Value;
				Иначе
					Возврат 0;
				КонецЕсли;
			Иначе
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
			КонецЕсли;   
			
		ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetPrimaryReestr" Тогда // Получение реестра документов 
			
			ПутьНаСервере = "/api/Info/GetPrimaryReestr?idOrg="+ДанныеДляОбработки.idOrg+"&docType=-1&moveType=2&dateFrom="+ДанныеДляОбработки.dateFrom+"&dateEnd="+ДанныеДляОбработки.dateEnd; 
			
			ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
			Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
			
			Если Ответ.КодСостояния = 200 Тогда 
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
				
				ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
				//Если ОтветСтруктура.Value = "1" Тогда  
				//	Возврат Истина;
				//Иначе 
				Возврат ОтветСтруктура;
				//КонецЕсли;
				
			Иначе
				ЗаписьЖурналаРегистрации( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
				Возврат Неопределено;
			КонецЕсли;  
	
			
		КонецЕсли;
		
		
		
		
	Исключение
		
		
	КонецПопытки;	
	
	
	
	
	
	
	
	Возврат Истина;
	
	
	
	
	
	////Попытка
	////	
	////	Если ДанныеДляОбработки.ТекущаяЗадача = "MakeDoc" Тогда  // Cтворення та наповнення даними документа
	////		
	////		Заголовки.Вставить("Connection", "keep-alive");
	////		Заголовки.Вставить("Content-type", "application/json");
	////		
	////		ПутьНаСервере = "/api/Document/MakeDoc?edrpou="+ДанныеДляОбработки.edrpou+"&shablonType="+ДанныеДляОбработки.shablonType+"&charCode="+ДанныеДляОбработки.charCode+"&exDocId="+ДанныеДляОбработки.exDocId+"&per_type="+ДанныеДляОбработки.per_type+"&per_date="+ДанныеДляОбработки.per_date; 
	////		
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляОбработки.ТекJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	////		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	////		
	////		ЧтениеJSON = Новый ЧтениеJSON;
	////		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////		
	////		ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON); 
	////		
	////		Если Не Ответ.КодСостояния = 200 Тогда
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////		Иначе
	////			Возврат ОтветСтруктура;
	////		КонецЕсли;   
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetOrgCode" Тогда // Пошук і отримання ідентифікатора установи за заданими ЄДРПОУ установи та номером філії
	////		
	////		Если ДанныеДляОбработки.Свойство("dept") Тогда
	////			ПутьНаСервере = "/api/System/GetOrgCode?edrpou="+ДанныеДляОбработки.edrpou+"&dept="+ДанныеДляОбработки.dept; 
	////		Иначе	
	////			ПутьНаСервере = "/api/System/GetOrgCode?edrpou="+ДанныеДляОбработки.edrpou; 
	////		КонецЕсли; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			
	////			Если ОтветСтруктура.Свойство("Value") Тогда
	////				Возврат ОтветСтруктура.Value;
	////			Иначе
	////				Возврат 0;
	////			КонецЕсли;
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////		КонецЕсли;   
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetDocStatus" Тогда // Отримати статус документа 
	////		
	////		ПутьНаСервере = "/api/Info/GetDocStatus?idOrg="+ДанныеДляОбработки.idOrg+"&exDocID="+ДанныеДляОбработки.exDocID; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			
	////			Возврат ОтветСтруктура.Value;  
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////		КонецЕсли;   
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "Ping" Тогда // Перевірка з'єднання з сервером 
	////		
	////		ПутьНаСервере = "/api/System/Ping"; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			Если ОтветСтруктура.Code = 0 Тогда  
	////				СформироватьСообщение( НСтр("ru = 'Соединение установлено';uk = 'Зʼєднання встановлене'") );	
	////			Иначе  
	////				СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////			КонецЕсли;
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////		КонецЕсли; 
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetDocSendStt" Тогда // Отримати стан відправки документа
	////		
	////		ПутьНаСервере = "/api/Info/GetDocSendStt?idOrg="+ДанныеДляОбработки.idOrg+"&exDocID="+ДанныеДляОбработки.exDocID; 
	
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			
	////			Возврат ОтветСтруктура.Value;
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////		КонецЕсли;   
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "MoveToTrash" Тогда // Видалення документа в корзину
	////		
	////		ПутьНаСервере = "api/Document/MoveToTrash?idOrg="+ДанныеДляОбработки.idOrg+"&exDocID="+ДанныеДляОбработки.exDocID; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			
	////			Возврат ОтветСтруктура.Code;
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////		КонецЕсли; 
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetInTrashStatus" Тогда // Перевірка статусу знаходження документа в корзині
	////		
	////		ПутьНаСервере = "api/Info/GetInTrashStatus?idOrg="+ДанныеДляОбработки.idOrg+"&exDocID="+ДанныеДляОбработки.exDocID; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			Если ОтветСтруктура.Value = "1" Тогда  
	////				Возврат Истина;
	////			Иначе 
	////				Возврат Ложь;
	////			КонецЕсли;
	////
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") );
	////		КонецЕсли;   
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetVerDocking" Тогда // Получение версии стиковки 
	////		
	////		ПутьНаСервере = "/api/system/GetVerDocking"; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда  
	////			
	////			ВерсияСтыковки = Метаданные().Реквизиты.ВерсияСтыковки.Комментарий;
	////			//ОтветМассив = СтрРазделить(Ответ.ПолучитьТелоКакСтроку(), ", ");
	////			ОтветМассив = СтрРазделитьРасширенная(Ответ.ПолучитьТелоКакСтроку(), ",");
	////			
	////			Попытка 
	////				Если Число(ВерсияСтыковки) < Число(СокрЛП(ОтветМассив[5])) Тогда
	////					Возврат Новый Структура("ЕстьОбновление,СсылкаНаОбновление", Истина,"https://medoc.ua/uk/integration");
	////				Иначе   
	////					Возврат Новый Структура("ЕстьОбновление,СсылкаНаОбновление", Ложь,"");
	////				КонецЕсли; 
	////			Исключение   
	////					Возврат Новый Структура("ЕстьОбновление,СсылкаНаОбновление", Ложь,"");
	////			КонецПопытки;
	////		
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли;      
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetPrimaryReestr" Тогда // Получение реестра документов 
	////		
	////		ПутьНаСервере = "/api/Info/GetPrimaryReestr?idOrg="+ДанныеДляОбработки.idOrg+"&docType=-1&moveType=2&dateFrom="+ДанныеДляОбработки.dateFrom+"&dateEnd="+ДанныеДляОбработки.dateEnd; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			//Если ОтветСтруктура.Value = "1" Тогда  
	////			//	Возврат Истина;
	////			//Иначе 
	////				Возврат ОтветСтруктура;
	////			//КонецЕсли;
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли;  
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetValues" Тогда // Отримання документа 
	////		
	////		ПутьНаСервере = "/api/Document/GetValues?cardCode="+ДанныеДляОбработки.cardCode; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	////			Возврат ОтветСтруктура;
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли; 
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "AddAppendix" Тогда // Прикріплення додатків до документа 
	////		
	////		
	////		Заголовки.Вставить("accept", "*/*");
	////		Заголовки.Вставить("Content-type", "application/json-patch+json");
	////        		
	////		ПутьНаСервере = "/api/Document/AddAppendix"; 
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляОбработки.ТекJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	////		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	////		
	////		Если Не Ответ.КодСостояния = 200 Тогда
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////		Иначе
	////			Возврат Ответ.КодСостояния;
	////		КонецЕсли;   
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "CreateDocumentByParam" Тогда // Cтворення документа за заданими параметрами 
	////		
	////		Если ДанныеДляОбработки.Свойство("idParent") Тогда   
	////			ПутьНаСервере = "/api/Document/CreateDocumentByParam?char_code="+ДанныеДляОбработки.char_code+"&exDocId="+ДанныеДляОбработки.exDocId+"&per_type="+ДанныеДляОбработки.per_type+"&per_date="+ДанныеДляОбработки.per_date+"&id_org="+ДанныеДляОбработки.id_org+"&id_user="+ДанныеДляОбработки.id_user+"&idParent="+ДанныеДляОбработки.idParent; 
	////		Иначе                                                                                                                                                                                                    
	////			ПутьНаСервере = "/api/Document/CreateDocumentByParam?char_code="+ДанныеДляОбработки.char_code+"&exDocId="+ДанныеДляОбработки.exDocId+"&per_type="+ДанныеДляОбработки.per_type+"&per_date="+ДанныеДляОбработки.per_date+"&id_org="+ДанныеДляОбработки.id_org+"&id_user="+ДанныеДляОбработки.id_user; 
	////		КонецЕсли;
	////	
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	////			Возврат ОтветСтруктура;
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли; 
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "GetDocInfo" Тогда // Отримати повну інформацію по документу 
	////		
	////		
	////		ПутьНаСервере = "/api/Info/GetDocInfo?idOrg="+ДанныеДляОбработки.IdOrg+"&exDocId="+ДанныеДляОбработки.exDocId; 
	
	////			
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	////			Возврат ОтветСтруктура;
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли; 	
	////    ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "SetValues" Тогда  // Збереження документа
	////		
	////		Заголовки.Вставить("Connection", "keep-alive");
	////		Заголовки.Вставить("Content-type", "application/json");
	////		
	////		ПутьНаСервере = "/api/Document/SetValues?cardCode="+ДанныеДляОбработки.cardCode; 
	////		
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляОбработки.ТекJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	////		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	////
	////	
	////		Если Не Ответ.КодСостояния = 200 Тогда
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////		Иначе
	////			Возврат Ответ.КодСостояния;
	////		КонецЕсли;
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "PrintDocPDF" Тогда // Отримання документа в PDF форматі 
	////		
	////                                                                                                                                                                                              
	////		ПутьНаСервере = "/api/Info/PrintDocPDF?idOrg="+ДанныеДляОбработки.idOrg+"&cardCode="+ДанныеДляОбработки.cardCode+"&signerInfo="+ДанныеДляОбработки.signerInfo+"&facsimile="+ДанныеДляОбработки.facsimile; 
	////	
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	////		
	////		Если Ответ.КодСостояния = 200 Тогда 
	////			ЧтениеJSON = Новый ЧтениеJSON;
	////			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////			
	////			ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
	////			
	////			Для Каждого ТекОтветСтруктура Из ОтветСтруктура Цикл 
	////				Если Не ТекОтветСтруктура.Attachment Тогда
	////					 Возврат ТекОтветСтруктура;
	////					Прервать;
	////				КонецЕсли;	
	////				
	////			КонецЦикла;
	////			
	////			Возврат "";
	////			
	////		Иначе
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////			Возврат Неопределено;
	////		КонецЕсли; 
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "ToPartner" Тогда  // Відправка документів контрагенту та затвердження
	////		
	////		Заголовки.Вставить("Connection", "keep-alive");
	////		Заголовки.Вставить("Content-type", "application/json");
	////		
	////		ПутьНаСервере = "/api/SignSendReceive/ToPartner"; 
	////		
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляОбработки.ТекJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	////		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	////		
	////		ЧтениеJSON = Новый ЧтениеJSON;
	////		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////		
	////		ОтветМасивСтруктур = ПрочитатьJSON(ЧтениеJSON); 
	////		
	////		
	////		
	////		Если Не Ответ.КодСостояния = 200 Тогда
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////		Иначе  
	////			
	////			Для Каждого СтрокаДокумент из ОтветМасивСтруктур Цикл  
	////				
	////				Если НЕ СтрокаДокумент.Code = 0 Тогда  
	////					
	////					Если НЕ СтрокаДокумент.Proto = Неопределено Тогда
	////						СформироватьСообщение( СтрокаДокумент.Proto );
	////					КонецЕсли;	
	////					
	////					Если Не СтрокаДокумент.Message = Неопределено Тогда  
	////						СформироватьСообщение( СтрокаДокумент.Message );
	////					КонецЕсли;
	////					
	////				ИначеЕсли СтрокаДокумент.Code = 0 и не СтрокаДокумент.Proto = Неопределено Тогда 
	////					
	////					СформироватьСообщение( СтрокаДокумент.Proto );
	////					
	////				Иначе 
	////					Если ДанныеДляОбработки.СогласоватьОтклонить Тогда  
	////						Если ДанныеДляОбработки.Accept Тогда    
	////							СформироватьСообщение( НСтр("ru = 'Документ(ы) согласовано!'; uk = 'Документ(и) погоджено!'") );
	////						Иначе  
	////							СформироватьСообщение( НСтр("ru = 'Документ(ы) отклонено!'; uk = 'Документ(и) відхилено!'") );
	////						КонецЕсли;	
	////					Иначе		
	////						Если ДанныеДляОбработки.Шифрование Тогда 
	////							
	////							СформироватьСообщение( СтрокаДокумент.Message ); 
	////							СформироватьСообщение( НСтр("ru = 'Документ(ы) подписан и отправлен контрагенту!'; uk = 'Документ(и) підписано і відправлено контрагенту!'") );
	////						Иначе 
	////							СформироватьСообщение( СтрокаДокумент.Message );
	////							СформироватьСообщение( НСтр("ru = 'Документ(ы) подписано!'; uk = 'Докумет(и) підписано!'") );
	////							
	////							//Возврат ДанныеДляОтвета;
	////						КонецЕсли;  
	////					КонецЕсли;
	////				КонецЕсли;	
	////			КонецЦикла; 
	////			
	////			
	////			Возврат "";
	////			
	////		КонецЕсли;
	////		
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "ReceiveCorrespondence" Тогда  // Отримання повідомлень
	////		
	////		Заголовки.Вставить("Connection", "keep-alive");
	////		Заголовки.Вставить("Content-type", "application/json");
	////		
	////		ПутьНаСервере = "/api/SignSendReceive/ReceiveCorrespondence"; 
	////		
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляОбработки.ТекJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	////		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	////		
	////		ЧтениеJSON = Новый ЧтениеJSON;
	////		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////		
	////		ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON); 
	////		
	////		Если Не Ответ.КодСостояния = 200 Тогда
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////		Иначе  
	////			
	////			
	////			//Если Не ОтветСтруктура.Proto = Неопределено Тогда
	////			//	СформироватьСообщение( ОтветСтруктура.Proto );
	////			//КонецЕсли;	
	////			//
	////			//Если Не ОтветСтруктура.Message = Неопределено Тогда  
	////			//	СформироватьСообщение( ОтветСтруктура.Message );
	////			//КонецЕсли;
	////			
	////			Возврат ОтветСтруктура;
	////			
	////		КонецЕсли;
	////		
	////		
	////	ИначеЕсли ДанныеДляОбработки.ТекущаяЗадача = "ToGov" Тогда  // Відправка документів у контролюючий орган
	////		
	////		Заголовки.Вставить("Connection", "keep-alive");
	////		Заголовки.Вставить("Content-type", "application/json");
	////		
	////		ПутьНаСервере = "/api/SignSendReceive/ToGov"; 
	////		
	////		
	////		ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	////		ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляОбработки.ТекJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	////		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	////		
	////		ЧтениеJSON = Новый ЧтениеJSON;
	////		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////		
	////		ОтветМасивСтруктур = ПрочитатьJSON(ЧтениеJSON); 
	////		
	////		
	////		
	////		Если Не Ответ.КодСостояния = 200 Тогда
	////			СформироватьСообщение( НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'") ); 
	////		Иначе  
	////			
	////			Для Каждого СтрокаДокумент из ОтветМасивСтруктур Цикл  
	////				
	////				Если НЕ СтрокаДокумент.Code = 0 Тогда  
	////					
	////					Если НЕ СтрокаДокумент.Proto = Неопределено Тогда
	////						СформироватьСообщение( СтрокаДокумент.Proto );
	////					КонецЕсли;	
	////					
	////					Если Не СтрокаДокумент.Message = Неопределено Тогда  
	////						СформироватьСообщение( СтрокаДокумент.Message );
	////					КонецЕсли;
	////					
	////				ИначеЕсли СтрокаДокумент.Code = 0 и не СтрокаДокумент.Proto = Неопределено Тогда 
	////					
	////					СформироватьСообщение( СтрокаДокумент.Proto );
	////					
	////				Иначе 
	////						Если ДанныеДляОбработки.Шифрование Тогда 
	////							
	////							СформироватьСообщение( СтрокаДокумент.Message ); 
	////							СформироватьСообщение( НСтр("ru = 'Документ(ы) отправлен в ГНС!'; uk = 'Документ(и) відправлено до ДПС!'") );
	////							
	////							//Возврат ДанныеДляОтвета;
	////						КонецЕсли;  
	////				КонецЕсли;	
	////			КонецЦикла; 
	////			
	////			
	////			Возврат "";
	////			
	////		КонецЕсли;
	////
	////		
	////		
	////	Иначе 
	////		
	////		СформироватьСообщение( НСтр("ru = 'Эта функция не описана обратитесь к администратору ';uk = 'Ця функція не описана зверніться до адміністратора'") );
	////		
	////	КонецЕсли;
	////	
	////	
	////Исключение	
	////	ЗаписьЖурналаРегистрации(НСтр("ru = 'Отсутствует связь с сервером';uk = 'Відсутній звʼязок з сервером'"));
	////КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьJSON(ДанныеДляОбработки)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	//ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("");
	ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
	
	Для Каждого ТекВложение Из ДанныеДляОбработки Цикл 
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта(); 
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("TAB");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(ТекВложение.TAB);
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("LINE");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(ТекВложение.LINE);
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("NAME");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(ТекВложение.NAME);
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("VALUE");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(СокрЛП(ТекВложение.VALUE));
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
	Возврат	ЗаписьДанныхСообщения.Закрыть(); 
	
КонецФункции

Процедура ЭДО() Экспорт 
	
	ЗагрузитьСчетаИзВчасно();
	
	масОрганизации = Новый Массив;
	масОрганизации.Добавить(Справочники.Организации.НайтиПоКоду("000000000", Истина));
	масОрганизации.Добавить(Справочники.Организации.НайтиПоКоду("000000012", Истина));
	
	Для Каждого элемент Из масОрганизации Цикл 
		ЗагрузитьСчетаИзMedoc(элемент);
	КонецЦикла;

КонецПроцедуры	
