Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета
Перем ВнешниеНаборыДанных Экспорт;

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю

#Если Клиент ИЛИ ВнешнееСоединение Тогда                     
	
Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
		
КонецФункции

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

                                                                                     
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	СтруктураНатроек = Новый Структура();
	Возврат СтруктураНатроек;
	
КонецФункции

#КонецЕсли

#Если Клиент Тогда
	
// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецЕсли

// Процедура запускается каждый раз перед формированием отчета. В ней содержиться код который обрабатывает настройки отчета 
// перед формированим отчета. К примеру подстановка периода отчета по умолчанию если пользователь не задал не период в отчете
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
КонецПроцедуры



Функция ПолучитьОбъектПоНаименованиюИГУИД(Наименование,НаименованиеПолное,Стр) Экспорт 
	Если СокрЛП(Наименование) = "Справочник" тогда
		Возврат Справочники[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	ИначеЕсли СокрЛП(Наименование) = "Документ" тогда
		Возврат Документы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	ИначеЕсли СокрЛП(Наименование) = "Задача" тогда
		Возврат Задачи[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	ИначеЕсли СокрЛП(Наименование) = "БизнесПроцесс" тогда
		Возврат БизнесПроцессы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции	

Функция ПолучитьДатуОбъектаПоНаименованиюИГУИД(Наименование,НаименованиеПолное,Стр) Экспорт 
	Если СокрЛП(Наименование) = "Справочник" тогда
		Возврат Неопределено;
	ИначеЕсли СокрЛП(Наименование) = "Документ" тогда
		Возврат Документы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр))).Дата;
	ИначеЕсли СокрЛП(Наименование) = "Задача" тогда
		Возврат Задачи[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр))).Дата;
	ИначеЕсли СокрЛП(Наименование) = "БизнесПроцесс" тогда
		Возврат БизнесПроцессы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр))).Дата;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции	



Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;
