Перем глКомпонента, глНомерУстройства Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	Попытка
	
	Результат = Разработка.ЗапросПроверитьВерсию();
	Если Не Результат.Успех Тогда
		ПоказатьПредупреждение(, "Версія додатку на сервері " + Результат.ВерсияНаСервере + "." +
							   Символы.ПС + "Поточна версія " + Результат.ТекущаяВерсия + "." +
							   Символы.ПС + "Оновыть додаток! " + Результат.Узел);
	КонецЕсли;
	Исключение
	КонецПопытки;
						   						   
	//ПараметрыФормы = Новый Структура("ИмяСобытия", "ВходВПрограмму");
	//ОткрытьФорму("ОбщаяФорма.ФормаАутентификации", ПараметрыФормы);
	Разработка.ПроверитьЗаполнениеОсновныхКонстант();
	Разработка.ПроверитьЗаполнениеПланаОбмена();
	
	ПодключитьКомпонентуСканирования();			
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

	#Если МобильноеПриложениеКлиент Тогда
	Если глКомпонента <> Неопределено Тогда
		глКомпонента.Отключить(глНомерУстройства);
	КонецЕсли;
	#КонецЕсли

КонецПроцедуры

Процедура ПодключитьКомпонентуСканирования()

	СтруктураНастроек = Разработка.ПолучитьСтруктуруНастроекСканирования();
	Если НЕ ЗначениеЗаполнено(СтруктураНастроек.МодельТСД)
		ИЛИ СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.НеУказана") Тогда
			Возврат;
	КонецЕсли;

	#Если МобильноеПриложениеКлиент Тогда
	Если ПодключитьВнешнююКомпоненту("ОбщийМакет.Component", "Broadcasts", ТипВнешнейКомпоненты.Native) Тогда
		глКомпонента = Новый("AddIn.Broadcasts.UniversalBroadcast");
		ШаблонДанных = глКомпонента.ПолучитьШаблонОписанияДанных();
		Если СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Caribe_PL_45L")
			ИЛИ СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Caribe_PL_40L")
			ИЛИ СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Caribe_PL_55L")
			ИЛИ СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.LTP_83") Тогда
				ЗахватываемыеДанные = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных, СтруктураНастроек.ИмяПоляШтрихкода, XMLСтрока(Истина), XMLСтрока(15));
		Иначе
			ЗахватываемыеДанные = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных, СтруктураНастроек.ИмяПоляШтрихкода, XMLСтрока(Ложь), XMLСтрока(0));
		КонецЕсли;
		Если СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Zebra_TC21")
			ИЛИ СтруктураНастроек.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Symbol_MC40") Тогда
				глКомпонента.УстановитьПараметр("Category", "android.intent.category.DEFAULT");
		КонецЕсли;
		глКомпонента.УстановитьПараметр("FilterName", СтруктураНастроек.ИмяСобытияСканирования);
		глКомпонента.УстановитьПараметр("CaptureData", ЗахватываемыеДанные);
		Если НЕ глКомпонента.Подключить(глНомерУстройства) Тогда
			ТекстОшибки = "";
			КодОшибки = глКомпонента.ПолучитьОшибку(ТекстОшибки);
			Сообщить("Ошибка: "+КодОшибки+", "+ТекстОшибки);
		КонецЕсли;
	Иначе
		Сообщить("Компонента сканирования не подключена");
	КонецЕсли;
	#КонецЕсли

КонецПроцедуры

