
Процедура ВыгрузкаPowerBI() Экспорт 
	КонецПериода = ТекущаяДата();
	//НачалоПериода = КонецПериода - 4*7*24*60*60; //4 недели	
	НачалоПериода = ДобавитьМесяц(КонецПериода,-2);	
	
	
	Попытка
		ВыгрузитьДДС(НачалоПериода, КонецПериода);	
	Исключение
	    ЗаписьЖурналаРегистрации("ВыгрузкаPowerBI.ВыгрузитьДДС", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
	КонецПопытки;
	
	//<+++ a3b 21.10.2020 15:54:17 
	Попытка
		ВыгрузитьКурсы(НачалоПериода, КонецПериода);	
	Исключение
	    ЗаписьЖурналаРегистрации("ВыгрузкаPowerBI.ВыгрузитьКурсы", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
	КонецПопытки;
	//---> a3b 21.10.2020 16:04:14
	
КонецПроцедуры

//результат запроса к рег накопления движения ддс (отчет ДДС_PowerBI)
Функция ПолучитьРезультатЗапросаДДС(НачалоПериода, КонецПериода)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса,
		|	ДвиженияДенежныхСредствОбороты.Регистратор,
		|	ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Владелец КАК Организация,
		|	ДвиженияДенежныхСредствОбороты.Период КАК Дата,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.Контрагент = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВЫБОР
		|					КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|						ТОГДА ДвиженияДенежныхСредствОбороты.Регистратор.СубконтоКт1
		|					КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		|						ТОГДА ДвиженияДенежныхСредствОбороты.Регистратор.СубконтоДт1
		|					ИНАЧЕ ДвиженияДенежныхСредствОбороты.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ ДвиженияДенежныхСредствОбороты.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.приход)
		|			ТОГДА ВЫБОР
		|					КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|							И ДвиженияДенежныхСредствОбороты.Регистратор.ВидОперации = &ВидоперацииПокупкаПродажаВалюты
		|							И ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств = &СтяттяКурсовіРізниці
		|						ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|					КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|							И ДвиженияДенежныхСредствОбороты.Регистратор.ВидОперации = &ВидоперацииППИсхПокупкаПродажаВалюты
		|							И ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств = &СтяттяКурсовіРізниці
		|						ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|					ИНАЧЕ ДвиженияДенежныхСредствОбороты.СуммаОборот
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПриход,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.приход)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						И ДвиженияДенежныхСредствОбороты.Регистратор.ВидОперации = &ВидоперацииПокупкаПродажаВалюты
		|						И ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств = &СтяттяКурсовіРізниці
		|					ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|				КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|						И ДвиженияДенежныхСредствОбороты.Регистратор.ВидОперации = &ВидоперацииППИсхПокупкаПродажаВалюты
		|						И ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств = &СтяттяКурсовіРізниці
		|					ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|				ИНАЧЕ ДвиженияДенежныхСредствОбороты.СуммаОборот
		|			КОНЕЦ
		|	КОНЕЦ КАК СуммаРасход,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|				И ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств = &СтяттяКурсовіРізниці
		|			ТОГДА &Грн
		|		КОГДА ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|				И ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств = &СтяттяКурсовіРізниці
		|			ТОГДА &Грн
		|		ИНАЧЕ ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.ВалютаДенежныхСредств
		|	КОНЕЦ КАК Валюта,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот = 0
		|			ТОГДА 1
		|		ИНАЧЕ ДвиженияДенежныхСредствОбороты.СуммаУпрОборот / ДвиженияДенежныхСредствОбороты.СуммаОборот
		|	КОНЕЦ КАК Курс,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.приход)
		|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|		ИНАЧЕ -1 * ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|	КОНЕЦ КАК СуммаВал,
		|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств.Родитель КАК СтатьяДДС_Группа,
		|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
		|	ВЫРАЗИТЬ(ДвиженияДенежныхСредствОбороты.Регистратор.Комментарий КАК СТРОКА(300)) КАК Комментарий,
		|	ВЫБОР
		|		КОГДА ДвиженияДенежныхСредствОбороты.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|			ТОГДА ДвиженияДенежныхСредствОбороты.Регистратор.Подразделение
		|		ИНАЧЕ ДвиженияДенежныхСредствОбороты.Подразделение
		|	КОНЕЦ КАК Подразделение,
		|	ДвиженияДенежныхСредствОбороты.ПриходРасход,
		|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
		|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ГОД) КАК ПериодГод,
		|	ДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Владелец.Префикс КАК ОрганизацияПрефикс
		|ИЗ
		|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(&началоПериода, &КонецПериода, Регистратор, ) КАК ДвиженияДенежныхСредствОбороты
		|ГДЕ
		|	НЕ ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|	И НЕ ДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УпрДвиженияДенежныхСредствОбороты.БанковскийСчетКасса,
		|	УпрДвиженияДенежныхСредствОбороты.Регистратор,
		|	УпрДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Владелец,
		|	УпрДвиженияДенежныхСредствОбороты.Период,
		|	ВЫБОР
		|		КОГДА УпрДвиженияДенежныхСредствОбороты.Контрагент = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВЫБОР
		|					КОГДА УпрДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.УпрПриходныйКассовыйОрдер
		|						ТОГДА УпрДвиженияДенежныхСредствОбороты.Регистратор.СубконтоКт1
		|					КОГДА УпрДвиженияДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.УпрРасходныйКассовыйОрдер
		|						ТОГДА УпрДвиженияДенежныхСредствОбороты.Регистратор.СубконтоДт1
		|					ИНАЧЕ УпрДвиженияДенежныхСредствОбороты.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ УпрДвиженияДенежныхСредствОбороты.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпрДвиженияДенежныхСредствОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.приход)
		|			ТОГДА УпрДвиженияДенежныхСредствОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпрДвиженияДенежныхСредствОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
		|			ТОГДА УпрДвиженияДенежныхСредствОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	УпрДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.ВалютаДенежныхСредств,
		|	ВЫБОР
		|		КОГДА УпрДвиженияДенежныхСредствОбороты.СуммаОборот = 0
		|			ТОГДА 1
		|		ИНАЧЕ УпрДвиженияДенежныхСредствОбороты.СуммаУпрОборот / УпрДвиженияДенежныхСредствОбороты.СуммаОборот
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпрДвиженияДенежныхСредствОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.приход)
		|			ТОГДА УпрДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|		ИНАЧЕ -1 * УпрДвиженияДенежныхСредствОбороты.СуммаУпрОборот
		|	КОНЕЦ,
		|	УпрДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств.Родитель,
		|	УпрДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств,
		|	ВЫРАЗИТЬ(УпрДвиженияДенежныхСредствОбороты.Регистратор.Комментарий КАК СТРОКА(300)),
		|	ВЫБОР
		|		КОГДА УпрДвиженияДенежныхСредствОбороты.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|			ТОГДА УпрДвиженияДенежныхСредствОбороты.Регистратор.Подразделение
		|		ИНАЧЕ УпрДвиженияДенежныхСредствОбороты.Подразделение
		|	КОНЕЦ,
		|	УпрДвиженияДенежныхСредствОбороты.ПриходРасход,
		|	НАЧАЛОПЕРИОДА(УпрДвиженияДенежныхСредствОбороты.Период, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(УпрДвиженияДенежныхСредствОбороты.Период, ГОД),
		|	УпрДвиженияДенежныхСредствОбороты.БанковскийСчетКасса.Владелец.Префикс
		|ИЗ
		|	РегистрНакопления.УпрДвиженияДенежныхСредств.Обороты(&началоПериода, &КонецПериода, Регистратор, ) КАК УпрДвиженияДенежныхСредствОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("началоПериода", началоПериода);
	
	Запрос.УстановитьПараметр("ВидоперацииПокупкаПродажаВалюты",Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты);
	Запрос.УстановитьПараметр("ВидоперацииППИсхПокупкаПродажаВалюты",Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты);
	Запрос.УстановитьПараметр("Грн", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("СтяттяКурсовіРізниці", а3б_ДляПодписокНаСобытия.ПолучитьПредопределенныйЭлемент("Справочники.СтатьиДвиженияДенежныхСредств.КурсоваРізниця"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ВыгрузитьДДС(НачалоПериода, КонецПериода) Экспорт
	
	ОбработкаСоединение = Обработки.РаботаСSQL.Создать();
	//установка нач значений
	
	//+NovashIV_19.12.20222
	//ОбработкаСоединение.СтрокаСоединения = "Provider=SQLOLEDB.1;Persist Security Info=true;User ID=PowerBI_Full;Password=F+zC5gzM+)623+Jm;Initial Catalog=PowerBI_VAC;Data Source=10.100.10.21";

	мПараметры = ПолучитьПарольИЛогинПоверБА();
	ОбработкаСоединение.СтрокаСоединения = "Provider=SQLOLEDB.1;Persist Security Info=true;User ID=" + Строка(мПараметры.Логин) + ";" + "Password=" + Строка(мПараметры.Пароль) + ";" + "Initial Catalog=" + Строка(мПараметры.InitialCatalog) + ";" + "Data Source=" + Строка(мПараметры.DataSource);

    //+NovashIV_19.12.20222

	Таблица = "db_accessadmin.DDSPowerBI";
	СтруктураДанных = Новый Структура("Counterparty,CounterpartyString,BankAccount,BankAccountString,OrganisationPrefix,Date,Sum_Income,Sum_Outcome,Currency,CurrencyString,CurRatio,Sum_Cur,Comment,Department,DepartmentString,CFItem,CFItemString,CFItemGroup,CFItemGroupString,PeriodMonth,PeriodYear,Registrator,RegistratorString",
									"КонтрагентГуид","Контрагент","БанковскийСчетКассаГуид","БанковскийСчетКасса","ОрганизацияПрефикс","Дата","СуммаПриход","СуммаРасход","ВалютаГуид","Валюта",
									"Курс","СуммаВал","Комментарий","ПодразделениеГуид","Подразделение","СтатьяДДСГуид","СтатьяДДС","СтатьяДДС_ГруппаГуид","СтатьяДДС_Группа","ПериодМесяц","ПериодГод","РегистраторГуид","Регистратор");
	СписокГуидов = Новый СписокЗначений;
	СписокГуидов.Добавить("Контрагент");
	СписокГуидов.Добавить("БанковскийСчетКасса");
	СписокГуидов.Добавить("Валюта");
	СписокГуидов.Добавить("Подразделение");
	СписокГуидов.Добавить("СтатьяДДС");
	СписокГуидов.Добавить("СтатьяДДС_Группа");
	СписокГуидов.Добавить("Регистратор");
	
	
	Соединение = ОбработкаСоединение.ПолучитьСоединениеСБазойSQL();	
	Результат = ПолучитьРезультатЗапросаДДС(НачалоПериода, КонецПериода).Выгрузить();
	
	//дозаполнить тз
	ОбработкаСоединение.ДополнитьГуидами(Результат, СписокГуидов);
	
	//Очистить от старых записей
	рез = ОбработкаСоединение.УдалитьСтрокиSQL(Таблица, Соединение, "where Date >= '"+Формат(НачалоПериода,"ДЛФ=DT")+"'  AND Date <= '"+Формат(КонецПериода,"ДЛФ=DT")+"' ");
	
	//выполнить запись
	рез = ОбработкаСоединение.ЗаписатьДанныеSQL(Таблица, Результат, СтруктураДанных, Соединение);
	
	//окончание работы
	ОбработкаСоединение.ЗакрытьСоединениеСБазой(Соединение);		
КонецПроцедуры

//<+++ a3b 21.10.2020 15:54:17

//выгружает регистр курсы валют в скл базу 
Процедура ВыгрузитьКурсы(НачалоПериода, КонецПериода) Экспорт
	ОбработкаСоединение = Обработки.РаботаСSQL.Создать();
	//установка нач значений
	
	//+NovashIV_19.12.20222
	//ОбработкаСоединение.СтрокаСоединения = "Provider=SQLOLEDB.1;Persist Security Info=true;User ID=PowerBI_Full;Password=F+zC5gzM+)623+Jm;Initial Catalog=PowerBI_VAC;Data Source=10.100.10.21";

	мПараметры = ПолучитьПарольИЛогинПоверБА();
	ОбработкаСоединение.СтрокаСоединения = "Provider=SQLOLEDB.1;Persist Security Info=true;User ID=" + Строка(мПараметры.Логин) + ";" + "Password=" + Строка(мПараметры.Пароль) + ";" + "Initial Catalog=" + Строка(мПараметры.InitialCatalog) + ";" + "Data Source=" + Строка(мПараметры.DataSource);
    //+NovashIV_19.12.20222

	Таблица = "db_accessadmin.ExchangeRates";
	СтруктураДанных = Новый Структура("Date,Currency,CurrencyString,CurrencyCode,Rate,Mult",
										"Дата","ВалютаГуид","Валюта","ВалютаКод","Курс","Кратность");
	СписокГуидов = Новый СписокЗначений;
	СписокГуидов.Добавить("Валюта");
	
	
	Соединение = ОбработкаСоединение.ПолучитьСоединениеСБазойSQL();	
	Результат = ПолучитьКурсы(НачалоПериода, КонецПериода).Выгрузить();
	
	//Нормализовать кратность к 1
	Для каждого стр Из Результат Цикл
	
		стр.Курс = ?(стр.Кратность <> 0, стр.Курс / стр.Кратность, стр.Курс);
		стр.Кратность = 1;
	
	КонецЦикла;
	
	//дозаполнить тз
	ОбработкаСоединение.ДополнитьГуидами(Результат, СписокГуидов);
	
	//Очистить от старых записей
	рез = ОбработкаСоединение.УдалитьСтрокиSQL(Таблица, Соединение, "where Date >= '"+Формат(НачалоПериода,"ДФ=yyyy-MM-dd")+"'  AND Date <= '"+Формат(КонецПериода,"ДФ=yyyy-MM-dd")+"' ");
	
	//выполнить запись
	рез = ОбработкаСоединение.ЗаписатьДанныеSQL(Таблица, Результат, СтруктураДанных, Соединение);
	
	//окончание работы
	ОбработкаСоединение.ЗакрытьСоединениеСБазой(Соединение);		
КонецПроцедуры

//РезультатЗапроса к рег сведений курсы валют
Функция ПолучитьКурсы(НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалют.Период КАК Дата,
		|	КурсыВалют.Валюта,
		|	КурсыВалют.Валюта.Код,
		|	КурсыВалют.Курс,
		|	КурсыВалют.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
//---> a3b 21.10.2020 16:04:14  

функция ПолучитьПарольИЛогинПоверБА()
	//+NovashIV_19.12.20222
	Логин = Константы.User_Id_PowerBI.Получить();
	Пароль = Константы.PasswordPowerBI.Получить();
	InitialCatalog = Константы.InitialCatalogPoweBI.Получить();
	DataSource = Константы.DataSourcePowerBI.Получить();

	мПараметры = Новый Структура;
	
	мПараметры.Вставить("Пароль",Пароль);
	мПараметры.Вставить("Логин",Логин);
	мПараметры.Вставить("InitialCatalog",InitialCatalog);
	мПараметры.Вставить("DataSource",DataSource);
	
	Возврат мПараметры;
	//+NovashIV_19.12.20222
КонецФункции