

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСОтборами();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСОтборами()
	
	Для Каждого стрОтбор из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Строка(стрОтбор.ЛевоеЗначение) = "Подразделение" Тогда
			
			стрОтбор.ПравоеЗначение = Подразделение;
			Если ЗначениеЗаполнено(Подразделение) Тогда
				стрОтбор.Использование = Истина;
			Иначе
				стрОтбор.Использование = Ложь;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Для Каждого стрОтбор из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Строка(стрОтбор.ЛевоеЗначение) = "Склад" Тогда
			
			стрОтбор.ПравоеЗначение = Склад;
			Если ЗначениеЗаполнено(Склад) Тогда
				стрОтбор.Использование = Истина;
			Иначе
				стрОтбор.Использование = Ложь;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ЗаполнитьСОтборами()

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ЗаполнитьСОтборами();
КонецПроцедуры
