// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)

	Если Не (ЭтоГруппа Или ОбменДанными.Загрузка) Тогда
		Если НЕ ЗначениеЗаполнено(ТипОплаты) Тогда
			СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Тип оплаты""!';uk='Не заповненно значення реквізита ""Тип оплати""!'");
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru='Справочник: Виды оплат чека ККМ';uk='Довідник: Види оплат чека ККМ'"));
		КонецЕсли;

		Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			Если НЕ ЗначениеЗаполнено(БанкКредитор) Тогда
				СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Банк-кредитор""!';uk='Не заповнено значення реквізиту ""Банк-кредитор""!'");
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru='Справочник: Виды оплат чека ККМ';uk='Довідник: Види оплат чека ККМ'"));
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетовБанкаКредитора) Тогда
				СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Договор взаиморасчетов""!';uk='Не заповнено значення реквізиту ""Договір взаєморозрахунків""!'");
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru='Справочник: Виды оплат чека ККМ';uk='Довідник: Види оплат чека ККМ'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
