
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура должна быть заполнена обязательно!';uk=""Номенклатура повинна бути заповнена обов'язково!"""), Отказ);
		ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура не может быть услугой!';uk='Номенклатура не може бути послугою!'"), Отказ);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Комплектующая) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая должна быть заполнена обязательно!';uk=""Комплектуюча повинна бути заповнена обов'язково!"""), Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Услуга Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая не может быть услугой!';uk='Комплектуюча не може бути послугою!'"), Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Набор Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая не может быть набором-пакетом!';uk='Комплектуюча не може бути набором-пакетом!'"), Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Комплект Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая не может быть набором-комплектом!';uk='Комплектуюча не може бути набором-комплектом!'"), Отказ);
		КонецЕсли;
		
		Если (ЗаписьРегистра.Комплектующая = ЗаписьРегистра.Номенклатура)
		   И ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура не может совпадать с комплектующей!';uk='Номенклатура не може збігатися з комплектуючої!'"), Отказ);
		КонецЕсли;

		Если ЗаписьРегистра.Количество = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Количество не должно быть нулевым!';uk='Кількість не повинна бути нульовою!'"), Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры



