
Процедура УстановитьОтборКомпоновкиДанных(ОтборКомпоновки, ИмяЭлемента, Значение) Экспорт
	
	ЭлементОтбора  = НайтиСоздатьЭлементОтбораКомпоновкиДанных(ОтборКомпоновки, Новый ПолеКомпоновкиДанных(ИмяЭлемента));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Значение;
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСоздатьЭлементОтбораКомпоновкиДанных(ОтборКомпоновки, ПолеКомпоновки)
	
	НайденныйЭлементОтбора 	= Неопределено;
	ТипЭлементаОтбора 		= Тип("ЭлементОтбораКомпоновкиДанных");
	
	Для Каждого ЭлементОтбора Из ОтборКомпоновки.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = ТипЭлементаОтбора
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			
			НайденныйЭлементОтбора = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденныйЭлементОтбора = Неопределено Тогда
		
		НайденныйЭлементОтбора = ОтборКомпоновки.Элементы.Добавить(ТипЭлементаОтбора);
		НайденныйЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
		
	КонецЕсли;
	
	Возврат НайденныйЭлементОтбора;
	
КонецФункции

Процедура ОтключитьОтборыДинамическогоСписка(Список) Экспорт
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		ЭлементОтбора.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры
