
&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)

	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШтрихкодаНаКлиенте(ДобавлятьНовуюСтрокуТоваров = Ложь)

	ТекущаяСтрока = Неопределено;
	Модифицированность = Истина;
	Если НЕ ЗначениеЗаполнено(СокрЛП(Штрихкод)) Тогда
		Возврат;
	КонецЕсли;

	Если РучнойВводКоличества Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
	Иначе
		ДобавитьОбработатьСтрокуОтсканировано();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОбработатьСтрокуОтсканировано()

	МассивСтрок = Объект.Отсканировано.НайтиСтроки(Новый Структура("Штрихкод", Штрихкод));
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаОтсканировано = МассивСтрок[0];
	Иначе
		СтрокаОтсканировано = Объект.Отсканировано.Вставить(0);
		СтрокаОтсканировано.Штрихкод = Штрихкод;
	КонецЕсли;
	СтрокаОтсканировано.Количество = СтрокаОтсканировано.Количество + ?(РучнойВводКоличества, РучноеКоличество, 1);
	ТекущаяСтрока = СтрокаОтсканировано.ПолучитьИдентификатор();
	Штрихкод = "";

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УправлениеФормамиСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВводаКоличества" Тогда
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Число") ИЛИ НЕ ВыбранноеЗначение > 0 Тогда
			Возврат;
		КонецЕсли;
		РучноеКоличество = ВыбранноеЗначение;
		ДобавитьОбработатьСтрокуОтсканировано();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Записать();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если ОткрытаФормаРедактированияНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	Если ФормаДокументаЗаблокирована Тогда
		Возврат;
	КонецЕсли;

	Если Событие = "UniversalBroadcastEvent" и Источник = глНомерУстройства Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Данные);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		МассивЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("FilterData");
		Если МассивЭлементов.Количество() Тогда
			Штрихкод = МассивЭлементов[0].ТекстовоеСодержимое;
			ОбработатьВводШтрихкодаНаКлиенте();
			Если ОткрытаФормаСтроки Тогда
				СтруктураСканирования = Новый Структура();
				СтруктураСканирования.Вставить("Номенклатура", Номенклатура);
				СтруктураСканирования.Вставить("Количество", Количество);
				Оповестить("UniversalBroadcastEvent", СтруктураСканирования, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СканироватьЧерезКамеруУстройства(Команда)

	НажатаКомандаСканированияЧерезКамеру = Истина;
	ЗапуститьСканированиеЧерезКамеруУстройства();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканированиеЧерезКамеруУстройства()

	ИдетСканированиеЧерезКамеру = Истина;
	РучнойВводКоличества = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
	ОбработчикСканирования = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗавершение", ЭтаФорма);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗакрытие", ЭтаФорма);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(, ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОстановитьСканированиеЧерезКамеруУстройства()

	Если ИдетСканированиеЧерезКамеру Тогда
		ПрограммноеЗакрытиеСканированияЧерезКамеру = Истина;
		#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		ИдетСканированиеЧерезКамеру = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗавершение(ОтсканированныйШтрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	Штрихкод = СокрЛП(ОтсканированныйШтрихкод);
	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗакрытие(ДополнительныеПараметры) Экспорт

	Если НЕ ПрограммноеЗакрытиеСканированияЧерезКамеру Тогда
		НажатаКомандаСканированияЧерезКамеру = Ложь;
	КонецЕсли;
	ПрограммноеЗакрытиеСканированияЧерезКамеру = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	ПодключитьОбработчикАвтосохранения();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикАвтосохранения()

	Если ИспользоватьАвтосохранение <> Истина
		ИЛИ ИнтервалАвтосохранения = 0 Тогда
			Возврат;
	КонецЕсли;

	ПодключитьОбработчикОжидания("ВыполнитьАвтосохранениеДокумента", ИнтервалАвтосохранения);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтосохранениеДокумента() Экспорт

	Попытка
		Записать();
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	УправлениеФормамиКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);

КонецПроцедуры







