
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТекстВопроса = "Процедура оновлення залишків номенклатури може зайняти тривалий час. Продовжити?";
	ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Залишки");

КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Разработка.ВыполнитьУдалениеСтарыхДокументов();
		Сообщить("Процедуру видалення старих документів завершено!");
	КонецЕсли;

КонецПроцедуры

