#Если Клиент тогда
	
Процедура СформироватьОтчет(Результат, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	Результат.Очистить();
	
	ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если ЗначениеПараметраНачалоПериода <> Неопределено Тогда
		ЗначениеПараметраНачалоПериода.Значение = НачалоДня(НачалоПериода);
		ЗначениеПараметраНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если ЗначениеПараметраКонецПериода <> Неопределено Тогда
		ЗначениеПараметраКонецПериода.Значение = ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), КонецДня(ТекущаяДата()));
		ЗначениеПараметраКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ЭтотОбъект.СкомпоноватьРезультат(Результат, ДанныеРасшифровки);

КонецПроцедуры

#КонецЕсли