
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	УстановитьУсловноеОформление(Форма);

	ПроверитьДатуАктуальностиДокумента(Форма);
	Форма.ИспользоватьАвтосохранение = Константы.ИспользоватьАвтосохранение.Получить();
	Форма.ИнтервалАвтосохранения = Константы.ИнтервалАвтосохранения.Получить();
	Форма.РучнойВводКоличества = Константы.ЗапрашиватьКоличествоПриСканировании.Получить();
	Форма.Элементы.Дата.ТолькоПросмотр = НЕ Константы.РазрешитьРедактированиеДатыДокументов.Получить();
	Форма.Элементы.Ответственный.ТолькоПросмотр = НЕ Константы.РазрешитьРедактированиеОтветственного.Получить();
	Если Форма.Параметры.Ключ.Пустая() Тогда
		ЗаполнитьШапкуНовогоДокумента(Форма.Объект, Форма.РеквизитФормыВЗначение("Объект").Метаданные());
	КонецЕсли;

	ТоварыКоманднаяПанель = Форма.Элементы.Найти("ТоварыКоманднаяПанель");
	Если ТоварыКоманднаяПанель <> Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить("ОчиститьТаблицуТоваров");
		КомандаФормы.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
		КомандаФормы.Заголовок = "Очистить товары";

		Кнопка = Форма.Элементы.Добавить("ОчиститьТаблицуТоваров", Тип("КнопкаФормы"), ТоварыКоманднаяПанель);
		Кнопка.ИмяКоманды = "ОчиститьТаблицуТоваров";
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт

	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементФормы.ЦветТекстаЗаголовка = WebЦвета.ТемноСерый;
			//ЭлементФормы.ШрифтЗаголовка = Новый Шрифт(, 9);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьДатуАктуальностиДокумента(ФормаДокумента) Экспорт

	Если ФормаДокумента.Параметры.Ключ.Пустая() Тогда
		Возврат;
	КонецЕсли;

	КоличествоДнейДоступностиРедактированияДокументов = Константы.КоличествоДнейДоступностиРедактированияДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(КоличествоДнейДоступностиРедактированияДокументов) Тогда
		Возврат;
	КонецЕсли;

	ДатаАктуальности = НачалоДня(ТекущаяДата()) - КоличествоДнейДоступностиРедактированияДокументов*24*60*60;
	ФормаДокумента.ФормаДокументаЗаблокирована = (ФормаДокумента.Объект.Дата < ДатаАктуальности);
	ФормаДокумента.Доступность = НЕ ФормаДокумента.ФормаДокументаЗаблокирована;

КонецПроцедуры

Процедура ЗаполнитьШапкуНовогоДокумента(ДокументОбъект, МетаданныеДокумента) Экспорт

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СозданНаМобильномУстройстве", МетаданныеДокумента) Тогда
		ДокументОбъект.СозданНаМобильномУстройстве = Истина;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Склад) Тогда
			ДокументОбъект.Склад = Константы.СкладПоУмолчанию.Получить();
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ответственный) Тогда
			ДокументОбъект.Ответственный = Константы.ПользовательПоУмолчанию.Получить();
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
			ДокументОбъект.Организация = Константы.ОрганизацияПоУмолчанию.Получить();
		КонецЕсли;
	КонецЕсли;
	
	//+NovashIV_15.05.2023
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Подразделение) Тогда
			ДокументОбъект.Подразделение = Константы.ПодразделениеПоУполчанию.Получить();
		КонецЕсли;
	КонецЕсли;
	//-NovashIV_15.05.2023

	ДокументОбъект.Дата = ТекущаяДата();

КонецПроцедуры

//Процедура ОбработкаПроверкиЗаполненияДокументов(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт

Процедура ОбработкаПроверкиЗаполненияДокументов(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт

	МетаданныеДокумента = Форма.РеквизитФормыВЗначение("Объект").Метаданные();
	ЕстьОшибки = Ложь;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Склад) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заповнене поле ""Склад""";
			СообщениеПользователю.ПутьКДанным = "Объект.Склад";
			СообщениеПользователю.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Организация) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заповнене поле ""Організація""";
			СообщениеПользователю.ПутьКДанным = "Объект.Организация";
			СообщениеПользователю.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(Форма.Объект.СкладОтправитель) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заповнене поле ""Склад-відправник""";
			СообщениеПользователю.ПутьКДанным = "Объект.СкладОтправитель";
			СообщениеПользователю.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладПолучатель", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(Форма.Объект.СкладПолучатель) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заповнене поле ""Склад-отримувач""";
			СообщениеПользователю.ПутьКДанным = "Объект.СкладПолучатель";
			СообщениеПользователю.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;

	Отказ = ЕстьОшибки;

КонецПроцедуры

