
Процедура ПриЗаписи() Экспорт

	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ПриходныйОрдерМобильный", Ссылка);
	//Запрос.Текст =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ПриходныйОрдерНаТовары.Ссылка
	//|ИЗ
	//|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	//|ГДЕ
	//|	ПриходныйОрдерНаТовары.vrgПриходныйОрдерМобильный = &ПриходныйОрдерМобильный
	//|";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//Иначе
	//	ДокументОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	//КонецЕсли;

	//ДокументОбъект.Дата = Дата;
	//ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходныйОрдер.Перемещение;
	//ДокументОбъект.Склад = Склад;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУзлаОбмена);
	//ДокументОбъект.Организация = УзелОбмена.Организация;
	//Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
	//	ДокументОбъект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
	//	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, ПеремещениеТоваров);
	//КонецЕсли;

	//ДокументОбъект.Ответственный = Ответственный;
	//ДокументОбъект.Комментарий = Комментарий;
	//ДокументОбъект.ДокументПеремещения = ПеремещениеТоваров;
	//ДокументОбъект.vrgПриходныйОрдерМобильный = Ссылка;

	//ДокументОбъект.Товары.Очистить();
	//Для Каждого СтрокаТовары Из Товары Цикл
	//	НоваяСтрокаТовары = ДокументОбъект.Товары.Добавить();
	//	НоваяСтрокаТовары.Номенклатура = СтрокаТовары.Номенклатура;
	//	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрокаТовары, ДокументОбъект);
	//	НоваяСтрокаТовары.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
	//	НоваяСтрокаТовары.Количество = СтрокаТовары.Количество;
	//	НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
	//	НоваяСтрокаТовары.Коэффициент      = НоваяСтрокаТовары.ЕдиницаИзмерения.Коэффициент;
	//	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(НоваяСтрокаТовары, ДокументОбъект, Ложь);
	//	НоваяСтрокаТовары.Качество = Справочники.Качество.Новый;
	//КонецЦикла;

	////ДокументОбъект.ОбменДанными.Загрузка = Истина;
	//ДокументОбъект.ПометкаУдаления = ПометкаУдаления;
	//ДокументОбъект.Записать();

КонецПроцедуры