
Функция Запуск1СВозможен() Экспорт 
	Рез = Истина;
	
	Если РольДоступна("УпрДенежныеСредства") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользователиУправленческихПодсистем.Пользователь
			|ИЗ
			|	РегистрСведений.ПользователиУправленческихПодсистем КАК ПользователиУправленческихПодсистем
			|ГДЕ
			|	ПользователиУправленческихПодсистем.Пользователь = &Пользователь
			|	И ПользователиУправленческихПодсистем.ДДС";
		
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если не ВыборкаДетальныеЗаписи.Следующий() Тогда 
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Рез;
КонецФункции	

Функция ЭтоУпрКонтролер() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиУправленческихПодсистем.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиУправленческихПодсистем КАК ПользователиУправленческихПодсистем
		|ГДЕ
		|	ПользователиУправленческихПодсистем.Пользователь = &Пользователь
		|	И ПользователиУправленческихПодсистем.Контролер";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Следующий();
КонецФункции	