Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;

//Дандали В. 07.03.2024 +
Перем СозданКопированием Экспорт;
Перем НоменклатураКопирования Экспорт;
//Дандали В. 07.03.2024 -

Перем мЭтоНеНовый;
//+BalakoD 20230208
Перем ПерваяЗапись;
//-BalakoD 20230208

//Dandali V. 11.03.2023 {
Перем ШтрихкодСоздан;
//Dandali v. 11.03.2023 }

// Обработчик события элемента ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		ОсновноеИзображение     = Неопределено;
		НоменклатураГТД     = Неопределено;
		//+BalakoD 20230214
		Артикул = Неопределено;
		//-BalakoD 20230214
		//Дандали В. 07.03.2024 +
		СозданКопированием = Истина;
		НоменклатураКопирования = ОбъектКопирования.Ссылка;
		//Дандали В. 07.03.2024 -
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)
	
	Если мЭтоНеНовый = Неопределено Тогда
		мЭтоНеНовый = Не ЭтоНовый();
	КонецЕсли;
	//+BalakoD 20230208
	Если ПерваяЗапись = Неопределено Тогда
		ПерваяЗапись = Истина;
	КонецЕсли;
	//-BalakoD 20230208
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		Если Не Услуга И НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, НСтр("ru='базовая единица';uk='базова одиниця'"));
			#КонецЕсли
			Отказ = Истина;
		Иначе
			// Надо проверить владельца единицы хранения остатков.
			Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
			   И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
				ТекстСообщения = НСтр("ru='У единицы хранения остатков номенклатуры ""';uk='В одиниці зберігання залишків номенклатури ""'") + СокрЛП(Ссылка) + НСтр("ru='"" неверно указан владелец!';uk='"" невірно вказаний власник!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;

		// Надо проверить владельца единицы для отчетов.
		Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
		   И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
			ТекстСообщения = НСтр("ru='У единицы для отчетов номенклатуры ""';uk='У одиниці для звітів номенклатури ""'") + СокрЛП(Ссылка) + НСтр("ru='"" неверно указан владелец!';uk='"" невірно вказаний власник!'");
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		Если мЭтоНеНовый Тогда
			СуществуютСсылки = Неопределено;

			Если Не Услуга И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = НСтр("ru='Единица ""';uk='Одиниця ""'") + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + НСтр("ru='"" является единицей хранения остатков для ""';uk='"" є одиницею зберігання залишків для ""'") + Наименование + НСтр("ru='"""
"и уже участвует в товародвижении. "
"Изменить эту единицу уже нельзя!';uk='"""
"і вже бере участь у русі товарів. "
"Змінити цю одиницю вже не можна!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если (Услуга <> Ссылка.Услуга Или Комплект <> Ссылка.Комплект Или Набор <> Ссылка.Набор)
			   И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = НСтр("ru='Номенклатура ""';uk='Номенклатура ""'") + СокрЛП(Ссылка) + НСтр("ru='"" участвует в товародвижении."
"Нельзя изменить тип номенклатуры (Услуга, товар, набор-комплект), если позиция номенклатуры участвует в товародвижении!';uk='"" бере участь у русі товарів."
"Не можна змінити тип номенклатури (Послуга, товар, набір-комплект), якщо позиція номенклатури бере участь у русі товарів!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
				ТекстСообщения = НСтр("ru='Номенклатура ""';uk='Номенклатура ""'") + СокрЛП(Ссылка) + НСтр("ru='"" участвует в товародвижении."
"признак учета по сериям не может быть изменен!';uk='"" бере участь у русі товарів."
"ознака обліку за серіями не може бути змінена!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		//+BalakoD 20230206
		Иначе
		//Дандали В. 03.05.2023
		//Закоментировал т.к. если номенклатура уже есть, а артикула нет то артикул не назначается
			//Если НЕ ЗначениеЗаполнено(Артикул) Тогда
			//	ПоследнийАртикул = ПолучитьПоследнийАртикул();
			//	Артикул = СтрЗаменить(ПоследнийАртикул," ",""); 
			//КонецЕсли;
		//-BalakoD 20230206
	КонецЕсли;
	
	//Дандали В. 03.05.2023
	Если НЕ ЗначениеЗаполнено(Артикул) Тогда
		ПоследнийАртикул = ПолучитьПоследнийАртикул();
		Артикул = СтрЗаменить(ПоследнийАртикул," ",""); 
	КонецЕсли;
	//Дандали В. 03.05.2023

		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, НСтр("ru='вид номенклатуры';uk='вид номенклатури'"));
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
				
	КонецЕсли;
	
	// t.me/konstantyn_buhantsev [4 лютого 2025 р.] --> 
	Если ЭтоНовый() Тогда
		БрендИзменен = Истина;
	Иначе
		БрендИзменен = Ссылка.Бренд <> Бренд;	
	КонецЕсли;
	
	//Дандали В. 24.09.2025 +
	Если ЭтоНовый() И НЕ ЭтоГруппа Тогда
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	КонецЕсли;
	//Дандали В. 24.09.2025 -

КонецПроцедуры // ПередЗаписью()

//+BalakoD 20230206
Функция ПолучитьПоследнийАртикул()
	
	ПоследнийАртикул = Константы.ПоследнийАртикул.Получить();
	
	Возврат ПоследнийАртикул + 1;
		
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ И ПерваяЗапись Тогда
		
		ПоследнийАртикул = Константы.ПоследнийАртикул.Получить();
		НовыйАртикул = ПоследнийАртикул + 1;
		Константы.ПоследнийАртикул.Установить(НовыйАртикул);
		
		ПерваяЗапись = Ложь;
		
	КонецЕсли;
	
	//Dandali V. 11.03.2023 {
	Если НЕ мЭтоНеНовый И ЗначениеЗаполнено(ЕдиницаХраненияОстатков) И ШтрихкодСоздан = Неопределено Тогда
		ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		
		ТекЗапись.Владелец         = Ссылка;
		ТекЗапись.ЕдиницаИзмерения = ЕдиницаХраненияОстатков;
		ТекЗапись.ТипШтрихкода     = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
		ТекЗапись.Качество         = Справочники.Качество.Новый;
		ТекЗапись.Штрихкод         = РаботаСТорговымОборудованием.СформироватьШтрихКод();

		Попытка
			ТекЗапись.Записать();
			ШтрихкодСоздан = Истина;
		Исключение
		КонецПопытки;
	КонецЕсли;
	//Dandali V. 11.03.2023 }
	
	//Дандали В. 30.03.2026 +
	Если НЕ Отказ
		И НЕ мЭтоНеНовый
		И НЕ ЭтоГруппа
		И ЗначениеЗаполнено(Бренд) 
		И ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004") //Товары
		И НЕ НеПоказыватьНаСайте Тогда
		
		МодульРегламентныхЗаданий.ЗарегистрироватьНаВыгрузкуАпи(Ссылка);
	КонецЕсли;

	//Дандали В. 30.03.2026 -

	
КонецПроцедуры
//-BalakoD 20230206
 
СозданКопированием = Ложь;
НоменклатураКопирования = Неопределено;
