
#Область ФункцииВебСервиса

Функция ВыгрузитьДанныеНаМобильноеУстройство(УзелУстройства, ОбновлятьРегистрыСведений = Истина) Экспорт

	Если ОбновлятьРегистрыСведений Тогда
		ЗаписатьДанныеРегистраСведенийОстаткиНаСкладахМобильныеСклад(УзелУстройства);
		ЗаписатьДанныеРегистраСведенийЦеныНоменклатурыМобильные(УзелУстройства);
		//ЗаписатьДанныеРегистраСведенийОстаткиЗаказовПоставщикамМобильные(УзелУстройства);
	КонецЕсли;

	ЗаписьXML = Новый ЗаписьXML;

	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелУстройства);

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

	ТипДанныхУдаления = Тип("УдалениеОбъекта");

	//ЕстьОграничениеДоступностиРедактирования = ЗначениеЗаполнено(УзелУстройства.КоличествоДнейДоступностиРедактированияДокументов);
	//ДатаОграниченияВыгрузкиДокументов = НачалоДня(ТекущаяДата()) - УзелУстройства.КоличествоДнейДоступностиРедактированияДокументов * 24*60*60;
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелУстройства, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл

		Данные = ВыборкаИзменений.Получить();

		//Если ЕстьОграничениеАктуальностиДокументов И Метаданные.Документы.Содержит(Данные.Метаданные()) Тогда
		//	Если Данные.Дата < ДатаОграниченияВыгрузкиДокументов Тогда
		//		Продолжить;
		//	КонецЕсли;
		//КонецЕсли;

		// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных
		Если Не НуженПереносДанных(Данные, УзелУстройства) Тогда
		
			УдалениеДанныхНаМобильномУстройстве = ТребуетсяУдалениеДанныхНаМобильномУстройстве(Данные, УзелУстройства); // получим, пока еще данные не преобразованы

			// уберем регистрацию этих данных на будущее
			Если НЕ УдалениеДанныхНаМобильномУстройстве Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелУстройства, Данные);
			КонецЕсли;
			
			УдалениеДанных(Данные);
			
			Если УдалениеДанныхНаМобильномУстройстве Тогда
				ЗаписатьДанные(ЗаписьXML, Данные, УзелУстройства);
			КонецЕсли;
			
		Иначе
			
			// Записываем данные в сообщение
			ЗаписатьДанные(ЗаписьXML, Данные, УзелУстройства);
			
		КонецЕсли;

	КонецЦикла;

	ЗаписьСообщения.ЗакончитьЗапись();

	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

КонецФункции

Процедура ПринятьДанныеСМобильногоУстройства(УзелУстройства, ДанныеОбмена, ОчиститьИзменения = Истина) Экспорт

	//Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		
		ЗаписьЖурналаРегистрации("Данные обмена"+УзелУстройства.код,УровеньЖурналаРегистрации.Ошибка,,ДанныеОбмена.Получить());
		
		Если ОчиститьИзменения Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
		КонецЕсли;

		МассивДокументовДляПроведения = Новый Массив;
		НачатьТранзакцию();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			
			Данные = ПрочитатьXML(ЧтениеXML);
			Если ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
				Продолжить;
			КонецЕсли;

			Если Не Данные = Неопределено Тогда
				
				//Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
				Данные.ОбменДанными.Загрузка = Истина;
				//Если Данные.Дата > (ТекущаяДата() - (60*60*24*30)) Тогда
				Если  Данные.Номер = "МБ000000727"  Или Данные.Номер = "00000000271" Тогда
					Продолжить;
				КонецЕсли;
	
				
				Данные.Записать();
			   // КонецЕсли;
			КонецЕсли;

			// если это непомеченный на удаление документ и в настройках узла задано проведение
			Если УзелУстройства.РежимЗаписиДокументовПриОбмене = "Проводить"
				И Метаданные.Документы.Содержит(Данные.Метаданные()) И НЕ Данные.ПометкаУдаления Тогда
					МассивДокументовДляПроведения.Добавить(Данные.Ссылка);
			КонецЕсли;

		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
	//Исключение
	//	#Если Клиент Тогда
	//	Сообщить("Неудачная попытка чтения данных обмена по причине: " + ОписаниеОшибки());
	//	#КонецЕсли
	//КонецПопытки;

	ВыполнитьОтложенноеПроведениеДокументов(МассивДокументовДляПроведения);

КонецПроцедуры

Процедура ВыполнитьОтложенноеПроведениеДокументов(МассивМобильныхДокументов)

	Если МассивМобильныхДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.УстановитьПараметр("МассивМобильныхДокументов", МассивМобильныхДокументов);
	ЗапросДокументов.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	vrgСоответствияМобильныхДокументов.ОсновнойДокумент
	|ИЗ
	|	РегистрСведений.vrgСоответствияМобильныхДокументов КАК vrgСоответствияМобильныхДокументов
	|ГДЕ
	|	vrgСоответствияМобильныхДокументов.МобильныйДокумент В (&МассивМобильныхДокументов)
	|	И НЕ vrgСоответствияМобильныхДокументов.ОсновнойДокумент.ПометкаУдаления
	|";
	ВыборкаДокументов = ЗапросДокументов.Выполнить().Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.ОсновнойДокумент.ПолучитьОбъект();
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Функция ВыполнитьНачальнуюИнициализациюДляУзлаМобильногоУстройства(УзелУстройства, ЗаписыватьДанные = Истина) Экспорт

	//ЗаписатьДанныеРегистраСведенийОстаткиНаСкладахМобильныеСклад(УзелУстройства);
	//ЗаписатьДанныеРегистраСведенийЦеныНоменклатурыМобильные(УзелУстройства);
	//ЗаписатьДанныеРегистраСведенийОстаткиЗаказовПоставщикамМобильные(УзелУстройства);

	ЗаписьXML = Неопределено;
	Если ЗаписыватьДанные Тогда
		ЗаписьXML = Новый ЗаписьXML;

		ЗаписьXML.УстановитьСтроку("UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();

		ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
		ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелУстройства);

		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");
	КонецЕсли;

	ЗарегистрироватьЗаписатьИзмененияНачальныхДанных(УзелУстройства, ЗаписыватьДанные, ЗаписьXML);

	Если ЗаписыватьДанные Тогда
		ЗаписьСообщения.ЗакончитьЗапись();
		Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
	КонецЕсли;

КонецФункции

Функция ИзменитьПараметрыНоменклатуры(УзелУстройства, ДанныеОбмена, ТекстОшибки) Экспорт

	СтруктураПараметров = ДесериализаторJSON(ДанныеОбмена);
	//Попытка
	//	СправочникСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(СтруктураПараметров.Номенклатура)));
	//Исключение
	//	ТекстОшибки = ТекстОшибки + "Не удалось записать реквизиты: " + ОписаниеОшибки();
	//	Возврат Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
	//КонецПопытки;

	СправочникСсылка = СтруктураПараметров.Номенклатура;
	Если СтруктураПараметров.Свойство("Расположение") Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.Расположение = СтруктураПараметров.Расположение;

		Попытка
			СправочникОбъект.Записать();
		Исключение
			ТекстОшибки = ТекстОшибки + "Не удалось изменить номенклатуру: " + ОписаниеОшибки();
			//Возврат Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		КонецПопытки;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("ТаблицаНовыхШтрихкодов") Тогда
		Для Каждого СтрокаШтрихкода Из СтруктураПараметров.ТаблицаНовыхШтрихкодов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаШтрихкода.Штрихкод) Тогда
				Продолжить;
			КонецЕсли;
			ЗаписьРегистра = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.Владелец = СправочникСсылка;
			ЗаписьРегистра.Штрихкод = СтрокаШтрихкода.Штрихкод;
			ЗаписьРегистра.ХарактеристикаНоменклатуры = СтрокаШтрихкода.Характеристика;
			Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
				ЗаписьРегистра.ЕдиницаИзмерения = СправочникСсылка.ЕдиницаХраненияОстатков;
				ЗаписьРегистра.Качество = Справочники.Качество.Новый;
			КонецЕсли;
			ЗаписьРегистра.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128;
			Попытка
				ЗаписьРегистра.Записать();
			Исключение
				
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелУстройства);

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");

	ЗаписатьДанные(ЗаписьXML, СправочникСсылка, УзелУстройства);
	ЗапросШтрихкоды = Новый Запрос;
	ЗапросШтрихкоды.УстановитьПараметр("Владелец", СправочникСсылка);
	Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
		ЗапросШтрихкоды.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.Владелец КАК Владелец,
		|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Штрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
		|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|";
	ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
		ЗапросШтрихкоды.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.Владелец КАК Владелец,
		|	Штрихкоды.Характеристика КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|";
	КонецЕсли;
	Выборка = ЗапросШтрихкоды.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Штрихкод.Установить(Выборка.Штрихкод);
		НаборЗаписей.Отбор.Владелец.Установить(Выборка.Владелец);
		Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
			НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(Выборка.ЕдиницаИзмерения);
			НаборЗаписей.Отбор.СерияНоменклатуры.Установить(Выборка.СерияНоменклатуры);
			НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(Выборка.ХарактеристикаНоменклатуры);
		ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
			НаборЗаписей.Отбор.Характеристика.Установить(Выборка.ХарактеристикаНоменклатуры);
		КонецЕсли;
		НаборЗаписей.Прочитать();
		ЗаписатьДанные(ЗаписьXML, НаборЗаписей, УзелУстройства);
	КонецЦикла;

	ЗаписьСообщения.ЗакончитьЗапись();

	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

КонецФункции

Функция ПолучитьКартинкуНоменклатуры(УзелУстройства, Номенклатура, ПолучатьОнлайн, ТекстОшибки) Экспорт

	НоменклатураСсылка = ДесериализаторJSON(Номенклатура);
	Если ПолучатьОнлайн Тогда
		Возврат НоменклатураСсылка.ОсновноеИзображение.Хранилище;
	Иначе
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписатьДанные(ЗаписьXML, НоменклатураСсылка, УзелУстройства, Истина);
		Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
	КонецЕсли;

КонецФункции

Функция ВыгрузитьЦеныНаМобильноеУстройство(УзелУстройства) Экспорт

	ЗаписатьДанныеРегистраСведенийЦеныНоменклатурыМобильные(УзелУстройства);

	ЗаписьXML = Новый ЗаписьXML;

	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелУстройства);

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");

	ТаблицаЦен = ВыгрузитьДанныеРегистраСведенийНаМобильноеУстройство(УзелУстройства, "vrgЦеныНоменклатурыМобильныеСклад");
	НаборЗаписей = РегистрыСведений.vrgЦеныНоменклатурыМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаЦен);
	ЗаписатьДанные(ЗаписьXML, НаборЗаписей, УзелУстройства);

	ЗаписьСообщения.ЗакончитьЗапись();

	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

КонецФункции

Функция ВыгрузитьОстаткиНаМобильноеУстройство(УзелУстройства) Экспорт

	ЗаписатьДанныеРегистраСведенийОстаткиНаСкладахМобильныеСклад(УзелУстройства);

	ЗаписьXML = Новый ЗаписьXML;

	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелУстройства);

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");

	ТаблицаОстатков = ВыгрузитьДанныеРегистраСведенийНаМобильноеУстройство(УзелУстройства, "vrgОстаткиНаСкладахМобильныеСклад");
	НаборЗаписей = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаОстатков);
	ЗаписатьДанные(ЗаписьXML, НаборЗаписей, УзелУстройства);

	ЗаписьСообщения.ЗакончитьЗапись();

	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

КонецФункции

Функция ВыгрузитьДанныеРегистраСведенийНаМобильноеУстройство(УзелУстройства, ИмяРегистра) Экспорт

	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	СтруктураПараметровНастройкиОбмена = ПолучитьСтруктуруПараметровНастройкиОбмена(УзелУстройства);
	СтруктураНастроекОтбора = ПолучитьСтруктуруНастроекОтбора(УзелУстройства);
	СтруктураОписанияОбъекта = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьСтруктуруОписанияОбъекта(МетаданныеРегистра, Ложь);
	МассивПолей = ПолучитьМассивКлючевыхПолейРегистраСведений(МетаданныеРегистра);
	Возврат ПолучитьТаблицуЗаписейРегистраСведений(СтруктураОписанияОбъекта, СтруктураНастроекОтбора, МассивПолей, СтруктураПараметровНастройкиОбмена, УзелУстройства)

КонецФункции

#КонецОбласти

#Область МобильныеРегистрыСведений

Функция ПолучитьТаблицуРазличийДляРегистраСведенийОстаткиНаСкладахМобильныеСклад(УзелУстройства) Экспорт

	Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
		Если Константы.vrg_ИспользоватьХозрасчетныйДляОстатковOctopus.Получить() Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.Субконто3 КАК Склад,
			|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
			|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто4.ХарактеристикаНоменклатуры,ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	0 КАК КоличествоМоб
			|ПОМЕСТИТЬ ОстаткиНеСгруппированные
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В (&СчетаУчета)) КАК ХозрасчетныйОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОстаткиНаСкладахМобильныеСклад.Склад,
			|	ОстаткиНаСкладахМобильныеСклад.Номенклатура,
			|	ОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры,
			|	ОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры,
			|	0,
			|	ОстаткиНаСкладахМобильныеСклад.Количество
			|ИЗ
			|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК ОстаткиНаСкладахМобильныеСклад
			|;
			|
			|ВЫБРАТЬ
			|	Склад,
			|	Номенклатура,
			|	СерияНоменклатуры,
			|	ХарактеристикаНоменклатуры,
			|	СУММА(Количество) КАК Количество,
			|	СУММА(КоличествоМоб) КАК КоличествоМоб
			|ПОМЕСТИТЬ ОстаткиСгруппированные
			|ИЗ
			|	ОстаткиНеСгруппированные КАК ОстаткиНеСгруппированные
			|СГРУППИРОВАТЬ ПО
			|	Склад,
			|	Номенклатура,
			|	СерияНоменклатуры,
			|	ХарактеристикаНоменклатуры
			|;
			|ВЫБРАТЬ
			|	Склад,
			|	Номенклатура,
			|	СерияНоменклатуры,
			|	ХарактеристикаНоменклатуры,
			|	Количество
			|ИЗ
			|	ОстаткиСгруппированные КАК ОстаткиСгруппированные
			|ГДЕ
			|	Количество <> КоличествоМоб
			|";
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
			|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
			|	(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕстьNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)) КАК Количество,
			//|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
			|	0 КАК КоличествоМоб
			|ПОМЕСТИТЬ ОстаткиНеСгруппированные
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладах
			|ПО
			|	ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
			|	И ТоварыВРезервеНаСкладах.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
			|	И ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
			|   И ТоварыВРезервеНаСкладах.Склад = ТоварыНаСкладахОстатки.Склад
			|
			//|ОБЪЕДИНИТЬ ВСЕ
			//|
			//|ВЫБРАТЬ
			//|	ТоварыВРозницеОстатки.Склад,
			//|	ТоварыВРозницеОстатки.Номенклатура,
			//|	ТоварыВРозницеОстатки.СерияНоменклатуры,
			////|	(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕстьNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)) КАК Количество,
			//|	ТоварыВРозницеОстатки.КоличествоОстаток КАК Количество,
			//|	0 КАК КоличествоМоб
			//|ИЗ
			//|	РегистрНакопления.ТоварыВРознице.Остатки КАК ТоварыВРозницеОстатки
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОстаткиНаСкладахМобильныеСклад.Склад,
			|	ОстаткиНаСкладахМобильныеСклад.Номенклатура,
			|	ОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры,
			|	ОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры,
			|	0,
			|	ОстаткиНаСкладахМобильныеСклад.Количество
			|ИЗ
			|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК ОстаткиНаСкладахМобильныеСклад
			|;
			|
			|ВЫБРАТЬ
			|	Склад,
			|	Номенклатура,
			|	СерияНоменклатуры,
			|	ХарактеристикаНоменклатуры,
			|	СУММА(Количество) КАК Количество,
			|	СУММА(КоличествоМоб) КАК КоличествоМоб
			|ПОМЕСТИТЬ ОстаткиСгруппированные
			|ИЗ
			|	ОстаткиНеСгруппированные КАК ОстаткиНеСгруппированные
			|СГРУППИРОВАТЬ ПО
			|	Склад,
			|	Номенклатура,
			|	СерияНоменклатуры,
			|	ХарактеристикаНоменклатуры
			|;
			|ВЫБРАТЬ
			|	Склад,
			|	Номенклатура,
			|	СерияНоменклатуры,
			|	ХарактеристикаНоменклатуры,
			|	Количество
			|ИЗ
			|	ОстаткиСгруппированные КАК ОстаткиСгруппированные
			|ГДЕ
			|	Количество <> КоличествоМоб
			|";
		КонецЕсли;

	ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
		|	ТоварыНаСкладахОстатки.Характеристика КАК ХарактеристикаНоменклатуры,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|	0 КАК КоличествоМоб
		|ПОМЕСТИТЬ ОстаткиНеСгруппированные
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиНаСкладахМобильныеСклад.Склад,
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура,
		|	ОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры,
		|	ОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры,
		|	0,
		|	ОстаткиНаСкладахМобильныеСклад.Количество
		|ИЗ
		|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК ОстаткиНаСкладахМобильныеСклад
		|;
		|
		|ВЫБРАТЬ
		|	Склад,
		|	Номенклатура,
		|	СерияНоменклатуры,
		|	ХарактеристикаНоменклатуры,
		|	СУММА(Количество) КАК Количество,
		|	СУММА(КоличествоМоб) КАК КоличествоМоб
		|ПОМЕСТИТЬ ОстаткиСгруппированные
		|ИЗ
		|	ОстаткиНеСгруппированные КАК ОстаткиНеСгруппированные
		|СГРУППИРОВАТЬ ПО
		|	Склад,
		|	Номенклатура,
		|	СерияНоменклатуры,
		|	ХарактеристикаНоменклатуры
		|;
		|ВЫБРАТЬ
		|	Склад,
		|	Номенклатура,
		|	СерияНоменклатуры,
		|	ХарактеристикаНоменклатуры,
		|	Количество
		|ИЗ
		|	ОстаткиСгруппированные КАК ОстаткиСгруппированные
		|ГДЕ
		|	Количество <> КоличествоМоб
		|";

	КонецЕсли;

	СтруктураПараметровНастройкиОбмена = ПолучитьСтруктуруПараметровНастройкиОбмена(УзелУстройства);
	СтруктураНастроекОтбора = ПолучитьСтруктуруНастроекОтбора(УзелУстройства);
	СтруктураОписанияОбъекта = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьСтруктуруОписанияОбъекта(Метаданные.РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад, Ложь);
	МассивПолейОтбора = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьМассивПолейОтбораДляОбъекта("РегистрыСведений", СтруктураОписанияОбъекта.ИмяОбъекта);
	ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора);
	СхемаКомпоновки = ПолучитьСхемуКомпоновкиДанныхДляВыборки(ТекстЗапроса);
	НастройкиКомпоновки = СкомпоноватьНастройки(СхемаКомпоновки);
	ДобавитьОтборыИзСхемыОбмена(НастройкиКомпоновки, СтруктураНастроекОтбора, СтруктураОписанияОбъекта.ИмяКласса, СтруктураОписанияОбъекта.ИмяОбъекта, Истина, СтруктураПараметровНастройкиОбмена, Истина);
	Макет = ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
	Запрос = ПолучитьЗапросИзМакетаКомпоновки(Макет, "Запрос");
	ДобавитьПараметрыЗапроса(Запрос, СтруктураОписанияОбъекта.ИмяКласса, СтруктураОписанияОбъекта.ИмяОбъекта, СтруктураПараметровНастройкиОбмена, УзелУстройства);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ЗаписатьДанныеРегистраСведенийОстаткиНаСкладахМобильныеСклад(УзелУстройства) Экспорт

	ТаблицаРазличий = ПолучитьТаблицуРазличийДляРегистраСведенийОстаткиНаСкладахМобильныеСклад(УзелУстройства);
	Если ТаблицаРазличий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ТаблицаРазличий Цикл

		Если СтрокаТаблицы.Количество <> 0 Тогда
			НаборЗаписей = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Склад.Установить(СтрокаТаблицы.Склад);
			НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
			НаборЗаписей.Отбор.СерияНоменклатуры.Установить(СтрокаТаблицы.СерияНоменклатуры);
			НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Склад = СтрокаТаблицы.Склад;
			НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура;
			НоваяЗапись.СерияНоменклатуры = СтрокаТаблицы.СерияНоменклатуры;
			НоваяЗапись.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
			НоваяЗапись.Количество = СтрокаТаблицы.Количество;
			НаборЗаписей.Записать();
		Иначе
			НаборЗаписейОчистка = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
			НаборЗаписейОчистка.Отбор.Склад.Установить(СтрокаТаблицы.Склад);
			НаборЗаписейОчистка.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
			НаборЗаписейОчистка.Отбор.СерияНоменклатуры.Установить(СтрокаТаблицы.СерияНоменклатуры);
			НаборЗаписейОчистка.Отбор.ХарактеристикаНоменклатуры.Установить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
			НаборЗаписейОчистка.Прочитать();
			Если НаборЗаписейОчистка.Количество() > 0 Тогда
				НаборЗаписейОчистка.Очистить();
				НаборЗаписейОчистка.Записать();
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТаблицуРазличийДляРегистраСведенийЦеныНоменклатурыМобильные(УзелУстройства)

	Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура,
		|	ЦеныНоменклатуры.ЕдиницаИзмерения,
		|	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
		|	ЦеныНоменклатуры.Цена КАК Цена,
		|	0 КАК ЦенаМоб
		|ПОМЕСТИТЬ ОстаткиНеСгруппированные
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних() КАК ЦеныНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыМобильные.Номенклатура,
		|	ЦеныНоменклатурыМобильные.ЕдиницаИзмерения,
		|	ЦеныНоменклатурыМобильные.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыМобильные.ТипЦен,
		|	0,
		|	ЦеныНоменклатурыМобильные.Цена
		|ИЗ
		|	РегистрСведений.vrgЦеныНоменклатурыМобильныеСклад КАК ЦеныНоменклатурыМобильные
		|;
		|
		|ВЫБРАТЬ
		|	Номенклатура,
		|	ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры,
		|	ТипЦен,
		|	МАКСИМУМ(Цена) КАК Цена,
		|	МАКСИМУМ(ЦенаМоб) КАК ЦенаМоб
		|ПОМЕСТИТЬ ОстаткиСгруппированные
		|ИЗ
		|	ОстаткиНеСгруппированные КАК ОстаткиНеСгруппированные
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура,
		|	ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры,
		|	ТипЦен
		|;
		|ВЫБРАТЬ
		|	Номенклатура,
		|	ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры,
		|	ТипЦен,
		|	Цена
		|ИЗ
		|	ОстаткиСгруппированные КАК ОстаткиСгруппированные
		|ГДЕ
		|	Цена <> ЦенаМоб
		|";
	ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура,
		// пересмотреть
		|	ЦеныНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЦеныНоменклатуры.Характеристика КАК ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатуры.ВидЦены КАК ТипЦен,
		|	ЦеныНоменклатуры.Цена КАК Цена,
		|	0 КАК ЦенаМоб
		|ПОМЕСТИТЬ ОстаткиНеСгруппированные
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних() КАК ЦеныНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыМобильные.Номенклатура,
		|	ЦеныНоменклатурыМобильные.ЕдиницаИзмерения,
		|	ЦеныНоменклатурыМобильные.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыМобильные.ТипЦен,
		|	0,
		|	ЦеныНоменклатурыМобильные.Цена
		|ИЗ
		|	РегистрСведений.vrgЦеныНоменклатурыМобильныеСклад КАК ЦеныНоменклатурыМобильные
		|;
		|
		|ВЫБРАТЬ
		|	Номенклатура,
		|	ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры,
		|	ТипЦен,
		|	МАКСИМУМ(Цена) КАК Цена,
		|	МАКСИМУМ(ЦенаМоб) КАК ЦенаМоб
		|ПОМЕСТИТЬ ОстаткиСгруппированные
		|ИЗ
		|	ОстаткиНеСгруппированные КАК ОстаткиНеСгруппированные
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура,
		|	ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры,
		|	ТипЦен
		|;
		|ВЫБРАТЬ
		|	Номенклатура,
		|	ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры,
		|	ТипЦен,
		|	Цена
		|ИЗ
		|	ОстаткиСгруппированные КАК ОстаткиСгруппированные
		|ГДЕ
		|	Цена <> ЦенаМоб
		|";
	КонецЕсли;

	СтруктураПараметровНастройкиОбмена = ПолучитьСтруктуруПараметровНастройкиОбмена(УзелУстройства);
	СтруктураНастроекОтбора = ПолучитьСтруктуруНастроекОтбора(УзелУстройства);
	СтруктураОписанияОбъекта = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьСтруктуруОписанияОбъекта(Метаданные.РегистрыСведений.vrgЦеныНоменклатурыМобильныеСклад, Ложь);
	МассивПолейОтбора = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьМассивПолейОтбораДляОбъекта("РегистрыСведений", СтруктураОписанияОбъекта.ИмяОбъекта);
	ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора);
	СхемаКомпоновки = ПолучитьСхемуКомпоновкиДанныхДляВыборки(ТекстЗапроса);
	НастройкиКомпоновки = СкомпоноватьНастройки(СхемаКомпоновки);
	ДобавитьОтборыИзСхемыОбмена(НастройкиКомпоновки, СтруктураНастроекОтбора, СтруктураОписанияОбъекта.ИмяКласса, СтруктураОписанияОбъекта.ИмяОбъекта, Истина, СтруктураПараметровНастройкиОбмена, Истина);
	Макет = ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
	Запрос = ПолучитьЗапросИзМакетаКомпоновки(Макет, "Запрос");
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ЗаписатьДанныеРегистраСведенийЦеныНоменклатурыМобильные(УзелУстройства) Экспорт

	ТаблицаРазличий = ПолучитьТаблицуРазличийДляРегистраСведенийЦеныНоменклатурыМобильные(УзелУстройства);
	Если ТаблицаРазличий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ТаблицаРазличий Цикл

		Если СтрокаТаблицы.Цена <> 0 Тогда
			НаборЗаписей = РегистрыСведений.vrgЦеныНоменклатурыМобильныеСклад.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
			НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(СтрокаТаблицы.ЕдиницаИзмерения);
			НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
			НаборЗаписей.Отбор.ТипЦен.Установить(СтрокаТаблицы.ТипЦен);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура;
			НоваяЗапись.ТипЦен = СтрокаТаблицы.ТипЦен;
			НоваяЗапись.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
			НоваяЗапись.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
			НоваяЗапись.Цена = СтрокаТаблицы.Цена;
			НаборЗаписей.Записать();
		Иначе
			НаборЗаписейОчистка = РегистрыСведений.vrgЦеныНоменклатурыМобильныеСклад.СоздатьНаборЗаписей();
			НаборЗаписейОчистка.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
			НаборЗаписейОчистка.Отбор.ЕдиницаИзмерения.Установить(СтрокаТаблицы.ЕдиницаИзмерения);
			НаборЗаписейОчистка.Отбор.ХарактеристикаНоменклатуры.Установить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
			НаборЗаписейОчистка.Отбор.ТипЦен.Установить(СтрокаТаблицы.ТипЦен);
			НаборЗаписейОчистка.Прочитать();
			Если НаборЗаписейОчистка.Количество() > 0 Тогда
				НаборЗаписейОчистка.Очистить();
				НаборЗаписейОчистка.Записать();
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТаблицуРазличийДляРегистраСведенийОстаткиЗаказовПоставщикамМобильные()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад КАК Склад,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	|	0 КАК КоличествоМоб
	|ПОМЕСТИТЬ ОстаткиНеСгруппированные
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиЗаказовПоставщикамМобильные.Склад,
	|	ОстаткиЗаказовПоставщикамМобильные.Номенклатура,
	|	ОстаткиЗаказовПоставщикамМобильные.ХарактеристикаНоменклатуры,
	|	ОстаткиЗаказовПоставщикамМобильные.Контрагент,
	|	ОстаткиЗаказовПоставщикамМобильные.ЗаказПоставщику,
	|	0,
	|	ОстаткиЗаказовПоставщикамМобильные.Количество
	|ИЗ
	|	РегистрСведений.vrgОстаткиЗаказовПоставщикамМобильные КАК ОстаткиЗаказовПоставщикамМобильные
	|;
	|
	|ВЫБРАТЬ
	|	Склад,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Контрагент,
	|	ЗаказПоставщику,
	|	СУММА(Количество) КАК Количество,
	|	СУММА(КоличествоМоб) КАК КоличествоМоб
	|ПОМЕСТИТЬ ОстаткиСгруппированные
	|ИЗ
	|	ОстаткиНеСгруппированные КАК ОстаткиНеСгруппированные
	|СГРУППИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Контрагент,
	|	ЗаказПоставщику
	|;
	|ВЫБРАТЬ
	|	Склад,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Контрагент,
	|	ЗаказПоставщику,
	|	Количество
	|ИЗ
	|	ОстаткиСгруппированные КАК ОстаткиСгруппированные
	|ГДЕ
	|	Количество <> КоличествоМоб
	|";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ЗаписатьДанныеРегистраСведенийОстаткиЗаказовПоставщикамМобильные(УзелУстройства) Экспорт

	ТаблицаРазличий = ПолучитьТаблицуРазличийДляРегистраСведенийОстаткиЗаказовПоставщикамМобильные();
	Если ТаблицаРазличий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	//МассивУзлов = ПолучитьМассивВсехУзловОбменаСМобильнымиУстройствами();

	Для Каждого СтрокаТаблицы Из ТаблицаРазличий Цикл

		Если СтрокаТаблицы.Количество <> 0 Тогда
			НаборЗаписей = РегистрыСведений.vrgОстаткиЗаказовПоставщикамМобильные.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Склад.Установить(СтрокаТаблицы.Склад);
			НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
			НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
			НаборЗаписей.Отбор.Контрагент.Установить(СтрокаТаблицы.Контрагент);
			НаборЗаписей.Отбор.ЗаказПоставщику.Установить(СтрокаТаблицы.ЗаказПоставщику);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Склад = СтрокаТаблицы.Склад;
			НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
			НоваяЗапись.Контрагент = СтрокаТаблицы.Контрагент;
			НоваяЗапись.ЗаказПоставщику = СтрокаТаблицы.ЗаказПоставщику;
			НоваяЗапись.Количество = СтрокаТаблицы.Количество;
			НаборЗаписей.Записать();
			// зарегистрируем заказ поставщику
			//ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, СтрокаТаблицы.ЗаказПоставщику);
		Иначе
			НаборЗаписейОчистка = РегистрыСведений.vrgОстаткиЗаказовПоставщикамМобильные.СоздатьНаборЗаписей();
			НаборЗаписейОчистка.Отбор.Склад.Установить(СтрокаТаблицы.Склад);
			НаборЗаписейОчистка.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
			НаборЗаписейОчистка.Отбор.ХарактеристикаНоменклатуры.Установить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
			НаборЗаписейОчистка.Отбор.Контрагент.Установить(СтрокаТаблицы.Контрагент);
			НаборЗаписейОчистка.Отбор.ЗаказПоставщику.Установить(СтрокаТаблицы.ЗаказПоставщику);
			НаборЗаписейОчистка.Прочитать();
			Если НаборЗаписейОчистка.Количество() > 0 Тогда
				НаборЗаписейОчистка.Очистить();
				НаборЗаписейОчистка.Записать();
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаТиповДанных

Процедура ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, ВыгружатьПризнакГруппы = Истина, ВыгружатьРодителя = Истина, ВыгружатьВладельца = Ложь, ВыгружатьКод = Истина, УзелУстройства = Неопределено)

	ЗаписатьXML(ЗаписьXML, Данные.Ссылка.УникальныйИдентификатор(), "Ref");

	Если ВыгружатьПризнакГруппы Тогда
		ЗаписатьXML(ЗаписьXML, Данные.ЭтоГруппа, "IsFolder");
	КонецЕсли;

	ЗаписатьXML(ЗаписьXML, Данные.ПометкаУдаления, "DeletionMark");

	Если ВыгружатьВладельца Тогда
		ЗаписатьXML(ЗаписьXML, Данные.Владелец, "Owner", НазначениеТипаXML.Явное);
	КонецЕсли;

	Если ВыгружатьРодителя Тогда
		ЗаписатьXML(ЗаписьXML, Данные.Родитель.УникальныйИдентификатор(), "Parent");
	КонецЕсли;

	Если ВыгружатьКод Тогда
		ЗаписатьXML(ЗаписьXML, Данные.Код, "Code");
	КонецЕсли;

	ЗаписатьXML(ЗаписьXML, Данные.Наименование, "Description");

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуОбщихРеквизитовДокументов(ЗаписьXML, Данные)
	
	ЗаписатьXML(ЗаписьXML, Данные.Ссылка.УникальныйИдентификатор(), "Ref");

	ЗаписатьXML(ЗаписьXML, Данные.ПометкаУдаления, "DeletionMark");

	ЗаписатьXML(ЗаписьXML, Данные.Дата, "Date");

	ЗаписатьXML(ЗаписьXML, Данные.Номер, "Number");

	ЗаписатьXML(ЗаписьXML, Данные.Проведен, "Posted");

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуСправочникНоменклатура(ЗаписьXML, Данные, УзелУстройства, ВыгружатьКартинкиПринудительно)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Номенклатура");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные);

	Если Не Данные.ЭтоГруппа Тогда
		ЗаписатьXML(ЗаписьXML, Данные.Весовой, "Весовой");
		Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
			ЕдиницаХраненияОстатков = Данные.ЕдиницаХраненияОстатков;
			ОсновноеИзображениеНоменклатуры = Данные.ОсновноеИзображение;
		ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
			ЕдиницаХраненияОстатков = "00000000-0000-0000-0000-000000000000";
			ОсновноеИзображениеНоменклатуры = Неопределено;
		КонецЕсли;
		ЗаписатьXML(ЗаписьXML, ЕдиницаХраненияОстатков, "ЕдиницаХраненияОстатков");
		ЗаписатьXML(ЗаписьXML, ЗначениеЗаполнено(ОсновноеИзображениеНоменклатуры), "ОсновноеИзображениеДобавлено");
		ЗаписатьXML(ЗаписьXML, Данные.Артикул, "Артикул");
		ОсновноеИзображение = Новый ХранилищеЗначения(Неопределено);
		Если ЗначениеЗаполнено(ОсновноеИзображениеНоменклатуры)
			И (УзелУстройства.ВыгружатьКартинки ИЛИ ВыгружатьКартинкиПринудительно) Тогда
			ОсновноеИзображение = ОсновноеИзображениеНоменклатуры.Хранилище;
		КонецЕсли;
		ЗаписатьXML(ЗаписьXML, ОсновноеИзображение, "ОсновноеИзображение");
		ЕдиницаИзмерения = "00000000-0000-0000-0000-000000000000";
		Если УзелУстройства.Конфигурация = "BASRetail" Тогда
			ЕдиницаИзмерения = Данные.ЕдиницаИзмерения;
		КонецЕсли;
		ЗаписатьXML(ЗаписьXML, ЕдиницаИзмерения, "ЕдиницаИзмерения");
		ЗаписатьXML(ЗаписьXML, Данные.ВестиУчетПоСериям, "ВестиУчетПоСериям");
	КонецЕсли;

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникЕдиницыИзмерения(ЗаписьXML, Данные, УзелУстройства)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ЕдиницыИзмерения");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь, Истина, , УзелУстройства);

	Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
		Коэффициент = Данные.Коэффициент;
	ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
		Коэффициент = 0;
	КонецЕсли;
	ЗаписатьXML(ЗаписьXML, Коэффициент, "Коэффициент");

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникБазовыеЕдиницыИзмерения(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.БазовыеЕдиницыИзмерения");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникСерииНоменклатуры(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СерииНоменклатуры");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь, Истина);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникХарактеристикиНоменклатуры(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ХарактеристикиНоменклатуры");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь, Истина, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникКонтрагенты(ЗаписьXML, Данные, УзелУстройства)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Контрагенты"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные);

	Если Не Данные.ЭтоГруппа Тогда
		Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
			ОсновнойДоговорКонтрагента = Данные.ОсновнойДоговорКонтрагента;
		ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
			ОсновнойДоговорКонтрагента = "00000000-0000-0000-0000-000000000000";
		КонецЕсли;
		ЗаписатьXML(ЗаписьXML, ОсновнойДоговорКонтрагента, "ОсновнойДоговорКонтрагента");
	КонецЕсли;

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуСправочникДоговорыКонтрагентов(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ДоговорыКонтрагентов"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, , , Истина);

	Если Не Данные.ЭтоГруппа Тогда
		ЗаписатьXML(ЗаписьXML, ?(ТипЗнч(Данные.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры"), Данные.ТипЦен, Справочники.ТипыЦенНоменклатуры.ПустаяСсылка()),
						"ТипЦен");
		ЗаписатьXML(ЗаписьXML, Данные.ДопустимоеЧислоДнейЗадолженности, "ДопустимоеЧислоДнейЗадолженности");
		ЗаписатьXML(ЗаписьXML, Данные.КонтролироватьЧислоДнейЗадолженности, "КонтролироватьЧислоДнейЗадолженности");
		ЗаписатьXML(ЗаписьXML, Данные.Организация, "Организация");
		ЗаписатьXML(ЗаписьXML, Данные.ВидДоговора, "ВидДоговора");
	КонецЕсли;

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникОрганизации(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Организации"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуСправочникТипыЦенНоменклатуры(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ТипыЦенНоменклатуры"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникСклады(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Склады");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникПользователи(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Пользователи");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуРегистрСведенийШтрихкоды(ЗаписьXML, Данные, УзелУстройства)

	ЗаписьXML.ЗаписатьНачалоЭлемента("InformationRegisterRecordSet.Штрихкоды");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Filter");
	ЗаписатьXML(ЗаписьXML, Данные.Отбор.Штрихкод.Значение, "Штрихкод");
	ЗаписатьXML(ЗаписьXML, Данные.Отбор.Владелец.Значение, "Владелец");
	Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
		ЗаписатьXML(ЗаписьXML, Данные.Отбор.ЕдиницаИзмерения.Значение, "ЕдиницаИзмерения");
		Если Данные.Отбор.СерияНоменклатуры.Использование Тогда
		ЗаписатьXML(ЗаписьXML, Данные.Отбор.СерияНоменклатуры.Значение, "СерияНоменклатуры");
		КонецЕсли;
		Если Данные.Отбор.ХарактеристикаНоменклатуры.Использование Тогда
			ЗаписатьXML(ЗаписьXML, Данные.Отбор.ХарактеристикаНоменклатуры.Значение, "ХарактеристикаНоменклатуры");
		КонецЕсли;
	ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
		ЗаписатьXML(ЗаписьXML, "00000000-0000-0000-0000-000000000000", "ЕдиницаИзмерения");
		Если Данные.Отбор.Характеристика.Использование Тогда
			ЗаписатьXML(ЗаписьXML, Данные.Отбор.Характеристика.Значение, "ХарактеристикаНоменклатуры");
		КонецЕсли;
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Records");
	Для Каждого СтрокаНабора Из Данные Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписатьXML(ЗаписьXML, СтрокаНабора.Штрихкод, "Штрихкод");
		ЗаписатьXML(ЗаписьXML, СтрокаНабора.Владелец, "Владелец");
		Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
			ЗаписатьXML(ЗаписьXML, СтрокаНабора.ЕдиницаИзмерения, "ЕдиницаИзмерения");
			ЗаписатьXML(ЗаписьXML, СтрокаНабора.СерияНоменклатуры, "СерияНоменклатуры");
			ЗаписатьXML(ЗаписьXML, СтрокаНабора.ХарактеристикаНоменклатуры, "ХарактеристикаНоменклатуры");
		ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
			ЗаписатьXML(ЗаписьXML, "00000000-0000-0000-0000-000000000000", "ЕдиницаИзмерения");
			ЗаписатьXML(ЗаписьXML, "00000000-0000-0000-0000-000000000000", "СерияНоменклатуры");
			ЗаписатьXML(ЗаписьXML, СтрокаНабора.Характеристика, "ХарактеристикаНоменклатуры");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуДокументЗаказПоставщику(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ЗаказПоставщику");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовДокументов(ЗаписьXML, Данные);

	ЗаписатьXML(ЗаписьXML, Данные.ДатаПоступления, "ДатаПоступления");
	ЗаписатьXML(ЗаписьXML, Данные.Склад, "Склад");
	ЗаписатьXML(ЗаписьXML, Данные.Контрагент, "Контрагент");

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуДокументПоступлениеТоваровУслуг(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.vrgПоступлениеМобильное");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовДокументов(ЗаписьXML, Данные);

	ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
	Если ТипЗнч(Данные.Сделка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаказПоставщику = Данные.Сделка;
	КонецЕсли;
	ЗаписатьXML(ЗаписьXML, ЗаказПоставщику, "ЗаказПоставщику");
	ЗаписатьXML(ЗаписьXML, Данные.Контрагент, "Контрагент");
	СкладОрдер = Справочники.Склады.ПустаяСсылка();
	Если ТипЗнч(Данные.СкладОрдер) = Тип("СправочникСсылка.Склады") Тогда
		СкладОрдер = Данные.СкладОрдер;
	КонецЕсли;
	ЗаписатьXML(ЗаписьXML, СкладОрдер, "Склад");
	ЗаписатьXML(ЗаписьXML, Данные.Ответственный, "Ответственный");
	ЗаписатьXML(ЗаписьXML, Данные.Комментарий, "Комментарий");
	ЗаписатьXML(ЗаписьXML, "", "КодУзлаОбмена");
	ЗаписатьXML(ЗаписьXML, Ложь, "СозданНаМобильномУстройстве");

	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
	Для Каждого СтрокаТовары Из Данные.Товары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Row");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Номенклатура, "Номенклатура");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.СерияНоменклатуры, "СерияНоменклатуры");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.КоличествоОтсканировано, "Количество");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Количество, "КоличествоЗаказ");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуДокументРеализацияТоваровУслуг(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.vrgРеализацияМобильная");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовДокументов(ЗаписьXML, Данные);

	ЗаписатьXML(ЗаписьXML, Данные.Контрагент, "Контрагент");
	ЗаписатьXML(ЗаписьXML, Данные.Склад, "Склад");
	ЗаписатьXML(ЗаписьXML, Данные.Ответственный, "Ответственный");
	ЗаписатьXML(ЗаписьXML, Данные.Комментарий, "Комментарий");
	ЗаписатьXML(ЗаписьXML, "", "КодУзлаОбмена");
	ЗаписатьXML(ЗаписьXML, Ложь, "СозданНаМобильномУстройстве");
	ЗаписатьXML(ЗаписьXML, Данные.ОтобранНаСкладе, "Отобран");

	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
	Для Каждого СтрокаТовары Из Данные.Товары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Row");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Номенклатура, "Номенклатура");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.СерияНоменклатуры, "СерияНоменклатуры");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.КоличествоОтсканировано, "Количество");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Количество, "КоличествоЗаказ");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуДокументИнвентаризацияТоваровНаСкладе(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.vrgИнвентаризацияМобильная");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовДокументов(ЗаписьXML, Данные);

	ЗаписатьXML(ЗаписьXML, Данные.Склад, "Склад");
	ЗаписатьXML(ЗаписьXML, Данные.Ответственный, "Ответственный");
	ЗаписатьXML(ЗаписьXML, Данные.Комментарий, "Комментарий");
	ЗаписатьXML(ЗаписьXML, Справочники.Номенклатура.ПустаяСсылка(), "Группа");
	ЗаписатьXML(ЗаписьXML, "", "КодУзлаОбмена");
	ЗаписатьXML(ЗаписьXML, Ложь, "СозданНаМобильномУстройстве");

	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
	Для Каждого СтрокаТовары Из Данные.Товары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Row");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Номенклатура, "Номенклатура");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.СерияНоменклатуры, "СерияНоменклатуры");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Количество, "Количество");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.КоличествоУчет, "КоличествоУчет");
		ЗаписатьXML(ЗаписьXML, "", "Штрихкод");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуДокументПеремещениеТоваров(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ПеремещениеТоваров");

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовДокументов(ЗаписьXML, Данные);

	ЗаписатьXML(ЗаписьXML, Данные.СкладОтправитель, "СкладОтправитель");
	ЗаписатьXML(ЗаписьXML, Данные.СкладПолучатель, "СкладПолучатель");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
	Для Каждого СтрокаТовары Из Данные.Товары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Row");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Номенклатура, "Номенклатура");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.СерияНоменклатуры, "СерияНоменклатуры");
		ЗаписатьXML(ЗаписьXML, СтрокаТовары.Количество, "Количество");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ВыгрузкаВМобильнуюБазуРегистрСведенийНастройкиМобильныхУстройств(ЗаписьXML, Данные, УзелУстройства)

	// обновляем, только если есть, что обновлять,
	// в противном случае оставляем на устройстве прошлые настройки - перестраховка от случайного затирания
	Данные.Прочитать();
	Если Данные.Количество() > 0 Тогда
		СтрокаНастроек = Данные[0];
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.КоличествоДнейХраненияДокументовНаУстройстве");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.КоличествоДнейХраненияДокументовНаУстройстве, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.КоличествоДнейДоступностиРедактированияДокументов");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.КоличествоДнейДоступностиРедактированияДокументов, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьАвтосохранение");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьАвтосохранение, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИнтервалАвтосохранения");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИнтервалАвтосохранения, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ЗапрашиватьКоличествоПриСканировании");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ЗапрашиватьКоличествоПриСканировании, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.РазрешитьРедактированиеДатыДокументов");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.РазрешитьРедактированиеДатыДокументов, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИдентификаторУстройства");
		ЗаписатьXML(ЗаписьXML, СтрокаНастроек.ИдентификаторУстройства, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ПарольДляВходаНаУстройстве");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ПарольДляВходаНаУстройстве, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ПользовательПоУмолчанию");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.Пользователь, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ХранилищеТаблицыКомандРабочегоСтола");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ХранилищеТаблицыКомандРабочегоСтола, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИмяОсновнойКонфигурации");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.Конфигурация, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьЕдиницыИзмерения");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23", "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьБазовыеЕдиницыИзмерения");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.Конфигурация = "BASRetail", "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДоговорыКонтрагентов");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23", "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументИнвентаризация");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументИнвентаризация, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументПоступление");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументПоступление, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументРеализация");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументРеализация, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументСписание");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументСписание, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументОприходование");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументОприходование, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументПеремещение");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументПеремещение, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументВозвратПоставщику");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументВозвратПоставщику, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументВозвратОтКлиента");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументВозвратОтКлиента, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументЗаказКлиента");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументЗаказКлиента, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументЗаказПоставщику");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументЗаказПоставщику, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.РазрешитьРедактированиеОтветственного");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.РазрешитьРедактированиеОтветственного, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьУниверсальныйДокумент");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьУниверсальныйДокумент, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//+NovashIV_24.01.2023
		ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьДокументТребованиеНакладная");
		ЗаписатьXML(ЗаписьXML, УзелУстройства.ИспользоватьДокументТребованиеНакладная, "Value");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//-NovashIV_24.01.2023
		
	КонецЕсли;

КонецПроцедуры

//+NovashIV_24.01.2023

Процедура ВыгрузкаВМобильнуюБазуСправочникОбласти(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Области"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникРайоны(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Районы"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь, Истина);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникНаселенныеПункты(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.НаселенныеПункты"); 
	
	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь, Истина);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникУлицы(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Улицы"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь, Истина);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникСтатьиЗатрат(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СтатьиЗатрат"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные,,,,Истина);
	
	Если Не Данные.ЭтоГруппа Тогда
		ЗаписатьXML(ЗаписьXML, Данные.НаправлениеЗатрат, "НаправлениеЗатрат");
	
	КонецЕсли;
		
	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры 

Процедура ВыгрузкаВМобильнуюБазуСправочникНаправленияЗатрат(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.НаправленияЗатрат"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры               

Процедура ВыгрузкаВМобильнуюБазуСправочникПодразделения(ЗаписьXML, Данные)

	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Подразделения"); 

	ВыгрузкаВМобильнуюБазуОбщихРеквизитовСправочников(ЗаписьXML, Данные, Ложь, Истина, Ложь);

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры  

//-NovashIV_24.01.2023

#КонецОбласти

#Область Служебное

// Функция получает массив узлов обмена с мобильными устройствами
//
// Параметры
//  нет.
//
// Возвращаемое значение:
//   <Массив>   - возвращает массив узлов.
//
Функция ПолучитьМассивВсехУзловОбменаСМобильнымиУстройствами() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Мобильные.Ссылка
	|ИЗ
	|	ПланОбмена.vrgМобильныеСклад КАК Мобильные
	|ГДЕ
	|	Мобильные.Ссылка <> &ЭтотУзелМобильные
	|";

	Запрос.УстановитьПараметр("ЭтотУзелМобильные", ПланыОбмена.vrgМобильныеСклад.ЭтотУзел());
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассивСсылок;

КонецФункции

Функция ТребуетсяУдалениеДанныхНаМобильномУстройстве(Данные, УзелУстройства)

	Если (УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23") И ТипЗнч(Данные) = Тип("СправочникОбъект.ЕдиницыИзмерения") Тогда
		Если ТипЗнч(Данные.Владелец) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.Штрихкоды") Тогда
		Если ТипЗнч(Данные.Отбор.Владелец.Значение) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Процедура УдалениеДанных(Данные)

	// Получаем объект описания метаданного, соответствующий данным
	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	// Проверяем тип, интересуют только те типы, которые реализованы на мобильной платформе
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда

		// Перенос удаления объекта для объектных
		Данные = Новый УдалениеОбъекта(Данные.Ссылка);

	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда

		// Очищаем данные
		Данные.Очистить();

	КонецЕсли;

КонецПроцедуры

Функция НуженПереносДанных(Данные, УзелУстройства)
Попытка
	
	Если (УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23") И ТипЗнч(Данные) = Тип("СправочникОбъект.ЕдиницыИзмерения") Тогда
		Если ТипЗнч(Данные.Владелец) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.Штрихкоды") Тогда
		Если ТипЗнч(Данные.Отбор.Владелец.Значение) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат Ложь;
		КонецЕсли;
		
	//+ НОВАШ РУСЛАН
	ИначеЕсли ТипЗнч(Данные) = тип("УдалениеОбъекта") Тогда 
		Возврат Ложь;
	//-
	
	// если это справочник, то транслируем удаление объекта в следующих случаях:
	// 1. если элемент помечен на удаление;
	// 2. если это серия, а в узле не задано использование серий;
	// 3. если это характеристика, а в узле не задано использование характеристик.
	ИначеЕсли (Метаданные.Справочники.Найти(Метаданные.НайтиПоТипу(ТипЗнч(Данные)).Имя) <> Неопределено И Данные.ПометкаУдаления) Тогда
		//ИЛИ (ТипЗнч(Данные) = Тип("СправочникОбъект.СерииНоменклатуры") И НЕ УзелУстройства.ИспользоватьСерииНоменклатуры)
		//ИЛИ (ТипЗнч(Данные) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") И НЕ УзелУстройства.ИспользоватьХарактеристикиНоменклатуры) Тогда
			Возврат Ложь;
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.vrgНастройкиМобильныхУстройств")
		И Данные.Отбор.УзелУстройства <> УзелУстройства Тогда
			Возврат Ложь;
			
		ИначеЕсли ТипЗнч(Данные) = тип("УдалениеОбъекта") Тогда 
			Возврат Ложь;
			
	КонецЕсли;

	Возврат Истина;
Исключение
	//ЗаписьЖурналаРегистрации("ОШИБКА",УровеньЖурналаРегистрации.Ошибка,,Данные," "+ОписаниеОшибки()+ " " + Данные +" "+ ТипЗнч(Данные),РежимТранзакцииЗаписиЖурналаРегистрации.Независимая );
	
	КонецПопытки;
КонецФункции

Процедура ЗаписатьДанные(ЗаписьXML, Данные, УзелУстройства, ВыгружатьКартинкиПринудительно = Ложь) Экспорт

	#Если Клиент Тогда
	Состояние(СокрЛП(Данные));
	ОбработкаПрерыванияПользователя();
	#КонецЕсли
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВыгрузкаВМобильнуюБазуСправочникНоменклатура(ЗаписьXML, Данные, УзелУстройства, ВыгружатьКартинкиПринудительно);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Контрагенты")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВыгрузкаВМобильнуюБазуСправочникКонтрагенты(ЗаписьXML, Данные, УзелУстройства);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Организации")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Организации") Тогда
		ВыгрузкаВМобильнуюБазуСправочникОрганизации(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Склады")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Склады") Тогда
		ВыгрузкаВМобильнуюБазуСправочникСклады(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СерииНоменклатуры")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		ВыгрузкаВМобильнуюБазуСправочникСерииНоменклатуры(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		ВыгрузкаВМобильнуюБазуСправочникХарактеристикиНоменклатуры(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Пользователи")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Пользователи") Тогда
		ВыгрузкаВМобильнуюБазуСправочникПользователи(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.Штрихкоды") Тогда
		ВыгрузкаВМобильнуюБазуРегистрСведенийШтрихкоды(ЗаписьXML, Данные, УзелУстройства);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		ВыгрузкаВМобильнуюБазуДокументЗаказПоставщику(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.vrgНастройкиМобильныхУстройств") Тогда
		ВыгрузкаВМобильнуюБазуРегистрСведенийНастройкиМобильныхУстройств(ЗаписьXML, Данные, УзелУстройства);
	ИначеЕсли (УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23")
		И (ТипЗнч(Данные) = Тип("СправочникОбъект.ДоговорыКонтрагентов") ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
		ВыгрузкаВМобильнуюБазуСправочникДоговорыКонтрагентов(ЗаписьXML, Данные);
	ИначеЕсли (УзелУстройства.Конфигурация = "BASRetail" И (ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыЦен") ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыЦен")))
		ИЛИ ((УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23")
		И (ТипЗнч(Данные) = Тип("СправочникОбъект.ТипыЦенНоменклатуры") ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ТипыЦенНоменклатуры"))) Тогда
		ВыгрузкаВМобильнуюБазуСправочникТипыЦенНоменклатуры(ЗаписьXML, Данные);
	ИначеЕсли (УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23")
		И (ТипЗнч(Данные) = Тип("СправочникОбъект.ЕдиницыИзмерения")ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ЕдиницыИзмерения")) Тогда
		ВыгрузкаВМобильнуюБазуСправочникЕдиницыИзмерения(ЗаписьXML, Данные, УзелУстройства);
	ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" И (ТипЗнч(Данные) = Тип("СправочникОбъект.БазовыеЕдиницыИзмерения") ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.БазовыеЕдиницыИзмерения")) Тогда
		ВыгрузкаВМобильнуюБазуСправочникБазовыеЕдиницыИзмерения(ЗаписьXML, Данные);
		
	//+NovashIV_24.01.2023	
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Области")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Области") Тогда
		ВыгрузкаВМобильнуюБазуСправочникОбласти(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Районы")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Районы") Тогда
		ВыгрузкаВМобильнуюБазуСправочникРайоны(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.НаселенныеПункты")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.НаселенныеПункты") Тогда
		ВыгрузкаВМобильнуюБазуСправочникНаселенныеПункты(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Улицы")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Улицы") Тогда
		ВыгрузкаВМобильнуюБазуСправочникУлицы(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Подразделения")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Подразделения") Тогда
		ВыгрузкаВМобильнуюБазуСправочникПодразделения(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.НаправленияЗатрат")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.НаправленияЗатрат") Тогда
		ВыгрузкаВМобильнуюБазуСправочникНаправленияЗатрат(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СтатьиЗатрат")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
		ВыгрузкаВМобильнуюБазуСправочникСтатьиЗатрат(ЗаписьXML, Данные);
		
	//	
	//-NovashIV_24.01.2023
		
		//ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
	//	ВыгрузкаВМобильнуюБазуДокументПеремещениеТоваров(ЗаписьXML, Данные);
	//ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
	//	ВыгрузкаВМобильнуюБазуДокументПоступлениеТоваровУслуг(ЗаписьXML, Данные);
	//ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
	//	ВыгрузкаВМобильнуюБазуДокументРеализацияТоваровУслуг(ЗаписьXML, Данные);
	//ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ИнвентаризацияТоваровНаСкладе") Тогда
	//	ВыгрузкаВМобильнуюБазуДокументИнвентаризацияТоваровНаСкладе(ЗаписьXML, Данные);
	Иначе
		ЗаписатьXML(ЗаписьXML, Данные);
	КонецЕсли;

КонецПроцедуры

Процедура ЗафиксироватьЗавершениеОбмена(СтруктураДанныхНастройкиОбмена) Экспорт

	//ДатаПоследнегоОбмена = ТекущаяДата();
	//СтруктураДанныхНастройкиОбмена.Вставить("ДатаПоследнегоОбмена", ДатаПоследнегоОбмена);
	ДатаПоследнегоОбмена = СтруктураДанныхНастройкиОбмена.ДатаПоследнегоОбмена;
	ТипОбменаДанными = СтруктураДанныхНастройкиОбмена.ТипОбменаДанными;

	НаборЗаписейИстории = РегистрыСведений.vrgИсторияОбменаДаннымиСМобильнымиУстройствами.СоздатьНаборЗаписей();
	НаборЗаписейИстории.Отбор.УзелИнформационнойБазы.Установить(СтруктураДанныхНастройкиОбмена.УзелИнформационнойБазы);
	НаборЗаписейИстории.Отбор.ТипОбменаДанными.Установить(ТипОбменаДанными);
	НаборЗаписейИстории.Отбор.Период.Установить(ДатаПоследнегоОбмена);
	СтрокаИстории = НаборЗаписейИстории.Добавить();	
	СтрокаИстории.УзелИнформационнойБазы = СтруктураДанныхНастройкиОбмена.УзелИнформационнойБазы;
	СтрокаИстории.ТипОбменаДанными = ТипОбменаДанными;
	СтрокаИстории.Период = ДатаПоследнегоОбмена;
		
	// дата и результат последней выгрузки и загрузки
	Если СтруктураДанныхНастройкиОбмена.Свойство("ДатаПоследнейЗагрузки") И ЗначениеЗаполнено(СтруктураДанныхНастройкиОбмена.ДатаПоследнейЗагрузки) Тогда

		СтрокаИстории.ДатаПоследнейЗагрузки = СтруктураДанныхНастройкиОбмена.ДатаПоследнейЗагрузки;	
		СтрокаИстории.ДатаНачалаПоследнейЗагрузки = СтруктураДанныхНастройкиОбмена.ДатаНачалаЗагрузки;
		СтрокаИстории.РезультатПоследнейЗагрузки = СтруктураДанныхНастройкиОбмена.Результат;

	КонецЕсли;

	КомментарийПриЗагрузкеДанных = "";
	Если СтруктураДанныхНастройкиОбмена.Свойство("КомментарийПриЗагрузкеДанных", КомментарийПриЗагрузкеДанных) Тогда
		СтрокаИстории.КомментарийКЗагрузкеДанных = СокрЛП(КомментарийПриЗагрузкеДанных);
	КонецЕсли;
	
	Если СтруктураДанныхНастройкиОбмена.Свойство("ДатаПоследнейВыгрузки") И ЗначениеЗаполнено(СтруктураДанныхНастройкиОбмена.ДатаПоследнейВыгрузки) Тогда

		СтрокаИстории.ДатаПоследнейВыгрузки = СтруктураДанныхНастройкиОбмена.ДатаПоследнейВыгрузки;	
		СтрокаИстории.ДатаНачалаПоследнейВыгрузки = СтруктураДанныхНастройкиОбмена.ДатаНачалаВыгрузки;
		СтрокаИстории.РезультатПоследнейВыгрузки = СтруктураДанныхНастройкиОбмена.Результат;

	КонецЕсли;
	
	КомментарийПриВыгрузкеДанных = "";
	Если СтруктураДанныхНастройкиОбмена.Свойство("КомментарийПриВыгрузкеДанных", КомментарийПриВыгрузкеДанных) Тогда
		
		СтрокаИстории.КомментарийКВыгрузкеДанных = СокрЛП(КомментарийПриВыгрузкеДанных);
		
	КонецЕсли;	

	НаборЗаписейИстории.Записать();

КонецПроцедуры

Процедура ДействияСправочникСписокПриПолученииДанныхОбмена(Элемент, ОформленияСтрок) Экспорт
	
	// отображаем дату загрузки и выгрузки данных
	Для Каждого Оформление Из ОформленияСтрок Цикл
		
		Если Оформление.ДанныеСтроки.Ссылка = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;

		Если Оформление.ДанныеСтроки.ЗапретДоступа Тогда
			Оформление.ЦветТекста = WebЦвета.Серый;
		КонецЕсли;

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИсторияОбменов.ТипОбменаДанными,
					   |	ИсторияОбменов.ДатаПоследнейЗагрузки,
		               |	ИсторияОбменов.ДатаПоследнейВыгрузки,
		               |	ИсторияОбменов.РезультатПоследнейЗагрузки,
		               |	ИсторияОбменов.РезультатПоследнейВыгрузки
		               |ИЗ
		               |	РегистрСведений.vrgИсторияОбменаДаннымиСМобильнымиУстройствами.СрезПоследних(, УзелИнформационнойБазы = &Ссылка) КАК ИсторияОбменов
		               |";
					   
		Запрос.УстановитьПараметр("Ссылка", Оформление.ДанныеСтроки.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТипОбменаДанными = Перечисления.vrgТипыОбменаДанными.ЗагрузкаДанных Тогда
					РезультатПоследнейЗагрузки = Выборка.РезультатПоследнейЗагрузки;
	            	ДатаПоследнейЗагрузки = Выборка.ДатаПоследнейЗагрузки;
				ИначеЕсли Выборка.ТипОбменаДанными = Перечисления.vrgТипыОбменаДанными.ВыгрузкаДанных Тогда
					ДатаПоследнейВыгрузки = Выборка.ДатаПоследнейВыгрузки; 
					РезультатПоследнейВыгрузки = Выборка.РезультатПоследнейВыгрузки;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ДатаПоследнейЗагрузки = Неопределено;
			ДатаПоследнейВыгрузки = Неопределено;
			
			РезультатПоследнейЗагрузки = Ложь;
			РезультатПоследнейВыгрузки = Ложь;
			
		КонецЕсли;
		
		// отображаем дату последней загрузки по следующему принципу
		// если стоит признак загрузки, но нет информации о последней загрузке - пишем - не производился
		// если есть информация, то ее выводим
		// если не стоит признак производить загрузку - то пишем не загружать и все
			
		ОтображатьФлаг = Ложь;
		ОтображатьКартинку = Ложь;
		Если ЗначениеЗаполнено(ДатаПоследнейЗагрузки) Тогда 
				
			Оформление.Ячейки.ЗагрузкаДанных.Значение = ДатаПоследнейЗагрузки;
				
			ОтображатьКартинку = НЕ Оформление.ДанныеСтроки.ЗапретДоступа;
			Если РезультатПоследнейЗагрузки = Истина Тогда
				Оформление.Ячейки.ЗагрузкаДанных.УстановитьКартинку(БиблиотекаКартинок.Утвердить);
			Иначе	
				Оформление.Ячейки.ЗагрузкаДанных.УстановитьКартинку(БиблиотекаКартинок.Остановить);
			КонецЕсли;		
							
		Иначе
			ОтображатьФлаг = Истина;
			// флаг показываем, но данные нет
			Оформление.Ячейки.ЗагрузкаДанных.ЗначениеФлажка = Истина;	
			Оформление.Ячейки.ЗагрузкаДанных.Значение = "Не производилась";
						
		КонецЕсли;			
					
		Оформление.Ячейки.ЗагрузкаДанных.ОтображатьФлажок = ОтображатьФлаг;
		Оформление.Ячейки.ЗагрузкаДанных.ОтображатьКартинку = ОтображатьКартинку;
					
		ОтображатьФлаг = Ложь;
		ОтображатьКартинку = Ложь;
			
		Если ЗначениеЗаполнено(ДатаПоследнейВыгрузки) Тогда 
				
			Оформление.Ячейки.ВыгрузкаДанных.Значение = ДатаПоследнейВыгрузки;
			ОтображатьКартинку = НЕ Оформление.ДанныеСтроки.ЗапретДоступа;
			Если РезультатПоследнейВыгрузки = Истина Тогда
				Оформление.Ячейки.ВыгрузкаДанных.УстановитьКартинку(БиблиотекаКартинок.Утвердить);
			Иначе	
				Оформление.Ячейки.ВыгрузкаДанных.УстановитьКартинку(БиблиотекаКартинок.Остановить);
			КонецЕсли;	
				
		Иначе	
				
			ОтображатьФлаг = Истина;
			// флаг показываем, но данные нет
			Оформление.Ячейки.ВыгрузкаДанных.ЗначениеФлажка = Истина;	
			Оформление.Ячейки.ВыгрузкаДанных.Значение = "Не производилась";
				
		КонецЕсли;		
				
		Оформление.Ячейки.ВыгрузкаДанных.ОтображатьФлажок = ОтображатьФлаг;	
		Оформление.Ячейки.ВыгрузкаДанных.ОтображатьКартинку = ОтображатьКартинку;
		
	КонецЦикла
	
КонецПроцедуры

Функция СериализаторJSON(ДанныеВходные) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,ДанныеВходные,НазначениеТипаXML.Явное);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;

КонецФункции

Функция ДесериализаторJSON(ДанныеВходные) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеВходные);
	ДанныеВозврат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат ДанныеВозврат;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияРегистрациейИзмененийИВыборкиДанных

// Выбирает и возвращает данные, подлежащие регистрации изменения, исходя из схемы обмена,
// определенной для узла
//
// Параметры:
//  УзелОбмена - узел плана обмена, по которому регистрируются изменения
//  СтруктураОписанияОбъекта - структура, в которой хранится описание объекта метаданных
//  СтруктураНастроекОтбора - структура, содержащая настройки обмена
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//
// Возвращаемое значение:
//  Выборка данных, подлежащих регистрации изменений
//
Функция ВыбратьСсылкиДляРегистрацииИзменений(УзелОбмена, СтруктураОписанияОбъекта, СтруктураНастроекОтбора, СтруктураПараметровНастройкиОбмена)
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляВыборкиСсылочныхДанных(СтруктураОписанияОбъекта, СтруктураПараметровНастройкиОбмена);
	Запрос = ПолучитьЗапросДляОбъекта(ТекстЗапроса, СтруктураОписанияОбъекта, СтруктураНастроекОтбора, СтруктураПараметровНастройкиОбмена, , , УзелОбмена);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();

КонецФункции

// Формирует и возвращает таблицу значений, содержащую записи регистра сведений, отобранные по условиям схемы обмена
//
// Параметры:
//  СтруктураОписанияОбъекта - структура, содержащая описание объекта
//  СтруктураНастроекОтбора -  Структура, включающая настройки отбора по схеме обмена
//  МассивПолей - массив, содержащий имена полей регистра
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//  УзелОбмена - узел обмена, для которого выбираются данные
//
// Возвращаемое значение:
//  Таблица значений, содержащая записи регистра сведений, отобранные по условиям схемы обмена
//
Функция ПолучитьТаблицуЗаписейРегистраСведений(СтруктураОписанияОбъекта, СтруктураНастроекОтбора, МассивПолей, СтруктураПараметровНастройкиОбмена, УзелОбмена)

	// Выбираем данные с учетом отборов, определенных в настройках обмена
	ТекстЗапроса = ПолучитьТекстЗапросаДляВыборкиПолейРегистраСведений(СтруктураОписанияОбъекта.ИмяОбъекта, СтруктураОписанияОбъекта.ИмяТаблицы, МассивПолей, Ложь, , УзелОбмена);
	Запрос = ПолучитьЗапросДляОбъекта(ТекстЗапроса, СтруктураОписанияОбъекта, СтруктураНастроекОтбора, СтруктураПараметровНастройкиОбмена,,, УзелОбмена, Истина);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Формирует и возращает набор записей регистра сведений, сформированный из переданных данных
//
// Параметры:
//  ИмяОбъекта - имя регистра сведений
//  Комбинация ключей - строка таблицы значений, в свойствах которой - значения полей набора записей
//  МассивСтрокТаблицыЗаписей - массив, содержащий строки таблицы значений с записями регистра
//  МассивКлючевыхПолей - массив, содержащий имена ключевых полей регистра сведений
//  МассивПолей - массив, содержащий имена полей регистра сведений
//
// Возвращаемое значение:
//  Таблица значений, содержащая записи регистра сведений, отобранные по условиям схемы обмена
//
Функция СформироватьНаборЗаписейДляВыгрузки(ИмяОбъекта, КомбинацияКлючей, МассивСтрокТаблицыЗаписей, МассивКлючевыхПолей, МассивПолей, МассивВыбранныхПолей)

	НаборЗаписей = РегистрыСведений[ИмяОбъекта].СоздатьНаборЗаписей();

	Для Каждого КлючевоеПоле из МассивКлючевыхПолей Цикл
		Если МассивВыбранныхПолей.Найти(КлючевоеПоле) = Неопределено Тогда
			ТипИзмерения = Метаданные.РегистрыСведений[ИмяОбъекта].Измерения[КлючевоеПоле].Тип;
			ЗначениеОтбора = ТипИзмерения.ПривестиЗначение();
			НаборЗаписей.Отбор[КлючевоеПоле].Установить(ЗначениеОтбора, Истина);
		Иначе
			НаборЗаписей.Отбор[КлючевоеПоле].Установить(КомбинацияКлючей[КлючевоеПоле], Истина);
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаТаблицыЗаписей из МассивСтрокТаблицыЗаписей Цикл
		Запись = НаборЗаписей.Добавить();
		Для Каждого Поле из МассивПолей Цикл
			Попытка
				Запись[Поле] = СтрокаТаблицыЗаписей[Поле];
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;

	Возврат НаборЗаписей;

КонецФункции

// Формирует и возвращает таблицу значений, в строках которой содержатся уникальные комбинации
// значений полей регистра сведений, на основании которых можно задавать отборы для наборов записей
//
// Параметры:
//  СтруктураОписанияОбъекта - структура, содержащая описание объекта метаданных (Имя, имя таблицы и т.д.)
//  СтруктураНастроекОтбора - структура, содержащая настройки отбора
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//  Изменения - признак того, что выбираются только изменения по таблице изменений
//  НомерСообщения - номер сообщения обмена, в рамках которого ведется выборка данных
//
// Возвращаемое значение:
//  Таблица значений, содержащая уникальные наборы значений полей регистра сведений
//
Функция ПолучитьТаблицуКлючейНабораЗаписей(СтруктураОписанияОбъекта, СтруктураНастроекОтбора, МассивПолей, СтруктураПараметровНастройкиОбмена, Изменения = Ложь, УзелОбмена = Неопределено, НомерСообщения = Неопределено)

	ТекстЗапроса = ПолучитьТекстЗапросаДляВыборкиПолейРегистраСведений(СтруктураОписанияОбъекта.ИмяОбъекта, СтруктураОписанияОбъекта.ИмяТаблицы, МассивПолей, Изменения, НомерСообщения, УзелОбмена);
	Запрос = ПолучитьЗапросДляОбъекта(ТекстЗапроса, СтруктураОписанияОбъекта, СтруктураНастроекОтбора, СтруктураПараметровНастройкиОбмена,,Изменения, УзелОбмена, Истина, НомерСообщения);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Формирует и возвращает набор записей для указанного регистра сведений.
// При этом отбор для набора записей устанавливается по указанным значениям комбинации полей отбора
//
// Параметры:
//  СтруктураОписанияОбъекта - структура, содержащая описание объекта метаданных
//  КомбинацияКлючей - коллекция (в частности, строка таблицы значений), содержащая значения полей отбора
//  МассивПолей - массив, содержащий имена полей регистра, по которым устанавливается отбор
//
// Возвращаемое значение:
//  Набор записей с установленным отборам
//
Функция ПолучитьНаборЗаписейРегистраСведенийПоКомбинацииКлючей(СтруктураОписанияОбъекта, КомбинацияКлючей, МассивПолей, МассивВыбранныхПолей)

	НаборЗаписей = РегистрыСведений[СтруктураОписанияОбъекта.ИмяОбъекта].СоздатьНаборЗаписей();
	
	Для Каждого Поле из МассивПолей Цикл

		ЭлементОтбора = НаборЗаписей.Отбор.Найти(Поле);
		Если ЭлементОтбора <> Неопределено Тогда
			Если МассивВыбранныхПолей.Найти(Поле) = Неопределено Тогда
				ТипИзмерения = Метаданные.РегистрыСведений[СтруктураОписанияОбъекта.ИмяОбъекта].Измерения[Поле].Тип;
				ЗначениеОтбора = ТипИзмерения.ПривестиЗначение();
				ЭлементОтбора.Установить(ЗначениеОтбора, Истина);
			Иначе
				ЭлементОтбора.Установить(КомбинацияКлючей[Поле], Истина);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат НаборЗаписей;

КонецФункции

// Формирует и возвращает текст запроса по данным объекта определенного вида с учетом
// полей, на которые будет налагаться отбор
//
// Параметры:
// СтруктураОписанияОбъекта - структура, содержащая описание объекта
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//
// Возвращаемое значение:
//  Сформированный текст запроса
//
Функция ПолучитьТекстЗапросаДляВыборкиСсылочныхДанных(СтруктураОписанияОбъекта, СтруктураПараметровНастройкиОбмена)

	// Для справочников и документов
	ИмяКласса = СтруктураОписанияОбъекта.ИмяКласса;
	ИмяОбъекта = СтруктураОписанияОбъекта.ИмяОбъекта;
	ИмяТаблицы = СтруктураОписанияОбъекта.ИмяТаблицы;

	МассивПолейОтбора = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьМассивПолейОтбораДляОбъекта(ИмяКласса, ИмяОбъекта);

	ТекстЗапроса = ПолучитьТекстЗапросаДляОбъекта(ИмяОбъекта, ИмяТаблицы, МассивПолейОтбора, СтруктураПараметровНастройкиОбмена);

	Если ТекстЗапроса <> "" Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ИмяОбъекта + ".Ссылка ИЗ " + ИмяТаблицы + " КАК " + ИмяОбъекта + " ГДЕ НЕ " + ИмяОбъекта + ".ПометкаУдаления ";

	ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора);
	
	Возврат ТекстЗапроса;

КонецФункции

// Формирует и возвращает текст запроса для выборки полей регистра сведений
// При этом выбираются различные комбинации указанных полей
//
// Параметры:
//  ИмяОбъекта - имя регистра сведений
//  ИмяТаблицы - Имя таблицы, из которой производится выборка
//  МассивПолей - массив, содержащий имена полей регистра, подлежащих выборке
//  Изменения - признак того, что выбираются только изменения по таблице изменений
//  НомерСообщения - номер сообщения обмена. Используется при запросе по таблицам изменений
//
// Возвращаемое значение:
//  Сформированный текст запроса
//
Функция ПолучитьТекстЗапросаДляВыборкиПолейРегистраСведений(ИмяОбъекта, ИмяТаблицы, МассивПолей, Изменения = Ложь, НомерСообщения = Неопределено, УзелУстройства)
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляРегистра(ИмяОбъекта, ИмяТаблицы, МассивПолей, Изменения, НомерСообщения, УзелУстройства);

	Если ТекстЗапроса <> "" Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ";
	
	КоличествоПолей = МассивПолей.Количество();

	Если КоличествоПолей > 0 Тогда	

		Индекс = 0;

		Для Каждого Поле из МассивПолей Цикл
			
			ТекстЗапроса = ТекстЗапроса + "Таблица." + Поле;

			Если Индекс < КоличествоПолей-1 Тогда
				ТекстЗапроса = ТекстЗапроса + ",";
			КонецЕсли;	
			
			Индекс = Индекс + 1;
			
		КонецЦикла;

		ТекстЗапроса = ТекстЗапроса + " ИЗ " + ИмяТаблицы + " КАК Таблица";

	КонецЕсли;

	Если Изменения Тогда
		МассивПолейОтбора = Новый Массив();
		МассивПолейОтбора.Добавить("Узел");
		
		Если НомерСообщения <> Неопределено Тогда
			МассивПолейОтбора.Добавить("НомерСообщения");
		КонецЕсли;	
	Иначе
		МассивПолейОтбора = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьМассивПолейОтбораДляОбъекта("РегистрыСведений", ИмяОбъекта);
	КонецЕсли;
	
	ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора);
	
	Возврат ТекстЗапроса;

КонецФункции

// Формирует и возвращает текст запроса для выборки данных конкретного объекта
//
// Параметры:
//  ИмяОбъекта - имя объекта, по которому необходимо сформировать текст запроса
//  ИмяТаблицы - имя таблицы данных, по которой необходимо сформировать текст запроса
//  МассивПолейОтбора - массив, содержащий имена полей, которые могут участвовать в отборе
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//
// Возвращаемое значение:
//  Текст запроса, если он определен для объекта. В противном случае возвращается пустая строка - при этом будет
//  использован "стандартный" текст запроса по таблице, без дополнительных условий
//
Функция ПолучитьТекстЗапросаДляОбъекта(ИмяОбъекта, ИмяТаблицы, МассивПолейОтбора, СтруктураПараметровНастройкиОбмена)

	ТекстЗапроса = "";
	
	Если ИмяТаблицы = "Справочник.Партнеры" Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партнеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Клиент
		|	И Партнеры.ОбслуживаетсяТорговымиПредставителями
		|	И (НЕ Партнеры.ПометкаУдаления)"
		;
		
	ИначеЕсли ИмяТаблицы = "Справочник.Организации" Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления"
		//|	Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)"
		;
		
	ИначеЕсли ИмяТаблицы = "Справочник.ВидыКонтактнойИнформации" Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	(ВидыКонтактнойИнформации.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникПартнеры))
		|			ИЛИ ВидыКонтактнойИнформации.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров)))
		|	И (НЕ ВидыКонтактнойИнформации.ПометкаУдаления)"
		;	
	ИначеЕсли ИмяТаблицы = "Справочник.ЕдиницыИзмерения" Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Владелец ССЫЛКА Справочник.Номенклатура
		|	И НЕ ЕдиницыИзмерения.ПометкаУдаления"
		;	
	ИначеЕсли ИмяТаблицы = "Справочник.ВидыЦен" Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦен.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	ВидыЦен.ИспользоватьПриПродаже
		|	И (НЕ ВидыЦен.ПометкаУдаления)"
		;	
		
	ИначеЕсли ИмяТаблицы = "Справочник.УпаковкиЕдиницыИзмерения" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковкиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
		|		ПО (УпаковкиНоменклатуры.Владелец = Номенклатура.Ссылка),
		|	Справочник.НаборыУпаковок КАК НаборыУпаковок
		|ГДЕ
		|	(НЕ УпаковкиНоменклатуры.Ссылка ЕСТЬ NULL )
		|	И (НЕ ВЫРАЗИТЬ(УпаковкиНоменклатуры.Владелец КАК Справочник.Номенклатура) ЕСТЬ NULL )
		|	И (НЕ УпаковкиНоменклатуры.ПометкаУдаления)
		|{ГДЕ
		|	УпаковкиНоменклатуры.Владелец.*}
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	УпаковкиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
		|		ПО (УпаковкиНоменклатуры.Владелец = НаборыУпаковок.Ссылка)
		|ГДЕ
		|	(НЕ УпаковкиНоменклатуры.Ссылка ЕСТЬ NULL )
		|	И (НЕ ВЫРАЗИТЬ(УпаковкиНоменклатуры.Владелец КАК Справочник.НаборыУпаковок) ЕСТЬ NULL )
		|	И (НЕ УпаковкиНоменклатуры.ПометкаУдаления)"
		;
		
	ИначеЕсли ИмяТаблицы = "Справочник.ХарактеристикиНоменклатуры" Тогда	
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка),
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	(НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL )
		|	И (НЕ ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.Номенклатура) ЕСТЬ NULL )
		|	И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
		|{ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец.*}"
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ХарактеристикиНоменклатуры.Ссылка
		//|ИЗ
		//|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		//|		ПО (ХарактеристикиНоменклатуры.Владелец = ВидыНоменклатуры.Ссылка)
		//|ГДЕ
		//|	(НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL )
		//|	И (НЕ ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.ВидыНоменклатуры) ЕСТЬ NULL )
		//|	И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)"
		;
		
	ИначеЕсли ИмяТаблицы = "Справочник.СоглашенияСКлиентами" Тогда
		
		ТекстЗапроса = 	 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоглашениеСКлиентомИндивидуальное.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентомИндивидуальное
		|ГДЕ
		|   (&ИспользованиеСоглашенийСКлиентами <> ЗНАЧЕНИЕ(Перечисление.ИспользованиеСоглашенийСКлиентами.ТолькоТиповыеСоглашения))
		|	И СоглашениеСКлиентомИндивидуальное.ИспользуетсяВРаботеТорговыхПредставителей
		|	И СоглашениеСКлиентомИндивидуальное.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|	И (НЕ СоглашениеСКлиентомИндивидуальное.Типовое)
		|	И (НЕ СоглашениеСКлиентомИндивидуальное.ПометкаУдаления)
		|{ГДЕ
		|	СоглашениеСКлиентомИндивидуальное.Партнер}
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СоглашениеСКлиентомТиповое.Ссылка
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентомТиповое
		|ГДЕ
		|   (&ИспользованиеСоглашенийСКлиентами <> ЗНАЧЕНИЕ(Перечисление.ИспользованиеСоглашенийСКлиентами.ТолькоИндивидуальныеСоглашения))
		|	И СоглашениеСКлиентомТиповое.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|	И СоглашениеСКлиентомТиповое.ИспользуетсяВРаботеТорговыхПредставителей
		|	И СоглашениеСКлиентомТиповое.Типовое
		|	И (НЕ СоглашениеСКлиентомТиповое.ПометкаУдаления)"
		;
		
	ИначеЕсли ИмяТаблицы = "Справочник.ДоговорыКонтрагентов" Тогда
		
		ТекстЗапроса = 	 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		//|	ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
		|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
		//|	И (ДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
		//|			ИЛИ ДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
		|{ГДЕ
		|	ДоговорыКонтрагентов.Владелец}"
		//|	ДоговорыКонтрагентов.Партнер}"
		;
		
	ИначеЕсли ИмяТаблицы = "Справочник.НоменклатураПрисоединенныеФайлы" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.ФайлКартинки КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ФайлКартинки <> ЗНАЧЕНИЕ(Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка)
		|	И (НЕ Номенклатура.ПометкаУдаления)
		|	И (НЕ Номенклатура.ЭтоГруппа)
		|{ГДЕ
		|	Номенклатура.Ссылка.*}"
		;
		
	ИначеЕсли ИмяТаблицы = "Документ.ЗаданиеТорговомуПредставителю" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаданиеТорговомуПредставителю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеТорговомуПредставителю КАК ЗаданиеТорговомуПредставителю
		|ГДЕ
		|	ЗаданиеТорговомуПредставителю.ТорговыйПредставитель = &ТорговыйПредставитель
		|	И ЗаданиеТорговомуПредставителю.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийТорговымПредставителям.КОтработке)
		|	И (НЕ ЗаданиеТорговомуПредставителю.ПометкаУдаления)"
		
		;

	//ИначеЕсли ИмяТаблицы = "Регистры.ЗаданиеТорговомуПредставителю" Тогда
	//	
	//	ТекстЗапроса = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ЗаданиеТорговомуПредставителю.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ЗаданиеТорговомуПредставителю КАК ЗаданиеТорговомуПредставителю
	//	|ГДЕ
	//	|	ЗаданиеТорговомуПредставителю.ТорговыйПредставитель = &ТорговыйПредставитель
	//	|	И ЗаданиеТорговомуПредставителю.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийТорговымПредставителям.КОтработке)
	//	|	И (НЕ ЗаданиеТорговомуПредставителю.ПометкаУдаления)"
	//	
	//	;

	КонецЕсли;

	// Добавим поля, по которым возможен отбор
	ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора);
	
	Возврат ТекстЗапроса;

КонецФункции

// Добавляет в переданный текст запроса поля, по которым возможен отбор
//
// Параметры:
//  ТекстЗапроса - текст запроса, в который требуется добавить поля
//  МассивПолейОтбора - массив, содержащий имена полей для отбора
//
Процедура ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора)
	
	Если ТекстЗапроса <> "" Тогда
		
		КоличествоПолейОтбора = МассивПолейОтбора.Количество();
		
		Если КоличествоПолейОтбора > 0 Тогда
			
			ТекстДополнения = " {ГДЕ ";
			
			Индекс = 0;
			
			Для Каждого Поле из МассивПолейОтбора Цикл
				
				ТекстДополнения = ТекстДополнения + Поле;
				
				Если Индекс < КоличествоПолейОтбора-1 Тогда
					ТекстДополнения = ТекстДополнения + ",";
				КонецЕсли;	
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
			ТекстДополнения = ТекстДополнения + "}";
			ТекстЗапроса = ТекстЗапроса + ТекстДополнения;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Формирует и возвращает запрос на основании переданного текста запроса
// и структуры настроек, содержащей отборы для объекта
//
// Параметры:
//  ТекстЗапроса - текст запроса
//  СтруктураОписанияОбъекта - структура, содержащая описание объекта
//  СтруктураНастроекОтбора - структура, содержащая настройки отбора для обмена
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//  Ссылка - Ссылка на объект, запрос для которого требуется получить
//  Изменения - признак того, что отбираются только изменения по таблице изменений
//  УзелОбмена - узел обмена, для которого выбираются данные
//  ИспользоватьДополнительныеОтборы - признак использования дополнительных отборов
//
// Возвращаемое значение:
//  Сформированный запрос
//
Функция ПолучитьЗапросДляОбъекта(ТекстЗапроса, СтруктураОписанияОбъекта, СтруктураНастроекОтбора, 
								СтруктураПараметровНастройкиОбмена, Ссылка = Неопределено, Изменения = Ложь, 
								УзелОбмена = Неопределено, ИспользоватьДополнительныеОтборы = Ложь, НомерСообщения = Неопределено)

 	ИмяКласса = СтруктураОписанияОбъекта.ИмяКласса;
	ИмяОбъекта = СтруктураОписанияОбъекта.ИмяОбъекта;

	СхемаКомпоновки = ПолучитьСхемуКомпоновкиДанныхДляВыборки(ТекстЗапроса);
	НастройкиКомпоновки = СкомпоноватьНастройки(СхемаКомпоновки);

	ДобавитьОтборыИзСхемыОбмена(НастройкиКомпоновки, СтруктураНастроекОтбора, ИмяКласса, ИмяОбъекта, ИспользоватьДополнительныеОтборы, СтруктураПараметровНастройкиОбмена, Истина);

	Если Ссылка <> Неопределено Тогда
		ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Ссылка", ВидСравненияКомпоновкиДанных.Равно, Истина, Ссылка);
	КонецЕсли;

	Если Изменения Тогда
		ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Узел", ВидСравненияКомпоновкиДанных.Равно, Истина, УзелОбмена);
		Если НомерСообщения <> Неопределено Тогда
			ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "НомерСообщения", ВидСравненияКомпоновкиДанных.Равно, Истина, НомерСообщения);
		КонецЕсли;	
	КонецЕсли;
	
	Макет = ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
	
	Запрос = ПолучитьЗапросИзМакетаКомпоновки(Макет, "Запрос");

	ДобавитьПараметрыЗапроса(Запрос, ИмяКласса, ИмяОбъекта, СтруктураПараметровНастройкиОбмена, УзелОбмена);

	Возврат Запрос;

КонецФункции

// Добавляет параметры в переданный запрос для указанного объекта
//
// Параметры:
//  Запрос - запрос, в который требуется добавить параметры
//  ИмяКласса - имя класса, к которому принадлежит объект (Справочники, Документы и т.д), для которого используется запрос
//  ИмяОбъекта - имя объекта метаданных, для которого используется запрос
//  СтруктураПараметровНастройкиОбмена - структура, содержащая настройки параметров обмена
//
Процедура ДобавитьПараметрыЗапроса(Запрос, ИмяКласса, ИмяОбъекта, СтруктураПараметровНастройкиОбмена, УзелУстройства)

	//Если ИмяКласса = "Справочники" Тогда
	//	Если ИмяОбъекта = "СоглашенияСКлиентами" Тогда
	//		Запрос.УстановитьПараметр("ИспользованиеСоглашенийСКлиентами", СтруктураПараметровНастройкиОбмена.ИспользованиеСоглашенийСКлиентами);
	//	КонецЕсли;
	//ИначеЕсли ИмяКласса = "Документы" Тогда
	//	Если ИмяОбъекта = "ЗаданиеТорговомуПредставителю" Тогда
	//		Запрос.УстановитьПараметр("ТорговыйПредставитель", СтруктураПараметровНастройкиОбмена.ТорговыйПредставитель);
	//	КонецЕсли;
	//ИначеЕсли ИмяКласса = "РегистрыСведений" Тогда
	//	Если ИмяОбъекта = "КурсыВалют" Тогда
	//		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//	КонецЕсли;
	//КонецЕсли;
	Если ИмяКласса = "РегистрыСведений" Тогда
		Если ИмяОбъекта = "vrgНастройкиМобильныхУстройств" Тогда
			Запрос.УстановитьПараметр("УзелУстройства", УзелУстройства);
		ИначеЕсли ИмяОбъекта = "vrgОстаткиНаСкладахМобильныеСклад" Тогда
			Если Константы.vrg_ИспользоватьХозрасчетныйДляОстатковOctopus.Получить() Тогда
				СчетаУчета = Новый Массив;
				ЗапросСчетов = Новый Запрос;
				ЗапросСчетов.Текст = 
				"ВЫБРАТЬ
				|	ХозрасчетныйВидыСубконто.Счет
				|ИЗ
				|	(ВЫБРАТЬ
				|		ХозрасчетныйВидыСубконто.Ссылка КАК Счет,
				|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХозрасчетныйВидыСубконто.ВидСубконто) КАК ВидСубконто
				|	ИЗ
				|		ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
				|	ГДЕ
				|		ХозрасчетныйВидыСубконто.ВидСубконто В(&ВидСубконто)
				|		И ХозрасчетныйВидыСубконто.Количественный
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ХозрасчетныйВидыСубконто.Ссылка) КАК ХозрасчетныйВидыСубконто
				|ГДЕ
				|	ХозрасчетныйВидыСубконто.ВидСубконто = 2
				|";
				ВидСубконто = Новый СписокЗначений;
				ВидСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
				ВидСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
				ЗапросСчетов.УстановитьПараметр("ВидСубконто", ВидСубконто);
				РезультатЗапросаСчетов = ЗапросСчетов.Выполнить();
				Если НЕ РезультатЗапросаСчетов.Пустой() Тогда
					СчетаУчета = ЗапросСчетов.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
				КонецЕсли;
				Запрос.УстановитьПараметр("СчетаУчета", СчетаУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Определяет, отключено ли использование конкретного объекта функциональной опцией, или другими условиями
//
// Параметры:
//  ИмяКласса - имя класса, которому принадлежит объект (Справочники, Документы и т.д.)
//  ИмяОбъекта - имя объекта, для которого проверяется факт исключения
//  УзелОбмена - узел плана обмена, для которого выполняется обмен или регистрируются изменения
//
// Возвращаемое значение:
//  Признак отключения использования. Истина - использование отключено, Ложь - объект используется
//
Функция ИспользованиеОбъектаОтключено(ИмяКласса, ИмяОбъекта, УзелОбмена)
	
	Если ИмяКласса = "Справочники" Тогда
		
		//Если ИмяОбъекта = "УпаковкиНоменклатуры" ИЛИ ИмяОбъекта = "НаборыУпаковок" Тогда
		//	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
		//ИначеЕсли ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда
		//	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
		//ИначеЕсли ИмяОбъекта = "ЦеновыеГруппы" Тогда
		//	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
		//ИначеЕсли ИмяОбъекта = "КонтактныеЛицаПартнеров" Тогда
		//	Возврат УзелОбмена.ИспользованиеКонтактнойИнформации = Перечисления.ИспользованиеКонтактнойИнформацииМобильнымПриложением.НеИспользуется;
		//ИначеЕсли ИмяОбъекта = "ГрафикиОплаты" Тогда
		//	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");
		//ИначеЕсли ИмяОбъекта = "ПричиныОтменыЗаказовКлиентов" Тогда
		//	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов");
		//ИначеЕсли ИмяОбъекта = "ДоговорыКонтрагентов" Тогда
		//	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
		//КонецЕсли;
		Если ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда
			Возврат НЕ Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
		ИначеЕсли ИмяОбъекта = "СерииНоменклатуры" Тогда
			Возврат НЕ Константы.ИспользоватьСерииНоменклатуры.Получить();
		КонецЕсли;
		
	//ИначеЕсли ИмяКласса = "Документы" Тогда	
	//	
	//	Если ИмяОбъекта = "ЗаданиеТорговомуПредставителю" Тогда
	//		ИспользованиеЗаданий = Константы.ИспользованиеЗаданийТорговымПредставителям.Получить();
	//		Возврат (ИспользованиеЗаданий = Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются)
	//				ИЛИ (НЕ ЗначениеЗаполнено(ИспользованиеЗаданий));
	//	КонецЕсли;
			
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСКомпоновкойДанных

// Получает и возвращает макет компоновки данных для схемы компоновки
//
// Параметры:
//  СхемаКомпоновки - схема компоновки данных, для которой получается макет компоновки
//  Настройки - настройки компоновки, применяемые к схеме
//
// Возвращаемое значение:
//  Макет компоновки данных
//
Функция ПолучитьМакетКомпоновки(СхемаКомпоновки, Настройки) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Возврат КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

КонецФункции

// Получает и возвращает запрос из переданного макета компоновки данных
//
// Параметры:
//  Макет - макет компоновки данных, из которого требуется получить запрос.
//  ИмяНабораДанных - имя набора данных из макета, для которого получается запрос.
//
// Возвращаемое значение:
//  Запрос, сформированный на основании макета компоновки
//
Функция ПолучитьЗапросИзМакетаКомпоновки(Макет, ИмяНабораДанных) Экспорт

	Запрос = Новый Запрос(Макет.НаборыДанных[ИмяНабораДанных].Запрос);

	Для Каждого Параметр Из Макет.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	Возврат Запрос;

КонецФункции

// Формирует и возвращает настройки компоновщика для переданной схемы компоновки
//
// Параметры:
//  СхемаКомпоновки - схема компоновки данных, для которой компонуются настройки
//
// Возвращаемое значение:
//  Настройки компоновщика
//
Функция СкомпоноватьНастройки(СхемаКомпоновки) Экспорт

	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	// Добавим выбранные поля
	Для Каждого Элемент из КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		
		Если НЕ Элемент.Папка Тогда
			ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Использование = Истина;
			ВыбранноеПоле.Поле = Элемент.Поле;
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавим группировку
	ГруппировкаНастроек = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Поле = ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Возврат КомпоновщикНастроек.Настройки;

КонецФункции

// Добавляет элемент отбора в настройки компоновки
//
// Параметры:
//  Настройки - настройки компоновки
//  ИмяПоля - имя поля, по которому задается отбор
//  Вид сравнения - вид сравнения компоновки данных
//  Использование - использование элемента отбора
//  ПравоеЗначение - правое значение сравнения
//
Процедура ДобавитьЭлементОтбораВНастройкиСхемы(Настройки, ИмяПоля, ВидСравнения = Неопределено, Использование = Истина, ПравоеЗначение = Неопределено) Экспорт

	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;

	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент = Настройки.ДоступныеПоляОтбора.НайтиПоле(Поле);

	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Элемент.Поле;
	ЭлементОтбора.ВидСравнения = ВидСравнения;
	ЭлементОтбора.Использование = Использование;
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;

КонецПроцедуры

// Выполняет установку значения элемента отбора в настройках компоновки
//
// Параметры:
//  Отбор - отбор компоновки
//
Процедура УстановитьЗначениеЭлементаОтбора(Отбор, ИмяПоля, ВидСравнения = Неопределено, Использование = Истина, ПравоеЗначение = Неопределено) Экспорт

	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Для Каждого ЭлементОтбора из Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
			ЭлементОтбора.Использование = Использование;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Устанавливает признак включения в настройки компоновки поля
//
// Параметры:
//  НастройкиКомпоновки - настройки компоновки, для которых требуется установить использование
//  ИмяПоля - имя поля компоновки, использование которого требуется установить
//
Процедура УстановитьИспользованиеПоляКомпоновки(НастройкиКомпоновки, ИмяПоля, Использование) Экспорт

	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);

	Для Каждого Элемент из НастройкиКомпоновки.Выбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			Если Элемент.Поле = ПолеКомпоновки Тогда
				Элемент.Использование = Использование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Устанавливает указанное значение параметра настроек компоновки данных
//
// Параметры:
//  Настройки - настройки компоновки данных
//  ИмяПараметра - имя параметра, значение которого нужно установить
//  Значение - устанавливаемое значение параметра
//
Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение) Экспорт

	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;

КонецПроцедуры

// Формирует и возвращает структуру на основе переданного отбора компоновки данных
//
// Параметры:
//  Отбор - отбор компоновки данных
//
// Возвращаемое значение:
//  Структура, содержащая данные отбора
// 
Функция ПолучитьСтруктуруОтбораКомпоновкиДанных(Отбор) Экспорт

	СтруктураОтбора = Новый Структура();
	
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		
		// Заполним структуру элемента отбора
		СтруктураЭлементаОтбора = Новый Структура();
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			СтруктураЭлементаОтбора.Вставить("ВидСравнения",ЭлементОтбора.ВидСравнения);
			СтруктураЭлементаОтбора.Вставить("ИдентификаторПользовательскойНастройки",ЭлементОтбора.ИдентификаторПользовательскойНастройки);
			СтруктураЭлементаОтбора.Вставить("Использование",ЭлементОтбора.Использование);
			СтруктураЭлементаОтбора.Вставить("ЛевоеЗначение",ЭлементОтбора.ЛевоеЗначение);
			СтруктураЭлементаОтбора.Вставить("ПравоеЗначение",ЭлементОтбора.ПравоеЗначение);
			СтруктураЭлементаОтбора.Вставить("Представление",ЭлементОтбора.Представление);
			СтруктураЭлементаОтбора.Вставить("ПредставлениеПользовательскойНастройки",ЭлементОтбора.ПредставлениеПользовательскойНастройки);
			СтруктураЭлементаОтбора.Вставить("Применение",ЭлементОтбора.Применение);
			СтруктураЭлементаОтбора.Вставить("РежимОтображения",ЭлементОтбора.РежимОтображения);
			
			// Структуру элемента отбора поместим в структуру отбора
			СтруктураОтбора.Вставить(ЭлементОтбора.ЛевоеЗначение, СтруктураЭлементаОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОтбора;

КонецФункции

// Заполняет указанный отбор на основании структуры, содержащей данные отбора
//
// Параметры:
//  Отбор - отбор компоновки данных, который надо заполнить
//  Структура отбора - структура, содержащая данные для заполнения отбора
//
Процедура ЗаполнитьОтборКомпоновкиИзСтруктуры(Отбор, СтруктураОтбора) Экспорт

	Отбор.Элементы.Очистить();
	
	Для Каждого ЭлементСтруктурыОтбора из СтруктураОтбора Цикл
		
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		СтруктураЭлементаОтбора = ЭлементСтруктурыОтбора.Значение;
		
		Для Каждого Элемент из СтруктураЭлементаОтбора Цикл
			Если Элемент.Ключ = "ЛевоеЗначение" Тогда
				ЭлементОтбора[Элемент.Ключ] =  Новый ПолеКомпоновкиДанных(Элемент.Значение);
			Иначе
				ЭлементОтбора[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЦикла;

КонецПроцедуры

// Задает отборы для выборки объектов с использованием компоновки
//
// Параметры:
//  НастройкиКомпоновки - настройки компоновки данных, для которых задаются отборы
//  СтруктураНастроекОтбора - структура, содержащая описание устанавливаемого отбора
//  ИмяКласса - имя класса, к которому принадлежит объект (Справочники, Документы и т.д)
//  ИмяОбъекта - имя объекта метаданных, для которого добавляются отборы
//  ИспользоватьДополнительныеОтборы - признак необходимости установки доп. отборов для регистров (помимо ключевых полей)
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//  ИспользуетсяВыборка - признак того, что используется выборка данных и отборы указываются для выборки
//
Процедура ДобавитьОтборыИзСхемыОбмена(НастройкиКомпоновки, СтруктураНастроекОтбора, ИмяКласса, ИмяОбъекта, 
									  ИспользоватьДополнительныеОтборы, СтруктураПараметровНастройкиОбмена, ИспользуетсяВыборка) Экспорт

	Если ИмяКласса = "Справочники" Тогда

		Если ИмяОбъекта = "Контрагенты" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Контрагенты","Ссылка");
		ИначеЕсли ИмяОбъекта = "Пользователи" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Пользователи","Ссылка");
		ИначеЕсли ИмяОбъекта = "Организации" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Организации","Ссылка");
		//ИначеЕсли ИмяОбъекта = "СоглашенияСКлиентами" Тогда
		//	Если ИспользуетсяВыборка Тогда
		//		ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Партнеры","Партнер");
		//	КонецЕсли;
		ИначеЕсли ИмяОбъекта = "ДоговорыКонтрагентов" Тогда
			Если ИспользуетсяВыборка Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Контрагенты","Владелец");
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Организации","Организация");
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "Номенклатура" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Ссылка");
		ИначеЕсли ИмяОбъекта = "ЕдиницыИзмерения" Тогда
			Если ИспользуетсяВыборка Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Владелец");
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "СерииНоменклатуры" Тогда
			Если ИспользуетсяВыборка Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Владелец");
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда
			Если ИспользуетсяВыборка Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Владелец");
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "ТипыЦенНоменклатуры" ИЛИ ИмяОбъекта = "ВидыЦен" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "ТипыЦенНоменклатуры","Ссылка");
		ИначеЕсли ИмяОбъекта = "ВидыЦен" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "ТипыЦенНоменклатуры","Ссылка");
		ИначеЕсли ИмяОбъекта = "Склады" Тогда
			ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Склады","Ссылка");
		//ИначеЕсли ИмяОбъекта = "ПричиныОтменыЗаказовКлиентов" Тогда
		//	ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "ПричиныОтменыЗаказовКлиентов","Ссылка");
		//ИначеЕсли ИмяОбъекта = "НоменклатураПрисоединенныеФайлы" Тогда
		//	ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Ссылка");
		КонецЕсли;

	ИначеЕсли ИмяКласса = "Документы" Тогда

		//Если ИмяОбъекта = "ЗаданиеТорговомуПредставителю" Тогда
		//	ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Партнеры","Партнер");
		//КонецЕсли;

	ИначеЕсли ИмяКласса = "РегистрыСведений" Тогда

		Если ИмяОбъекта = "vrgЦеныНоменклатурыМобильныеСклад" Тогда
			Если ИспользоватьДополнительныеОтборы Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "ТипыЦенНоменклатуры","ТипЦен");
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Номенклатура");
				//ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "ВидЦены.ИспользоватьПриПродаже", ВидСравненияКомпоновкиДанных.Равно, Истина, Истина);
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "vrgОстаткиНаСкладахМобильныеСклад" Тогда
			Если ИспользоватьДополнительныеОтборы Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Номенклатура");
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Склады","Склад");
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "vrgОстаткиЗаказовПоставщикамМобильные" Тогда
			Если ИспользоватьДополнительныеОтборы Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Номенклатура");
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Склады","Склад");
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Контрагенты","Контрагент");
			КонецЕсли;
		ИначеЕсли ИмяОбъекта = "Штрихкоды" Тогда
			Если ИспользоватьДополнительныеОтборы Тогда
				ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, "Номенклатура","Владелец");
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСКомпоновкойДанных

// Формирует и возвращает схему компоновки данных на основании текста запроса
// для выборки данных по конкретному объекту
//
// Параметры:
//  ТекстЗапроса - текст запроса для источника данных схемы компоновки
//
// Возвращаемое значение:
//  Схема компоновки данных
//
Функция ПолучитьСхемуКомпоновкиДанныхДляВыборки(ТекстЗапроса)

	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();
	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.СтрокаСоединения="";
	Источник.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "Запрос";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.ИсточникДанных = "Источник1";
	
	Возврат СхемаКомпоновки;

КонецФункции

// Формирует и возвращает схему компоновки данных для объекта
//
// Параметры:
//  Объект - объект, для которого требуется получить схему
//
// Возвращаемое значение:
//  Схема компоновки данных
//
Функция ПолучитьСхемуКомпоновкиДанныхДляОбъекта(МассивПолей)

	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();
	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.СтрокаСоединения="";
	Источник.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Объект";
	НаборДанных.ИмяОбъекта = "ОбъектДанных";
	НаборДанных.ИсточникДанных = "Источник1";
	
	Для Каждого Поле из МассивПолей Цикл
		ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Поле = Поле;
		ПолеНабораДанных.ПутьКДанным = Поле;
	КонецЦикла;
	
	Возврат СхемаКомпоновки;

КонецФункции

// Заполняет в переданном отборе элемент на основании структуры, содержащей данные отбора
//
// Параметры:
//  Отбор - отбор компоновки данных, который надо заполнить
//  СтруктураЭлементаОтбора - структура, содержащая данные для заполнения элемента отбора
//  ИмяЭлементаОтбора - имя поля - элемента отбора
//
Процедура ЗаполнитьЭлементОтбораКомпоновкиИзСтруктуры(Отбор, СтруктураНастроекОтбора, ИмяНастройки, ИмяЭлементаОтбора)

	СтруктураЭлементаОтбора = ПолучитьСтруктуруОтбораДляНастройки(СтруктураНастроекОтбора, ИмяНастройки);

	Если СтруктураЭлементаОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Для Каждого Элемент из СтруктураЭлементаОтбора Цикл
		Если Элемент.Ключ = "ЛевоеЗначение" Тогда
			ЭлементОтбора[Элемент.Ключ] =  Новый ПолеКомпоновкиДанных(ИмяЭлементаОтбора);
		Иначе
			ЭлементОтбора[Элемент.Ключ] = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Добавляет отборы в настройки компоновки для отдельных объектов
//
// Параметры:
//  СтруктураРеквизитовОбъекта - структура, содержащая реквизиты объекта
//  Отбор - отбор компоновки, элемент которого требуется заполнить
//  СтруктураНастроекОтбора - структура, содержащая описание устанавливаемого отбора
//  ИмяКласса - имя класса, к которому принадлежит объект (Справочники, Документы и т.д.)
//  ИмяОбъекта - имя объекта, для которого добавляются отборы
//
Процедура ДобавитьОтборыДляОтдельныхОбъектов(СтруктураРеквизитовОбъекта, Отбор, СтруктураНастроекОтбора, ИмяКласса, ИмяОбъекта)
	
	Если ИмяКласса = "Справочники" Тогда
		
		Если ИмяОбъекта = "УпаковкиНоменклатуры" ИЛИ ИмяОбъекта = "ХарактеристикиНоменклатуры" ИЛИ ИмяОбъекта = "СерииНоменклатуры" Тогда
			ЗаполнитьЭлементОтбораДляУпаковкиИХарактеристикиНоменклатуры(СтруктураРеквизитовОбъекта, Отбор, СтруктураНастроекОтбора);
		КонецЕсли;
		
		Если ИмяОбъекта = "СоглашенияСКлиентами" Тогда
			ЗаполнитьЭлементОтбораДляСоглашенияСКлиентом(СтруктураРеквизитовОбъекта, Отбор, СтруктураНастроекОтбора);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

// Выполняет заполнение элемента отбора для справочников "УпаковкиНоменклатуры" и "ХарактеристикиНоменклатуры"
//
// Параметры:
//  СтруктураРеквизитовОбъекта - структура, содержащая реквизиты объекта
//  Отбор - отбор компоновки, элемент которого требуется заполнить
//  СтруктураНастроекОтбора - структура, содержащая описание устанавливаемого отбора
//
Процедура ЗаполнитьЭлементОтбораДляУпаковкиИХарактеристикиНоменклатуры(СтруктураРеквизитовОбъекта, Отбор, СтруктураНастроекОтбора)
	
	Если ТипЗнч(СтруктураРеквизитовОбъекта.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		СтруктураЭлементаОтбора = ПолучитьСтруктуруОтбораДляНастройки(СтруктураНастроекОтбора, "Номенклатура");
		
		Если СтруктураЭлементаОтбора = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Для Каждого Элемент из СтруктураЭлементаОтбора Цикл
			Если Элемент.Ключ = "ЛевоеЗначение" Тогда
				ЭлементОтбора[Элемент.Ключ] =  Новый ПолеКомпоновкиДанных("Владелец");
			Иначе
				ЭлементОтбора[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет заполнение элемента отбора для справочника "СоглашенияСКлиентами"
//
// Параметры:
//  СтруктураРеквизитовОбъекта - структура, содержащая реквизиты объекта
//  Отбор - отбор компоновки, элемент которого требуется заполнить
//  СтруктураНастроекОтбора - структура, содержащая описание устанавливаемого отбора
//
Процедура ЗаполнитьЭлементОтбораДляСоглашенияСКлиентом(СтруктураРеквизитовОбъекта, Отбор, СтруктураНастроекОтбора)
	
	Если Не СтруктураРеквизитовОбъекта.Типовое Тогда
		
		СтруктураЭлементаОтбора = ПолучитьСтруктуруОтбораДляНастройки(СтруктураНастроекОтбора, "Партнер");
		
		Если СтруктураЭлементаОтбора = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Для Каждого Элемент из СтруктураЭлементаОтбора Цикл
			Если Элемент.Ключ = "ЛевоеЗначение" Тогда
				ЭлементОтбора[Элемент.Ключ] =  Новый ПолеКомпоновкиДанных("Партнер");
			Иначе
				ЭлементОтбора[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Задает обязательные отборы для выборки объектов с использованием компоновки, налагаемые независимо от настроек пользователя
//
// Параметры:
//  НастройкиКомпоновки - настройки компоновки данных, для которых задаются отборы
//  ИмяКласса - имя класса, к которому принадлежит объект (Справочники, Документы и т.д)
//  ИмяОбъекта - имя объекта метаданных, для которого добавляются отборы
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//
Процедура ДобавитьОбязательныеОтборы(УзелОбмена, НастройкиКомпоновки, ИмяКласса, ИмяОбъекта, СтруктураПараметровНастройкиОбмена)

	Если ИмяКласса = "Справочники" Тогда

		//Если ИмяОбъекта = "Партнеры" Тогда
		//	
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Клиент", ВидСравненияКомпоновкиДанных.Равно, Истина, Истина);
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "ОбслуживаетсяТорговымиПредставителями", ВидСравненияКомпоновкиДанных.Равно, Истина, Истина);
		//	
		//ИначеЕсли ИмяОбъекта = "Организации" Тогда
		//	
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Ссылка", ВидСравненияКомпоновкиДанных.НеРавно, Истина, Справочники.Организации.УправленческаяОрганизация);
		//	
		//ИначеЕсли ИмяОбъекта = "СоглашенияСКлиентами" Тогда
		//	
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Статус", ВидСравненияКомпоновкиДанных.Равно, Истина, Перечисления.СтатусыСоглашенийСКлиентами.Действует);
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "ИспользуетсяВРаботеТорговыхПредставителей", ВидСравненияКомпоновкиДанных.Равно, Истина, Истина);
		//	
		//	Если СтруктураПараметровНастройкиОбмена.ИспользованиеСоглашенийСКлиентами = Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоТиповыеСоглашения Тогда
		//		ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Типовое", ВидСравненияКомпоновкиДанных.Равно, Истина, Истина);
		//	КонецЕсли;
		//	
		//	Если СтруктураПараметровНастройкиОбмена.ИспользованиеСоглашенийСКлиентами = Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоИндивидуальныеСоглашения Тогда
		//		ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Типовое", ВидСравненияКомпоновкиДанных.Равно, Истина, Ложь);
		//	КонецЕсли;
		//	
		//ИначеЕсли ИмяОбъекта = "ДоговорыКонтрагентов" Тогда
		//	
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Статус", ВидСравненияКомпоновкиДанных.Равно, Истина, Перечисления.СтатусыДоговоровКонтрагентов.Действует);
		//	
		//	СписокХозяйственныхОпераций = Новый СписокЗначений();
		//	СписокХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
		//	СписокХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		//	
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "ХозяйственнаяОперация", ВидСравненияКомпоновкиДанных.ВСписке, Истина, СписокХозяйственныхОпераций);
		//	
		//ИначеЕсли ИмяОбъекта = "ВидыКонтактнойИнформации" Тогда
		//	
		//	СписокИспользуемыхГрупп = Новый СписокЗначений();
		//	СписокИспользуемыхГрупп.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
		//	СписокИспользуемыхГрупп.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
		//	
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Ссылка", ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, Истина, СписокИспользуемыхГрупп);
		//	
		//КонецЕсли;
		
	ИначеЕсли ИмяКласса = "Документы" Тогда

		//Если ИмяОбъекта = "ЗаданиеТорговомуПредставителю" Тогда
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "Статус", ВидСравненияКомпоновкиДанных.Равно, Истина, Перечисления.СтатусыЗаданийТорговымПредставителям.КОтработке);
		//	ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "ТорговыйПредставитель", ВидСравненияКомпоновкиДанных.Равно, Истина, СтруктураПараметровНастройкиОбмена.ТорговыйПредставитель);
		//КонецЕсли;

	ИначеЕсли ИмяКласса = "РегистрыСведений" Тогда
		Если ИмяОбъекта = "vrgНастройкиМобильныхУстройств" Тогда
			ДобавитьЭлементОтбораВНастройкиСхемы(НастройкиКомпоновки, "УзелУстройства", ВидСравненияКомпоновкиДанных.Равно, Истина, УзелОбмена);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСНастройкамиИПараметрамиОбмена

// Получает и возвращает структуру, содержащую описание отбора для указанной настройки обмена
//
// Параметры:
//  СтруктураНастроекОтбора - структура, содержащая настройки отбора для схемы обмена
//  ИмяНастройки - имя настройки в структуре настроек отбора
//
// Возвращаемое значение:
//  Структура, содержащая описание отбора для указанной настройки обмена
//
Функция ПолучитьСтруктуруОтбораДляНастройки(СтруктураНастроекОтбора, ИмяНастройки)

	Настройка = Неопределено;
	Если СтруктураНастроекОтбора.Свойство(ИмяНастройки, Настройка) Тогда
		Если ТипЗнч(Настройка) = Тип("Структура") Тогда
			Возврат Настройка;
		КонецЕсли;
	КонецЕсли;

	Возврат Настройка;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСМетаданными

// Формирует и возвращает структуру использования свойства справочника (реквизита или табличной части
//
// Параметры:
//  Свойство - свойство объекта метаданных - реквизит или табличная часть справочника
//
// Возвращаемое значение:
//  Структура использования свойства, определяющая использование для элемента и группы справочника
// 
Функция ПолучитьСтруктуруИспользованияСвойстваСправочника(Свойство)

	// Определим вариант использования 
	ДляЭлемента = (Свойство.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы);
	ДляГруппы   = (Свойство.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента);

	СтруктураИспользования = Новый Структура();
	СтруктураИспользования.Вставить("ИспользуетсяДляЭлемента", ДляЭлемента);
	СтруктураИспользования.Вставить("ИспользуетсяДляГруппы", ДляГруппы);

	Возврат СтруктураИспользования;

КонецФункции

// Определяет и возвращает вид указания типа в XML для реквизита
//
// Параметры:
//  Реквизит - реквизит объекта метаданных, для которого требуется определить вид указания типа
//
// Возвращаемое значение:
//  Назначение типа XML - явное или неявное
//
Функция ПолучитьУказаниеТипаРеквизита(Реквизит)

	Если Реквизит.Тип.Типы().Количество()>1 Тогда
		Возврат НазначениеТипаXML.Явное;
	Иначе
		Возврат НазначениеТипаXML.Неявное;
	КонецЕсли;

КонецФункции

// Определяет и возвращает тип стандартного реквизита объекта (справочника или документа)
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, которому принадлежит реквизит
//  ИмяКласса - имя класса, к которому принадлежит объект (Справочники, Документы)
//  ИмяРеквизита - имя реквизита, тип которого требуется определить
//
// Возвращаемое значение:
//  Тип - тип реквизита
//
Функция ПолучитьТипСтандартногоРеквизита(ОбъектМетаданных, ИмяКласса, ИмяРеквизита)

	ТипРеквизита = Неопределено;
	
	Если ИмяРеквизита = "Ref" ИЛИ ИмяРеквизита = "Ссылка" Тогда
		
		Если ИмяКласса = "Справочники" Тогда
			ТипРеквизита = Тип("СправочникСсылка." + ОбъектМетаданных.Имя);
		Иначе
			ТипРеквизита = Тип("ДокументСсылка." + ОбъектМетаданных.Имя);
		КонецЕсли;
		
	ИначеЕсли ИмяРеквизита = "IsFolder" ИЛИ ИмяРеквизита = "ЭтоГруппа"
		ИЛИ ИмяРеквизита = "DeletionMark" ИЛИ ИмяРеквизита = "ПометкаУдаления"
		ИЛИ ИмяРеквизита = "Posted" ИЛИ ИмяРеквизита = "Проведен" Тогда
		
		ТипРеквизита = Тип("Булево");
		
	ИначеЕсли ИмяРеквизита = "Parent" ИЛИ ИмяРеквизита = "Родитель" Тогда
		
		ТипРеквизита = Тип("СправочникСсылка." + ОбъектМетаданных.Имя);
		
	ИначеЕсли ИмяРеквизита = "Description" ИЛИ ИмяРеквизита = "Наименование" Тогда
		
		ТипРеквизита = Тип("Строка");
		
	ИначеЕсли ИмяРеквизита = "Date" ИЛИ ИмяРеквизита = "Дата" Тогда
		
		ТипРеквизита = Тип("Дата");
		
	ИначеЕсли ИмяРеквизита = "Code" ИЛИ ИмяРеквизита = "Код" Тогда
		
		Если ОбъектМетаданных.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ТипРеквизита = Тип("Строка");
		Иначе
			ТипРеквизита = Тип("Число");
		КонецЕсли;
			
	ИначеЕсли ИмяРеквизита = "Number" ИЛИ ИмяРеквизита = "Номер" Тогда
		
		Если ОбъектМетаданных.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Строка Тогда
			ТипРеквизита = Тип("Строка");
		Иначе
			ТипРеквизита = Тип("Число");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТипРеквизита;

КонецФункции

// Получает и возвращает тип указанного реквизита объекта метаданных
//
// Параметры:
//  Реквизит - реквизит, тип которого требуется определить
//
// Возвращаемое значение:
//  Тип реквизита, если тип не составной, Неопределено, если тип составной
//
Функция ПолучитьТипРеквизита(Реквизит)

	ОписаниеТипов = Реквизит.Тип;
	МассивТипов = ОписаниеТипов.Типы();
	
	Если МассивТипов.Количество()=1 Тогда
		Возврат МассивТипов[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Формирует и возвращает структуру описания реквизита объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, реквизит которого анализируется
//  ИмяРеквизита - имя реквизита, использование которого определяется
//
// Возвращаемое значение:
//  Структура, описывающая использование (для группы и элемента) и указание типа реквизита справочника
//
Функция ПолучитьСтруктуруОписанияРеквизитаСправочника(ОбъектМетаданных, ИмяРеквизита)

	ТипРеквизита = Неопределено;
	
	Если ИмяРеквизита = "Ref" ИЛИ ИмяРеквизита = "Ссылка"
		ИЛИ ИмяРеквизита = "IsFolder" ИЛИ ИмяРеквизита = "ЭтоГруппа"
		ИЛИ ИмяРеквизита = "DeletionMark" ИЛИ ИмяРеквизита = "ПометкаУдаления"
		ИЛИ ИмяРеквизита = "Parent" ИЛИ ИмяРеквизита = "Родитель"
		ИЛИ ИмяРеквизита = "Code" ИЛИ ИмяРеквизита = "Код"
		ИЛИ ИмяРеквизита = "Description" ИЛИ ИмяРеквизита = "Наименование" Тогда

		ДляЭлемента = Истина;
		ДляГруппы = Истина;
		УказаниеТипа = НазначениеТипаXML.Неявное;
		
		ТипРеквизита = ПолучитьТипСтандартногоРеквизита(ОбъектМетаданных, "Справочники", ИмяРеквизита);

	ИначеЕсли ИмяРеквизита = "Owner" ИЛИ ИмяРеквизита = "Владелец" Тогда

		ДляЭлемента = Истина;
		ДляГруппы = Истина;
		УказаниеТипа = НазначениеТипаXML.Явное;
		
	ИначеЕсли ИмяРеквизита = "Predefined" ИЛИ ИмяРеквизита = "Предопределенный" Тогда

		ДляЭлемента = Истина;
		ДляГруппы = Истина;
		УказаниеТипа = НазначениеТипаXML.НеЯвное;
		ТипРеквизита = Тип("Булево");
		
	Иначе
		
		Реквизит = ОбъектМетаданных.Реквизиты[ИмяРеквизита];
		ТипРеквизита = ПолучитьТипРеквизита(Реквизит);
		
		// Определим вариант использования реквизита
		СтруктураИспользования = ПолучитьСтруктуруИспользованияСвойстваСправочника(Реквизит);

		ДляЭлемента = СтруктураИспользования.ИспользуетсяДляЭлемента;
		ДляГруппы   = СтруктураИспользования.ИспользуетсяДляГруппы;
		
		// Определим вариант указания типа для реквизита
		// тип следует указывать только в том случае, если он не всегда может быть однозначно определен
		
		УказаниеТипа = ПолучитьУказаниеТипаРеквизита(Реквизит);
		
	КонецЕсли;

	СтруктураОписания = Новый Структура();
	СтруктураОписания.Вставить("ИспользуетсяДляЭлемента", ДляЭлемента);
	СтруктураОписания.Вставить("ИспользуетсяДляГруппы", ДляГруппы);
	СтруктураОписания.Вставить("УказаниеТипа", УказаниеТипа);
	СтруктураОписания.Вставить("Тип", ТипРеквизита);

	Возврат СтруктураОписания;

КонецФункции

// Формирует и возвращает структуру описания реквизита объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, реквизит которого анализируется
//  ИмяРеквизита - имя реквизита, использование которого определяется
//
// Возвращаемое значение:
//  Структура, описывающая указание типа реквизита документа
//
Функция ПолучитьСтруктуруОписанияРеквизитаДокумента(ОбъектМетаданных, ИмяРеквизита)

	ТипРеквизита = Неопределено;
	
	Если ИмяРеквизита = "Ref" ИЛИ ИмяРеквизита = "Ссылка"
		ИЛИ ИмяРеквизита = "DeletionMark" ИЛИ ИмяРеквизита = "ПометкаУдаления"
		ИЛИ ИмяРеквизита = "Date" ИЛИ ИмяРеквизита = "Дата"
		ИЛИ ИмяРеквизита = "Number" ИЛИ ИмяРеквизита = "Номер"
		ИЛИ ИмяРеквизита = "Posted" ИЛИ ИмяРеквизита = "Проведен" Тогда

		УказаниеТипа = НазначениеТипаXML.Неявное;
		
		ТипРеквизита = ПолучитьТипСтандартногоРеквизита(ОбъектМетаданных, "Документы", ИмяРеквизита);
		
	Иначе
		
		Реквизит = ОбъектМетаданных.Реквизиты[ИмяРеквизита];
		ТипРеквизита = ПолучитьТипРеквизита(Реквизит);
		
		// Определим вариант указания типа для реквизита
		// тип следует указывать только в том случае, если он не всегда может быть однозанчно определен
		УказаниеТипа = ПолучитьУказаниеТипаРеквизита(Реквизит);
		
	КонецЕсли;

	СтруктураОписания = Новый Структура();
	СтруктураОписания.Вставить("УказаниеТипа", УказаниеТипа);
	СтруктураОписания.Вставить("Тип", ТипРеквизита);

	Возврат СтруктураОписания;

КонецФункции

// Формирует и возвращает структуру, отражающую состав объекта метаданных (справочника или документа)
// Структура содержит следующие элементы: Реквизиты - массив реквизитов объекта, ТабличныеЧасти - структура табличных частей
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, структуру состава которого требуется получить
//  ИмяКласса - имя класса объекта (Справочники, Документы и т.д.)
//  ИмяОбъекта - имя объекта метаданных
//  ДеревоИспользуемыхМетаданных - дерево, описывающее используемые метаданные
//
// Возвращаемое значение:
//  Структура, описывающая состав объекта
//
Функция ПолучитьСтруктуруСоставаОбъекта(ОбъектМетаданных, ИмяКласса, ИмяОбъекта, ДеревоИспользуемыхМетаданных)

	СтруктураСостава = Новый Структура();
	СтруктураРеквизитов = Новый Структура();
	
	СтруктураТабличныхЧастей = Новый Структура();

	СтрокаКласса = ДеревоИспользуемыхМетаданных.Строки[0].Строки.Найти(ИмяКласса, "Имя");

	Если СтрокаКласса = Неопределено Тогда
		
		#Если ВнешнееСоединение Тогда
		ТекстСообщения = НСтр("ru='В пакет обмена записаны неверные данные: %ИмяКласса%.%ИмяОбъекта%.%ПереводСтроки%В приложении не используются %ИмяКласса%';uk='У пакет обміну записані невірні дані: %ИмяКласса%.%ИмяОбъекта%.%ПереводСтроки%В програмі не використовуються %ИмяКласса%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ИмяКласса%",ИмяКласса);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ИмяОбъекта%",ИмяОбъекта);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ПереводСтроки%",Символы.ПС);
		
		ВызватьИсключение(ТекстСообщения);
		#КонецЕсли
		
	КонецЕсли;

	СтрокаОбъекта = СтрокаКласса.Строки.Найти(ИмяОбъекта, "Имя");

	Если СтрокаОбъекта = Неопределено Тогда
		
		#Если ВнешнееСоединение Тогда
		ТекстСообщения = НСтр("ru='В пакет обмена записаны неверные данные: %ИмяКласса%.%ИмяОбъекта%.%ПереводСтроки%В приложении не используется данный объект';uk='У пакет обміну записані невірні дані: %ИмяКласса%.%ИмяОбъекта%.%ПереводСтроки%В програмі не використовується даний об''єкт'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ИмяКласса%",ИмяКласса);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ИмяОбъекта%",ИмяОбъекта);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ПереводСтроки%",Символы.ПС);
		
		ВызватьИсключение(ТекстСообщения);
		#КонецЕсли
		
	КонецЕсли;
	
	// Добавим реквизиты объекта
	ВетвьРеквизитов = СтрокаОбъекта.Строки.Найти("Attributes","Имя");
	
	Если ВетвьРеквизитов <> Неопределено Тогда
		Для Каждого СтрокаРеквизита из ВетвьРеквизитов.Строки Цикл
			
			СтруктураОписанияРеквизита = Новый Структура();
					
			Если ИмяКласса = "Справочники" Тогда
				СтруктураОписанияРеквизита = ПолучитьСтруктуруОписанияРеквизитаСправочника(ОбъектМетаданных, СтрокаРеквизита.Имя);
			ИначеЕсли ИмяКласса = "Документы" Тогда
				СтруктураОписанияРеквизита = ПолучитьСтруктуруОписанияРеквизитаДокумента(ОбъектМетаданных, СтрокаРеквизита.Имя);
			КонецЕсли;

			СтруктураРеквизитов.Вставить(СтрокаРеквизита.Имя, СтруктураОписанияРеквизита);

		КонецЦикла;	
	КонецЕсли;	
	
	// Добавим реквизиты табличных частей
	
	ВетвьТабличныхЧастей = СтрокаОбъекта.Строки.Найти("TabularParts","Имя");
	
	Если ВетвьТабличныхЧастей <> Неопределено Тогда
		
		Для Каждого СтрокаТабличнойЧасти из ВетвьТабличныхЧастей.Строки Цикл

			СтруктураОписанияТабличнойЧасти = Новый Структура();
			СтруктураРеквизитовТабличнойЧасти = Новый Структура();
			
			ИмяТабличнойЧасти = СтрокаТабличнойЧасти.Имя;
			
			Для Каждого СтрокаРеквизита Из СтрокаТабличнойЧасти.Строки Цикл

				СтруктураОписанияРеквизита = Новый Структура();

				РеквизитТабличнойЧасти = ОбъектМетаданных.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты[СтрокаРеквизита.Имя];
				УказаниеТипа = ПолучитьУказаниеТипаРеквизита(РеквизитТабличнойЧасти);
				ТипРеквизита = ПолучитьТипРеквизита(РеквизитТабличнойЧасти);

				СтруктураОписанияРеквизита.Вставить("УказаниеТипа", УказаниеТипа);
				СтруктураОписанияРеквизита.Вставить("Тип", ТипРеквизита);

				СтруктураРеквизитовТабличнойЧасти.Вставить(СтрокаРеквизита.Имя, СтруктураОписанияРеквизита);

			КонецЦикла;
			
			ТабличнаяЧасть = ОбъектМетаданных.ТабличныеЧасти[ИмяТабличнойЧасти];

			Если ИмяКласса = "Справочники" Тогда
				
				СтруктураИспользованияТабличнойЧасти = ПолучитьСтруктуруИспользованияСвойстваСправочника(ТабличнаяЧасть);
				
				СтруктураОписанияТабличнойЧасти.Вставить("ИспользуетсяДляЭлемента", СтруктураИспользованияТабличнойЧасти.ИспользуетсяДляЭлемента);
				СтруктураОписанияТабличнойЧасти.Вставить("ИспользуетсяДляГруппы", СтруктураИспользованияТабличнойЧасти.ИспользуетсяДляГруппы);
				
			КонецЕсли;
			
			СтруктураОписанияТабличнойЧасти.Вставить("СтруктураРеквизитов", СтруктураРеквизитовТабличнойЧасти);

			СтруктураТабличныхЧастей.Вставить(ИмяТабличнойЧасти, СтруктураОписанияТабличнойЧасти);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураСостава.Вставить("Реквизиты", СтруктураРеквизитов);
	СтруктураСостава.Вставить("ТабличныеЧасти", СтруктураТабличныхЧастей);
		
	Возврат СтруктураСостава;

КонецФункции

// Формирует и возвращает структуру, содержащую описание используемых объектов
//
// Параметры:
//  УзелОбмена - узел плана обмена, для которого анализируются используемые объекты
//
// Возвращаемое значение:
//  Структура, содержащая описание используемых объектов
//
Функция ПолучитьСтруктуруОписанияИспользуемыхОбъектов(УзелОбмена)

	СтруктураОписания = Новый Структура();

	ОписаниеИспользуемыхМетаданных = УзелОбмена.ВерсияМобильногоПриложения.ИспользуемыеМетаданные;
	ДеревоИспользуемыхМетаданных = ПолучитьДеревоИспользуемыхМетаданных(ОписаниеИспользуемыхМетаданных);

	КореньДереваМетаданных = ДеревоИспользуемыхМетаданных.Строки[0];

	Для Каждого СтрокаКласса из КореньДереваМетаданных.Строки Цикл

		ИмяКласса = СтрокаКласса.Имя;

		Если ИмяКласса = "Константы" ИЛИ ИмяКласса = "Справочники" ИЛИ ИмяКласса = "Документы" ИЛИ ИмяКласса = "РегистрыСведений" Тогда

			МетаданныеКласса = Метаданные[ИмяКласса];
			
			Для Каждого СтрокаОбъекта из СтрокаКласса.Строки Цикл
				
				МетаданныеОбъекта = МетаданныеКласса[СтрокаОбъекта.Имя];
				
				СтруктураОписанияОбъекта = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьСтруктуруОписанияОбъекта(МетаданныеОбъекта, Ложь);
				
				Если СтруктураОписанияОбъекта.ИмяКласса = "Справочники" ИЛИ СтруктураОписанияОбъекта.ИмяКласса = "Документы" Тогда
					СтруктураСостава = ПолучитьСтруктуруСоставаОбъекта(МетаданныеОбъекта, СтруктураОписанияОбъекта.ИмяКласса, СтруктураОписанияОбъекта.ИмяОбъекта, ДеревоИспользуемыхМетаданных);
					СтруктураОписания.Вставить(СтруктураОписанияОбъекта.ИмяКласса + СтруктураОписанияОбъекта.ИмяОбъекта, СтруктураСостава);
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	Возврат СтруктураОписания;

КонецФункции

// Получает и возвращает массив, содержащий имена ключевых полей регистра сведений,
// т.е. полей, которые участвуют в основном отборе и обязательно должны быть заполнены
// при регистрации изменений
//
// Параметры:
//  ОбъектМетаданных - объект метаданных конкретного регистра сведений
//
// Возвращаемое значение:
//  Массив, содержащий имена ключевых полей регистра
//
Функция ПолучитьМассивКлючевыхПолейРегистраСведений(ОбъектМетаданных)

	МассивПолей = Новый Массив();

	// Для регистров сведений, подчиненных регистратору, отбор возможен только по регистратору
	Если ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		МассивПолей.Добавить("Регистратор");
		Возврат МассивПолей;
	КонецЕсли;
	
	Если ОбъектМетаданных.ОсновнойОтборПоПериоду Тогда
		МассивПолей.Добавить("Период");
	КонецЕсли;

	Для Каждого Измерение из ОбъектМетаданных.Измерения Цикл
		Если Измерение.ОсновнойОтбор Тогда
			МассивПолей.Добавить(Измерение.Имя);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивПолей;

КонецФункции

// Получает и возвращает массив, содержащий имена полей регистра сведений
//
// Параметры:
//  ОбъектМетаданных - объект метаданных конкретного регистра сведений
//
// Возвращаемое значение:
//  Массив, содержащий имена полей регистра
//
Функция ПолучитьМассивПолейРегистраСведенийДляВыборки(ОбъектМетаданных)

	МассивПолей = ПолучитьМассивКлючевыхПолейРегистраСведений(ОбъектМетаданных);
	
	Для Каждого СтандартныйРеквизит из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Если МассивПолей.Найти(СтандартныйРеквизит.Имя) = Неопределено Тогда
			МассивПолей.Добавить(СтандартныйРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Измерение из ОбъектМетаданных.Измерения Цикл
		Если МассивПолей.Найти(Измерение.Имя) = Неопределено Тогда
			МассивПолей.Добавить(Измерение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Ресурс из ОбъектМетаданных.Ресурсы Цикл
		МассивПолей.Добавить(Ресурс.Имя);
	КонецЦикла;
	
	Для Каждого Реквизит из ОбъектМетаданных.Реквизиты Цикл
		МассивПолей.Добавить(Реквизит.Имя);
	КонецЦикла;

	Возврат МассивПолей;

КонецФункции

Функция СоответствиеИменСтандартныхРеквизитовСправочника()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ссылка", "Ref");
	Соответствие.Вставить("ЭтоГруппа", "IsFolder");
	Соответствие.Вставить("ПометкаУдаления", "DeletionMark");
	Соответствие.Вставить("Родитель", "Parent");
	Соответствие.Вставить("Код", "Code");
	Соответствие.Вставить("Наименование", "Description");
	Соответствие.Вставить("Владелец", "Owner");
	
	Возврат Соответствие;
	
КонецФункции

Функция СоответствиеИменСтандартныхРеквизитовДокумента()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ссылка", "Ref");
	Соответствие.Вставить("Дата", "Date");
	Соответствие.Вставить("Номер", "Number");
	Соответствие.Вставить("ПометкаУдаления", "DeletionMark");
	Соответствие.Вставить("Проведен", "Posted");
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСНастройкамиИПараметрамиОбмена

// Формирует и возвращает структуру, содержащую структуры настроек отбора
//
// Параметры:
//  УзелОбмена - узел плана обмена, для которого определяются настройки отборов
//
// Возвращаемое значение:
//  Структура, описывающее отборы
//
Функция ПолучитьСтруктуруНастроекОтбора(УзелОбмена) Экспорт
	
	СтруктураНастроек = УзелОбмена.ХранилищеОтбораСхемыОбмена.Получить();
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат СтруктураНастроек;
	Иначе
		Возврат Новый Структура();
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

// Формирует и возвращает структуру, описывающие параметры настройки обмена для указанного узла обмена
//
// Параметры:
//  УзелОбмена - узел плана обмена, для которого требуется получить параметры
//
// Возвращаемое значение:
//  Структура, описывающая параметры настройки обмена для указанного узла обмена
//
Функция ПолучитьСтруктуруПараметровНастройкиОбмена(УзелОбмена) Экспорт
	
	СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("АвтоматическиСоздаватьЗаказыПоЗаданию", УзелОбмена.АвтоматическиСоздаватьЗаказыПоЗаданию);
	//СтруктураПараметров.Вставить("ТорговыйПредставитель", УзелОбмена.Пользователь);
	//СтруктураПараметров.Вставить("ИспользованиеКонтактнойИнформации", УзелОбмена.ИспользованиеКонтактнойИнформации);
	//СтруктураПараметров.Вставить("ИспользованиеСоглашенийСКлиентами", Константы.ИспользованиеСоглашенийСКлиентами.Получить());
	
	Возврат СтруктураПараметров;

КонецФункции

// Разбирает xml-строку параметров обмена данными и формирует структуру параметров на ее основе
//
// Параметры:
//  ПараметрыОбменаДанными - xml-строка, содержащая параметры обмена
//
// Возвращаемое значение:
//  Структура, содержащая параметры обмена
//
Функция ПолучитьСтруктуруПараметровОбменаДанными(ПараметрыОбменаДанными) Экспорт
	
	СтруктураПараметров = Новый Структура();
	
	ЧтениеXML = Новый ЧтениеXML();
		
	Попытка
		ЧтениеXML.УстановитьСтроку(ПараметрыОбменаДанными);
	Исключение
		
		#Если ВнешнееСоединение Тогда
		ТекстСообщения = НСтр("ru='Ошибка при чтении параметров обмена данными:';uk='Помилка при читанні параметрів обміну даними:'");
		ВызватьИсключение(ТекстСообщения + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		#КонецЕсли
		
	КонецПопытки;
	
	Попытка
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
				
				ИмяПараметра = ЧтениеXML.Имя;
				ЗначениеПараметра = ПрочитатьXML(ЧтениеXML);
				
				СтруктураПараметров.Вставить(ИмяПараметра, ЗначениеПараметра);
				
			КонецЦикла;
			
		КонецЦикла;		
				
	Исключение
		
		#Если ВнешнееСоединение Тогда
		ТекстСообщения = НСтр("ru='Ошибка при чтении параметров обмена данными:';uk='Помилка при читанні параметрів обміну даними:'");
		ВызватьИсключение(ТекстСообщения + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		#КонецЕсли
		
	КонецПопытки;

	Возврат СтруктураПараметров;

КонецФункции

// Определяет, требуется ли подключение внешней компоненты обмена данными при старте системы
//
// Возвращаемое значение:
//  Булево, Истина - подключение требуется, Ложь - не требуется
//
Функция ПодключатьКомпонентуОбменаДаннымиПриСтартеСистемы() Экспорт
	
	ТребуетсяПодключение = Ложь;
	
	ЗначениеНастройкиИзХранилища = Неопределено;
	ЗначениеНастройкиИзХранилища = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиРаботыПользователяСКомпонентойОбменаДанными", 
																				"ПодключатьКомпонентуОбменаДаннымиПриСтартеСистемы");
		
	Если ЗначениеНастройкиИзХранилища <> Неопределено Тогда
		ТребуетсяПодключение = ЗначениеНастройкиИзХранилища;
	КонецЕсли;
	
	Возврат ТребуетсяПодключение;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСМетаданными

// Формирует дерево используемых метаданных на основании описания, полученного от редактора мобильных приложений
//
// Параметры:
//  ОписаниеМетаданных - XML-строка, содержащая описание используемых метаданных
//
// Возвращаемое значение:
//  Сформированное дерево значений, содержащее данные по используемым метаданным
//
Функция ПолучитьДеревоИспользуемыхМетаданных(ОписаниеМетаданных) Экспорт

	ДеревоМетаданных = Новый ДеревоЗначений();
	ДеревоМетаданных.Колонки.Добавить("Имя");	
	ДеревоМетаданных.Колонки.Добавить("Использование");	
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(ОписаниеМетаданных);
	
	СтрокаДерева = Неопределено;
	
	Попытка
		
		Пока ЧтениеXML.Прочитать() Цикл	
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				Если СтрокаДерева = Неопределено Тогда
					КоллекцияСтрокДляДобавления = ДеревоМетаданных.Строки;
				Иначе
					КоллекцияСтрокДляДобавления = СтрокаДерева.Строки;
				КонецЕсли;	
					
				СтрокаДерева = КоллекцияСтрокДляДобавления.Добавить();
				Имя = ЧтениеXML.Имя;
				СтрокаДерева.Имя = Имя;
				
				Если СтрокаДерева.Уровень() = 1 Тогда
					
					Если Имя = "Constants" Тогда
						СтрокаДерева.Имя = "Константы";
					ИначеЕсли Имя = "Catalogs" Тогда
						СтрокаДерева.Имя = "Справочники";
					ИначеЕсли Имя = "Documents" Тогда
						СтрокаДерева.Имя = "Документы";
					ИначеЕсли Имя = "InformationRegisters" Тогда
						СтрокаДерева.Имя = "РегистрыСведений";
					КонецЕсли;
						
				КонецЕсли;
				
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
				Если СтрокаДерева <> Неопределено Тогда
					СтрокаДерева = СтрокаДерева.Родитель;
				КонецЕсли;	
				
			КонецЕсли;
				
		КонецЦикла;
			
	Исключение
		
		#Если ВнешнееСоединение Тогда
		ВызватьИсключение(НСтр("ru='Ошибка чтения перечня метаданных, используемых мобильным приложением';uk='Помилка читання переліку метаданих, що використовуються мобільним додатком'"));
		#КонецЕсли
	
	КонецПопытки;
	
	Возврат ДеревоМетаданных;

КонецФункции

Функция СтруктураСоставаОбъектаМетаданных(ИмяКласса, ИмяОбъекта, СтруктураИспользованияОбъекта) Экспорт
	
	ОбъектМетаданных = Метаданные[ИмяКласса][ИмяОбъекта];
	
	Если СтруктураИспользованияОбъекта.Свойство("Реквизиты") Тогда
		СтруктураИспользуемыхРеквизитов = СтруктураИспользованияОбъекта.Реквизиты;
	Иначе
		СтруктураИспользуемыхРеквизитов = Новый Структура;
	КонецЕсли;
	
	Если СтруктураИспользованияОбъекта.Свойство("ТабличныеЧасти") Тогда
		СтруктураИспользуемыхТабличныхЧастей = СтруктураИспользованияОбъекта.ТабличныеЧасти;
	Иначе
		СтруктураИспользуемыхТабличныхЧастей = Новый Структура;
	КонецЕсли;
	
	СтруктураСостава = Новый Структура();
	СтруктураРеквизитов = Новый Структура();
	СтруктураТабличныхЧастей = Новый Структура();
	
	Если ИмяКласса = "Справочники" Тогда
		СоответствиеИмен = СоответствиеИменСтандартныхРеквизитовСправочника();
	ИначеЕсли ИмяКласса = "Документы" Тогда
		СоответствиеИмен = СоответствиеИменСтандартныхРеквизитовДокумента();
	КонецЕсли;
	
	Для Каждого Реквизит из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		
		ИмяРеквизита = СоответствиеИмен.Получить(Реквизит.Имя);
		
		Если ИмяРеквизита = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяКласса = "Справочники" Тогда
			СтруктураРеквизита = ПолучитьСтруктуруОписанияРеквизитаСправочника(ОбъектМетаданных, ИмяРеквизита);
		ИначеЕсли ИмяКласса = "Документы" Тогда
			СтруктураРеквизита = ПолучитьСтруктуруОписанияРеквизитаДокумента(ОбъектМетаданных, ИмяРеквизита);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить(ИмяРеквизита, СтруктураРеквизита);
		
	КонецЦикла;
	
	Для Каждого Реквизит из ОбъектМетаданных.Реквизиты Цикл
		
		Если НЕ СтруктураИспользуемыхРеквизитов.Свойство(Реквизит.Имя) Тогда
			// реквизиты, которые не используются, не учитываются
			Продолжить;
		КонецЕсли;
		
		Если ИмяКласса = "Справочники" Тогда
			СтруктураРеквизита = ПолучитьСтруктуруОписанияРеквизитаСправочника(ОбъектМетаданных, Реквизит.Имя);
		ИначеЕсли ИмяКласса = "Документы" Тогда
			СтруктураРеквизита = ПолучитьСтруктуруОписанияРеквизитаДокумента(ОбъектМетаданных, Реквизит.Имя);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить(Реквизит.Имя, СтруктураРеквизита);
		
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Если НЕ СтруктураИспользуемыхТабличныхЧастей.Свойство(ТабличнаяЧасть.Имя) Тогда
			// Табличные части, которые не используются, не учитываются
			Продолжить;
		КонецЕсли;
		
		СтруктураИспользованияТабличнойЧасти = СтруктураИспользуемыхТабличныхЧастей[ТабличнаяЧасть.Имя];
		
		СтруктураОписанияТабличнойЧасти = Новый Структура;
		СтруктураРеквизитовТЧ = Новый Структура;
		
		Для Каждого РеквизитТЧ из ТабличнаяЧасть.Реквизиты Цикл
			
			Если НЕ СтруктураИспользованияТабличнойЧасти.Свойство(РеквизитТЧ.Имя) Тогда
				// Реквизиты табличной части, которые не используются, не учитываются
				Продолжить;
			КонецЕсли;
			
			СтруктураРеквизитаТЧ = Новый Структура;
			
			УказаниеТипа = ПолучитьУказаниеТипаРеквизита(РеквизитТЧ);
			ТипРеквизита = ПолучитьТипРеквизита(РеквизитТЧ);
			
			СтруктураРеквизитаТЧ.Вставить("УказаниеТипа", УказаниеТипа);
			СтруктураРеквизитаТЧ.Вставить("Тип", ТипРеквизита);
			
			СтруктураРеквизитовТЧ.Вставить(РеквизитТЧ.Имя, СтруктураРеквизитаТЧ);
				
		КонецЦикла;
		
		Если ИмяКласса = "Справочники" Тогда
				
			СтруктураИспользованияТабличнойЧасти = ПолучитьСтруктуруИспользованияСвойстваСправочника(ТабличнаяЧасть);
			
			СтруктураОписанияТабличнойЧасти.Вставить("ИспользуетсяДляЭлемента", СтруктураИспользованияТабличнойЧасти.ИспользуетсяДляЭлемента);
			СтруктураОписанияТабличнойЧасти.Вставить("ИспользуетсяДляГруппы", СтруктураИспользованияТабличнойЧасти.ИспользуетсяДляГруппы);
				
		КонецЕсли;
		
		СтруктураОписанияТабличнойЧасти.Вставить("СтруктураРеквизитов", СтруктураРеквизитовТЧ);
		
		СтруктураТабличныхЧастей.Вставить(ТабличнаяЧасть.Имя, СтруктураОписанияТабличнойЧасти);
		
	КонецЦикла;
	
	СтруктураСостава.Вставить("Реквизиты", СтруктураРеквизитов);
	СтруктураСостава.Вставить("ТабличныеЧасти", СтруктураТабличныхЧастей);
	
	Возврат СтруктураСостава;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленкияРегистрациейИзмененийИВыборкиДанных

// Определяет необходимость регистрации изменений в указанном узле плана обмена, исходя из
// схемы обмена, определенной для данного узла обмена
//
// Параметры:
//  СтруктураРеквизитовОбъекта - структура, содержащая реквизиты проверяемого объекта
//  СтруктураОписанияОбъекта - структура, содержащая описание объекта метаданных
//  МассивПолей - массив, содержащий имена полей объекта
//  ТаблицаДанныхОбъекта - таблица значений, содержащая данные полей объекта
//  УзелОбмена - узел плана обмена, в котором регистрируются изменения
//
// Возвращаемое значение:
//  Признак необходимости регистрации изменений по объекту
//   Истина - регистрация требуется
//	 Ложь   - регистрация не требуется	
//
Функция ТребуетсяРегистрацияИзмененийОбъекта(СтруктураРеквизитовОбъекта, СтруктураОписанияОбъекта, МассивПолей, ТаблицаДанныхОбъекта, УзелОбмена) Экспорт

	ИмяКласса = СтруктураОписанияОбъекта.ИмяКласса;
	ИмяОбъекта = СтруктураОписанияОбъекта.ИмяОбъекта;
	
	Если ИмяОбъекта = "Контрагенты" или ИмяОбъекта = "Номенклатура" или ИмяОбъекта = "ЕдиницыИзмерения" или ИмяОбъекта = "Штрихкоды" Тогда 
		Возврат Истина;
		
	Иначе
		СтруктураПараметровНастройкиОбмена = ПолучитьСтруктуруПараметровНастройкиОбмена(УзелОбмена);
		
		СтруктураНастроекОтбора = ПолучитьСтруктуруНастроекОтбора(УзелОбмена);
		
		Если ИспользованиеОбъектаОтключено(ИмяКласса, ИмяОбъекта, УзелОбмена) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СхемаКомпоновки = ПолучитьСхемуКомпоновкиДанныхДляОбъекта(МассивПолей);
		НастройкиКомпоновки = СкомпоноватьНастройки(СхемаКомпоновки);
		
		ДобавитьОтборыИзСхемыОбмена(НастройкиКомпоновки, СтруктураНастроекОтбора, ИмяКласса, ИмяОбъекта, Истина, СтруктураПараметровНастройкиОбмена, Ложь);
		ДобавитьОтборыДляОтдельныхОбъектов(СтруктураРеквизитовОбъекта, НастройкиКомпоновки.Отбор, СтруктураНастроекОтбора, ИмяКласса, ИмяОбъекта);
		ДобавитьОбязательныеОтборы(УзелОбмена, НастройкиКомпоновки, ИмяКласса, ИмяОбъекта, СтруктураПараметровНастройкиОбмена);
		
		МакетКомпоновки = ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
		
		ВнешниеНаборыДанных = Новый Структура("ОбъектДанных", ТаблицаДанныхОбъекта);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ТаблицаРезультата = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		Возврат ТаблицаРезультата.Количество()>0;
	КонецЕсли;
	//Возврат Истина;
	
КонецФункции

// Регистрирует изменения для указанного узла обмена в соответствии
// со схемой обмена, определенной для этого узла
//
// Параметры:
// УзелОбмена - узел плана обмена, для которого нужно зарегистрировать изменения
//
Процедура ЗарегистрироватьЗаписатьИзмененияНачальныхДанных(УзелОбмена, ЗаписыватьДанные = Ложь, ЗаписьXML = Неопределено) Экспорт

	СоставПланаОбмена = УзелОбмена.Метаданные().Состав;
	
	СтруктураПараметровНастройкиОбмена = ПолучитьСтруктуруПараметровНастройкиОбмена(УзелОбмена);
	
	СтруктураНастроекОтбора = ПолучитьСтруктуруНастроекОтбора(УзелОбмена);
	
	// В цикле обходятся все объекты метаданных, входящие в состав плана обмена и по каждому из них
	// регистрируются изменения с учетом настроек схемы обмена

	Для Каждого ЭлементСоставаПланаОбмена Из СоставПланаОбмена Цикл
		
		СтруктураОписанияОбъекта = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьСтруктуруОписанияОбъекта(ЭлементСоставаПланаОбмена.Метаданные, Ложь);

		ИмяКласса = СтруктураОписанияОбъекта.ИмяКласса;
		ИмяОбъекта = СтруктураОписанияОбъекта.ИмяОбъекта;
	
		Если ИмяКласса = "Константы" Тогда
			
			// Для констант никаких условий отбора не задается, поэтому сразу зарегистрируем изменения
			Если ЗаписыватьДанные Тогда
				Если ИмяОбъекта = "ИспользоватьСерииНоменклатуры" Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьСерииНоменклатуры");
					ЗаписатьXML(ЗаписьXML, Константы.ИспользоватьСерииНоменклатуры.Получить(), "Value");
					ЗаписьXML.ЗаписатьКонецЭлемента();
				ИначеЕсли ИмяОбъекта = "ИспользоватьХарактеристикиНоменклатуры" Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager.ИспользоватьХарактеристикиНоменклатуры");
					ЗаписатьXML(ЗаписьXML, Константы.ИспользоватьХарактеристикиНоменклатуры.Получить(), "Value");
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
			Иначе
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,ЭлементСоставаПланаОбмена.Метаданные);
			КонецЕсли;

		ИначеЕсли ИмяКласса = "Справочники" ИЛИ ИмяКласса = "Документы" Тогда
			
			Если ИспользованиеОбъектаОтключено(ИмяКласса, ИмяОбъекта, УзелОбмена) Тогда
				Продолжить;
			КонецЕсли;	
			
			// Для справочников и документов выберем ссылки, по которым зарегистрируем изменения
			ВыборкаДанных = ВыбратьСсылкиДляРегистрацииИзменений(УзелОбмена, СтруктураОписанияОбъекта, СтруктураНастроекОтбора, СтруктураПараметровНастройкиОбмена);
			
			Пока ВыборкаДанных.Следующий() Цикл
				
				Если ЗаписыватьДанные Тогда
					ЗаписатьДанные(ЗаписьXML, ВыборкаДанных.Ссылка, УзелОбмена);
				Иначе
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,ВыборкаДанных.Ссылка);
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ИмяКласса = "РегистрыСведений" Тогда

			// остатки и цены отдельными кнопками грузятся, просто чтобы было меньше пакет данных
			Если ЗаписыватьДанные И (ИмяОбъекта = "vrgЦеныНоменклатурыМобильныеСклад" ИЛИ ИмяОбъекта = "vrgОстаткиНаСкладахМобильныеСклад") Тогда
				Продолжить;
			КонецЕсли;

			МассивПолей = ПолучитьМассивКлючевыхПолейРегистраСведений(ЭлементСоставаПланаОбмена.Метаданные);
			ТаблицаКлючей = ПолучитьТаблицуКлючейНабораЗаписей(СтруктураОписанияОбъекта, СтруктураНастроекОтбора, МассивПолей, СтруктураПараметровНастройкиОбмена, , УзелОбмена);
			
			МассивВыбранныхПолей = Новый Массив();
			Для Каждого Колонка из ТаблицаКлючей.Колонки Цикл
				МассивВыбранныхПолей.Добавить(Колонка.Имя);
			КонецЦикла;

			// Для каждой уникальной комбинации полей сформируем наборы записей с такими отборами и зарегистрируем по ним изменения
			Для Каждого КомбинацияКлючей из ТаблицаКлючей Цикл

				НаборЗаписей = ПолучитьНаборЗаписейРегистраСведенийПоКомбинацииКлючей(СтруктураОписанияОбъекта, КомбинацияКлючей, МассивПолей, МассивВыбранныхПолей);
				Если ЗаписыватьДанные Тогда
					НаборЗаписей.Прочитать();
					ЗаписатьДанные(ЗаписьXML, НаборЗаписей, УзелОбмена);
				Иначе
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,НаборЗаписей);
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Формирует и возвращает текст запроса для выборки данных конкретного регистра сведений
//
// Параметры:
//  ИмяОбъекта - имя регистра, по которому необходимо сформировать текст запроса
//  ИмяТаблицы - имя таблицы данных, по которой необходимо сформировать текст запроса
//  МассивПолей - массив, содержащий имена полей для выборки
//  СтруктураПараметровНастройкиОбмена - структура, содержащая параметры настройки обмена
//
// Возвращаемое значение:
//  Текст запроса, если он определен для регистра. В противном случае возвращается пустая строка - при этом будет
//  использован "стандартный" текст запроса по таблице, без дополнительных условий
//
Функция ПолучитьТекстЗапросаДляРегистра(ИмяОбъекта, ИмяТаблицы, МассивПолей, Изменения, НомерСообщения, УзелУстройства) Экспорт
	
	ТекстЗапроса = "";
	
	//Если ИмяТаблицы = "РегистрСведений.КурсыВалют" Тогда
	//			
	//	ТекстЗапроса =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	КурсыВалютСрезПоследних.Период,
	//	|	КурсыВалютСрезПоследних.Валюта,
	//	|	КурсыВалютСрезПоследних.Курс,
	//	|	КурсыВалютСрезПоследних.Кратность
	//	|ИЗ
	//	|	РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, ) КАК КурсыВалютСрезПоследних"
	//	;
	//КонецЕсли;
	Если ИмяТаблицы = "РегистрСведений.vrgНастройкиМобильныхУстройств" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиМобильныхУстройств.УзелУстройства,
		|	НастройкиМобильныхУстройств.ИдентификаторУстройства
		|ИЗ
		|	РегистрСведений.vrgНастройкиМобильныхУстройств КАК НастройкиМобильныхУстройств
		|ГДЕ
		|	НастройкиМобильныхУстройств.УзелУстройства = &УзелУстройства
		|";
	ИначеЕсли ИмяТаблицы = "РегистрСведений.Штрихкоды" Тогда
		Если УзелУстройства.Конфигурация = "УТП" ИЛИ УзелУстройства.Конфигурация = "УТ23" Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод КАК Штрихкод,
			|	Штрихкоды.Владелец КАК Владелец,
			|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Штрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
			|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	Штрихкоды.ТипШтрихкода КАК ТипШтрихкода,
			|	Штрихкоды.Качество КАК Качество
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
			|";
		ИначеЕсли УзелУстройства.Конфигурация = "BASRetail" Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Штрихкоды.Штрихкод,
			|	Штрихкоды.Владелец,
			|	Штрихкоды.Характеристика,
			|	Штрихкоды.Упаковка,
			|	Штрихкоды.ТипШтрихкода
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
			|";
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Остатки.Склад,
		|	Остатки.Номенклатура,
		|	Остатки.СерияНоменклатуры,
		|	Остатки.ХарактеристикаНоменклатуры,
		|	Остатки.Количество
		|ИЗ
		|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК Остатки
		|";
	ИначеЕсли ИмяТаблицы = "РегистрСведений.vrgЦеныНоменклатурыМобильныеСклад" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Цены.Номенклатура,
		|	Цены.ТипЦен,
		|	Цены.ЕдиницаИзмерения,
		|	Цены.ХарактеристикаНоменклатуры,
		|	Цены.Цена
		|ИЗ
		|	РегистрСведений.vrgЦеныНоменклатурыМобильныеСклад КАК Цены
		|";
	КонецЕсли;
	
	Если Изменения Тогда
		МассивПолейОтбора = Новый Массив();
		МассивПолейОтбора.Добавить("Узел");
		
		Если НомерСообщения <> Неопределено Тогда
			МассивПолейОтбора.Добавить("НомерСообщения");
		КонецЕсли;	
	Иначе
		МассивПолейОтбора = vrgОбменДаннымиСМобильнымиПриложениямиСобытия.ПолучитьМассивПолейОтбораДляОбъекта("РегистрыСведений", ИмяОбъекта);
	КонецЕсли;
	
	ДобавитьПоляОтбораВТекстЗапроса(ТекстЗапроса, МассивПолейОтбора);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти









