// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда

		Если Не  ЗначениеЗаполнено(ТипНоменклатуры) Тогда
			ТекстСообщения = НСтр("ru='Необходимо указать тип номенклатуры!';uk='Необхідно вказати тип номенклатури!'");
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		СуществуютСсылки = Неопределено;
		Если НЕ ЭтоНовый() 
		   И ТипНоменклатуры <> Ссылка.ТипНоменклатуры 
		   И ПолныеПрава.ВидыНоменклатуры_СуществуютСсылкиВНоменклатуре(Ссылка, СуществуютСсылки) Тогда
			ТекстСообщения = НСтр("ru='Вид номенклатуры ""';uk='Вид номенклатури ""'") + СокрЛП(Ссылка) + НСтр("ru='"" выбран в элементах справочника ""Номенклатура""."
"Тип не может быть изменен!';uk='"" обраний в елементах довідника ""Номенклатура""."
"Тип не може бути змінено!'");
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()
