
Процедура ЗаполнитьДанныеПоФизЛицу(МассФизЛиц, СоответствиеФизЛиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
		|	РаботникиСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник.Физлицо В (&ФизЛицо)) КАК РаботникиОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&Дата, ФизЛицо В (&ФизЛицо)) КАК РаботникиСрезПоследних
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = РаботникиСрезПоследних.ФизЛицо";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Физлицо", МассФизЛиц);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		стрДанные = Новый Структура;
		стрДанные.Вставить("Организация", Выборка.Организация);
		стрДанные.Вставить("Подразделение", Выборка.Подразделение);
		СоответствиеФизЛиц[Выборка.ФизЛицо] = стрДанные;
	КонецЦикла;
	
КонецПроцедуры
