
Процедура ДокументОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее")Тогда 
		Если ложь Тогда Источник = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();КонецЕсли;
		Если Источник.Оплачено и Источник.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда 
			
			Запись = Источник.Движения.ДвиженияДенежныхСредств.Добавить();
			Запись.Период = Источник.ДатаОплаты;
			Запись.БанковскийСчетКасса	= Источник.СчетОрганизации;
			Запись.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Безналичные;
			Запись.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
			Запись.СтатьяДвиженияДенежныхСредств = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Запись.ДокументДвижения = Источник.Ссылка;
			Запись.Организация = Источник.Организация;
			Запись.Контрагент = Источник.Контрагент;
			
			запись.Сумма = Источник.СуммаДокумента;
			запись.СуммаУпр = Источник.СуммаДокумента*Источник.КурсДокумента/Источник.КратностьДокумента;
			
			Запись = Источник.Движения.ДвиженияДенежныхСредств.Добавить();
			Запись.Период = Источник.ДатаОплаты;
			Запись.БанковскийСчетКасса	= Источник.СчетКонтрагента;
			Запись.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Безналичные;
			Запись.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход;
			Запись.СтатьяДвиженияДенежныхСредств = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Запись.ДокументДвижения = Источник.Ссылка;
			Запись.Организация = Источник.Организация;
			Запись.Контрагент = Источник.Контрагент;
			
			запись.Сумма = Источник.СуммаДокумента;
			запись.СуммаУпр = Источник.СуммаДокумента*Источник.КурсДокумента/Источник.КратностьДокумента;
			
			Источник.Движения.ДвиженияДенежныхСредств.Записать();
		КонецЕсли;	
		//<+++ a3b *Нікітін Андрій ВК 11.08.2020 10:40:16 
		Если Источник.Оплачено тогда
			СформироватьДвиженияПоПокупкеПродажеВалюты(Источник);
		КонецЕсли;
	иначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПокупкаПродажаВалюты")Тогда 
		СформироватьДвиженияПоПокупкеПродажеВалюты(Источник);
	иначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее")Тогда 
		Если Источник.Оплачено тогда
			СформироватьДвиженияПоПокупкеПродажеВалюты(Источник);  
		КонецЕсли;
		//иначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее")Тогда 
		//	СформироватьДвиженияПоПокупкеПродажеВалюты(Источник);
	КонецЕсли;	
	
КонецПроцедуры

//<+++ a3b *Нікітін Андрій ВК 11.08.2020 10:39:34 
Процедура СформироватьДвиженияПоПокупкеПродажеВалюты(ДокументОбъект) Экспорт 
	
	Регистратор = ДокументОбъект.Ссылка;
	Изменен = Ложь;
	
	СтатьиДДС = ДокументОбъект.Движения.ДвиженияДенежныхСредств;                                                
	ДДСПеремещениеНаОбмен = а3б_ДляПодписокНаСобытия.ПолучитьПредопределенныйЭлемент("Справочники.СтатьиДвиженияДенежныхСредств.ПеремещениеНаОбмен");
	ДДСКурсоваРізниця = а3б_ДляПодписокНаСобытия.ПолучитьПредопределенныйЭлемент("Справочники.СтатьиДвиженияДенежныхСредств.КурсоваРізниця");
	
	Если ДокументОбъект.Движения.Хозрасчетный.Количество() Тогда 
		набор = ДокументОбъект.Движения.Хозрасчетный;
	иначе  
		набор = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей() ;
		запись = набор.Добавить();
		набор.Отбор.регистратор.Установить(Регистратор);
		набор.Прочитать();
	КонецЕсли;
	
	ЕтоПлатежноеПоручениеВходящее = ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее");
	ЕтоПлатежноеПоручениеИсходящее = ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее");
	ЭтоПокупкаПродажа = ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПокупкаПродажаВалюты");
	
	для Каждого запись из набор Цикл  
		Если //не запись.ВидРегламентнойОперации = Перечисления.ВидыРегламентныхОпераций.ПереоценкаВалютныхСчетов
			//и 
			не ЭтоПокупкаПродажа и не ЕтоПлатежноеПоручениеВходящее и не ЕтоПлатежноеПоручениеИсходящее Тогда 
			Продолжить;
		КонецЕсли;  
		
		//Если ЭтоПокупкаПродажа тогда
		//	//Кореспонденція Дт 333 Кт334 (при продажу)
		//	Если  Лев(запись.СчетДт.Код,3) = "333" и Лев(запись.СчетКт.Код,3) = "334"  Тогда  
		//		
		//		СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
		//		
		//		Если ЕтоПлатежноеПоручениеВходящее тогда
		//			СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.БанковскийСчетКасса;
		//		иначе
		//			СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.Заявка.СчетВалютный;
		//		КонецЕсли;
		//		СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
		//		СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
		//		СтрокаДвиженийОстатки.Сумма               = запись.ВалютнаяСуммаКт;
		//		СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
		//		СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Приход;
		//		СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСПеремещениеНаОбмен;
		//		СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
		//		СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
		//		
		//		
		//	КонецЕсли;
		//	
		//	//Дт 334 Кт 333 (при купівлі валюти)
		//	Если  Лев(запись.СчетДт.Код,3) = "334" и Лев(запись.СчетКт.Код,3) = "333"  Тогда  
		//		
		//		СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
		//		
		//		Если ЕтоПлатежноеПоручениеВходящее тогда
		//			СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.БанковскийСчетКасса;
		//		иначе
		//			СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.Заявка.СчетВалютный;
		//		КонецЕсли;
		//		СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
		//		СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
		//		СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
		//		СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
		//		СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Расход;
		//		СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСПеремещениеНаОбмен;
		//		СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
		//		СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
		//		
		//	КонецЕсли;
		//КонецЕсли;
		
		Если Лев(запись.СчетКт.Код,3) = "714" или Лев(запись.СчетКт.Код,3) = "711"  Тогда   //доходы
			
			
			Если (ЕтоПлатежноеПоручениеИсходящее или ЕтоПлатежноеПоручениеВходящее) и Лев(запись.СчетДт.Код,2) = "31" тогда
				СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
				//<+++ a3b Нікітін А. ВК 18.09.2020 12:23:22 
				//Если Регистратор.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты И ЗначениеЗаполнено(Регистратор.ЗаявкаНаПокупкуПродажуВалюты.СчетГривневый) Тогда
				//	СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.ЗаявкаНаПокупкуПродажуВалюты.СчетГривневый;
				//Иначе
					СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.СчетОрганизации;
				//КонецЕсли; 

				//Если ЕтоПлатежноеПоручениеИсходящее Тогда
				//	СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.ЗаявкаНаПокупкуПродажуВалюты.СчетГривневый;
				//иначе
				//	СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.СчетОрганизации;
				//КонецЕсли; 
				//---> a3b Нікітін А. ВК 18.09.2020 12:24:16 
				СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
				СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
				СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
				СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
				СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Приход;
				СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСКурсоваРізниця;
				СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
				СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
				СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Контрагент;
			иначе
				Если  Лев(запись.СчетДт.Код,3) = "334"  Тогда  
					
					СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
					
					Если ЕтоПлатежноеПоручениеВходящее или ЕтоПлатежноеПоручениеИсходящее тогда
						СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.БанковскийСчетКасса;
					иначе
						СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.Заявка.СчетВалютный;
					КонецЕсли;
					СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
					СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
					СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
					СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
					СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Приход;
					СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСКурсоваРізниця;
					СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
					СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
					СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Банк;

					
					//расход по курсовой разнице
					СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
					СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.Заявка.СчетВалютный;
					СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
					СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
					СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
					СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
					СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Расход;
					СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСПеремещениеНаОбмен;
					СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
					СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
					СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Банк;

					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		
		
		
		Если Лев(запись.СчетДт.Код,3) = "945" или Лев(запись.СчетДт.Код,3) = "942" Тогда   //затраты
			Если (ЕтоПлатежноеПоручениеИсходящее или ЕтоПлатежноеПоручениеВходящее) и Лев(запись.СчетКт.Код,2) = "31" тогда
				СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
				СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.СчетОрганизации;
				СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
				СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
				//СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
				СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
				СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Расход;
				СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСКурсоваРізниця;
				СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
				СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
				СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Контрагент;
			иначе
				
				Если Лев(запись.СчетКт.Код,3) = "334"  Тогда
					
					Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПокупкаПродажаВалюты")
						и запись.Содержание  = "Комиссионные банка"  Тогда 
						Продолжить;
					КонецЕсли;  
					
					СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
					
					Если ЕтоПлатежноеПоручениеВходящее или ЕтоПлатежноеПоручениеИсходящее тогда
						//СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.БанковскийСчетКасса;
						Если Регистратор.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты Тогда
							СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.ДокументОснование.СчетГривневый;
						иначе
							СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.СчетОрганизации;
						КонецЕсли;
					иначе
						СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.ДокументОснование.СчетГривневый;
					КонецЕсли;
					
					СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
					СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
					СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
					СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
					СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Расход;
					СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСКурсоваРізниця;
					СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
					СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
					Если ЕтоПлатежноеПоручениеВходящее или ЕтоПлатежноеПоручениеИсходящее тогда
						СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Контрагент;
					Иначе
						СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Банк;
					КонецЕсли;
					
					
					//приход по курсовой разнице
					СтрокаДвиженийОстатки = СтатьиДДС.Добавить();
					//СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.Заявка.СчетГривневый;
					Если ЕтоПлатежноеПоручениеВходящее или ЕтоПлатежноеПоручениеИсходящее тогда
						//СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.БанковскийСчетКасса;
						Если Регистратор.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты Тогда
							СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.ДокументОснование.СчетГривневый;
						иначе
							СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.СчетОрганизации;
						КонецЕсли;
					иначе
						СтрокаДвиженийОстатки.БанковскийСчетКасса = Регистратор.ДокументОснование.СчетГривневый;
					КонецЕсли;

					СтрокаДвиженийОстатки.Организация 		  = Регистратор.Организация;
					СтрокаДвиженийОстатки.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Безналичные;
					СтрокаДвиженийОстатки.Сумма               = запись.Сумма;
					СтрокаДвиженийОстатки.СуммаУпр            = запись.Сумма; //Регистратор.СуммаУпр;
					СтрокаДвиженийОстатки.ПриходРасход        = Перечисления.ВидыДвиженийПриходРасход.Приход;
					СтрокаДвиженийОстатки.СтатьяДвиженияДенежныхСредств = ДДСПеремещениеНаОбмен;
					СтрокаДвиженийОстатки.ДокументДвижения 	  = Регистратор;
					СтрокаДвиженийОстатки.период 	  		  = Регистратор.дата;
					Если ЕтоПлатежноеПоручениеВходящее или ЕтоПлатежноеПоручениеИсходящее тогда
						СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Контрагент;
					Иначе
						СтрокаДвиженийОстатки.Контрагент 	  	  = Регистратор.Банк;
					КонецЕсли;

					
					
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	СтатьиДДС.записать();
	
	//Если Изменен и не ДокументОбъект.Движения.Хозрасчетный.Количество() Тогда 
	//  набор.Записать();
	//КонецЕсли;
	//ДокументОбъект.Движения.ВзаиморасчетыСКонтрагентами.Записать();
	//ДокументОбъект.Движения.Продажи.Записать();
	//ДокументОбъект.Движения.Затраты.Записать();
	
КонецПроцедуры

Процедура ПередЗаписьюРегистраНакопленияПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Регистратор = Источник.отбор.регистратор.значение;
	Если ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ПартииТоваровНаСкладах") и Источник.количество() Тогда 
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаправкаТехники") 
			ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратГСМ") Тогда  
			Тз = источник.Выгрузить();
			тз.свернуть("Номенклатура","Количество,Стоимость");
			Если тз[0].Количество Тогда 
				Цена = тз[0].Стоимость/тз[0].Количество;
				набор = РегистрыНакопления.ИнтекоУчетГСМ.СоздатьНаборЗаписей();
				набор.Отбор.регистратор.Установить(Регистратор);
				набор.Прочитать();
				Для каждого Запись Из набор  Цикл
					Запись.Сумма = запись.Количество * Цена;
				КонецЦикла; 
				набор.Записать();
			КонецЕсли;	
		КонецЕсли; 
	ИначеЕсли 	ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ПартииТоваровНаСкладахБухгалтерскийУчет") и Источник.количество() Тогда 
		
	КонецЕсли;	
КонецПроцедуры
