
&НаКлиенте
Процедура СайтПриложенияНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СайтПриложения);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СайтПриложения = "http://octopus-tsd.com.ua/";
	ЭлектронныйАдресТехническойПоддержки = "octopus.tsd@gmail.com";
	TelegramHelpDesk = "octopushelpdesk_bot";

КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйАдресТехническойПоддержкиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		НовВз.Действие = "android.intent.action.SENDTO";
		НовВз.Данные = "mailto:" + ЭлектронныйАдресТехническойПоддержки;
		НовВз.Запустить(Истина);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура TelegramHelpDeskНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке("https://t.me/e1c_mobile");

КонецПроцедуры

&НаКлиенте
Процедура КомандаТелеграм(Команда)

	ЗапуститьПриложение("https://t.me/e1c_mobile");

КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаСайтНажатие(Элемент)

	ПерейтиПоНавигационнойСсылке("https://vrgroup.info");

КонецПроцедуры
