
Процедура АвтозаполнениеПараметров(ПериодРегистрации, Организация, ТекСтрока ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);
	Запрос.УстановитьПараметр("парамВидРасчета" , ТекСтрока.ВидРасчета);
	
	Запрос.УстановитьПараметр("парамПериодРегистрации" , ПериодРегистрации);
	Запрос.УстановитьПараметр("парамНазначение", ТекСтрока.Назначение); 
	Запрос.УстановитьПараметр("ФизЛицо", ТекСтрока.Назначение.ФизЛицо); 
	 
	Запрос.УстановитьПараметр("парамНачало",	ТекСтрока.ДатаНачала);
	
	Запрос.УстановитьПараметр("парамДатаВалютногоУчета" , ПериодРегистрации);
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета" , Константы.ВалютаРегламентированногоУчета.Получить());
	
	//	ВТОкладТариф
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Начисления.Организация	КАК Организация,
		|	Начисления.Сотрудник	КАК Назначение,
		|	Начисления.ВидРасчета	КАК ВидРасчета,
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ					КАК СпособУчетаВремени,
		|	Начисления.Показатель1	КАК ОкладТариф,
		|	Начисления.Валюта1		КАК Валюта1,
		|	Начисления.Период		КАК ДатаНачала,
		|	МИНИМУМ(Окончания.Период)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТОкладТариф	
		|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Окончания
		|ПО Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник = Окончания.Сотрудник
		|	И	Начисления.ВидРасчета = Окончания.ВидРасчета
		|	И	Начисления.Период < Окончания.Период
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ(
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|   НаборПоказателей.Ссылка	КАК ВидРасчета,
		|   НаборПоказателей.Показатель	КАК Показатель
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК НаборПоказателей
		|	ГДЕ		НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|) КАК НаборПоказателей
		|ПО Начисления.ВидРасчета = НаборПоказателей.ВидРасчета
		|
		|ГДЕ		Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник = &парамНазначение // оклад по назначению
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Организация,
		|	Начисления.Сотрудник,
		|	Начисления.ВидРасчета,
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ,
		|	Начисления.Показатель1,
		|	Начисления.Валюта1,
		|	Начисления.Период
 		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОкладТариф";
	
	//	ВТЗначенияПоказателей
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.Сотрудник,
		|	ЗначенияПоказателей.Подразделение,
		|	ЗначенияПоказателей.Показатель,
		|	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|		И НЕ (ЗначенияПоказателей.Валюта В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))
		|			ТОГДА ЗначенияПоказателей.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
		|		ИНАЧЕ ЗначенияПоказателей.Значение
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателей
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты
		|ПО Валюты.Валюта = ЗначенияПоказателей.Валюта 
		|	
		|ГДЕ	ЗначенияПоказателей.Организация = &парамОрганизация
		|	И	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&парамНачало, МЕСЯЦ)
		|	И	(ЗначенияПоказателей.Сотрудник = &парамНазначение
		|	ИЛИ	ЗначенияПоказателей.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЗначенияПоказателей";
	
	//	ВТПоказатели
	Если Истина Тогда 
		//	Описание:
		// 		
		//		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПодразделенияВПоказателях.Сотрудник КАК Сотрудник,
		|	СотрудникиПодразделенияВПоказателях.Подразделение КАК Подразделение,
		|	ПоказателиВидовРасчета.Ссылка КАК ВидРасчета,
		|	ПоказателиВидовРасчета.Показатель1.ТипПоказателя КАК ТипПоказателя1,
		|	ПоказателиВидовРасчета.Показатель2.ТипПоказателя КАК ТипПоказателя2,
		|	ПоказателиВидовРасчета.Показатель3.ТипПоказателя КАК ТипПоказателя3,
		|	ПоказателиВидовРасчета.Показатель4.ТипПоказателя КАК ТипПоказателя4,
		|	ПоказателиВидовРасчета.Показатель5.ТипПоказателя КАК ТипПоказателя5,
		|	ПоказателиВидовРасчета.Показатель6.ТипПоказателя КАК ТипПоказателя6,
		|	ПоказателиВидовРасчета.Показатель1.ВозможностьИзменения КАК ВозможностьИзменения1,
		|	ПоказателиВидовРасчета.Показатель2.ВозможностьИзменения КАК ВозможностьИзменения2,
		|	ПоказателиВидовРасчета.Показатель3.ВозможностьИзменения КАК ВозможностьИзменения3,
		|	ПоказателиВидовРасчета.Показатель4.ВозможностьИзменения КАК ВозможностьИзменения4,
		|	ПоказателиВидовРасчета.Показатель5.ВозможностьИзменения КАК ВозможностьИзменения5,
		|	ПоказателиВидовРасчета.Показатель6.ВозможностьИзменения КАК ВозможностьИзменения6,
		|	ЗначенияПоказателей1.Значение КАК Показатель1,
		|	ЗначенияПоказателей2.Значение КАК Показатель2,
		|	ЗначенияПоказателей3.Значение КАК Показатель3,
		|	ЗначенияПоказателей4.Значение КАК Показатель4,
		|	ЗначенияПоказателей5.Значение КАК Показатель5,
		|	ЗначенияПоказателей6.Значение КАК Показатель6
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение, Сотрудник ИЗ ВТЗначенияПоказателей КАК ЗначенияПоказателей) КАК СотрудникиПодразделенияВПоказателях
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		Показатели.Ссылка КАК Ссылка,
		|		Показатели1.Показатель КАК Показатель1,
		|		Показатели2.Показатель КАК Показатель2,
		|		Показатели3.Показатель КАК Показатель3,
		|		Показатели4.Показатель КАК Показатель4,
		|		Показатели5.Показатель КАК Показатель5,
		|		Показатели6.Показатель КАК Показатель6
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели1
		|	ПО Показатели.Ссылка = Показатели1.Ссылка И Показатели1.НомерСтроки = 1
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели2
		|	ПО Показатели.Ссылка = Показатели2.Ссылка И Показатели2.НомерСтроки = 2
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели3
		|	ПО Показатели.Ссылка = Показатели3.Ссылка И Показатели3.НомерСтроки = 3
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели4
		|	ПО Показатели.Ссылка = Показатели4.Ссылка И Показатели4.НомерСтроки = 4
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели5
		|	ПО Показатели.Ссылка = Показатели5.Ссылка И Показатели5.НомерСтроки = 5
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели6
		|	ПО Показатели.Ссылка = Показатели6.Ссылка И Показатели6.НомерСтроки = 6
		|	
		|) КАК ПоказателиВидовРасчета
		|ПО ИСТИНА
		|	
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей1
		|ПО 	ПоказателиВидовРасчета.Показатель1 = ЗначенияПоказателей1.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей1.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей1.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей2
		|ПО		ПоказателиВидовРасчета.Показатель2 = ЗначенияПоказателей2.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей2.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей2.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей3
		|ПО		ПоказателиВидовРасчета.Показатель3 = ЗначенияПоказателей3.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей3.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей3.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей4
		|ПО		ПоказателиВидовРасчета.Показатель4 = ЗначенияПоказателей4.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей4.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей4.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей5
		|ПО		ПоказателиВидовРасчета.Показатель5 = ЗначенияПоказателей5.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей5.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей5.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей6
		|ПО		ПоказателиВидовРасчета.Показатель6 = ЗначенияПоказателей6.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей6.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей6.Подразделение
		|
		|ГДЕ	ПоказателиВидовРасчета.Ссылка = &парамВидРасчета
		|	И (ЗначенияПоказателей1.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей2.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей3.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей4.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей5.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей6.Значение ЕСТЬ НЕ NULL)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоказатели";

	ТекстПоказатель1 = "
	|			ВЫБОР
	|				КОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|					ТОГДА	ВЫБОР	КОГДА Оклады.СпособУчетаВремени = ""ЗА МЕСЯЦ"" И ДанныеКалендаря.НормаЧасовЗаМесяц > 0
	|											ТОГДА Оклады.ОкладТариф/ДанныеКалендаря.НормаЧасовЗаМесяц
	|									КОГДА Оклады.СпособУчетаВремени = ""ЗА ДЕНЬ""
	|											ТОГДА Оклады.ОкладТариф/8
	|									ИНАЧЕ Оклады.ОкладТариф
	|							КОНЕЦ
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТариф)
	|					ТОГДА	Оклады.ОкладТариф
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	";
	ТекстПоказатель2 = СтрЗаменить(ТекстПоказатель1, "1", "2");
	ТекстПоказатель3 = СтрЗаменить(ТекстПоказатель1, "1", "3");
	ТекстПоказатель4 = СтрЗаменить(ТекстПоказатель1, "1", "4");
	ТекстПоказатель5 = СтрЗаменить(ТекстПоказатель1, "1", "5");
	ТекстПоказатель6 = СтрЗаменить(ТекстПоказатель1, "1", "6");
	//Основной текст запроса
	ОсновнойТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Работники.Подразделение КАК ПодразделениеУпр,
	|	ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы ИНАЧЕ РаботникиОрганизации.ГрафикРаботы КОНЕЦ КАК ГрафикРаботы,
	|	" + ТекстПоказатель1 + " КАК Показатель1,
	|	" + ТекстПоказатель2 + " КАК Показатель2,
	|	" + ТекстПоказатель3 + " КАК Показатель3,
	|	" + ТекстПоказатель4 + " КАК Показатель4,
	|	" + ТекстПоказатель5 + " КАК Показатель5,
	|	" + ТекстПоказатель6 + " КАК Показатель6,
	|	ДанныеКалендаря.НормаДнейЗаМесяц	КАК НормаДнейЗаМесяц,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц	КАК НормаЧасовЗаМесяц
	|ИЗ ПланВидовРасчета.Начисления КАК СписокНачислений
	|
	|
	|//-----------------------
	|// данные о подразделении и графике работы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамНачало, Сотрудник = &парамНазначение) КАК РаботникиОрганизации
	|ПО ИСТИНА
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&парамНачало, ФизЛицо = &ФизЛицо) КАК Работники
	|ПО ИСТИНА
	|
	|//-----------------------
	|// данные нормы календаря
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ГрафикиРаботы.ГрафикРаботы						КАК ГрафикРаботы,
	|		СУММА( ГрафикиРаботы.ОсновноеЗначение  )		КАК НормаДнейЗаМесяц,
	|		СУММА( ГрафикиРаботы.ДополнительноеЗначение )	КАК НормаЧасовЗаМесяц
	|	ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени	КАК ГрафикиРаботы
	|	ГДЕ		НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ ) = &парамНачало 
	|		И	ГрафикиРаботы.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
	|	СГРУППИРОВАТЬ ПО
	|			ГрафикиРаботы.ГрафикРаботы
	|) КАК ДанныеКалендаря
	|ПО		ДанныеКалендаря.ГрафикРаботы =  
	|		ВЫБОР	КОГДА 	
	|				ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику КОНЕЦ
	|					ТОГДА ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы.ГрафикРаботыНормыВремени ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.ГрафикРаботыНормыВремени КОНЕЦ
	|					ИНАЧЕ ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы ИНАЧЕ РаботникиОрганизации.ГрафикРаботы КОНЕЦ
	|		КОНЕЦ 
	|	
	|	
	|
	|
	|//-----------------------
	|// данные о видах показателей
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель1
	|ПО		ТипПоказатель1.Ссылка = СписокНачислений.Ссылка И ТипПоказатель1.НомерСтроки = 1
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель2
	|ПО		ТипПоказатель2.Ссылка = СписокНачислений.Ссылка И ТипПоказатель2.НомерСтроки = 2
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель3
	|ПО		ТипПоказатель3.Ссылка = СписокНачислений.Ссылка И ТипПоказатель3.НомерСтроки = 3
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель4
	|ПО		ТипПоказатель4.Ссылка = СписокНачислений.Ссылка И ТипПоказатель4.НомерСтроки = 4
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель5
	|ПО		ТипПоказатель5.Ссылка = СписокНачислений.Ссылка И ТипПоказатель5.НомерСтроки = 5
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель6
	|ПО		ТипПоказатель6.Ссылка = СписокНачислений.Ссылка И ТипПоказатель6.НомерСтроки = 6
	|
	|//-----------------------
	|// данные об окладах
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады
	|ПО	ИСТИНА
	|
	|//-----------------------
	|// данные показателей Схем Мотиваций
	|// по конкретным сотрудникам
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоСотруднику
	|ПО	ПоказателиСхемМотивацийПоСотруднику.Сотрудник = &парамНазначение
	|
	|// по подразделению
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделению
	|ПО	ПоказателиСхемМотивацийПоПодразделению.Подразделение = РаботникиОрганизации.ПодразделениеОрганизации
	|
	|// по подразделению упр.
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделениюУпр
	|ПО	ПоказателиСхемМотивацийПоПодразделениюУпр.Подразделение =  Работники.Подразделение
	|
	|// организации
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоОрганизации
	|ПО		ПоказателиСхемМотивацийПоОрганизации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|	И	ПоказателиСхемМотивацийПоОрганизации.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) 
	|
	|
	|ГДЕ СписокНачислений.Ссылка = &парамВидРасчета
	|
	|";
	
	Запрос.Текст = ОсновнойТекстЗапроса;
	
	ВыборкаНачисления = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНачисления.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТекСтрока, ВыборкаНачисления);
	КонецЦикла;

КонецПроцедуры

Процедура ПроставитьДанныеСтроки(Сотрудник, Назначение, ДатаСобытия, Регистратор, ТекущаяСтрока) Экспорт
	
	ПериодРегистрации = Регистратор.ПериодРегистрации;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамПериодРегистрации" , ПериодРегистрации);
	Запрос.УстановитьПараметр("парамНазначение", Назначение); 
	Запрос.УстановитьПараметр("ФизЛицо", Сотрудник.ФизЛицо); 
	Запрос.УстановитьПараметр("парамВидРасчета", ТекущаяСтрока.ВидРасчета);
	Запрос.УстановитьПараметр("парамОрганизация", Сотрудник.Организация);
	 
	//Запрос.УстановитьПараметр("парамНачало",	ДатаСобытия);
	Запрос.УстановитьПараметр("парамДатаСобытия", ДатаСобытия);
	
	Запрос.УстановитьПараметр("парамДатаВалютногоУчета" , ПериодРегистрации);
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета" , Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("парамВалютаУчета" , ?(Регистратор.ОтражатьВРеглУчете,Константы.ВалютаРегламентированногоУчета.Получить(),Константы.ВалютаУправленческогоУчета.Получить()));
	Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты" , ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
	
	//	ВТОкладТариф
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Начисления.Организация	КАК Организация,
		|	Начисления.Сотрудник	КАК Назначение,
		|	Начисления.ВидРасчета	КАК ВидРасчета,
		|
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ					КАК СпособУчетаВремени,
		|
		|	ВЫБОР	КОГДА Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|					ИЛИ Начисления.Валюта1 ЕСТЬ NULL
		|					ИЛИ Начисления.Валюта1 = &парамВалютаУчета
		|					ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|					ТОГДА  Начисления.Показатель1
		|			ИНАЧЕ  Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ					КАК ОкладТариф,
		|
		|	Начисления.Валюта1		КАК Валюта1,
		|	Начисления.Период		КАК ДатаНачала,
		|	МИНИМУМ(Окончания.Период)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТОкладТариф	
		|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты1
		|ПО Валюты1.Валюта = Начисления.Валюта1 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Окончания
		|ПО Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник = Окончания.Сотрудник
		|	И	Начисления.ВидРасчета = Окончания.ВидРасчета
		|	И	Начисления.Период < Окончания.Период
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ(
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|   НаборПоказателей.Ссылка	КАК ВидРасчета,
		|   НаборПоказателей.Показатель	КАК Показатель
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК НаборПоказателей
		|	ГДЕ		НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|		ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|) КАК НаборПоказателей
		|ПО Начисления.ВидРасчета = НаборПоказателей.ВидРасчета
		|
		|ГДЕ		Начисления.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И	Начисления.Актуальность 
		|	И	Начисления.Организация = &парамОрганизация
		|	И	Начисления.Сотрудник = &парамНазначение // оклад по назначению
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Организация,
		|	Начисления.Сотрудник,
		|	Начисления.ВидРасчета,
		|
		|	ВЫБОР	КОГДА 		Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням)
		|					ИЛИ Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)		
		|					ИЛИ	НаборПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)	
		|				ТОГДА ""ЗА МЕСЯЦ""
		|			КОГДА 	Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|			ТОГДА ""ЗА ДЕНЬ""
		|			ИНАЧЕ ""ЗА ЧАС""
		|	КОНЕЦ,
		|
		|	ВЫБОР	КОГДА Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|					ИЛИ Начисления.Валюта1 ЕСТЬ NULL
		|					ИЛИ Начисления.Валюта1 = &парамВалютаУчета
		|					ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|					ТОГДА  Начисления.Показатель1
		|			ИНАЧЕ  Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ,
		|
		|	Начисления.Валюта1,
		|	Начисления.Период
 		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОкладТариф";
	
	//	ВТЗначенияПоказателей
	Если Истина Тогда 
		//	Описание:
		// 		Все оклады сотрудников
		//		Для п.1.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.Сотрудник,
		|	ЗначенияПоказателей.Подразделение,
		|	ЗначенияПоказателей.Показатель,
		|	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) КАК ПериодДействия,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателей.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|		И НЕ (ЗначенияПоказателей.Валюта В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))
		|			ТОГДА ЗначенияПоказателей.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
		|		ИНАЧЕ ЗначенияПоказателей.Значение
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателей
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты
		|ПО Валюты.Валюта = ЗначенияПоказателей.Валюта 
		|	
		|ГДЕ	ЗначенияПоказателей.Организация = &парамОрганизация
		|	И	НАЧАЛОПЕРИОДА(ЗначенияПоказателей.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&парамДатаСобытия, МЕСЯЦ)
		|	И	(ЗначенияПоказателей.Сотрудник = &парамНазначение
		|	ИЛИ	ЗначенияПоказателей.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЗначенияПоказателей";
	
	//	ВТПоказатели
	Если Истина Тогда 
		//	Описание:
		// 		
		//		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПодразделенияВПоказателях.Сотрудник КАК Сотрудник,
		|	СотрудникиПодразделенияВПоказателях.Подразделение КАК Подразделение,
		|	ПоказателиВидовРасчета.Ссылка КАК ВидРасчета,
		|	ПоказателиВидовРасчета.Показатель1.ТипПоказателя КАК ТипПоказателя1,
		|	ПоказателиВидовРасчета.Показатель2.ТипПоказателя КАК ТипПоказателя2,
		|	ПоказателиВидовРасчета.Показатель3.ТипПоказателя КАК ТипПоказателя3,
		|	ПоказателиВидовРасчета.Показатель4.ТипПоказателя КАК ТипПоказателя4,
		|	ПоказателиВидовРасчета.Показатель5.ТипПоказателя КАК ТипПоказателя5,
		|	ПоказателиВидовРасчета.Показатель6.ТипПоказателя КАК ТипПоказателя6,
		|	ПоказателиВидовРасчета.Показатель1.ВозможностьИзменения КАК ВозможностьИзменения1,
		|	ПоказателиВидовРасчета.Показатель2.ВозможностьИзменения КАК ВозможностьИзменения2,
		|	ПоказателиВидовРасчета.Показатель3.ВозможностьИзменения КАК ВозможностьИзменения3,
		|	ПоказателиВидовРасчета.Показатель4.ВозможностьИзменения КАК ВозможностьИзменения4,
		|	ПоказателиВидовРасчета.Показатель5.ВозможностьИзменения КАК ВозможностьИзменения5,
		|	ПоказателиВидовРасчета.Показатель6.ВозможностьИзменения КАК ВозможностьИзменения6,
		|	ЗначенияПоказателей1.Значение КАК Показатель1,
		|	ЗначенияПоказателей2.Значение КАК Показатель2,
		|	ЗначенияПоказателей3.Значение КАК Показатель3,
		|	ЗначенияПоказателей4.Значение КАК Показатель4,
		|	ЗначенияПоказателей5.Значение КАК Показатель5,
		|	ЗначенияПоказателей6.Значение КАК Показатель6
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение, Сотрудник ИЗ ВТЗначенияПоказателей КАК ЗначенияПоказателей) КАК СотрудникиПодразделенияВПоказателях
		|
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		Показатели.Ссылка КАК Ссылка,
		|		Показатели1.Показатель КАК Показатель1,
		|		Показатели2.Показатель КАК Показатель2,
		|		Показатели3.Показатель КАК Показатель3,
		|		Показатели4.Показатель КАК Показатель4,
		|		Показатели5.Показатель КАК Показатель5,
		|		Показатели6.Показатель КАК Показатель6
		|	ИЗ ПланВидовРасчета.Начисления.Показатели КАК Показатели
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели1
		|	ПО Показатели.Ссылка = Показатели1.Ссылка И Показатели1.НомерСтроки = 1
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели2
		|	ПО Показатели.Ссылка = Показатели2.Ссылка И Показатели2.НомерСтроки = 2
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели3
		|	ПО Показатели.Ссылка = Показатели3.Ссылка И Показатели3.НомерСтроки = 3
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели4
		|	ПО Показатели.Ссылка = Показатели4.Ссылка И Показатели4.НомерСтроки = 4
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели5
		|	ПО Показатели.Ссылка = Показатели5.Ссылка И Показатели5.НомерСтроки = 5
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК Показатели6
		|	ПО Показатели.Ссылка = Показатели6.Ссылка И Показатели6.НомерСтроки = 6
		|	
		|) КАК ПоказателиВидовРасчета
		|ПО ИСТИНА
		|	
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей1
		|ПО 	ПоказателиВидовРасчета.Показатель1 = ЗначенияПоказателей1.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей1.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей1.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей2
		|ПО		ПоказателиВидовРасчета.Показатель2 = ЗначенияПоказателей2.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей2.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей2.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей3
		|ПО		ПоказателиВидовРасчета.Показатель3 = ЗначенияПоказателей3.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей3.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей3.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей4
		|ПО		ПоказателиВидовРасчета.Показатель4 = ЗначенияПоказателей4.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей4.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей4.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей5
		|ПО		ПоказателиВидовРасчета.Показатель5 = ЗначенияПоказателей5.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей5.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей5.Подразделение
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей6
		|ПО		ПоказателиВидовРасчета.Показатель6 = ЗначенияПоказателей6.Показатель
		|	И	СотрудникиПодразделенияВПоказателях.Сотрудник = ЗначенияПоказателей6.Сотрудник
		|	И	СотрудникиПодразделенияВПоказателях.Подразделение = ЗначенияПоказателей6.Подразделение
		|
		|ГДЕ	ПоказателиВидовРасчета.Ссылка = &парамВидРасчета
		|	И (ЗначенияПоказателей1.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей2.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей3.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей4.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей5.Значение ЕСТЬ НЕ NULL
		|	ИЛИ	ЗначенияПоказателей6.Значение ЕСТЬ НЕ NULL)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоказатели";

	ТекстПоказатель1 = "
	|			ВЫБОР
	|				КОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоСотруднику.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделению.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоПодразделениюУпр.Показатель1
	|				КОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1 ЕСТЬ НЕ NULL 
	|					ТОГДА ПоказателиСхемМотивацийПоОрганизации.Показатель1
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
	|                   // для оклада валюта учтена при его получении
	|					ТОГДА	ВЫБОР	КОГДА Оклады.СпособУчетаВремени = ""ЗА МЕСЯЦ"" И ДанныеКалендаря.НормаЧасовЗаМесяц > 0
	|										ТОГДА Оклады.ОкладТариф/ДанныеКалендаря.НормаЧасовЗаМесяц
	|									КОГДА Оклады.СпособУчетаВремени = ""ЗА ДЕНЬ""
	|										ТОГДА Оклады.ОкладТариф/8
	|									ИНАЧЕ Оклады.ОкладТариф
	|							КОНЕЦ
	|				КОГДА ТипПоказатель1.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОкладТариф)
	|                   // для оклада валюта учтена при его получении
	|					ТОГДА Оклады.ОкладТариф
	|				КОГДА СписокПлановыхНачислений.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
	|						ИЛИ СписокПлановыхНачислений.Валюта1 = &парамВалютаУчета
	|						ИЛИ СписокПлановыхНачислений.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					ТОГДА  ЕСТЬNULL(СписокПлановыхНачислений.Показатель1, 0)
	|				ИНАЧЕ ЕСТЬNULL(СписокПлановыхНачислений.Показатель1, 0) * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
	|			КОНЕЦ
	|	";
	ТекстПоказатель2 = СтрЗаменить(ТекстПоказатель1, "1", "2");
	ТекстПоказатель3 = СтрЗаменить(ТекстПоказатель1, "1", "3");
	ТекстПоказатель4 = СтрЗаменить(ТекстПоказатель1, "1", "4");
	ТекстПоказатель5 = СтрЗаменить(ТекстПоказатель1, "1", "5");
	ТекстПоказатель6 = СтрЗаменить(ТекстПоказатель1, "1", "6");
	//Основной текст запроса
	ОсновнойТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Работники.Подразделение КАК ПодразделениеУпр,
	|	Оклады.ОкладТариф КАК ОкладТариф,
    |   Валюты2.Валюта КАК Валюта,
    |   Валюты2.Курс КАК Курс,
    |   Валюты2.Кратность КАК Кратность,
    |
	|	" + ТекстПоказатель1 + " КАК Показатель1,
	|	" + ТекстПоказатель2 + " КАК Показатель2,
	|	" + ТекстПоказатель3 + " КАК Показатель3,
	|	" + ТекстПоказатель4 + " КАК Показатель4,
	|	" + ТекстПоказатель5 + " КАК Показатель5,
	|	" + ТекстПоказатель6 + " КАК Показатель6,
	|
	|	ДанныеКалендаря.НормаДнейЗаМесяц	КАК НормаДнейЗаМесяц,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц	КАК НормаЧасовЗаМесяц,
	|	ДанныеКалендаря.ГрафикРаботы        КАК ГрафикРаботы
	|ИЗ ПланВидовРасчета.Начисления КАК СписокНачислений
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамДатаСобытия, Сотрудник = &парамНазначение) КАК СписокПлановыхНачислений
	|ПО		СписокПлановыхНачислений.ВидРасчета = &парамВидРасчета
	|
	|
	|//-----------------------
	|// курсы валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как ВалютыУчета
	|ПО ВалютыУчета.Валюта = &парамВалютаУчета 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты1
	|ПО Валюты1.Валюта = СписокПлановыхНачислений.Валюта1 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты2
	|ПО Валюты2.Валюта = СписокПлановыхНачислений.Валюта2 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты3
	|ПО Валюты3.Валюта = СписокПлановыхНачислений.Валюта3 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты4
	|ПО Валюты4.Валюта = СписокПлановыхНачислений.Валюта4 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты5
	|ПО Валюты5.Валюта = СписокПлановыхНачислений.Валюта5 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДатаВалютногоУчета) Как Валюты6
	|ПО Валюты6.Валюта = СписокПлановыхНачислений.Валюта6 
	|
	|//-----------------------
	|// данные о подразделении и графике работы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДатаСобытия, Сотрудник = &парамНазначение) КАК РаботникиОрганизации
	|ПО ИСТИНА
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&парамДатаСобытия, ФизЛицо = &ФизЛицо) КАК Работники
	|ПО ИСТИНА
	|
	|//-----------------------
	|// данные нормы календаря
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ГрафикиРаботы.ГрафикРаботы						КАК ГрафикРаботы,
	|		СУММА( ГрафикиРаботы.ОсновноеЗначение  )		КАК НормаДнейЗаМесяц,
	|		СУММА( ГрафикиРаботы.ДополнительноеЗначение )	КАК НормаЧасовЗаМесяц
	|	ИЗ	РегистрСведений.ГрафикиРаботыПоВидамВремени	КАК ГрафикиРаботы
	|	ГДЕ		НАЧАЛОПЕРИОДА( ГрафикиРаботы.Дата, МЕСЯЦ ) = НАЧАЛОПЕРИОДА( &парамДатаСобытия, МЕСЯЦ ) 
	|		И	ГрафикиРаботы.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
	|	СГРУППИРОВАТЬ ПО
	|			ГрафикиРаботы.ГрафикРаботы
	|) КАК ДанныеКалендаря
	|ПО		ДанныеКалендаря.ГрафикРаботы =  
	|		ВЫБОР	КОГДА 	
	|				ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику КОНЕЦ
	|					ТОГДА ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы.ГрафикРаботыНормыВремени ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.ГрафикРаботыНормыВремени КОНЕЦ
	|					ИНАЧЕ ВЫБОР КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL ТОГДА Работники.ГрафикРаботы ИНАЧЕ РаботникиОрганизации.ГрафикРаботы КОНЕЦ
	|		КОНЕЦ 
	|	
	|	
	|
	|
	|//-----------------------
	|// данные о видах показателей
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель1
	|ПО		ТипПоказатель1.Ссылка = СписокНачислений.Ссылка И ТипПоказатель1.НомерСтроки = 1
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель2
	|ПО		ТипПоказатель2.Ссылка = СписокНачислений.Ссылка И ТипПоказатель2.НомерСтроки = 2
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель3
	|ПО		ТипПоказатель3.Ссылка = СписокНачислений.Ссылка И ТипПоказатель3.НомерСтроки = 3
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель4
	|ПО		ТипПоказатель4.Ссылка = СписокНачислений.Ссылка И ТипПоказатель4.НомерСтроки = 4
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель5
	|ПО		ТипПоказатель5.Ссылка = СписокНачислений.Ссылка И ТипПоказатель5.НомерСтроки = 5
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ТипПоказатель6
	|ПО		ТипПоказатель6.Ссылка = СписокНачислений.Ссылка И ТипПоказатель6.НомерСтроки = 6
	|
	|//-----------------------
	|// данные об окладах
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТОкладТариф КАК Оклады
	|ПО	ИСТИНА
	|
	|//-----------------------
	|// данные показателей Схем Мотиваций
	|// по конкретным сотрудникам
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоСотруднику
	|ПО	ПоказателиСхемМотивацийПоСотруднику.Сотрудник = &парамНазначение
	|
	|// по подразделению
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделению
	|ПО	ПоказателиСхемМотивацийПоПодразделению.Подразделение = РаботникиОрганизации.ПодразделениеОрганизации
	|
	|// по подразделению упр.
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоПодразделениюУпр
	|ПО	ПоказателиСхемМотивацийПоПодразделениюУпр.Подразделение =  Работники.Подразделение
	|
	|// организации
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиСхемМотивацийПоОрганизации
	|ПО		ПоказателиСхемМотивацийПоОрганизации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|	И	ПоказателиСхемМотивацийПоОрганизации.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) 
	|
	|
	|ГДЕ СписокНачислений.Ссылка = &парамВидРасчета
	|
	|";
	
	Запрос.Текст = ОсновнойТекстЗапроса;
	
	ВыборкаНачисления = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНачисления.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ВыборкаНачисления);
	КонецЦикла;

КонецПроцедуры

Процедура УдалитьСтрокиСторноПоУсловию(НаборДанных, Сотрудники, ПроверятьСторнируемыйДокумент = Ложь) Экспорт
	
	Если НаборДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// обходим в обратном порядке
	ПоследнееДвижение = НаборДанных.Количество()-1;
	Для Сч = 0 По ПоследнееДвижение Цикл
		
		Движение = НаборДанных[ПоследнееДвижение - Сч];
		Если ПроверятьСторнируемыйДокумент Тогда
			Если НЕ Движение.Авторасчет ИЛИ НЕ Движение.Сторно ИЛИ ЗначениеЗаполнено(Движение.СторнируемыйДокумент) Тогда
				Продолжить;	
			КонецЕсли;
		Иначе
			Если НЕ Движение.Авторасчет ИЛИ НЕ Движение.Сторно Тогда
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		
		// удалим сторно-записи по всем сотрудникам полученного списка
		Если Сотрудники.НайтиПоЗначению(Движение.Сотрудник) <> Неопределено Тогда
			НаборДанных.Удалить(ПоследнееДвижение - Сч);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УдалитьСтрокиСторноПоУсловию()

Процедура УдалитьСтрокиПоУсловию(ТаблицаДокумента, Сотрудники) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Сотрудник Из Сотрудники Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Сотрудник", Сотрудник.Значение);
		НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(ПараметрыОтбора);
		Для каждого СтрокаТЧ Из НайденныеСтроки Цикл
			ТаблицаДокумента.Удалить(СтрокаТЧ);
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры // УдалитьСтрокиПоУсловию()

// Процедура вычисляет количество лет, месяцев и дней между двумя датами
//
// Параметры
//  Дата1	– дата, первая дата (более поздняя, часто текущая, стаж определяется по состоянию на эту дату)
//  Дата2	– дата, вторая дата (ранняя дата, с нее начинается "течение" стажа)
//  Лет		– Число, в этот параметр будет записано кол-во лет между двумя датами (Дата1-Дата2)
//  Месяцев	– Число, в этот параметр будет записано кол-во месяцев между двумя датами (Дата1-Дата2)
//  Дней	– Число, в этот параметр будет записано кол-во дней между двумя датами (Дата1-Дата2)
//
Функция РазобратьРазностьДат(Дата1, Дата2, Дней = 0, Месяцев = 0, Лет = 0) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата1) ИЛИ НЕ ЗначениеЗаполнено(Дата2) Тогда
		Возврат НСтр("ru='Нет стажа';uk='Немає стажу'");
	КонецЕсли;
	
	Лет		= 0;
	Месяцев	= 0;
	Дней	= 0;
		
	Если Дата1 > Дата2 Тогда
		
		ВременнаяДата = Дата1;
		Если День(ВременнаяДата) < День(Дата2) Тогда
			Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);
		КонецЕсли;
		Если Месяц(ВременнаяДата) < Месяц(Дата2) Тогда
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);
			Месяцев = 12;
		КонецЕсли;
		
		Лет		= Макс(			 Год(ВременнаяДата)		- Год(Дата2),	0);
		Месяцев	= Макс(Месяцев	+ Месяц(ВременнаяДата)	- Месяц(Дата2),	0);
		Дней	= Макс(Дней		+ День(ВременнаяДата)	- День(Дата2),	0);
		
		
		// скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах
		
	КонецЕсли;
	
	
	
	Если Лет>20 Тогда
		ОстатокЛет=Лет%10;
	Иначе 
		ОстатокЛет = Лет;	
	КонецЕсли;
	
	Если Дней>20 Тогда
		ОстатокДней=Дней%10;
	Иначе 
		ОстатокДней = Дней;	
	КонецЕсли;
	СтрокаВозврата="";
	
	Если Лет=0 Тогда
		//пропускаем	
	ИначеЕсли ОстатокЛет=1 Тогда
		СтрокаВозврата =Строка(Лет)+НСтр("ru=' год ';uk=' рік '");
	ИначеЕсли ОстатокЛет < 5 Тогда	
		СтрокаВозврата = Строка(Лет)+НСтр("ru=' года ';uk=' року '");
	Иначе
		СтрокаВозврата = Строка(Лет)+НСтр("ru=' лет ';uk=' років '");
	КонецЕсли;
	
	Если Месяцев=0 Тогда
		//пропускаем	
	ИначеЕсли Месяцев=1 Тогда
		СтрокаВозврата = СтрокаВозврата+НСтр("ru='1 месяц ';uk='1 місяць '");
	ИначеЕсли Месяцев < 5 Тогда	
		СтрокаВозврата = СтрокаВозврата+Строка(Месяцев)+НСтр("ru=' месяца ';uk=' місяці '");
	Иначе
		СтрокаВозврата = СтрокаВозврата+Строка(Месяцев)+НСтр("ru=' месяцев ';uk=' місяців '");
	КонецЕсли;
	
	Если Дней=0 Тогда
		//пропускаем	
	ИначеЕсли ОстатокДней=1 Тогда
		СтрокаВозврата = СтрокаВозврата+Строка(Дней)+НСтр("ru=' день';uk=' день'");
	ИначеЕсли ОстатокДней < 5 Тогда	
		СтрокаВозврата = СтрокаВозврата+Строка(Дней)+НСтр("ru=' дня';uk=' дня'");
	Иначе
		СтрокаВозврата = СтрокаВозврата+Строка(Дней)+НСтр("ru=' дней';uk=' днів'");
	КонецЕсли;
	
	Если СтрокаВозврата = "" Тогда
		СтрокаВозврата =НСтр("ru='Нет стажа';uk='Немає стажу'");
	КонецЕсли;	
	
	Возврат СтрокаВозврата;
	


КонецФункции	// РазобратьРазностьДат
Функция ГрафикиИНормыПоСотрудникам(Организация, СотрудникиИНазначения, ПериодРегистрации) Экспорт
		
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СотрудникиИНазначения", СотрудникиИНазначения);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамПериодРегистрации" , ПериодРегистрации);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|   СотрудникиИНазначения.Сотрудник КАК Сотрудник,
	|   СотрудникиИНазначения.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТСотрудникиИНазначения
	|ИЗ
	|	&СотрудникиИНазначения КАК СотрудникиИНазначения
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|   Назначение
	|";
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиИНазначения.Сотрудник КАК Сотрудник,
	|	СотрудникиИНазначения.Назначение КАК Назначение,
	|	ДанныеКалендаря.ГрафикРаботы,
	|	ДанныеКалендаря.НормаДнейЗаМесяц,
	|	ДанныеКалендаря.НормаЧасовЗаМесяц
	|ИЗ
	|	ВТСотрудникиИНазначения КАК СотрудникиИНазначения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ),
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						СотрудникиИНазначения.Назначение
	|					ИЗ
	|						ВТСотрудникиИНазначения КАК СотрудникиИНазначения)) КАК Сотрудники
	|		ПО СотрудникиИНазначения.Назначение = Сотрудники.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|			СУММА(ГрафикиРаботы.ОсновноеЗначение) КАК НормаДнейЗаМесяц,
	|			СУММА(ГрафикиРаботы.ДополнительноеЗначение) КАК НормаЧасовЗаМесяц
	|		ИЗ
	|			РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|		ГДЕ
	|			НАЧАЛОПЕРИОДА(ГрафикиРаботы.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|			И ГрафикиРаботы.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГрафикиРаботы.ГрафикРаботы) КАК ДанныеКалендаря
	|		ПО (ДанныеКалендаря.ГрафикРаботы = (ВЫБОР КОГДА Сотрудники.ГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику 
	|											ТОГДА Сотрудники.ГрафикРаботы.ГрафикРаботыНормыВремени 
	|											ИНАЧЕ Сотрудники.ГрафикРаботы КОНЕЦ)  
	|			)";	

	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ определения специальных алгоритмов

  // Функция возвращает дату ввода Единого социального взноса
//
Функция ДатаВводаЕСВ() Экспорт
	
	Возврат Дата(2011,1,1);
	
КонецФункции

 // Функция возвращает дату ввода Налогового кодекса
//
Функция ДатаВводаНК() Экспорт
	
	Возврат Дата(2011,1,1);
	
КонецФункции

 // Функция возвращает дату изменения Налогового кодекса Законом №3609
//
Функция ДатаИзмененияНК3609() Экспорт
	
	Возврат Дата(2011,8,6);
	
КонецФункции

Функция ДатаВвводаФиксированнойИндексации() Экспорт
	
	Возврат Дата(2012,6,1);
	
КонецФункции

Функция ДатаВвводаИндексацииПоДожностям() Экспорт
	
	Возврат Дата(2015,12,1);
	
КонецФункции

Функция ДатаИзмененияПорогаИндексации() Экспорт
	
	Возврат Дата(2016,1,1);
	
КонецФункции

Функция ДатаНачалаИндексацииАлиментов() Экспорт
	
	Возврат Дата(2016,6,1);
	
КонецФункции

Функция ДатаИзмененияПорядкаИндексации() Экспорт
	
	Возврат Дата(2021,4,1);
	
КонецФункции

// Функция возвращает дату начала включения в страховой стаж отпуска по уходу за ребенком до 3-х лет (Закон от 19.11.2013 № 691-VII)
//
Функция ДатаВключенияВСтажОтпускаПоУходуЗаребенком() Экспорт
	
	Возврат Дата(2013,12,14);
	
КонецФункции

// Функция возвращает дату реформы Единого социального взноса
//
Функция ДатаИзмененияЕСВ1573() Экспорт
	
	Возврат Дата(2015,1,1);
	
КонецФункции

// Функция возвращает дату изменения Налогового кодекса Законом №1578
//
Функция ДатаИзмененияНК1578() Экспорт
	
	Возврат Дата(2015,1,1);
	
КонецФункции

 // Функция возвращает дату реформы Единого социального взноса
//
Функция ДатаИзмененияЕСВ1863() Экспорт
	
	Возврат Дата(2015,3,1);
	
КонецФункции

 // Функция возвращает дату реформы Единого социального взноса
//
Функция ДатаИзмененияЕСВ3688() Экспорт
	
	Возврат Дата(2016,1,1);
	
КонецФункции

 // Функция возвращает дату изменения Порядка №1266 расчета средней для выплат по общеобязательному государственному социальному страхованию
//
Функция ДатаИзмененияПорядка1266() Экспорт
	
	Возврат Дата(2015,7,4);
	
КонецФункции

 // Функция возвращает дату изменения Порядка №100 расчета средней
//
Функция ДатаИзмененияПорядка100() Экспорт
	
	Возврат Дата(2020,12,12);
	
КонецФункции

 // Функция возвращает дату изменения Порядка №100 расчета средней согласно Постановлению КМУ №917 от 01.09.21 г. 
 //
Функция ДатаИзмененияПорядка100_917() Экспорт
	
	Возврат Дата(2021,9,4);
	
КонецФункции

Функция ДатаИзмененияСхемыУчетаВС() Экспорт
	
	Возврат Дата(2021, 1, 1);
	
КонецФункции

// Функция по периоду определяет необходимость использования Единого социального взноса
//
Функция ИспользуетсяЕСВ(Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;	
		
	Возврат Период >= ДатаВводаЕСВ();
	
КонецФункции	

// Функция по периоду определяет необходимость использования Налогового кодекса
//
Функция ИспользуетсяНК(Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;	
		
	Возврат Период >= ДатаВводаНК();
	
КонецФункции	

// Функция возвращает используемые в ИБ варианты алгоритмов расчета ЗП
//
Функция ВариантыАлгоритмовРасчетаЗарплаты() Экспорт
	
	НаборЗаписей = РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты.СоздатьНаборЗаписей(); 
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		Возврат НаборЗаписей[0];
	КонецЕсли;
	//вдруг кто-то удалил
	Запись = НаборЗаписей.Добавить();
	Запись.РасчетНДФЛ17 = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения;
	Запись.РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.НеПрименять; 
	Запись.ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьС01012016;
	НаборЗаписей.Записать();
	Возврат Запись;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ для ЕСВ

// Процедура определяет Код категории застрахованного лица
//
Процедура ОпределитьКодКатегорииЗЛ(СтрокаТЧ, Регистратор)
	
	Если Регистратор.ПериодРегистрации < Дата(2011,12,1) Тогда
		СхемаКатегорий = 1;
	ИначеЕсли Регистратор.ПериодРегистрации < Дата(2016,6,1) Тогда	
	    СхемаКатегорий = 2;
	Иначе 
	    СхемаКатегорий = 3;	
	КонецЕсли;
	
	Если СхемаКатегорий = 3 Тогда
		
		//Новая схема
		
		Если СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТРаботники 
		 или СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТБюджетники Тогда
			//наймані працівники на загальних підставах
			//в т.ч. бюджетники
			СтрокаТЧ.КодКатегорииЗЛ = 1;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТИнвалиды Тогда
			//працюючий інвалід
			СтрокаТЧ.КодКатегорииЗЛ = 2;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТЛетчики Тогда
			//особа льотного складу
			СтрокаТЧ.КодКатегорииЗЛ = 3;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТРаботникиЗаПределами Тогда
			//громадянин України, який працює за її межами
			СтрокаТЧ.КодКатегорииЗЛ = 10;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТРаботникиИностранные Тогда
			//назва: працівник іноземних організацій в Україні
			СтрокаТЧ.КодКатегорииЗЛ = 11;	
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТРаботникиСР Тогда
			//наймані працівники, які працюють на посадах, робота на яких зараховується до стажу, що дає право на одержання пенсії відповідно до окремих законів України
			СтрокаТЧ.КодКатегорииЗЛ = 25;	
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТГПХ Тогда
			//особи, які працюють за угодами ЦПХ
			СтрокаТЧ.КодКатегорииЗЛ = 26;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС Тогда
			//особи, які працюють на підприємствах та в організаціях всеукраїнських громадських організацій інвалідів, зокрема товариствах УТОГ та УТОС
			СтрокаТЧ.КодКатегорииЗЛ = 27;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТИнвалиды50 Тогда	
			//працюючий інвалід на підприємстві або в організації громадських організацій інвалідів, в яких кількість інвалідів становить понад 50 % 
			СтрокаТЧ.КодКатегорииЗЛ = 28;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТБольничные Тогда		
			//особи, які отримують допомогу по тимчасовій непрацездатності
			СтрокаТЧ.КодКатегорииЗЛ = 29;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТИнвалидыУТОГУТОС Тогда		
			//найманий працівник-інвалід, який працює на підприємствах та в організаціях всеукраїнських громадських організацій інвалідів, зокрема товариствах УТОГ та УТОС
			СтрокаТЧ.КодКатегорииЗЛ = 30;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТИнвалидыСР Тогда		
			//Працюючі інваліди, які працюють на посадах, робота на яких зараховується до стажу, що дає право на одержання пенсії відповідно до окремих законів України
			СтрокаТЧ.КодКатегорииЗЛ = 32;	
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТБольничныеИнвалиды Тогда		
			//больничные для инвалидов
			СтрокаТЧ.КодКатегорииЗЛ = 36;			
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТБольничныеУТОГ Тогда		
			//больничные в организациях УТОГ, УТОС
			СтрокаТЧ.КодКатегорииЗЛ = 37;
        ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТГПХУТОГ Тогда		
			//ГПХ в УТОГ и УТОС
			СтрокаТЧ.КодКатегорииЗЛ = 38;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТБольничныеИнвалиды50 Тогда		
			//больничные для инвалида в организации с 50% инвалидов
			СтрокаТЧ.КодКатегорииЗЛ = 39;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТДекретные Тогда		
			//особи, які отримують допомогу у зв'язку з вагітністю та пологами
			СтрокаТЧ.КодКатегорииЗЛ = 42;	
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТДекретныеИнвалиды Тогда		
			//декретные для инвалида
			СтрокаТЧ.КодКатегорииЗЛ = 43;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТДекретныеУТОГ Тогда		
			//декретные в организациях УТОГ, УТОС
			СтрокаТЧ.КодКатегорииЗЛ = 44;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТДекретныеИнвалиды50 Тогда		
			//декретные для инвалида в организации с 50% инвалидов
			СтрокаТЧ.КодКатегорииЗЛ = 45;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТРаботникиФЛ Тогда		
			//особа, яка працює у фізичної особи
			СтрокаТЧ.КодКатегорииЗЛ = 46;	
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТМобил Тогда		
			// працівник, призваний на строкову військову службу
			СтрокаТЧ.КодКатегорииЗЛ = 47;
		ИначеЕсли СтрокаТЧ.Налог = Справочники.Налоги.ЕСВФОТМобилКомп Тогда		
			// Виплати, що компенсуються з бюджету в межах середнього заробітку працівників, призваних на військову службу
			СтрокаТЧ.КодКатегорииЗЛ = 48;
		КонецЕсли;	
		
	Иначе	
	
		//Определим случаи, когда код не нужен
		Если СтрокаТЧ.ВидРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.Взносы Тогда
			Возврат;
		КонецЕсли;
		Если НЕ СтрокаТЧ.ВидРасчета.ЕСВ Тогда
			Возврат;
		КонецЕсли;	
		
		Налоги = РегистрыСведений.ВзносыВФондыРаботниковОрганизаций.СрезПоследних(СтрокаТЧ.ДатаНачала,Новый Структура("Сотрудник",СтрокаТЧ.Сотрудник));
		
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ЕСВГПХ Тогда
			//особи, які працюють за угодами ЦПХ 
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС,"Налог"); 
			Если  Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//ГПХ в УТОГ и УТОС
				СтрокаТЧ.КодКатегорииЗЛ = 38;
			Иначе	
				СтрокаТЧ.КодКатегорииЗЛ = 26;
			КонецЕсли;	
			Возврат;
		КонецЕсли;
		
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ЕСВБольничные Тогда
			//особи, які отримують допомогу по тимчасовій непрацездатності
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТИнвалиды,"Налог");
			Если Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//больничные для инвалида
				СтрокаТЧ.КодКатегорииЗЛ = 36;
				Возврат;
			КонецЕсли;	
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТИнвалиды50,"Налог");
			Если Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//больничные для инвалида в организации с 50% инвалидов
				СтрокаТЧ.КодКатегорииЗЛ = 39;
				Возврат;
			КонецЕсли;	
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС,"Налог");
			Если Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//больничные в организациях УТОГ, УТОС
				СтрокаТЧ.КодКатегорииЗЛ = 37;
				Возврат;
			КонецЕсли;
			//все прочие больничные
			СтрокаТЧ.КодКатегорииЗЛ = 29;
			Возврат;
		КонецЕсли;
		
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ЕСВДекретные Тогда
			//Особи, які перебувають у відпустці у зв'язку з вагітністю та пологами
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТИнвалиды,"Налог");
			Если Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//декретные для инвалида
				СтрокаТЧ.КодКатегорииЗЛ = 43;
				Возврат;
			КонецЕсли;	
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТИнвалиды50,"Налог");
			Если Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//декретные для инвалида в организации с 50% инвалидов
				СтрокаТЧ.КодКатегорииЗЛ = 45;
				Возврат;
			КонецЕсли;	
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС,"Налог");
			Если Налог <> Неопределено И Налог.Актуальность И СхемаКатегорий = 2 Тогда
				//декретные в организациях УТОГ, УТОС
				СтрокаТЧ.КодКатегорииЗЛ = 44;
				Возврат;
			КонецЕсли;
			//все прочие декретные
			СтрокаТЧ.КодКатегорииЗЛ = 42;
			Возврат;
		КонецЕсли;
		
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ЕСВМобилизованные Тогда
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВМобилизованные,"Налог");
			Если Налог <> Неопределено Тогда
				СтрокаТЧ.КодКатегорииЗЛ = 48;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТИнвалиды,"Налог");
		Если Налог <> Неопределено И Налог.Актуальность Тогда
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВРаботникиСР,"Налог");
			Если  Налог <> Неопределено И Налог.Актуальность Тогда
				//Працюючі інваліди, які працюють на посадах, робота на яких зараховується до стажу, що дає право на одержання пенсії відповідно до окремих законів України
				СтрокаТЧ.КодКатегорииЗЛ = 32;
			Иначе	
				//працюючий інвалід (категорія платника: 1 та 2) 
				СтрокаТЧ.КодКатегорииЗЛ = 2;
			КонецЕсли;	
	        Возврат;
		КонецЕсли;
		
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТРаботники,"Налог");
		Если  Налог <> Неопределено И Налог.Актуальность Тогда
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВРаботникиСР,"Налог");
			Если  Налог <> Неопределено И Налог.Актуальность Тогда
				//наймані працівники, які працюють на посадах, робота на яких зараховується до стажу, що дає право на одержання пенсії відповідно до окремих законів України
				СтрокаТЧ.КодКатегорииЗЛ = 25;
		        Возврат;
			Иначе
				//наймані працівники на загальних підставах
				СтрокаТЧ.КодКатегорииЗЛ = 1;
		        Возврат;
			КонецЕсли;	
		КонецЕсли;
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТБюджетники,"Налог");
		Если  Налог <> Неопределено И Налог.Актуальность Тогда
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВРаботникиСР,"Налог");
			Если  Налог <> Неопределено И Налог.Актуальность Тогда
				//наймані працівники, які працюють на посадах, робота на яких зараховується до стажу, що дає право на одержання пенсії відповідно до окремих законів України
				СтрокаТЧ.КодКатегорииЗЛ = 25;
		        Возврат;
			Иначе
				//наймані працівники на загальних підставах
				СтрокаТЧ.КодКатегорииЗЛ = 1;
		        Возврат;
			КонецЕсли;	
		КонецЕсли;
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТСудостр,"Налог");
		Если  Налог <> Неопределено И Налог.Актуальность Тогда
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВРаботникиСР,"Налог");
			Если  Налог <> Неопределено И Налог.Актуальность Тогда
				//наймані працівники, які працюють на посадах, робота на яких зараховується до стажу, що дає право на одержання пенсії відповідно до окремих законів України
				СтрокаТЧ.КодКатегорииЗЛ = 25;
		        Возврат;
			Иначе
				//наймані працівники на загальних підставах
				СтрокаТЧ.КодКатегорииЗЛ = 1;
		        Возврат;
			КонецЕсли;	
		КонецЕсли;
		
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТЛетчики,"Налог");
		Если  Налог <> Неопределено И Налог.Актуальность Тогда
			//особа льотного складу
			СтрокаТЧ.КодКатегорииЗЛ = 3;
	        Возврат;
		КонецЕсли;
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТИнвалиды50,"Налог");
		Если  Налог <> Неопределено И Налог.Актуальность Тогда
			//працюючий інвалід на підприємстві або в організації громадських організацій інвалідів, в яких кількість інвалідів становить понад 50 % 
			СтрокаТЧ.КодКатегорииЗЛ = 28;
	        Возврат;
		КонецЕсли;
		Налог = Налоги.Найти(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС,"Налог"); 
		Если  Налог <> Неопределено И Налог.Актуальность Тогда
			Налог = Налоги.Найти(Справочники.Налоги.ЕСВИнвалидыУТОГУТОС,"Налог"); 
			Если  Налог <> Неопределено И Налог.Актуальность Тогда
				//найманий працівник-інвалід, який працює на підприємствах та в організаціях всеукраїнських громадських організацій інвалідів, зокрема товариствах УТОГ та УТОС
				СтрокаТЧ.КодКатегорииЗЛ = 30;
		        Возврат;
			Иначе
				//особи, які працюють на підприємствах та в організаціях всеукраїнських громадських організацій інвалідів, зокрема товариствах УТОГ та УТОС
				СтрокаТЧ.КодКатегорииЗЛ = 27;
		        Возврат;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

// Процедура определяет тип начисления
//
Процедура ОпределитьТипНачисления(СтрокаТЧ, Регистратор)
	
	//Определим случаи, когда код не нужен
	//Если СтрокаТЧ.ВидРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.Взносы Тогда
	//	Возврат;
	//КонецЕсли;
	Если НЕ СтрокаТЧ.ВидРасчета.ЕСВ Тогда
		Возврат;
	КонецЕсли;	
	Если (СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ЕСВГПХ ИЛИ
		СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ЕСВФОТГПХ)И
		СтрокаТЧ.БазовыйПериодНачало < Регистратор.ПериодРегистрации Тогда
		СтрокаТЧ.ТипНачисления = 1;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры	

// Функция возвращает список начислений входящих в базу взноса ЕСВ с оплаты по договорам ГПХ
//
Функция СписокГПХПоЕСВ() Экспорт
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВзносыВФондыБазовыеВидыРасчета.Ссылка,
	               |	ВзносыВФондыБазовыеВидыРасчета.ВидРасчета
	               |ИЗ
	               |	ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК ВзносыВФондыБазовыеВидыРасчета
				   |ГДЕ
				   |  ВзносыВФондыБазовыеВидыРасчета.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВГПХ)
				   |";
				   
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
	
КонецФункции

// Функция возвращает список начислений входящих в базу взноса ЕСВ с оплаты отпуска по беременности и родам
//
Функция СписокДекретныеПоЕСВ() Экспорт
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВзносыВФондыБазовыеВидыРасчета.Ссылка,
	               |	ВзносыВФондыБазовыеВидыРасчета.ВидРасчета
	               |ИЗ
	               |	ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК ВзносыВФондыБазовыеВидыРасчета
				   |ГДЕ
				   |  ВзносыВФондыБазовыеВидыРасчета.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВДекретные)
				   |";
				   
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
	
КонецФункции

Функция РассчитатьКоэффициентСтавки(Организация, МесяцНачисления) Экспорт
	
	Результат = Новый Структура("База,База2014,КоэффициентСтавки");
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(МесяцНачисления) Тогда
		Результат.База = 0;
		Результат.База2014 = 0;
		Результат.КоэффициентСтавки = 0;
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
   	|	СУММА(ВзносыВФонды.База) КАК База2014,
	|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ ВзносыВФонды.ПериодРегистрации) КАК Месяцев2014
	|ПОМЕСТИТЬ ВТБаза2014
	|ИЗ
    |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|ГДЕ
	|   ВзносыВФонды.Организация = &Организация
	|   И ГОД(ВзносыВФонды.ПериодРегистрации) = 2014
	|   И (ВзносыВФонды.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТ)
	|      ИЛИ ВзносыВФонды.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТГПХ))
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
   	|	СУММА(ВзносыВФонды.База) КАК База
	|ПОМЕСТИТЬ ВТБаза
	|ИЗ
    |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|ГДЕ
	|   ВзносыВФонды.Организация = &Организация
	|   И ВзносыВФонды.ПериодРегистрации = &МесяцНачисления
	|   И (ВзносыВФонды.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТ)
	|      ИЛИ ВзносыВФонды.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТГПХ))
	|;
	|
	|ВЫБРАТЬ
	|  ЕСТЬNULL(ТаблицаБаза.База, 0) КАК База,
	|  ЕСТЬNULL(ТаблицаБаза2014.База2014, 0) КАК База2014,
	|  ЕСТЬNULL(ТаблицаБаза2014.Месяцев2014, 0) КАК Месяцев2014
	|ИЗ
	|	ВТБаза КАК ТаблицаБаза
	|	ПОЛНОЕ СОЕДИНЕНИЕ
	|	ВТБаза2014 КАК ТаблицаБаза2014
	|	ПО ИСТИНА
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.База2014 = ?(Выборка.Месяцев2014 = 0, 0,Выборка.База2014/Выборка.Месяцев2014 );
		Результат.База = Выборка.База;
		Если Результат.База = 0 Тогда
			Результат.КоэффициентСтавки = 1;
		Иначе
			Результат.КоэффициентСтавки = МИН(МАКС(0.4, Результат.База2014/Результат.База),1);
		КонецЕсли;	
	Иначе
		Результат.База2014 = 0;
		Результат.База = 0;
		Результат.КоэффициентСтавки = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоэффициентСтавки1863(Организация, МесяцНачисления, БазаСОграничением) Экспорт
	
	Результат = Новый Структура("База,База2014,КоличествоЗЛ,КоличествоЗЛ2014,КоэффициентСтавки");
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(МесяцНачисления) Тогда
		Результат.База = 0;
		Результат.База2014 = 0;
		Результат.КоличествоЗЛ = 0;
		Результат.КоличествоЗЛ2014 = 0;
		Результат.КоэффициентСтавки = 0;
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Запрос.УстановитьПараметр("МассивНалогиБезКоэффициента",СписокНалогиБезКоэффициента());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзносыВФонды.ПериодРегистрации,
	|	СУММА(ВзносыВФонды.База) КАК База2014,
	|	КОЛИЧЕСТВО (РАЗЛИЧНЫЕ ВзносыВФонды.Сотрудник.ФизЛицо) КАК Сотрудники2014
	|ПОМЕСТИТЬ ВТБаза2014
	|ИЗ
    |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|ГДЕ
	|   ВзносыВФонды.Организация = &Организация
	|   И ГОД(ВзносыВФонды.ПериодРегистрации) = 2014
	|   И ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ВзносыФОТ)
	|   И ВзносыВФонды.Налог НЕ В (&МассивНалогиБезКоэффициента)
	|   И ВзносыВФонды.База <> 0	
	|СГРУППИРОВАТЬ ПО
	|    ВзносыВФонды.ПериодРегистрации
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзносыВФонды.Сотрудник.ФизЛицо КАК Сотрудник,
	|	СУММА(ВзносыВФонды.База) КАК База
	|ПОМЕСТИТЬ ВТБаза
	|ИЗ
    |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|ГДЕ
	|   ВзносыВФонды.Организация = &Организация
	|   И ВзносыВФонды.ПериодРегистрации = &МесяцНачисления
	|   И ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ВзносыФОТ)
	|   И ВзносыВФонды.Налог НЕ В (&МассивНалогиБезКоэффициента)
	|   И ВзносыВФонды.База <> 0	
	|СГРУППИРОВАТЬ ПО
	|    ВзносыВФонды.Сотрудник.ФизЛицо
	|;
	|
    |ВЫБРАТЬ
    |   КОЛИЧЕСТВО( РАЗЛИЧНЫЕ Взносы.Сотрудник) КАК КоличествоСотрудников,
    |   СУММА(Взносы.База) КАК База
    |ИЗ 
    |   ВТБаза КАК Взносы
    |;
    |
	|ВЫБРАТЬ
	|   СУММА(Взносы.Сотрудники2014)/КОЛИЧЕСТВО(Взносы.ПериодРегистрации) КАК Сотрудников2014,
	|   КОЛИЧЕСТВО(Взносы.ПериодРегистрации) КАК Месяцев2014,
	|   СУММА(Взносы.База2014) КАК База2014
	|ИЗ 
	|   ВТБаза2014 КАК Взносы
	|";
	
	Если БазаСОграничением Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВзносыВФонды.База","ВзносыВФонды.БазаВзноса");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[2].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.База = ?(Выборка.КоличествоСотрудников = 0, 0,Выборка.База/Окр(Выборка.КоличествоСотрудников) );
		Результат.КоличествоЗЛ = Выборка.КоличествоСотрудников
	Иначе
		Результат.База = 0;
		Результат.КоличествоЗЛ = 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[3].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.База2014 = ?(Выборка.Сотрудников2014 = 0 ИЛИ Выборка.Месяцев2014 = 0, 0,Выборка.База2014/Выборка.Месяцев2014/Окр(Выборка.Сотрудников2014) );
		Результат.КоличествоЗЛ2014 = Выборка.Сотрудников2014
	Иначе
		Результат.База2014 = 0;
		Результат.КоличествоЗЛ2014 = 0;
	КонецЕсли;
	
	Если Результат.База = 0 Тогда
		Результат.КоэффициентСтавки = 1;
	Иначе
		Результат.КоэффициентСтавки = Окр(МИН(МАКС(0.4, Результат.База2014/Результат.База),1),3);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьУсловияКоэффициентСтавки(Организация, МесяцНачисления, КоэффициентСтавки) Экспорт
	
	Результат = Новый Структура("СредняяЗП,СредняяЗП2014,МинимальнаяЗП,СреднийПлатеж");
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(МесяцНачисления) Тогда
		Результат.СредняяЗП = 0;
		Результат.СредняяЗП2014 = 0;
		Результат.СреднийПлатеж = 0;
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("КоэффициентСтавки", КоэффициентСтавки);
	
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ВзносыВФонды.Сотрудник,
	   |	ВЫБОР
	   |	 КОГДА ВзносыВФонды.КоэффициентСтавки <> 0 И ВзносыВФонды.КоэффициентСтавки <> &КоэффициентСтавки 
	   |	 ТОГДА ВзносыВФонды.БазаВзноса*ВзносыВФонды.Ставка*&КоэффициентСтавки 
	   |	 ИНАЧЕ ВзносыВФонды.Результат
	   |	КОНЕЦ КАК Результат
	   |ПОМЕСТИТЬ ВТВзносы
	   |ИЗ
       |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	   |ГДЕ
	   |    ВзносыВФонды.Организация = &Организация
	   |    И ВзносыВФонды.ПериодРегистрации = &МесяцНачисления
	   |    И ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ВзносыФОТ)
	   |    И ВзносыВФонды.БазаВзноса <> 0
	   |;
	   |
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	Начисления.Сотрудник,
	   |	Начисления.Результат
	   |ПОМЕСТИТЬ ВТНачисления
	   |ИЗ
       |	РегистрРасчета.Начисления КАК Начисления
	   |ГДЕ
	   |    Начисления.Организация = &Организация
	   |    И Начисления.ПериодРегистрации = &МесяцНачисления
	   |    И Начисления.ВидРасчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате)
	   |    И Начисления.Результат <> 0
	   |;
	   |
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	Начисления.Сотрудник,
	   |	КОЛИЧЕСТВО( РАЗЛИЧНЫЕ Начисления.ПериодРегистрации) КАК КоличествоМесяцев,
	   |	СУММА(Начисления.Результат) КАК Результат
	   |ПОМЕСТИТЬ ВТНачисления2014
	   |ИЗ
       |	РегистрРасчета.Начисления КАК Начисления
	   |ГДЕ
	   |    Начисления.Организация = &Организация
	   |    И ГОД(Начисления.ПериодРегистрации) = 2014
	   |    И Начисления.ВидРасчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате)
	   |    И Начисления.Результат <> 0
	   |СГРУППИРОВАТЬ ПО
	   |    Начисления.Сотрудник
	   |;
	   |
	   |ВЫБРАТЬ
	   |   КОЛИЧЕСТВО( РАЗЛИЧНЫЕ ВзносыВФонды.Сотрудник) КАК КоличествоСотрудниковВзносы,
	   |   СУММА(ВзносыВФонды.Результат) КАК РезультатВзносы
	   |ИЗ 
	   |   ВТВзносы КАК ВзносыВФонды
	   |;
	   |
	   |ВЫБРАТЬ
	   |   КОЛИЧЕСТВО( РАЗЛИЧНЫЕ Начисления.Сотрудник) КАК КоличествоСотрудниковНачисления,
	   |   СУММА(Начисления.Результат) КАК РезультатНачисления
	   |ИЗ 
	   |   ВТНачисления КАК Начисления
   	   |;
	   |
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	МинимальнаяОплатаТруда.Размер
	   |ИЗ
       |	РегистрСведений.МинимальнаяОплатаТруда.СрезПоследних(&МесяцНачисления) КАК МинимальнаяОплатаТруда
	   |;
	   |
	   |ВЫБРАТЬ
	   |   КОЛИЧЕСТВО( РАЗЛИЧНЫЕ Начисления.Сотрудник) КАК КоличествоСотрудниковНачисления2014,
	   |   СУММА(Начисления.Результат/Начисления.КоличествоМесяцев) КАК РезультатНачисления2014
	   |ИЗ 
	   |   ВТНачисления2014 КАК Начисления
   	   |
	   |";

	   
	   
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.КоличествоСотрудниковВзносы = 0 Тогда
			Результат.СреднийПлатеж = 0;
		Иначе
			Результат.СреднийПлатеж = Окр(Выборка.РезультатВзносы/Выборка.КоличествоСотрудниковВзносы,2);
		КонецЕсли
	Иначе
		Результат.СреднийПлатеж = 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[4].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.КоличествоСотрудниковНачисления = 0 Тогда
			Результат.СредняяЗП = 0;
		Иначе
			Результат.СредняяЗП = Окр(Выборка.РезультатНачисления/Выборка.КоличествоСотрудниковНачисления,2);
		КонецЕсли
	Иначе
		Результат.СредняяЗП = 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[5].Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.МинимальнаяЗП =  Выборка.Размер;
	Иначе
		Результат.МинимальнаяЗП = 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[6].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.КоличествоСотрудниковНачисления2014 = 0 Тогда
			Результат.СредняяЗП2014 = 0;
		Иначе
			Результат.СредняяЗП2014 = Окр(Выборка.РезультатНачисления2014/Выборка.КоличествоСотрудниковНачисления2014,2);
		КонецЕсли
	Иначе
		Результат.СредняяЗП2014 = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьУсловияКоэффициентСтавки1863(Организация, МесяцНачисления, КоэффициентСтавки, КоличествоЗЛ, КоличествоЗЛ2014) Экспорт
	
	Результат = Новый Структура("СреднийПлатеж, СреднийПлатеж2014"); 
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(МесяцНачисления) Тогда
		Результат.СреднийПлатеж = 0;
		Результат.СреднийПлатеж2014 = 0;
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("КоэффициентСтавки", КоэффициентСтавки);
	
	Запрос.УстановитьПараметр("МассивНалогиБезКоэффициента",СписокНалогиБезКоэффициента());
	
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ВзносыВФонды.Сотрудник.ФизЛицо КАК Сотрудник,
	   |	ВЫБОР
	   |	 КОГДА ВзносыВФонды.КоэффициентСтавки <> 0 И ВзносыВФонды.КоэффициентСтавки <> &КоэффициентСтавки 
	   |	 ТОГДА ВзносыВФонды.БазаВзноса*ВзносыВФонды.Ставка*&КоэффициентСтавки 
	   |	 ИНАЧЕ ВзносыВФонды.Результат
	   |	КОНЕЦ КАК Результат
	   |ПОМЕСТИТЬ ВТВзносы
	   |ИЗ
       |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	   |ГДЕ
	   |    ВзносыВФонды.Организация = &Организация
	   |    И ВзносыВФонды.ПериодРегистрации = &МесяцНачисления
	   |    И ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ВзносыФОТ)
	   |    И ВзносыВФонды.БазаВзноса <> 0
	   |    И ВзносыВФонды.Налог НЕ В (&МассивНалогиБезКоэффициента)
	   |;
	   |
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ВзносыВФонды.ПериодРегистрации,
	   |	СУММА(ВзносыВФонды.Результат) КАК Результат2014
	   |ПОМЕСТИТЬ ВТВзносы2014
	   |ИЗ
	   |	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	   |ГДЕ
	   |   ВзносыВФонды.Организация = &Организация
	   |   И ГОД(ВзносыВФонды.ПериодРегистрации) = 2014
	   |   И ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ВзносыФОТ)
	   |   И ВзносыВФонды.Налог НЕ В (&МассивНалогиБезКоэффициента)
	   |СГРУППИРОВАТЬ ПО
	   |    ВзносыВФонды.ПериодРегистрации
	   |;
	   |
	   |ВЫБРАТЬ
	   |   СУММА(ВзносыВФонды.Результат) КАК РезультатВзносы
	   |ИЗ 
	   |   ВТВзносы КАК ВзносыВФонды
	   |;
	   |
	   |ВЫБРАТЬ
	   |   СУММА(ВзносыВФонды.Результат2014)/КОЛИЧЕСТВО(ВзносыВФонды.ПериодРегистрации) КАК РезультатВзносы2014
	   |ИЗ 
	   |   ВТВзносы2014 КАК ВзносыВФонды
   	   |
	   |";

	   
	   
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Если КоличествоЗЛ = 0 ИЛИ Выборка.РезультатВзносы = NULL Тогда
			Результат.СреднийПлатеж = 0;
		Иначе
			Результат.СреднийПлатеж = Окр(Выборка.РезультатВзносы/КоличествоЗЛ,2);
		КонецЕсли;
	Иначе
		Результат.СреднийПлатеж = 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Если Выборка.Следующий() Тогда
		Если КоличествоЗЛ2014 = 0 ИЛИ Выборка.РезультатВзносы2014 = NULL Тогда
			Результат.СреднийПлатеж2014 = 0;
		Иначе
			Результат.СреднийПлатеж2014 = Окр(Выборка.РезультатВзносы2014/КоличествоЗЛ2014,2);
		КонецЕсли;
	Иначе
		Результат.СреднийПлатеж2014 = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокНалогиБезКоэффициента()
	
	МассивНалогиБезКоэффициента = Новый Массив();
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТГПХУТОГ);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды50);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТБольничныеИнвалиды);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТБольничныеИнвалиды50);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТБольничныеУТОГ);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТДекретныеИнвалиды);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТДекретныеИнвалиды50);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТДекретныеУТОГ);

	
	Возврат МассивНалогиБезКоэффициента;
		
КонецФункции
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАСЧЕТОВ Средних

// Осуществляет округление числа по правилу четной цифры
//
// Параметры
//  Значение  – Число – округляемое значение
//
Функция ОкруглитьПоПравилуЧетнойЦифры(Значение)
	
	Если (Значение = Неопределено) или (Значение = NULL) Тогда
		Возврат 0;
	КонецЕсли;	
	
	ЦелаяЧасть = Цел(Значение);
	ДробнаяЧасть = Значение - ЦелаяЧасть;
	Если (ДробнаяЧасть >= 0.6) или (ДробнаяЧасть < 0.5) Тогда
		//Стандартно
		Возврат Окр(Значение);
	КонецЕсли;
	ПоловинаЦелой = Цел(ЦелаяЧасть/2);
	Если (ЦелаяЧасть = (ПоловинаЦелой*2)) Тогда
		//четное - округляем в меньшую
	    Возврат ЦелаяЧасть;
	Иначе
		//нечетное - округляем в большую
		Возврат ЦелаяЧасть+1;
	КонецЕсли;	
	
КонецФункции	

// Расчитывает среднесписочную численность штатных работников и в эквиваленте полной занятости
//
// Параметры
//  ВидСредней  – Строка – "ЭПЗ", "ССЧ"
//  ВидПериода  – Строка – "МЕСЯЦ", "КВАРТАЛ", "ГОД", "КВАРТАЛСНАЧАЛАГОДА", "МЕСЯЦСНАЧАЛАГОДА" 
//  Организация  – ссылка – организация
//  ПараметрОтбора  – Строка – "" = по всем(штатным + ГПХ), "Ж" = Женщины, "Инв" = Инвалиды, "Пен" = пенсионеры, "Иностранцы" = иностранцы, "ГПХ" - работающие по договору ГПХ, "Штат" - только по штатным
//
// Возвращаемое число:
//   таблица значений   – Колонки: Период и Сумма
//
Функция ПолучитьСреднююЧисленность(НачалоПериода, КонецПериода, ВидСредней, ВидПериода = "МЕСЯЦ", Организация, ПараметрОтбора = "") Экспорт
	
	// таблица с результатми
	тбСредняя = Новый ТаблицаЗначений;
	тбСредняя.Колонки.Добавить("Период");
	тбСредняя.Колонки.Добавить("Средняя");
	ТекСтрока = тбСредняя.Добавить();
	ТекСтрока.Средняя = 0;
	
	
	Если ВидСредней = "ССЧ" Тогда
		ФормаОтчета = Отчеты.СреднеучетнаяЧисленностьСотрудников.ПолучитьФорму();
	ИначеЕсли ВидСредней = "ЭПЗ" Тогда
		ФормаОтчета = Отчеты.СреднеучетнаяЧисленностьСотрудниковЭПЗ.ПолучитьФорму();
	КонецЕсли;

	ФормаОтчета.ЗаполнитьНачальныеНастройки();
	ФормаОтчета.ПостроительОтчета.Отбор.Организация.Значение = Организация;
	ФормаОтчета.ПостроительОтчета.Отбор.Организация.Использование = Истина;
	//  ВидПериода  – Строка – "МЕСЯЦ", "КВАРТАЛ", "ГОД", "КВАРТАЛСНАЧАЛАГОДА", "МЕСЯЦСНАЧАЛАГОДА" 
	Если ВидПериода = "МЕСЯЦ" Тогда
		тбСредняя = ПолучитьСреднююЧисленностьЗаМесяц(КонецПериода, ВидСредней, Организация, ПараметрОтбора);
	ИначеЕсли ВидПериода = "КВАРТАЛ" Или ВидПериода = "КВАРТАЛСНАЧАЛАГОДА" Или ВидПериода = "МЕСЯЦСНАЧАЛАГОДА" Тогда
		
		Если ВидПериода = "КВАРТАЛ"  Тогда
			ТекДата	= НачалоКвартала(НачалоПериода);
		Иначе
			ТекДата	= НачалоГода(НачалоПериода);
		КонецЕсли;
		
		КвоМесяцев = 0;
		ДатаКонца	= НачалоМесяца(КонецПериода);
		Пока ТекДата <= ДатаКонца Цикл
			
			тбСредняяЗаМесяц = ПолучитьСреднююЧисленностьЗаМесяц(ТекДата, ВидСредней, Организация, ПараметрОтбора);
			Если тбСредняяЗаМесяц[0].Средняя <> Неопределено Тогда
				ТекСтрока.Средняя = ТекСтрока.Средняя + тбСредняяЗаМесяц[0].Средняя;
			КонецЕсли;
			
			КвоМесяцев = КвоМесяцев + 1;
			ТекДата = ДобавитьМесяц(ТекДата, 1);
		КонецЦикла;
		
		ТекСтрока.Средняя = ?( КвоМесяцев = 0, 0, ОкруглитьПоПравилуЧетнойЦифры(ТекСтрока.Средняя/КвоМесяцев));
		
	КонецЕсли;
	
	Возврат тбСредняя;
	
КонецФункции // ПолучитьСреднюю()

// Расчитывает среднесписочную численность штатных работников и в эквиваленте полной занятости
//
// Параметры
//  ВидСредней  – Строка – "ЭПЗ", "ССЧ"
//  ВидПериода  – Строка – "МЕСЯЦ", "КВАРТАЛ", "ГОД", "КВАРТАЛСНАЧАЛАГОДА", "МЕСЯЦСНАЧАЛАГОДА" 
//  Организация  – ссылка – организация
//  ПараметрОтбора  – Строка – "" = по всем, "Ж" = Женщины, "Инв" = Инвалиды, "Пен" = пенсионеры, "Иностранцы" = иностранцы, "ГПХ" - работающие по договору ГПХ
//
// Возвращаемое число:
//   таблица значений   – Колонки: Период и Сумма
//
Функция ПолучитьСреднююЧисленностьЗаМесяц(КонецПериода, ВидСредней, Организация, ПараметрОтбора = "") Экспорт
	
	// таблица с результатми
	тбСредняя = Новый ТаблицаЗначений;
	тбСредняя.Колонки.Добавить("Период");
	тбСредняя.Колонки.Добавить("Средняя");
	тбСредняя.Колонки.Добавить("РасчетВыполнен");	
	
	Если ВидСредней = "ССЧ" Тогда
		ФормаОтчета = Отчеты.СреднеучетнаяЧисленностьСотрудников.ПолучитьФорму();
	ИначеЕсли ВидСредней = "ЭПЗ" Тогда
		ФормаОтчета = Отчеты.СреднеучетнаяЧисленностьСотрудниковЭПЗ.ПолучитьФорму();
	КонецЕсли;

	ФормаОтчета.ЗаполнитьНачальныеНастройки();
	ФормаОтчета.ПостроительОтчета.Отбор.Организация.Значение = Организация;
	ФормаОтчета.ПостроительОтчета.Отбор.Организация.Использование = Истина;
	
	ВидОтчета 	  = "";
	ВидРаботников = "";
	Если  ВРЕГ(ПараметрОтбора) = "Ж" Тогда
		ВидОтчета = "Ж";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ЖШТАТ" Тогда
		ВидОтчета	  = "Ж"; 
		ВидРаботников = "Штатные";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ШТАТ" Тогда
		ВидРаботников = "Штатные";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "СОВМ" Тогда
		ВидРаботников = "Совместители";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ГПХ" Тогда
		Если ВидСредней = "ЭПЗ" Тогда
		   ВидОтчета = "ГПХ";
		КонецЕсли;
		ВидРаботников = "ГПХ";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ПЕНСИОНЕРЫ" Тогда
		ВидОтчета = "Пен";
	ИначеЕсли  ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ИНОСТРАНЦЫ" Тогда
		ВидОтчета = "Иностранцы";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ИНВШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "Инв";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ИНВ" Тогда
		ВидОтчета = "Инв";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ПЕННЕИНВ" Тогда
		ВидОтчета = "ПенНеИнв";	
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ИНВНЕПЕН" Тогда
		ВидОтчета = "ИнвНеПен";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ИНВПЕН" Тогда
		ВидОтчета = "ИнвПен";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ДОПГАРАНТИИ" Тогда
		ВидОтчета = "ДопГарантии";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ДОПГАРАНТИИШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ДопГарантии";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ДОПГАРАНТИИНЕИНВ" Тогда
		ВидОтчета = "ДопГарантииНеИнв";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ДОПГАРАНТИИНЕИНВШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ДопГарантииНеИнв";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ДОПГАРАНТИИ10ЛЕТ" Тогда
		ВидОтчета = "ДопГарантии10Лет";
	ИначеЕсли  ВРЕГ(ПараметрОтбора) = "ДОПГАРАНТИИ10ЛЕТШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ДопГарантии10Лет";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "СЕЛШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "Сел";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖСЕЛШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖСел";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ОТ18ДО35" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "От18До35";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖОТ18ДО35" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖОт18До35";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ОТ18ДО35" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ОТ18ДО35";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖОТ18ДО35" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖОТ18ДО35";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ОТ36ДО60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "От36До60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖОТ36ДО60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖОт36До60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ОТ60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "От60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖОТ60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖОт60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖИНВШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖИнв";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ИНВСЕЛШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ИнвСел";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖИНВСЕЛШТАТ" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖИнвСел";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ИНВШТАТОТ18ДО35" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ИнвОт18До35";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖИНВШТАТОТ18ДО35" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖИнвОт18До35";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ИНВШТАТОТ36ДО60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ИнвОт36До60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖИНВШТАТОТ36ДО60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖИнвОт36До60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ИНВШТАТОТ60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ИнвОт60";
	ИначеЕсли ВидСредней = "ССЧ" И ВРЕГ(ПараметрОтбора) = "ЖИНВШТАТОТ60" Тогда
		ВидРаботников = "Штатные";
		ВидОтчета = "ЖИнвОт60";
	ИначеЕсли ПараметрОтбора <> "" Тогда
		ТекСтрока = тбСредняя.Добавить();
		ТекСтрока.Период = НачалоМесяца(КонецПериода);
		ТекСтрока.Средняя = 0;
		ТекСтрока.РасчетВыполнен = Ложь;
		Возврат тбСредняя;
	КонецЕсли;
	
	ФормаОтчета.ДатаНачала	= НачалоМесяца(КонецПериода);
	ФормаОтчета.ДатаКонца	= КонецМесяца(КонецПериода);
	ФормаОтчета.ВидОтчета	  = ВидОтчета;
	Если ВидСредней = "ССЧ" Тогда
		ФормаОтчета.ВидРаботников = ВидРаботников;
	КонецЕсли;
	
	ФормаОтчета.СформироватьПараметрыОтчета();
	Выборка = ФормаОтчета.ПостроительОтчета.ПолучитьЗапрос().Выполнить().Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	
	ТекСтрока = тбСредняя.Добавить();
	ТекСтрока.Период = НачалоМесяца(КонецПериода);
	ТекСтрока.Средняя = ОкруглитьПоПравилуЧетнойЦифры(Выборка.Средняя);
	ТекСтрока.РасчетВыполнен = Истина;
	
	Возврат тбСредняя;
	
КонецФункции // ПолучитьСреднюю()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАСЧЕТОВ Коммунального налога

//Процедура служит для определения регламентированных параметров, необходимых для
//расчета суммы коммунального налога
Процедура ОпределитьРегламентированныеПараметрыДляРасчетаКоммунальногоНалога(СтавкаКоммунальногоНалога, НеоблагаемыйМинимум, ДатаНалога, Организация = "")   Экспорт
	
	Если Организация = "" Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//определяем ставку коммунального налога
	СтавкаКоммунальногоНалога = 0;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	НалогиОсн.Налог  КАК Налог, 
	|	НалогиОсн.Ставка КАК Ставка,
	|	НалогиОсн.Организация КАК Организация
    |ИЗ РегистрСведений.ШкалаСтавокНалогов.СрезПоследних (&Дата) КАК НалогиОсн
	|ГДЕ НалогиОсн.Налог = &КоммунальныйНалог
	|";
	ЗапросЗначенияСтавок = Новый Запрос;
	ЗапросЗначенияСтавок.Текст = ТекстЗапроса;
	ЗапросЗначенияСтавок.УстановитьПараметр("Дата", ДатаНалога);
	КоммунальныйНалог = Справочники.Налоги.КоммунальныйНалог;
	ЗапросЗначенияСтавок.УстановитьПараметр("КоммунальныйНалог", КоммунальныйНалог);
	
	РезультатЗапроса = ЗапросЗначенияСтавок.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТаблицаСтавок = РезультатЗапроса.Выгрузить();
		НайденнаяСтрока = ТаблицаСтавок.Найти (Организация,"Организация" );
		Если НайденнаяСтрока = Неопределено Тогда
			НайденнаяСтрока = ТаблицаСтавок.Найти (КоммунальныйНалог,"Налог" );
		КонецЕсли;
		СтавкаКоммунальногоНалога = НайденнаяСтрока.Ставка;
		
	КонецЕсли;
	
	
	//определяем значение необлагаемого минимума
	ТекстЗапроса = "
	|ВЫБРАТЬ  
	|	НеоблагМинимум.Размер  КАК РазмерМинимума 
	|ИЗ РегистрСведений.НеоблагаемыйМинимум.СрезПоследних (&Дата) КАК НеоблагМинимум
	|";
	
	ЗапросЗначениеМинимума = Новый Запрос;
	ЗапросЗначениеМинимума.Текст = ТекстЗапроса;
	ЗапросЗначениеМинимума.УстановитьПараметр("Дата", ДатаНалога);
	
	РезультатЗапроса = ЗапросЗначениеМинимума.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТаблицаСтавок = РезультатЗапроса.Выгрузить();
		НеоблагаемыйМинимум = ТаблицаСтавок[0].РазмерМинимума; 
		
	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ АВТОЗАПОЛНЕНИЯ

Функция АвтозаполнениеРаботникиОрганизации( Регистратор, ПроверятьДубли = Истина, ЭтоДоговорники = Ложь, ЭтоУволенные = Ложь) Экспорт
	
	ПериодРегистрации = Регистратор.ПериодРегистрации;
	Организация = Регистратор.Организация;
	Ответственный = Регистратор.Ответственный;
	ПодразделениеОрганизации = Регистратор.ПодразделениеОрганизации;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСсылка",	Регистратор);
	Запрос.УстановитьПараметр("парамНачало",	ПериодРегистрации);
	Запрос.УстановитьПараметр("парамКонец",		КонецМесяца(ПериодРегистрации) );
	
	// надо получить назначение на начало последнего дня месяца
	Запрос.УстановитьПараметр("парамПоследнийДеньПериодаРегистрации",	НачалоДня(КонецМесяца(ПериодРегистрации)) );
	Запрос.УстановитьПараметр("парамПоследнийДеньПередПериодРегистрации",	ПериодРегистрации );
	//Для того чтобы заполнять только уволенными надо брать СрезПоследних на следующий день
	Запрос.УстановитьПараметр("парамПервыйДеньПослеПериодаРегистрации", КонецМесяца(ПериодРегистрации) + 1);	
	
	Запрос.УстановитьПараметр("парамОрганизация",	Регистратор.Организация);
	Запрос.УстановитьПараметр("парамПользователь",	Регистратор.Ответственный);
	Запрос.УстановитьПараметр("парамПодразделение",	Регистратор.ПодразделениеОрганизации);
	
	ЭстьРеквизитЭтоПересчетНДФЛ = Ложь;
	Если Регистратор.Метаданные().Реквизиты.Найти("ЭтоПересчетНДФЛ") <> Неопределено Тогда
		ЭстьРеквизитЭтоПересчетНДФЛ = Истина;
		Запрос.УстановитьПараметр("ЭтоПересчетНДФЛ",	Регистратор.ЭтоПересчетНДФЛ);
	КонецЕсли;
	ЕстьРеквизитПредварительныйРасчет = Ложь;
	Если Регистратор.Метаданные().Реквизиты.Найти("ПредварительныйРасчет") <> Неопределено Тогда
		ЕстьРеквизитПредварительныйРасчет = Истина;
	КонецЕсли;
	ЕстьПерерассчитываемыйДокумент = Ложь;
	ТекстПерерассчитываемыйДокумент = "";
	Если Регистратор.Метаданные().Реквизиты.Найти("ПерерассчитываемыйДокумент") <> Неопределено Тогда
		ЕстьПерерассчитываемыйДокумент = Истина;
		ТекстПерерассчитываемыйДокумент = "ЗНАЧЕНИЕ(Документ."+Регистратор.Метаданные().Имя+".ПустаяСсылка)";
	КонецЕсли;

	// Проверим ответсвенного - является ли он расчетчиком вообще и для заданного 
	// подразделения (если оно задано)
	ПустоеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	ПустойОтветственный = Справочники.Пользователи.ПустаяСсылка();
	Если Ответственный <> ПустойОтветственный Тогда
		Если ПодразделениеОрганизации <> ПустоеПодразделение Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Подразделения.Ссылка
			|ИЗ Справочник.ПодразделенияОрганизаций КАК Подразделения
			|ГДЕ Подразделения.Ссылка В ИЕРАРХИИ(&парамПодразделение)
			|";
			Если Запрос.Выполнить().Пустой() Тогда
				Сообщить(НСтр("ru='Ответственный за этот документ не является расчетчиком для выбранного подразделения';uk='Відповідальний за цей документ не є розраховувачем для обраного підрозділу'"));
				Возврат  Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Описание условий	
	ПоВсемПодразделениямОрганизации = Истина;
	Если ПодразделениеОрганизации <> ПустоеПодразделение Тогда
		
		ПоВсемПодразделениямОрганизации = Ложь;
		УсловиеНаПодразделение = "ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделение)";
		
	КонецЕсли;
	
	Если Регистратор.ОтражатьВРеглУчете Тогда
		// Текст запроса: срез работников на конец месяца
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник  
		|ИЗ (		
		|	ВЫБРАТЬ
		|		Работники.Сотрудник КАК Сотрудник ";
		Если ЭтоУволенные Тогда  
			ТекстЗапроса = ТекстЗапроса + " ИЗ	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамПервыйДеньПослеПериодаРегистрации,Организация = &парамОрганизация) КАК Работники"; 
		Иначе  
			ТекстЗапроса = ТекстЗапроса + " ИЗ	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамПоследнийДеньПериодаРегистрации, Организация = &парамОрганизация) КАК Работники";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	
		|	
		|	// все уволенные до текущего периода
		|	ЛЕВОЕ СОЕДИНЕНИЕ (
		|		ВЫБРАТЬ
		|			Работники.Сотрудник КАК Сотрудник
		|		ИЗ	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамПоследнийДеньПередПериодРегистрации, Организация = &парамОрганизация) КАК Работники
		|		ГДЕ		Работники.ЗанимаемыхСтавок = 0 
		|			И	Работники.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|			И	Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			"+?(ПоВсемПодразделениямОрганизации, "", "И Работники."+УсловиеНаПодразделение)+"
		|	) КАК УволенныеРаботники
		|	ПО  Работники.Сотрудник = УволенныеРаботники.Сотрудник
		|	
		|	ГДЕ  Работники.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|	И  УволенныеРаботники.Сотрудник ЕСТЬ NULL
		|	"+?(ПоВсемПодразделениямОрганизации, "", "И Работники."+УсловиеНаПодразделение)+"
		|	"+?(ЭтоУволенные, "И Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)", "")+"
		|	"+?(ЭтоУволенные, "И Работники.Сотрудник.ВидДоговора<> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Подряда) ", "") + "
		|	"+?(ЭтоДоговорники, "И Работники.Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Подряда)", "") + "
		
		
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДоговорникиОрганизаций.Сотрудник КАК Сотрудник
		|	ИЗ  Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорникиОрганизаций
		|	
		|	ГДЕ ДоговорникиОрганизаций.Проведен
		|		И ДоговорникиОрганизаций.ДатаОкончания >= &парамНачало
		|		И ДоговорникиОрганизаций.ДатаНачала <= &парамКонец
		|		И ДоговорникиОрганизаций.Организация = &парамОрганизация
		|	"+?(ПоВсемПодразделениямОрганизации, "", " И ДоговорникиОрганизаций."+УсловиеНаПодразделение)+"
		|	"+?(ЭтоУволенные,"И ДоговорникиОрганизаций.Сотрудник.ВидДоговора<> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Подряда)", "") + "
		|	"+?(ЭтоДоговорники, "И ДоговорникиОрганизаций.Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Подряда)", "") + "
		
		|		
		|) КАК Сотрудники		
		|		
		|";
		
		Если ПроверятьДубли Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ (		
			|	ВЫБРАТЬ
			|		Работники.Сотрудник КАК Сотрудник
			|	ИЗ  Документ."+Регистратор.Метаданные().Имя+".РаботникиОрганизации КАК Работники
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|	Документ.Сторнирование КАК Сторнирование
			|	ПО Сторнирование.СторнируемыйДокумент = Работники.Ссылка
			|	ГДЕ		Работники.Ссылка <> &парамСсылка 
			|		И	Работники.Ссылка.ПериодРегистрации = &парамНачало
			|		И	Работники.Ссылка.Организация = &парамОрганизация
			|		И	НЕ Работники.Ссылка.ПометкаУдаления
			|		И	Работники.Ссылка.Проведен
            |		И	Сторнирование.Ссылка ЕСТЬ NULL
			|		" + ?(ЭстьРеквизитЭтоПересчетНДФЛ,"И НЕ Работники.Ссылка.ЭтоПересчетНДФЛ <> &ЭтоПересчетНДФЛ","")+"
			|		" + ?(ЕстьРеквизитПредварительныйРасчет,"И НЕ Работники.Ссылка.ПредварительныйРасчет","")+"
			|		" + ?(ЕстьПерерассчитываемыйДокумент,"И НЕ Работники.Ссылка.ПерерассчитываемыйДокумент <> "+ТекстПерерассчитываемыйДокумент,"")+"
			|) КАК РаботникиРасчитанныеДругимимДокументами		
			|ПО РаботникиРасчитанныеДругимимДокументами.Сотрудник = Сотрудники.Сотрудник 		
			|		
			|ГДЕ	РаботникиРасчитанныеДругимимДокументами.Сотрудник ЕСТЬ NULL		
			|	И	Сотрудники.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)		
			|";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ Сотрудники.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)		
			|";
			
		КонецЕсли;
	Иначе
		// для упр учета можно воспользоваться справочником СотрудникиОрганизаций
		Запрос.УстановитьПараметр("ПустаяДата", '00010101000000');
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник  
		|ИЗ Справочник.СотрудникиОрганизаций КАК Сотрудники		
		|ГДЕ	Сотрудники.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)		
		|	И	Сотрудники.Организация в (&парамОрганизация)
		|	И	Сотрудники.ДатаНачала <= &парамКонец
		|	И	(Сотрудники.ДатаОкончания = &ПустаяДата ИЛИ Сотрудники.ДатаОкончания >= &парамНачало)
		|";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // АвтозаполнениеРаботникиОрганизации()

Процедура АвтозаполнениеВзносы( Регистратор, Взносы, ЭтоВзносы, Сотрудники, ПоРегистратору = Ложь ) Экспорт
	
	Если Регистратор.Метаданные().реквизиты.Найти("ПерерассчитываемыйДокумент")= Неопределено  Тогда
		мПериодРегистрации = Регистратор.ПериодРегистрации;
	Иначе
		мПериодРегистрации = ?(ЗначениеЗаполнено(Регистратор.ПерерассчитываемыйДокумент), Регистратор.ПерерассчитываемыйДокумент.ПериодРегистрации, Регистратор.ПериодРегистрации);
	КонецЕсли;

	ИспользуетсяЕСВ = ИспользуетсяЕСВ(Регистратор.ПериодРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамРегистратор" , Регистратор);
	Запрос.УстановитьПараметр("парамОрганизация" , Регистратор.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", мПериодРегистрации);
	Запрос.УстановитьПараметр("парамСотрудники"  , Сотрудники);
	Запрос.УстановитьПараметр("парамПрогрессивнаяШкала"  , Перечисления.СпособыРасчетаПоШкале.Прогрессивный);
	
	//	ВТРаботникиПоПериодам
	Если Истина Тогда
		
		//Определим правила отнесения к налоговому периоду
		Если ИспользуетсяЕСВ Тогда
			
			Запрос.УстановитьПараметр("СписокДекретныеПоЕСВ",СписокДекретныеПоЕСВ());
			Запрос.УстановитьПараметр("СписокГПХПоЕСВ",СписокГПХПоЕСВ());
			
			ТекстНалоговыйПериод = "ВЫБОР КОГДА Начисления.ВидРасчета.ЭтоБольничные //Больничные
			                        |ИЛИ  Начисления.ВидРасчета В (&СписокГПХПоЕСВ) //Оплата по договору ГПХ
									|ИЛИ  Начисления.ВидРасчета В (&СписокДекретныеПоЕСВ) //Декретные
									|ИЛИ  Начисления.ВидРасчета.ЭтоОтпускные //Отпускные
									|ТОГДА НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало,	МЕСЯЦ) //по периоду действия
									|ИНАЧЕ &ПериодРегистрации //по периоду регистрации
									|КОНЕЦ";
            ТекстНачало = "ВЫБОР КОГДА Начисления.ВидРасчета.ЭтоБольничные
			                        |ИЛИ  Начисления.ВидРасчета В (&СписокГПХПоЕСВ)
									|ИЛИ  Начисления.ВидРасчета В (&СписокДекретныеПоЕСВ)
									|ИЛИ  Начисления.ВидРасчета.ЭтоОтпускные
									|ТОГДА Начисления.ПериодДействияНачало
									|ИНАЧЕ &ПериодРегистрации
									|КОНЕЦ";
			ТекстКонец = "ВЫБОР КОГДА Начисления.ВидРасчета.ЭтоБольничные
			                        |ИЛИ  Начисления.ВидРасчета В (&СписокГПХПоЕСВ)
									|ИЛИ  Начисления.ВидРасчета В (&СписокДекретныеПоЕСВ)
									|ИЛИ  Начисления.ВидРасчета.ЭтоОтпускные
									|ТОГДА Начисления.ПериодДействияКонец
									|ИНАЧЕ &ПериодРегистрации
									|КОНЕЦ";						
		Иначе
			ТекстНалоговыйПериод = "НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало,	МЕСЯЦ)";
			ТекстНачало = "НачисленияВсе.ПериодДействияНачало";
			ТекстКонец = "НачисленияВсе.ПериодДействияКонец";
		КонецЕсли;	
		
		//	Описание:
		// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Начисления.Сотрудник            						КАК Сотрудник,       // сотрудник определяет организацию, потому условие на организацию не требуется
		|"+ТекстНалоговыйПериод+" КАК НалоговыйПериод,
		|		МАКСИМУМ( 
		|       		ВЫБОР КОГДА ЕСТЬNULL(РаботникиПрием.Период,НАЧАЛОПЕРИОДА("+ТекстНачало+", МЕСЯЦ)) > НАЧАЛОПЕРИОДА("+ТекстНачало+", МЕСЯЦ) 
		|							ТОГДА РаботникиПрием.Период
		|                     ИНАЧЕ НАЧАЛОПЕРИОДА("+ТекстНачало+", МЕСЯЦ) КОНЕЦ
		|		)	КАК ДатаНачала,    // если пришел на работу, то это будет дата приема		
		|
		|		МАКСИМУМ( 
		|       		ВЫБОР КОГДА  ЕСТЬNULL(РаботникиУвольнение.Период, КОНЕЦПЕРИОДА("+ТекстКонец+", МЕСЯЦ)) > КОНЕЦПЕРИОДА("+ТекстКонец+", МЕСЯЦ) 
		|							ТОГДА КОНЕЦПЕРИОДА("+ТекстКонец+", МЕСЯЦ)
		|                     ИНАЧЕ ЕСТЬNULL(РаботникиУвольнение.Период, КОНЕЦПЕРИОДА("+ТекстКонец+", МЕСЯЦ)) КОНЕЦ
		|		)	КАК ДатаОкончания    // если уволился то это будет дата увольнения		
		|
		|ПОМЕСТИТЬ ВТРаботникиПоПериодам	
		|	ИЗ	РегистрРасчета.Начисления КАК Начисления
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ	РегистрРасчета.Начисления КАК НачисленияВсе
		|	ПО		НачисленияВсе.ПериодРегистрации <= &ПериодРегистрации
		|		И	НачисленияВсе.Сотрудник = Начисления.Сотрудник
		|		И	НАЧАЛОПЕРИОДА(НачисленияВсе.ПериодДействияНачало,	МЕСЯЦ) = НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало,	МЕСЯЦ)
		|           " + ?(ПоРегистратору, "И	НачисленияВсе.Регистратор = &парамРегистратор", "") + "
		|
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ( 
		|   	ВЫБРАТЬ
		|			Работники.Сотрудник,
		|			Работники.Период КАК Период
		|       ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники
		|       ГДЕ Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
		|		И	Работники.Сотрудник в ( &парамСотрудники )
		|   ) КАК РаботникиПрием
		|	ПО		РаботникиПрием.Сотрудник = Начисления.Сотрудник
		|
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ( 
		|   	ВЫБРАТЬ
		|			Работники.Сотрудник,
		|			ДОБАВИТЬКДАТЕ(Работники.Период,СЕКУНДА, -1) КАК Период 
		|       ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники
		|       ГДЕ Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|		И	Работники.Сотрудник в ( &парамСотрудники )
		|   ) КАК РаботникиУвольнение
		|	ПО		РаботникиУвольнение.Сотрудник = Начисления.Сотрудник
		|
		|	ГДЕ		Начисления.ПериодРегистрации = &ПериодРегистрации
		|		И	Начисления.Сотрудник в ( &парамСотрудники )
		|           " + ?(ПоРегистратору, "И	Начисления.Регистратор = &парамРегистратор", "") + "
		|
		|	СГРУППИРОВАТЬ ПО
		|		Начисления.Сотрудник,
		|"+ТекстНалоговыйПериод+"
		|
		|	ИНДЕКСИРОВАТЬ ПО
		|		Сотрудник,
		|		НалоговыйПериод
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТРаботникиПоПериодам = "ВТРаботникиПоПериодам";
	КонецЕсли;
	
	//	ВТВзносы
	Если Истина Тогда
		//	Описание:
		// 		Набор налогово по Сотруднику с периодом актуальности этого налога
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Взносы.Сотрудник		КАК Сотрудник,
		|	Взносы.Налог			КАК Налог,
		|	Взносы.Период			КАК ДатаНачала,
		|	МИНИМУМ (
		|       ВЫБОР	КОГДА НЕ Окончания.Актуальность		// это закрытие, значит надо закрыть предыдущим днем
		|					ТОГДА  НАЧАЛОПЕРИОДА(Окончания.Период, ДЕНЬ)
		|       		КОГДА Окончания.Актуальность //ЕСТЬ НЕ NULL		// это закрытие, значит надо закрыть предыдущим днем
		|					ТОГДА  ДОБАВИТЬКДАТЕ(Окончания.Период, ДЕНЬ,-1)
		|				ИНАЧЕ  РаботникиПомесячно.ДатаОкончания						// если не закрыто закрываем последней датой работника	
		|				КОНЕЦ
		|						)	КАК ДатаОкончания
		|
		|ПОМЕСТИТЬ ВТВзносы	
		|ИЗ РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК Взносы
		|			
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ( 			
		|	ВЫБРАТЬ
		|		РаботникиПоПериодам.Сотрудник КАК Сотрудник,
		|		МАКСИМУМ(РаботникиПоПериодам.ДатаОкончания) КАК ДатаОкончания
		|	ИЗ " + ТекстЗапросаВТРаботникиПоПериодам + "	КАК	РаботникиПоПериодам	
		|	СГРУППИРОВАТЬ ПО			
		|		РаботникиПоПериодам.Сотрудник
		|)КАК РаботникиПомесячно			
		|ПО 	Взносы.Сотрудник = РаботникиПомесячно.Сотрудник 			
		|	И	Взносы.Период <= РаботникиПомесячно.ДатаОкончания		
		|			
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК Окончания
		|ПО		Взносы.Сотрудник = Окончания.Сотрудник
		|	И	Взносы.Налог = Окончания.Налог
		////|	И	НЕ Взносы.Актуальность      // это условие позволит не видеть лишние записи
		|	И	Взносы.Период < Окончания.Период
		|			
		|ГДЕ	Взносы.Сотрудник в ( &парамСотрудники )
		|	И	Взносы.Актуальность
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Сотрудник,
		|	Взносы.Налог,
		|	Взносы.Период
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТВзносыРаботников = "ВТВзносы";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВзносы";
	
	//	ВТВзносыРаботников
	Если Истина Тогда
		//	Описание:
		// 		
		//
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Взносы.Сотрудник		КАК Сотрудник,
		|	Взносы.Налог			КАК Налог,
		|	Взносы.ДатаНачала		КАК ДатаНачала,
		|	МИНИМУМ(ВзносыОкончание.ДатаОкончания)	КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТВзносыРаботников	
		|ИЗ (			
		|	ВЫБРАТЬ
		|		ВзносыНачало.Сотрудник		КАК Сотрудник,
		|		ВзносыНачало.Налог			КАК Налог,
		|		ВзносыНачало.ДатаНачала		КАК ДатаНачала
		|	ИЗ ВТВзносы КАК ВзносыНачало
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносы КАК Предыдущий			
		|	ПО 		ВзносыНачало.Сотрудник = Предыдущий.Сотрудник 			
		|		И 	ВзносыНачало.Налог = Предыдущий.Налог 			
		|		И	ДОБАВИТЬКДАТЕ(ВзносыНачало.ДатаНачала, ДЕНЬ,-1) = Предыдущий.ДатаОкончания		
		|	ГДЕ	Предыдущий.Налог ЕСТЬ NULL
		|) КАК Взносы			
		|			
		|ЛЕВОЕ СОЕДИНЕНИЕ (			
		|	ВЫБРАТЬ
		|		ВзносыКонец.Сотрудник		КАК Сотрудник,
		|		ВзносыКонец.Налог			КАК Налог,
		|		ВзносыКонец.ДатаОкончания	КАК ДатаОкончания
		|	ИЗ ВТВзносы КАК ВзносыКонец
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносы КАК Следующий			
		|	ПО 	ВзносыКонец.Сотрудник = Следующий.Сотрудник 			
		|	И 	ВзносыКонец.Налог = Следующий.Налог 			
		|	И	ДОБАВИТЬКДАТЕ(ВзносыКонец.ДатаОкончания, ДЕНЬ,1) = Следующий.ДатаНачала		
		|	ГДЕ	Следующий.Налог ЕСТЬ NULL
		|) КАК ВзносыОкончание			
		|ПО 	Взносы.Сотрудник = ВзносыОкончание.Сотрудник 			
		|	И 	Взносы.Налог = ВзносыОкончание.Налог 			
		|	И 	Взносы.ДатаНачала <= ВзносыОкончание.ДатаОкончания 			
		|			
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Сотрудник,
		|	Взносы.Налог,
		|	Взносы.ДатаНачала
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТВзносыРаботников = "ВТВзносыРаботников";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВзносыРаботников";
	
	//	ВТПараметрыНалоговНачалоКонец
	Если Истина Тогда
		
		//	ВТДатаИзмененияПределВидРасчетаШкала
		Если Регистратор.Метаданные().Имя="НачислениеЗарплатыРаботникамОрганизаций" Тогда
			//	Описание:
			// 		СведенияОВзносахВФонды, ВидыРасчетовВзносовВФонды, ШкалаСтавокНалогов   
			//      тут получим даты изменения в таблицах (Периоды)
			//      эти таблички маленькие, потому никакими условиями их не ограничиваем
			//
			ТекстЗапроса = "
			|//--------------------------------------------------
			|// Если не СтавкаПоПериодуРегистрации - старый метод
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Налоги.Налог				КАК Налог,
			|	Налоги.Период				КАК Период
			|ПОМЕСТИТЬ ВТДатаИзмененияПределВидРасчетаШкала	
			|ИЗ РегистрСведений.СведенияОВзносахВФонды КАК Налоги
			|
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВидыРасч.Налог				КАК Налог,
			|	ВидыРасч.Период				КАК Период
			|ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды КАК ВидыРасч
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодРегистрации) КАК ВРВзносыВФонды
			|ПО ВидыРасч.Налог = ВРВзносыВФонды.Налог
			|ГДЕ НЕ ВРВзносыВФонды.ВидРасчета.СтавкаПоПериодуРегистрации 
			|
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ШкалаСтавокНалогов.Налог	КАК Налог,
			|	ШкалаСтавокНалогов.Период	КАК Период
			|ИЗ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавокНалогов
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодРегистрации) КАК ВРВзносыВФонды
			|ПО ШкалаСтавокНалогов.Налог = ВРВзносыВФонды.Налог
			|ГДЕ НЕ ВРВзносыВФонды.ВидРасчета.СтавкаПоПериодуРегистрации 
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТДатаИзмененияПределВидРасчетаШкала = "ВТДатаИзмененияПределВидРасчетаШкала";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДатаИзмененияПределВидРасчетаШкала";
		
		//	ВТНалогНачалоКонец
		Если Регистратор.Метаданные().Имя="НачислениеЗарплатыРаботникамОрганизаций" Тогда
			//	Описание:
			// 		Определить периоды когда параметры налога не изменялись: Налог (Начало, Конец)   
			//
			ТекстЗапроса = "
			|//--------------------------------------------------
			|// Если не СтавкаПоПериодуРегистрации - старый метод
			|ВЫБРАТЬ
			|	ДанныеОНалогах.Налог										КАК Налог,
			|	ДанныеОНалогах.Период										КАК ПериодНачало,
			|	МИНИМУМ( ДОБАВИТЬКДАТЕ( Окончание.Период, СЕКУНДА, -1 ) )	КАК ПериодКонец
			|ПОМЕСТИТЬ ВТНалогНачалоКонец	
			|ИЗ	" + ТекстЗапросаВТДатаИзмененияПределВидРасчетаШкала + " КАК ДанныеОНалогах
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДатаИзмененияПределВидРасчетаШкала + " КАК Окончание
			|ПО    Окончание.Налог = ДанныеОНалогах.Налог
			|	И	Окончание.Период > ДанныеОНалогах.Период
			|		
			|СГРУППИРОВАТЬ ПО
			|	ДанныеОНалогах.Налог,
			|	ДанныеОНалогах.Период
			|		
			|		
			|"; 
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТНалогНачалоКонец = "ВТНалогНачалоКонец";
		Иначе
			ТекстЗапроса = "
			|//--------------------------------------------------
			|// За месяц целиком
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеОНалогах.Налог	КАК Налог,
			|	НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)	КАК ПериодНачало,
			|	КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)		КАК ПериодКонец
			|ПОМЕСТИТЬ ВТНалогНачалоКонец	
			|ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодРегистрации) КАК ДанныеОНалогах
			|"; 
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТНалогНачалоКонец = "ВТНалогНачалоКонец";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНалогНачалоКонец";
		
		//	Описание:
		// 		Определить периоды когда параметры налогов не изменялись + сами параметры: 
		//		Налог+Параметры (Начало, Конец)   
		//
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НалогиПоПериодам.Налог			КАК Налог,
		|	НалогиПоПериодам.ПериодНачало	КАК ПериодНачало,
		|	НалогиПоПериодам.ПериодКонец	КАК ПериодКонец,    // тут может быть NULL
		|
		|	ДанныеОПределахВзносов.Предел	КАК Предел,
		|	ДанныеОПределахВзносов.МинимальнаяБаза	КАК МинимальнаяБаза,
		|
		|	ВидыРасчетов.ВидРасчета			КАК ВидРасчета,
		|	ВидыРасчетов.ВидРасчета.СпособРасчетаПоШкале КАК СпособРасчетаПоШкале,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаПоШкале.ПоШкале) КАК ПрогрессивнаяШкала,
		|
		|	ВЫБОР	КОГДА	ВидыРасчетов.ВидРасчета.СпособРасчетаПоШкале = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаПоШкале.ПоШкале) 
		|   			ТОГДА	NULL
		|   		ИНАЧЕ 		Шкала.НомерПорога 
		|   КОНЕЦ							КАК НомерПорога      // только для прогресивной шкалы
		|
		|ПОМЕСТИТЬ ВТПараметрыНалоговНачалоКонец	
		|ИЗ (
		|	ВЫБРАТЬ
		|		Налоги.Налог						КАК Налог,
		|		Налоги.ПериодНачало					КАК ПериодНачало,
		|		Налоги.ПериодКонец					КАК ПериодКонец,
		|		ШкалаПериодОрганизация.Организация	КАК Организация,
		|		МАКСИМУМ(Сведения.Период)			КАК ПериодПределВзносав,
		|		МАКСИМУМ(ВидыРасчетов.Период)		КАК ПериодВидРасчета,
		|		МАКСИМУМ(ШкалаПериодОрганизация.Период)	КАК ПериодШкалаСтавок
		|	ИЗ	" + ТекстЗапросаВТНалогНачалоКонец + " КАК Налоги
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВзносахВФонды КАК Сведения
		|	ПО		Налоги.Налог			=	Сведения.Налог
		|		И	(Налоги.ПериодКонец		>=	Сведения.Период 
		|		ИЛИ	Налоги.ПериодКонец		Есть NULL)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасчетовВзносовВФонды КАК ВидыРасчетов
		|	ПО		Налоги.Налог			=	ВидыРасчетов.Налог
		|		И	(Налоги.ПериодКонец		>=	ВидыРасчетов.Период 
		|		ИЛИ	Налоги.ПериодКонец		Есть NULL)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ (
		|		ВЫБРАТЬ 
		|			ШкалаСтавок.Налог	КАК Налог,
		|			ШкалаСтавок.Период	КАК Период,
		|			МАКСИМУМ(ШкалаСтавок.Организация)	КАК Организация
		|		ИЗ (
		|			ВЫБРАТЬ 
		|				ШкалаСтавокНалогов.Налог			КАК Налог,
		|				МАКСИМУМ(ШкалаСтавокНалогов.Период)	КАК Период
		|			ИЗ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавокНалогов
		|			ГДЕ		ШкалаСтавокНалогов.Период  <= КОНЕЦПЕРИОДА( &ПериодРегистрации )
		|				И	(ШкалаСтавокНалогов.Организация = (&парамОрганизация) ИЛИ ШкалаСтавокНалогов.Организация =  ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|			СГРУППИРОВАТЬ ПО
		|				ШкалаСтавокНалогов.Налог
		|		) КАК ШкалаСтавокПериод
		|					   	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавок	
		|		ПО		ШкалаСтавокПериод.Налог = ШкалаСтавок.Налог	   	
		|			И	ШкалаСтавокПериод.Период = ШкалаСтавок.Период
		|			И	(ШкалаСтавок.Организация = (&парамОрганизация) ИЛИ ШкалаСтавок.Организация =  ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|							
		|		СГРУППИРОВАТЬ ПО
		|			ШкалаСтавок.Налог,
		|			ШкалаСтавок.Период
		|	) КАК ШкалаПериодОрганизация
		|	ПО		Налоги.Налог = ШкалаПериодОрганизация.Налог
		|		И	(Налоги.ПериодКонец >=	ШкалаПериодОрганизация.Период 
		|		ИЛИ	Налоги.ПериодКонец Есть NULL)
		|
		|	СГРУППИРОВАТЬ ПО
		|		Налоги.Налог,
		|		Налоги.ПериодНачало,
		|		Налоги.ПериодКонец,
		|		ШкалаПериодОрганизация.Организация
	    |) КАК НалогиПоПериодам
	    |
	    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВзносахВФонды КАК ДанныеОПределахВзносов
	    |ПО		НалогиПоПериодам.Налог					= ДанныеОПределахВзносов.Налог
	    |	И	НалогиПоПериодам.ПериодПределВзносав	= ДанныеОПределахВзносов.Период 
	    |
	    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасчетовВзносовВФонды КАК ВидыРасчетов
	    |ПО		НалогиПоПериодам.Налог				= ВидыРасчетов.Налог
	    |	И	НалогиПоПериодам.ПериодВидРасчета	= ВидыРасчетов.Период 
	    |
	    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК Шкала
	    |ПО		НалогиПоПериодам.Налог				= Шкала.Налог
	    |	И	НалогиПоПериодам.ПериодШкалаСтавок	= Шкала.Период 
		|	И	НалогиПоПериодам.Организация =  Шкала.Организация
	    |
	    |
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТВТПараметрыНалоговНачалоКонец = "ВТПараметрыНалоговНачалоКонец";
		
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПараметрыНалоговНачалоКонец";
	
	//	ВТОсновная
	Если Истина Тогда
		//	Описание:
		// 		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Истина			КАК Авторасчет,
		|	РаботникиПоПериодам.Сотрудник			КАК Сотрудник,
		|	РаботникиПоПериодам.ДатаНачала 			КАК БазовыйПериодНачало,
		|	РаботникиПоПериодам.ДатаОкончания 		КАК БазовыйПериодКонец,
		|	ВзносыРаботников.Налог					КАК Налог,
		|
		|	ПараметрыНалогов.ВидРасчета				КАК ВидРасчета,
		|	ПараметрыНалогов.НомерПорога			КАК НомерПорога,
		|	ПараметрыНалогов.Предел					КАК Предел,
		|
		|	ПараметрыНалогов.МинимальнаяБаза		КАК МинимальнаяБаза,
		|
		|	ВЫБОР	КОГДА		РаботникиПоПериодам.ДатаНачала >= ВзносыРаботников.ДатаНачала		
		|					И	РаботникиПоПериодам.ДатаНачала >= ПараметрыНалогов.ПериодНачало
		|				ТОГДА	РаботникиПоПериодам.ДатаНачала
		|			КОГДА		ВзносыРаботников.ДатаНачала >= РаботникиПоПериодам.ДатаНачала		
		|					И	ВзносыРаботников.ДатаНачала >= ПараметрыНалогов.ПериодНачало
		|				ТОГДА	ВзносыРаботников.ДатаНачала
		|			КОГДА		ПараметрыНалогов.ПериодНачало >= РаботникиПоПериодам.ДатаНачала	
		|					И	ПараметрыНалогов.ПериодНачало >= ВзносыРаботников.ДатаНачала
		|				ТОГДА	ПараметрыНалогов.ПериодНачало
		|	КОНЕЦ										КАК ДатаНачала,
		|
		|	ВЫБОР	КОГДА		РаботникиПоПериодам.ДатаОкончания <= ВзносыРаботников.ДатаОкончания		
		|					И	(РаботникиПоПериодам.ДатаОкончания <= ПараметрыНалогов.ПериодКонец	ИЛИ ПараметрыНалогов.ПериодКонец ЕСТЬ NULL )
		|				ТОГДА	РаботникиПоПериодам.ДатаОкончания
		|			КОГДА		ВзносыРаботников.ДатаОкончания <= РаботникиПоПериодам.ДатаОкончания		
		|					И	(ВзносыРаботников.ДатаОкончания <= ПараметрыНалогов.ПериодКонец	ИЛИ ПараметрыНалогов.ПериодКонец ЕСТЬ NULL )
		|				ТОГДА	ВзносыРаботников.ДатаОкончания
		|			КОГДА		ПараметрыНалогов.ПериодКонец <= РаботникиПоПериодам.ДатаОкончания	
		|					И	ПараметрыНалогов.ПериодКонец <= ВзносыРаботников.ДатаОкончания
		|				ТОГДА	ПараметрыНалогов.ПериодКонец
		|	КОНЕЦ										КАК ДатаОкончания,
		|
		|	ВзносыРаботников.ДатаНачала		КАК ВзносыРаботниковДатаНачала,
		|	ВзносыРаботников.ДатаОкончания	КАК ВзносыРаботниковДатаОкончания,
		|	ПараметрыНалогов.ПериодНачало   КАК ПараметрыНалоговПериодНачало,
		|	ПараметрыНалогов.ПериодКонец	КАК ПараметрыНалоговПериодКонец
		|
		|ПОМЕСТИТЬ ВТОсновная	
		|ИЗ	" + ТекстЗапросаВТРаботникиПоПериодам + " КАК РаботникиПоПериодам
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТВзносыРаботников + " КАК ВзносыРаботников
		|ПО		РаботникиПоПериодам.Сотрудник =	ВзносыРаботников.Сотрудник
		|	И ( РаботникиПоПериодам.ДатаНачала <=	ВзносыРаботников.ДатаОкончания ИЛИ	ВзносыРаботников.ДатаОкончания ЕСТЬ NULL )
		|	И	ВзносыРаботников.ДатаНачала <= РаботникиПоПериодам.ДатаОкончания 
		|	            
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТВТПараметрыНалоговНачалоКонец + " КАК ПараметрыНалогов
		|	ПО	ВзносыРаботников.Налог = ПараметрыНалогов.Налог
		|	И ( РаботникиПоПериодам.ДатаНачала <= ПараметрыНалогов.ПериодКонец	ИЛИ	ПараметрыНалогов.ПериодКонец ЕСТЬ NULL )
		|	И	ПараметрыНалогов.ПериодНачало <= РаботникиПоПериодам.ДатаОкончания 
		|	И ( ВзносыРаботников.ДатаНачала <= ПараметрыНалогов.ПериодКонец	ИЛИ	ПараметрыНалогов.ПериодКонец ЕСТЬ NULL )
		|	И ( ПараметрыНалогов.ПериодНачало <= ВзносыРаботников.ДатаОкончания ИЛИ	ВзносыРаботников.ДатаОкончания ЕСТЬ NULL)
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТВзносыРаботников = "ВТОсновная";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОсновная";
	
	
	НужноРасчитыватьКоэффициент = Ложь;
	ЭтоНачислениеЗП = Ложь;

	Если Регистратор.Метаданные().Имя = "НачислениеЗарплатыРаботникамОрганизаций" Тогда
        // проверим есть ли в таблице несоответствие базового периода и периода изменения ставки
		// если есть, то надо будет провести еще расчет коэффициента
		//
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Основной.Сотрудник,
		|	Основной.БазовыйПериодНачало,
		|	Основной.БазовыйПериодКонец,
		|	Основной.Налог,
		|	Основной.ВидРасчета,
		|	Основной.НомерПорога,
		|	Основной.Предел,
		|	Основной.МинимальнаяБаза,
		|	Основной.ДатаНачала,
		|	Основной.ДатаОкончания
		|ИЗ	ВТОсновная КАК Основной
		|
		|ГДЕ Основной.БазовыйПериодНачало <> Основной.ДатаНачала	            
		|	 ИЛИ Основной.БазовыйПериодКонец <> Основной.ДатаОкончания           
		|";
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НужноРасчитыватьКоэффициент = Истина;
		КонецЕсли;
		ЭтоНачислениеЗП = Истина;	
	КонецЕсли;
	
	//Проверим, если в периоде регистрации неоплаченные больничные
	Если Регистратор.Метаданные().Имя = "НачислениеЗарплатыРаботникамОрганизаций" Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Основной.Сотрудник,
		|	Основной.ПериодРегистрации
		|ПОМЕСТИТЬ ВТНеоплаченныеБольничные
		|ИЗ	РегистрРасчета.Начисления КАК Основной
		|
		|ГДЕ Основной.ПериодРегистрации = &ПериодРегистрации	            
		|	 И Основной.ПериодДействия = &ПериодРегистрации
		|	 И Основной.Назначение В (&парамСотрудники)
		|	 И Основной.ВидРасчета.ЭтоБольничные
		|	 И Основной.Результат = 0
		|";
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ 
		|	NULL  КАК Сотрудник,
		|	NULL  КАК ПериодРегистрации
		|ПОМЕСТИТЬ ВТНеоплаченныеБольничные
		|";
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
	КонецЕсли;	
    Запрос.УстановитьПараметр("ПрименятьМинБазу", ЭтоНачислениеЗП И мПериодРегистрации >= ДатаИзмененияЕСВ1573());
	
	Если НужноРасчитыватьКоэффициент Тогда
		
		// ВТНорма	
		Если Истина Тогда
			//	Описание:
			// 		Норма времени по периодам минус норма времени невыходов 
			//		Невыходы - виды расчеты, которые виляют на расчет времени и не включены в базу взноса
			//		Например больничный для безработицы это невыход, но для пенсионного вкрлючается в норму отработанного времени для получения пропорции
			//
			ТекстЗапроса = "
			|ВЫБРАТЬ 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ДатаНачалаСтавки, 
			|	Основной.ДатаОкончанияСтавки, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания,
			|	СУММА(НормыПоГрафику.ОсновноеЗначение) КАК Дней
			|ПОМЕСТИТЬ ВТНорма	
			|ИЗ (
			|	ВЫБРАТЬ 
			|		Основной.Сотрудник					Как Сотрудник, 
			|		Основной.ВидРасчета					Как ВидРасчета, 
			|		Основной.БазовыйПериодНачало		Как БазовыйПериодНачало, 
			|		Основной.БазовыйПериодКонец			Как БазовыйПериодКонец, 
			|		Основной.ДатаНачала					Как ДатаНачалаСтавки, 
			|		Основной.ДатаОкончания				Как ДатаОкончанияСтавки, 
			|		ГрафикРаботника.ГрафикРаботы		Как ГрафикРаботы,
			|		ВЫБОР КОГДА Работники.ДатаНачала <= Основной.ДатаНачала ТОГДА Основной.ДатаНачала ИНАЧЕ Работники.ДатаНачала КОНЕЦ	Как ДатаНачала, 
			|		ВЫБОР КОГДА Работники.ДатаОкончания ЕСТЬ NULL ИЛИ Основной.ДатаОкончания <= Работники.ДатаОкончания ТОГДА Основной.ДатаОкончания ИНАЧЕ Работники.ДатаОкончания КОНЕЦ	Как ДатаОкончания 
			|		ИЗ ВТОсновная Как Основной
			|
			|		// если график менялся в середине месяца
			|		ЛЕВОЕ СОЕДИНЕНИЕ (
			|			ВЫБРАТЬ 
			|				РаботникиОрганизаций.Сотрудник,
			|				РаботникиОрганизаций.Период КАК ДатаНачала,
			|				МИНИМУМ(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций1.Период,День,-1)) КАК ДатаОкончания
			|			ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций1
			|			ПО	РаботникиОрганизаций1.ЗанимаемыхСтавок > 0
			|			И	РаботникиОрганизаций1.Сотрудник = РаботникиОрганизаций.Сотрудник
			|			И	РаботникиОрганизаций.Период < РаботникиОрганизаций1.Период
			|			ГДЕ	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
			|			СГРУППИРОВАТЬ ПО 
			|				РаботникиОрганизаций.Сотрудник,
			|				РаботникиОрганизаций.Период
			|		)КАК Работники
			|		ПО		Основной.Сотрудник	= Работники.Сотрудник 
			|			И	Работники.ДатаНачала <= Основной.ДатаОкончания
			|			И	(Основной.ДатаНачала <= Работники.ДатаОкончания ИЛИ Работники.ДатаОкончания ЕСТЬ NULL)
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ГрафикРаботника
			|		ПО		Основной.Сотрудник	= ГрафикРаботника.Сотрудник 
			|			И	Работники.ДатаНачала = ГрафикРаботника.Период
			|
			|		ГДЕ Основной.БазовыйПериодНачало <> Основной.ДатаНачала
			|		ИЛИ Основной.БазовыйПериодКонец <> Основной.ДатаОкончания
			|) КАК Основной 
			|
			|// График работы
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК НормыПоГрафику
			|ПО		Основной.ГрафикРаботы	= НормыПоГрафику.ГрафикРаботы 
			|	И	Основной.ДатаНачала <= НормыПоГрафику.Дата
			|	И	Основной.ДатаОкончания >= НормыПоГрафику.Дата
			|	И	НормыПоГрафику.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|
			|СГРУППИРОВАТЬ ПО 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ДатаНачалаСтавки, 
			|	Основной.ДатаОкончанияСтавки, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания
			|
			|
			|// невыходы нормы с отрицательными значениями
			|ОБЪЕДИНИТЬ ВСЕ			
			|ВЫБРАТЬ 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ДатаНачалаСтавки, 
			|	Основной.ДатаОкончанияСтавки, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания,
			|	СУММА(- НормыПоГрафику.ОсновноеЗначение) КАК Дней
			|
			|ИЗ (
			|ВЫБРАТЬ 
			|	Основной.Сотрудник					Как Сотрудник, 
			|	Основной.ВидРасчета					Как ВидРасчета, 
			|	Основной.БазовыйПериодНачало		Как БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец			Как БазовыйПериодКонец, 
			|	Основной.ДатаНачала					Как ДатаНачалаСтавки, 
			|	Основной.ДатаОкончания				Как ДатаОкончанияСтавки, 
			|	БазаИзНачислений.ГрафикРаботы		Как ГрафикРаботы, 
			|	БазаИзНачислений.ВидРасчета			Как ВидРасчета1, 
			|	ВЫБОР КОГДА Основной.ДатаНачала	<= БазаИзНачислений.ПериодДействияНачало 
			|			ТОГДА БазаИзНачислений.ПериодДействияНачало 
			|			ИНАЧЕ Основной.ДатаНачала 
			|	КОНЕЦ		Как ДатаНачала, 
			|	ВЫБОР КОГДА Основной.ДатаОкончания <= БазаИзНачислений.ПериодДействияКонец 
			|		ТОГДА Основной.ДатаОкончания 
			|		ИНАЧЕ БазаИзНачислений.ПериодДействияКонец 
			|	КОНЕЦ	Как ДатаОкончания 
			|
			|ИЗ ВТОсновная Как Основной
			|
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика() КАК БазаИзНачислений
			|ПО		Основной.Сотрудник	= БазаИзНачислений.Назначение 
			|	И	БазаИзНачислений.ПериодДействияНачало <= Основной.ДатаОкончания
			|	И	Основной.ДатаНачала <= БазаИзНачислений.ПериодДействияКонец
			|	И	БазаИзНачислений.ПериодРегистрации <= &ПериодРегистрации
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|	И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|
			|ГДЕ	БазовыеВидыРасчета.ВидРасчета ЕСТЬ NULL
			|	И	БазаИзНачислений.ВидРасчета.ЗачетНормыВремени
			|	И	(Основной.БазовыйПериодНачало <> Основной.ДатаНачала
			|	ИЛИ Основной.БазовыйПериодКонец <> Основной.ДатаОкончания)
			|
			|) КАК Основной 
			|
			|// График работы
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК НормыПоГрафику
			|ПО		Основной.ГрафикРаботы	= НормыПоГрафику.ГрафикРаботы 
			|	И	Основной.ДатаНачала <= НормыПоГрафику.Дата
			|	И	Основной.ДатаОкончания >= НормыПоГрафику.Дата
			|	И	НормыПоГрафику.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|
			|СГРУППИРОВАТЬ ПО 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ДатаНачалаСтавки, 
			|	Основной.ДатаОкончанияСтавки, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНорма";
		
		// ВТПолнаяНорма	
		Если Истина Тогда
			//	Описание:
			// 		Норма времени по периодам минус норма времени невыходов 
			//		Невыходы - виды расчеты, которые виляют на расчет времени и не включены в базу взноса
			//		Например больничный для безработицы это невыход, но для пенсионного вкрлючается в норму отработанного времени для получения пропорции
			//
			ТекстЗапроса = "
			|ВЫБРАТЬ 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания,
			|	СУММА(НормыПоГрафику.ОсновноеЗначение) КАК Дней
			|ПОМЕСТИТЬ ВТПолнаяНорма	
			|ИЗ (
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ 
			|		Основной.Сотрудник					Как Сотрудник, 
			|		Основной.ВидРасчета					Как ВидРасчета, 
			|		Основной.БазовыйПериодНачало		Как БазовыйПериодНачало, 
			|		Основной.БазовыйПериодКонец			Как БазовыйПериодКонец, 
			|		ГрафикРаботника.ГрафикРаботы		Как ГрафикРаботы,
			|		ВЫБОР КОГДА Работники.ДатаНачала <= Основной.БазовыйПериодНачало ТОГДА Основной.БазовыйПериодНачало ИНАЧЕ Работники.ДатаНачала КОНЕЦ	Как ДатаНачала, 
			|		ВЫБОР КОГДА Работники.ДатаОкончания ЕСТЬ NULL ИЛИ Основной.БазовыйПериодКонец <= Работники.ДатаОкончания ТОГДА Основной.БазовыйПериодКонец ИНАЧЕ Работники.ДатаОкончания КОНЕЦ	Как ДатаОкончания 
			|		ИЗ ВТОсновная Как Основной
			|
			|		// если график менялся в середине месяца
			|		ЛЕВОЕ СОЕДИНЕНИЕ (
			|			ВЫБРАТЬ 
			|				РаботникиОрганизаций.Сотрудник,
			|				РаботникиОрганизаций.Период КАК ДатаНачала,
			|				МИНИМУМ(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций1.Период,День,-1)) КАК ДатаОкончания
			|			ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций1
			|			ПО	РаботникиОрганизаций1.ЗанимаемыхСтавок > 0
			|			И	РаботникиОрганизаций1.Сотрудник = РаботникиОрганизаций.Сотрудник
			|			И	РаботникиОрганизаций.Период < РаботникиОрганизаций1.Период
			|			ГДЕ	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
			|			СГРУППИРОВАТЬ ПО 
			|				РаботникиОрганизаций.Сотрудник,
			|				РаботникиОрганизаций.Период
			|		)КАК Работники
			|		ПО		Основной.Сотрудник	= Работники.Сотрудник 
			|			И	Работники.ДатаНачала <= Основной.БазовыйПериодКонец
			|			И	(Основной.БазовыйПериодНачало <= Работники.ДатаОкончания ИЛИ Работники.ДатаОкончания ЕСТЬ NULL)
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ГрафикРаботника
			|		ПО		Основной.Сотрудник	= ГрафикРаботника.Сотрудник 
			|			И	Работники.ДатаНачала = ГрафикРаботника.Период
			|
			|) КАК Основной 
			|
			|// График работы
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК НормыПоГрафику
			|ПО		Основной.ГрафикРаботы	= НормыПоГрафику.ГрафикРаботы 
			|	И	Основной.ДатаНачала <= НормыПоГрафику.Дата
			|	И	Основной.ДатаОкончания >= НормыПоГрафику.Дата
			|	И	НормыПоГрафику.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|
			|СГРУППИРОВАТЬ ПО 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания
			|
			|
			|// невыходы нормы с отрицательными значениями
			|ОБЪЕДИНИТЬ ВСЕ			
			|ВЫБРАТЬ 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания,
			|	СУММА( - НормыПоГрафику.ОсновноеЗначение) КАК Дней
			|
			|ИЗ (
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Основной.Сотрудник					Как Сотрудник, 
			|	Основной.ВидРасчета					Как ВидРасчета, 
			|	Основной.БазовыйПериодНачало		Как БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец			Как БазовыйПериодКонец, 
			|	БазаИзНачислений.ГрафикРаботы		Как ГрафикРаботы, 
			|	БазаИзНачислений.ВидРасчета			Как ВидРасчета1, 
			|	ВЫБОР КОГДА Основной.БазовыйПериодНачало	<= БазаИзНачислений.ПериодДействияНачало 
			|			ТОГДА БазаИзНачислений.ПериодДействияНачало 
			|			ИНАЧЕ Основной.БазовыйПериодНачало 
			|	КОНЕЦ		Как ДатаНачала, 
			|	ВЫБОР КОГДА Основной.БазовыйПериодКонец <= БазаИзНачислений.ПериодДействияКонец 
			|		ТОГДА Основной.БазовыйПериодКонец 
			|		ИНАЧЕ БазаИзНачислений.ПериодДействияКонец 
			|	КОНЕЦ	Как ДатаОкончания 
			|
			|ИЗ ВТОсновная Как Основной
			|
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика() КАК БазаИзНачислений
			|ПО		Основной.Сотрудник	= БазаИзНачислений.Назначение 
			|	И	БазаИзНачислений.ПериодДействияНачало <= Основной.БазовыйПериодКонец
			|	И	Основной.БазовыйПериодНачало <= БазаИзНачислений.ПериодДействияКонец
			|	И	БазаИзНачислений.ПериодРегистрации <= &ПериодРегистрации
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|	И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|
			|ГДЕ	БазовыеВидыРасчета.ВидРасчета ЕСТЬ NULL
			|	И	БазаИзНачислений.ВидРасчета.ЗачетНормыВремени
			|
			|) КАК Основной 
			|
			|// График работы
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК НормыПоГрафику
			|ПО		Основной.ГрафикРаботы	= НормыПоГрафику.ГрафикРаботы 
			|	И	Основной.ДатаНачала <= НормыПоГрафику.Дата
			|	И	Основной.ДатаОкончания >= НормыПоГрафику.Дата
			|	И	НормыПоГрафику.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|
			|СГРУППИРОВАТЬ ПО 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ГрафикРаботы,
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПолнаяНорма";

		// ВТНормаВремени	
		Если Истина Тогда
			//	Описание:
			// 		Получаем реквизиты Дней и ДнейВсего, для расчета пропорции по норме времени при изменении ставки
			//
			ТекстЗапроса = "
			|ВЫБРАТЬ 
			|	Основной.Сотрудник, 
			|	Основной.ВидРасчета, 
			|	Основной.БазовыйПериодНачало, 
			|	Основной.БазовыйПериодКонец, 
			|	Основной.ДатаНачала, 
			|	Основной.ДатаОкончания, 
			|	Основной.Дней КАК Дней,
			|	СуммаОсновной.Дней КАК ДнейВсего
			|ПОМЕСТИТЬ ВТНормаВремени	
			|ИЗ ( 
			|	ВЫБРАТЬ 
			|		Норма.Сотрудник, 
			|		Норма.ВидРасчета, 
			|		Норма.БазовыйПериодНачало, 
			|		Норма.БазовыйПериодКонец, 
			|		Норма.ДатаНачалаСтавки		КАК ДатаНачала, 
			|		Норма.ДатаОкончанияСтавки	КАК ДатаОкончания, 
			|		СУММА(Норма.Дней) КАК Дней
			|		ИЗ ВТНорма Как Норма
			|	СГРУППИРОВАТЬ ПО 
			|		Норма.Сотрудник, 
			|		Норма.ВидРасчета, 
			|		Норма.БазовыйПериодНачало, 
			|		Норма.БазовыйПериодКонец, 
			|		Норма.ДатаНачалаСтавки, 
			|		Норма.ДатаОкончанияСтавки 
			|) КАК Основной 
			| 
			|ЛЕВОЕ СОЕДИНЕНИЕ ( 
			|	ВЫБРАТЬ 
			|		Норма.Сотрудник, 
			|		Норма.ВидРасчета, 
			|		Норма.БазовыйПериодНачало, 
			|		Норма.БазовыйПериодКонец, 
			|		СУММА(Норма.Дней) КАК Дней
			|		ИЗ ВТПолнаяНорма Как Норма
			|	СГРУППИРОВАТЬ ПО 
			|		Норма.Сотрудник, 
			|		Норма.ВидРасчета, 
			|		Норма.БазовыйПериодНачало, 
			|		Норма.БазовыйПериодКонец 
			|) КАК СуммаОсновной 
			|ПО   СуммаОсновной.Сотрудник = Основной.Сотрудник 
			|	И	СуммаОсновной.ВидРасчета = Основной.ВидРасчета 
			|	И	СуммаОсновной.БазовыйПериодНачало = Основной.БазовыйПериодНачало 
			|	И	СуммаОсновной.БазовыйПериодКонец = Основной.БазовыйПериодКонец  
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНормаВремени";
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Основной.Авторасчет,
		|	Основной.Сотрудник,
		|	Основной.БазовыйПериодНачало,
		|	Основной.БазовыйПериодКонец,
		|	Основной.Налог,
		|	Основной.ВидРасчета,
		|	Основной.НомерПорога,
		|	Основной.Предел,
		|	ВЫБОР
		|	 КОГДА НЕ &ПрименятьМинБазу
		|	  ТОГДА 0
		|	 КОГДА Основной.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
		|	  ТОГДА 0
		|	 КОГДА ЕСТЬNULL(РаботникиОрганизацийНаНачалоПериода.ЗанимаемыхСтавок,0) = 0
		|	   ИЛИ ЕСТЬNULL(РаботникиОрганизацийНаКонецПериода.ЗанимаемыхСтавок,0) = 0
		|	  ТОГДА 0
        |	 КОГДА НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) > &ПериодРегистрации
		|	  ТОГДА 0
		|	 КОГДА НЕ (НеоплаченныеБольничные.Сотрудник ЕСТЬ NULL)
        |	  ТОГДА 0
		|	 ИНАЧЕ Основной.МинимальнаяБаза
		|	КОНЕЦ КАК МинимальнаяБаза,
		|	Основной.ДатаНачала,
		|	Основной.ДатаОкончания,
		|	НормаВремени.Дней КАК ОтработаноДней,
		|	НормаВремени.ДнейВсего КАК ОтработаноДнейВсего
		|ИЗ	ВТОсновная КАК Основной
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремени КАК НормаВремени
		|ПО		Основной.Сотрудник = НормаВремени.Сотрудник
		|	И	Основной.ВидРасчета = НормаВремени.ВидРасчета 
		|	И	Основной.БазовыйПериодНачало = НормаВремени.БазовыйПериодНачало 
		|	И	Основной.БазовыйПериодКонец = НормаВремени.БазовыйПериодКонец 
		|	И	Основной.ДатаНачала = НормаВремени.ДатаНачала 
		|	И	Основной.ДатаОкончания = НормаВремени.ДатаОкончания 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(НАЧАЛОПЕРИОДА(&ПериодРегистрации,МЕСЯЦ), Организация = &парамОрганизация и Сотрудник В (&парамСотрудники)) 
		|	КАК РаботникиОрганизацийНаНачалоПериода
		|ПО		Основной.Сотрудник = РаботникиОрганизацийНаНачалоПериода.Сотрудник
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРегистрации,МЕСЯЦ), Организация = &парамОрганизация и Сотрудник В (&парамСотрудники)) 
		|	КАК РаботникиОрганизацийНаКонецПериода
		|ПО		Основной.Сотрудник = РаботникиОрганизацийНаКонецПериода.Сотрудник
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТНеоплаченныеБольничные КАК НеоплаченныеБольничные
		|ПО	Основной.Сотрудник = НеоплаченныеБольничные.Сотрудник
		|   И НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) = НеоплаченныеБольничные.ПериодРегистрации
		|	            
		|	            
		|УПОРЯДОЧИТЬ ПО	            
		|	Основной.Сотрудник,            
		|	НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ),            
		|	Основной.Налог,            
		|	Основной.БазовыйПериодНачало,            
		|	Основной.ДатаНачала,            
		|	НомерПорога.Порядок           
		|";
		Запрос.Текст = ТекстЗапроса;
		
	Иначе	
		
		// точно не надо получать данные графиков в середине месяца
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Основной.Авторасчет,
		|	Основной.Сотрудник,
		|	Основной.ДатаНачала	КАК ПериодВзаиморасчетов,
		|	Основной.БазовыйПериодНачало,
		|	Основной.БазовыйПериодКонец,
		|	Основной.Налог,
		|	Основной.ВидРасчета,
		|	Основной.НомерПорога,
		|	Основной.Предел,
		|	ВЫБОР
		|	 КОГДА НЕ &ПрименятьМинБазу
		|	  ТОГДА 0
		|	 КОГДА Основной.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
		|	  ТОГДА 0
		|	 КОГДА ЕСТЬNULL(РаботникиОрганизацийНаНачалоПериода.ЗанимаемыхСтавок,0) = 0
		|	   ИЛИ ЕСТЬNULL(РаботникиОрганизацийНаКонецПериода.ЗанимаемыхСтавок,0) = 0
		|	  ТОГДА 0
        |	 КОГДА НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) > &ПериодРегистрации
		|	  ТОГДА 0
		|	 КОГДА НЕ (НеоплаченныеБольничные.Сотрудник ЕСТЬ NULL)
        |	  ТОГДА 0
		|	 ИНАЧЕ Основной.МинимальнаяБаза
		|	КОНЕЦ КАК МинимальнаяБаза,
		|	Основной.ДатаНачала,
		|	Основной.ДатаОкончания
		|ИЗ	ВТОсновная КАК Основной
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(НАЧАЛОПЕРИОДА(&ПериодРегистрации,МЕСЯЦ), Организация = &парамОрганизация и Сотрудник В (&парамСотрудники)) 
		|	КАК РаботникиОрганизацийНаНачалоПериода
		|ПО		Основной.Сотрудник = РаботникиОрганизацийНаНачалоПериода.Сотрудник
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРегистрации,МЕСЯЦ), Организация = &парамОрганизация и Сотрудник В (&парамСотрудники)) 
		|	КАК РаботникиОрганизацийНаКонецПериода
		|ПО		Основной.Сотрудник = РаботникиОрганизацийНаКонецПериода.Сотрудник
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТНеоплаченныеБольничные КАК НеоплаченныеБольничные
		|ПО	Основной.Сотрудник = НеоплаченныеБольничные.Сотрудник
		|   И НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) = НеоплаченныеБольничные.ПериодРегистрации
		|	            
		|УПОРЯДОЧИТЬ ПО	            
		|	Основной.Сотрудник,            
		|	НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ),            
		|	Основной.Налог,            
		|	Основной.БазовыйПериодНачало,            
		|	Основной.ДатаНачала,            
		|	НомерПорога.Порядок           
		|";
		Запрос.Текст = ТекстЗапроса;
		
	КонецЕсли;
	
	
	ВыборкаВзносы = Запрос.Выполнить().Выбрать();
	Если ЭтоВзносы Тогда
		СпособВзносы = Перечисления.СпособыРасчетаОплатыТруда.Взносы;
	Иначе
		СпособВзносы = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ;
	КонецЕсли;

	Пока ВыборкаВзносы.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаВзносы.ВидРасчета) Тогда
			Продолжить;
		ИначеЕсли ВыборкаВзносы.ВидРасчета.СпособРасчета <> СпособВзносы Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Взносы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВзносы);
		ОпределитьКодКатегорииЗЛ(НоваяСтрока, Регистратор);
		ОпределитьТипНачисления(НоваяСтрока, Регистратор);
		
	КонецЦикла;

КонецПроцедуры // АвтозаполнениеВзносы

Процедура АвтозаполнениеНДФЛ( Регистратор, НДФЛ, Сотрудники, ПоРегистратору = Ложь, СНачалаГода = Ложь, ГодЗаполнения = 0 ) Экспорт
	
	Если СНачалаГода Тогда
		мПериодРегистрации = Мин(Регистратор.ПериодРегистрации, Дата(ГодЗаполнения,12,1));
	ИначеЕсли Регистратор.Метаданные().реквизиты.Найти("ПерерассчитываемыйДокумент")= Неопределено  Тогда
		мПериодРегистрации = Регистратор.ПериодРегистрации;
	Иначе
		мПериодРегистрации = ?(ЗначениеЗаполнено(Регистратор.ПерерассчитываемыйДокумент), Регистратор.ПерерассчитываемыйДокумент.ПериодРегистрации, Регистратор.ПериодРегистрации);
	КонецЕсли;
	
	РегистраторЗКВ = (ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций"));
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамРегистратор" , Регистратор);
	Запрос.УстановитьПараметр("парамОрганизация" , Регистратор.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", мПериодРегистрации);
	Запрос.УстановитьПараметр("парамСотрудники"  , Сотрудники);
	
	// парамНачало - парамКонец 
	Если СНачалаГода Тогда
		
		Запрос.УстановитьПараметр("парамНачало" , НачалоГода(мПериодРегистрации) );
		Запрос.УстановитьПараметр("парамКонец"  , КонецМесяца(мПериодРегистрации) );
		
	Иначе
		
		Запрос.УстановитьПараметр("парамНачало" , мПериодРегистрации);
		Запрос.УстановитьПараметр("парамКонец"  , КонецМесяца(мПериодРегистрации));
	
	КонецЕсли;
	
	ИспользуетсяНК = ИспользуетсяНК(Регистратор.ПериодРегистрации);
	ВариантНДФЛ = ВариантыАлгоритмовРасчетаЗарплаты().РасчетНДФЛ17;
	
	// ВТРаботникиПоПериодам
	Если Истина Тогда
		Запрос.УстановитьПараметр("СписокДекретныеПоЕСВ",СписокДекретныеПоЕСВ());
		Если ИспользуетсяНК Тогда
			ТекстНП = "ВЫБОР КОГДА Начисления.ВидРасчета.ЭтоБольничные //Больничные
					|		ИЛИ (Начисления.ВидРасчета.ЭтоОтпускные И НЕ Начисления.Сторно) //Отпускные
					|		ИЛИ  Начисления.ВидРасчета В (&СписокДекретныеПоЕСВ) //Декретные
					|		ТОГДА Начисления.ПериодДействия
					|		ИНАЧЕ Начисления.ПериодРегистрации
					|		КОНЕЦ";
		Иначе
			ТекстНП = "Начисления.ПериодДействия";
		КонецЕсли;	
		
		//	Описание:
		// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Начисления.Сотрудник            			КАК Сотрудник,		// сотрудник определяет организацию, потому условие на организацию не требуется
		|		Начисления.ВидРасчета.ДоходНДФЛ				КАК ДоходНДФЛ,
		|		"+ТекстНП+"	КАК ПериодДействия,
		|		"+?(ИспользуетсяНК И (ВариантНДФЛ=Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы),"МИНИМУМ(Начисления.Регистратор.Дата)		КАК ДатаДействия,","")+"
		|		МИНИМУМ(Начисления.ПериодДействияНачало)	КАК ДатаНачала,		// если принят на работу то это будет дата приема
		|		МАКСИМУМ(Начисления.ПериодДействияКонец)	КАК ДатаОкончания	// если уволился то это будет дата увольнения
		|
		|ПОМЕСТИТЬ ВТРаботникиПоПериодам	
		|	ИЗ	РегистрРасчета.Начисления КАК Начисления
		|		ГДЕ	Начисления.ПериодРегистрации <= &парамКонец
		|		И	Начисления.ПериодРегистрации >= &парамНачало
		|		И	Начисления.Сотрудник в ( &парамСотрудники )
		|           " + ?(ПоРегистратору, "И	Начисления.Регистратор = &парамРегистратор", "") + "
		|
		|	СГРУППИРОВАТЬ ПО
		|		Начисления.Сотрудник,
		|		Начисления.ВидРасчета.ДоходНДФЛ,
		|		"+ТекстНП+"
		|
		|	ИНДЕКСИРОВАТЬ ПО
		|		Сотрудник,
		|		ПериодДействия,
		|		ДоходНДФЛ
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТРаботникиПоПериодам = "ВТРаботникиПоПериодам";
	КонецЕсли;
	
	// ВТГражданствоФизЛиц
	Если Истина Тогда
		//	Описание:
		// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ГражданствоФизЛиц.Период     КАК Период,
		|		ГражданствоФизЛиц.ФизЛицо    КАК ФизЛицо,
		|		НЕ ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентом  КАК Резидент
		|
		|ПОМЕСТИТЬ ВТГражданствоФизЛиц	
		|	ИЗ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		|
		|	ГДЕ  	ГражданствоФизЛиц.Период <= &парамКонец
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТГражданствоФизЛиц = "ВТГражданствоФизЛиц";
	КонецЕсли;
	
	// ВТШахтеры
	Если Истина Тогда
		//	Описание:
		// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВЫБОР КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
		|		ТОГДА НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ)
		|		ИНАЧЕ РаботникиОрганизаций.Период КОНЕЦ   КАК Период,

		|		РаботникиОрганизаций.Сотрудник    КАК Сотрудник,
		|		РаботникиОрганизаций.Должность.Шахтеры  КАК Шахтер
		|
		|ПОМЕСТИТЬ ВТШахтеры	
		|	ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|
		|	ГДЕ		РаботникиОрганизаций.Сотрудник в ( &парамСотрудники )
		|	  	И	РаботникиОрганизаций.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТШахтеры = "ВТШахтеры";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТШахтеры";
	
	Если ИспользуетсяНК Тогда
		ТекстСтавка = "ИНАЧЕ Основной.ДоходНДФЛ.ВидСтавкиРезидента";
	Иначе
		ТекстСтавка = "			КОГДА ((Параметры_НеРезиденты.ФизЛицо) ЕСТЬ NULL) ИЛИ (Параметры_НеРезиденты.Резидент)
						|				ТОГДА Основной.ДоходНДФЛ.ВидСтавкиРезидента 
						|			ИНАЧЕ Основной.ДоходНДФЛ.ВидСтавкиНеРезидента";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Истина			КАК Авторасчет,
	|	Основной.Сотрудник			КАК Сотрудник,
	|	Основной.ДоходНДФЛ	    	КАК ДоходНДФЛ,
	|	Основной.НалоговыйПериод	КАК НалоговыйПериод,
	|	"+?(ИспользуетсяНК И (ВариантНДФЛ=Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы),"ВЫБОР КОГДА Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ	КАК ЭтоЗарплата,","")+"
	|	"+?(ИспользуетсяНК И (ВариантНДФЛ=Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы),"Основной.ДатаДействия	    	КАК ДатаДействия,","")+"
	|	Параметры_Шахтеры.Шахтер	КАК Параметры_Шахтеры_Шахтер,
	|	Основной.ДоходНДФЛ.ВидСтавкиШахтера	КАК ВидСтавкиШахтера,
	|	Основной.ДоходНДФЛ.ВидСтавкиНеРезидента	КАК ВидСтавкиНеРезидента,
	|	ВЫБОР	КОГДА ЕстьNULL(Параметры_Шахтеры.Шахтер,ЛОЖЬ)
	|	 ТОГДА Основной.ДоходНДФЛ.ВидСтавкиШахтера
	|	 ИНАЧЕ Основной.ДоходНДФЛ.ВидСтавкиУвеличенная
	|	КОНЕЦ КАК УвеличеннаяСтавка,
	|	ВЫБОР	КОГДА ЕстьNULL(Параметры_Шахтеры.Шахтер,ЛОЖЬ)
	|				ТОГДА Основной.ДоходНДФЛ.ВидСтавкиШахтера 
	|"+ТекстСтавка+"
	|          КОНЕЦ                                        КАК ВидСтавки
	|	ИЗ (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			НачисленияРаботников.Сотрудник		КАК Сотрудник,
	|			НачисленияРаботников.ДоходНДФЛ	    КАК ДоходНДФЛ,
	|			НачисленияРаботников.ПериодДействия	КАК НалоговыйПериод,
	|			"+?(ИспользуетсяНК И (ВариантНДФЛ=Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы),"МИНИМУМ(НачисленияРаботников.ДатаДействия) КАК ДатаДействия,","")+"
	|			МАКСИМУМ(ТБШахтеры.Период) 			КАК ПериодРасчетовШахтеры,
	|			МАКСИМУМ(НеРезиденты.Период) 		КАК ПериодРасчетовНеРезиденты
	|		ИЗ " + ТекстЗапросаВТРаботникиПоПериодам + " КАК НачисленияРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШахтеры + " КАК ТБШахтеры
	|       ПО		ТБШахтеры.Период <= НачисленияРаботников.ПериодДействия
	|       	И	 ТБШахтеры.Сотрудник = НачисленияРаботников.Сотрудник    
	|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТГражданствоФизЛиц + " КАК НеРезиденты
	|       ПО		НеРезиденты.Период <= НачисленияРаботников.ПериодДействия
	|       	И	 НеРезиденты.Физлицо = НачисленияРаботников.Сотрудник.Физлицо    
	|		СГРУППИРОВАТЬ ПО
	|			НачисленияРаботников.Сотрудник,
	|			НачисленияРаботников.ДоходНДФЛ,
	|			НачисленияРаботников.ПериодДействия
	|   ) КАК Основной
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШахтеры + " КАК Параметры_Шахтеры
	|	ПО		Основной.ПериодРасчетовШахтеры = Параметры_Шахтеры.Период
	|		И	Основной.Сотрудник =  Параметры_Шахтеры.Сотрудник
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТГражданствоФизЛиц + " КАК Параметры_НеРезиденты
	|	ПО		Основной.ПериодРасчетовНеРезиденты = Параметры_НеРезиденты.Период
	|		И	Основной.Сотрудник.Физлицо =  Параметры_НеРезиденты.Физлицо
	|
	|  "+?(ИспользуетсяНК И (ВариантНДФЛ=Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы),"УПОРЯДОЧИТЬ ПО Сотрудник, НалоговыйПериод, ЭтоЗарплата убыв, ДатаДействия, ДоходНДФЛ.Код","")+"
	|";

	
	Запрос.Текст = ТекстЗапроса;
	
	МассивНовыхСтрок = Новый Массив();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если	Выборка.ДоходНДФЛ = Null
			ИЛИ	Выборка.ДоходНДФЛ = Неопределено 
			ИЛИ	Выборка.ДоходНДФЛ = Справочники.ВидыДоходовНДФЛ.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = НДФЛ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		МассивНовыхСтрок.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	//ВОЕННЫЙ СБОР
	
	Запрос.УстановитьПараметр("ВидДоходаВС", Справочники.ВидыДоходовНДФЛ.ВоенныйСбор);
	Запрос.УстановитьПараметр("ВидСтавкиВС", Перечисления.ВидыСтавокНДФЛ.ВоенныйСбор);
	Запрос.УстановитьПараметр("ТЧНДФЛПолная", НДФЛ.Выгрузить());
	Запрос.УстановитьПараметр("ТЧНДФЛ", НДФЛ.Выгрузить(МассивНовыхСтрок));
	Используется1578 = (ДатаИзмененияНК1578() <=  Регистратор.Дата);
	Запрос.УстановитьПараметр("Используется1578", Используется1578);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник			КАК Сотрудник,
	|	ТЧ.ДоходНДФЛ	    	КАК ДоходНДФЛ,
	|	ТЧ.НалоговыйПериод		КАК НалоговыйПериод,
	|	&ПериодРегистрации      КАК ПериодРегистрации,
	|	ТЧ.ВидСтавки		 	КАК ВидСтавки,
	|	ТЧ.УвеличеннаяСтавка	КАК УвеличеннаяСтавка
	|ПОМЕСТИТЬ ВТНДФЛ
	|ИЗ &ТЧНДФЛ КАК ТЧ";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.ДоходНДФЛ			КАК ДоходНДФЛ,
	|	ТЧ.ВидСтавки	    	КАК ВидСтавки,
	|	ТЧ.НалоговыйПериод		КАК НалоговыйПериод,
	|	"+?(РегистраторЗКВ,"ТЧ.ПериодВзаиморасчетов		КАК ПериодВзаиморасчетов,","")+"
	|	ТЧ.Доход		 		КАК Доход,
	|	ТЧ.Налог				КАК Налог,
	|	ТЧ.НалогУпр				КАК НалогУпр,
	|	ТЧ.Льгота				КАК Льгота,
	|	ТЧ.КоличествоЛьгот	    КАК КоличествоЛьгот,
	|	ТЧ.Сторно				КАК Сторно,
	|	ТЧ.Авторасчет		 	КАК Авторасчет,
	|	ТЧ.Сотрудник			КАК Сотрудник,
	|	ТЧ.УвеличеннаяСтавка	КАК УвеличеннаяСтавка,
	|	ТЧ.ДоходПолный	    	КАК ДоходПолный
	|ПОМЕСТИТЬ ВТНДФЛПолная
	|ИЗ &ТЧНДФЛПолная КАК ТЧ";
	Запрос.Выполнить();
	
	Если мПериодРегистрации < ДатаИзмененияСхемыУчетаВС() Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ставки.Период,
		|	Ставки.ВидСтавки,
		|	Ставки.Ставка
		|ПОМЕСТИТЬ ВТСтавкиВС
		|ИЗ РегистрСведений.СтавкиНДФЛ КАК Ставки
		|ГДЕ Ставки.ВидСтавки = &ВидСтавкиВС
		|;
		|
		|ВЫБРАТЬ
		|	ТЧ.Сотрудник,
		|	ТЧ.ПериодРегистрации,
		|	ВЫБОР 
		|	 КОГДА &Используется1578
		|	 ТОГДА &ВидСтавкиВС
		|	 ИНАЧЕ ТЧ.ДоходНДФЛ.ВидСтавкиВоенныйСбор 
		|	КОНЕЦ КАК ВидСтавкиВС,
		|   МАКСИМУМ(Ставки.Период) КАК Период
		|ПОМЕСТИТЬ ВТНДФЛМаксимальныйПериод
		|ИЗ ВТНДФЛ КАК ТЧ
		|   ЛЕВОЕ СОЕДИНЕНИЕ
		|   ВТСтавкиВС КАК Ставки
		|   ПО ТЧ.ПериодРегистрации >= Ставки.Период
		|СГРУППИРОВАТЬ ПО
		|   ТЧ.Сотрудник,
		|	ТЧ.ПериодРегистрации,
		|	ТЧ.НалоговыйПериод,
		|	ТЧ.ДоходНДФЛ.ВидСтавкиВоенныйСбор
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧ.Сотрудник,
		|	ТЧ.ПериодРегистрации
		|ПОМЕСТИТЬ ВТНДФЛВС
		|ИЗ ВТНДФЛМаксимальныйПериод КАК ТЧ
		|   ЛЕВОЕ СОЕДИНЕНИЕ
		|   ВТСтавкиВС КАК Ставки
		|   ПО ТЧ.Период = Ставки.Период
		|ГДЕ
		|   ТЧ.ВидСтавкиВС = &ВидСтавкиВС
		|   И ЕСТЬNULL(Ставки.Ставка,0) > 0
		|;
		|
		|ВЫБРАТЬ
		|	ТЧ.ДоходНДФЛ			КАК ДоходНДФЛ,
		|	ТЧ.ДоходНДФЛ.Код		КАК ДоходНДФЛКод,
		|	ТЧ.ВидСтавки	    	КАК ВидСтавки,
		|	ТЧ.НалоговыйПериод		КАК НалоговыйПериод,
		|	"+?(РегистраторЗКВ,"ТЧ.ПериодВзаиморасчетов		КАК ПериодВзаиморасчетов,","")+"
		|	ТЧ.Доход		 		КАК Доход,
		|	ТЧ.Налог				КАК Налог,
		|	ТЧ.НалогУпр				КАК НалогУпр,
		|	ТЧ.Льгота				КАК Льгота,
		|	ТЧ.КоличествоЛьгот	    КАК КоличествоЛьгот,
		|	ТЧ.Сторно				КАК Сторно,
		|	ТЧ.Авторасчет		 	КАК Авторасчет,
		|	ТЧ.Сотрудник			КАК Сотрудник,
		|	ТЧ.УвеличеннаяСтавка	КАК УвеличеннаяСтавка,
		|	ТЧ.ДоходПолный	    	КАК ДоходПолный
		|
		|ИЗ ВТНДФЛПолная КАК ТЧ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|   &ВидДоходаВС,
		|   ""ВЗ"",
		|   &ВидСтавкиВС,
		|	НДФЛВС.ПериодРегистрации КАК НалоговыйПериод,
		|	"+?(РегистраторЗКВ,"0,","")+"
		|	0,
		|	0,
		|	0,
		|	NULL,
		|	0,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	НДФЛВС.Сотрудник,
		|   &ВидСтавкиВС,
		|	0
		|ИЗ ВТНДФЛВС КАК НДФЛВС
	    |
		|УПОРЯДОЧИТЬ ПО Сотрудник, НалоговыйПериод, ДоходНДФЛКод
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧ.Сотрудник			КАК Сотрудник,
		|	ВидыДоходовНДФЛ.ОблагаетсяВоеннымСбором2021	КАК ДоходНДФЛ,
		|	ВидыДоходовНДФЛ.ОблагаетсяВоеннымСбором2021.Код	КАК ДоходНДФЛКод,
		|	&ПериодРегистрации      КАК ПериодРегистрации,
		|	ВидыДоходовНДФЛ.ОблагаетсяВоеннымСбором2021.ВидСтавкиРезидента 	КАК ВидСтавки,
		|	ВидыДоходовНДФЛ.ОблагаетсяВоеннымСбором2021.ВидСтавкиУвеличенная	КАК УвеличеннаяСтавка
		|ПОМЕСТИТЬ ВТНДФЛВС
		|ИЗ ВТНДФЛ КАК ТЧ
		|   ЛЕВОЕ СОЕДИНЕНИЕ
		|   Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
		|   ПО ТЧ.ДоходНДФЛ = ВидыДоходовНДФЛ.Ссылка
		|ГДЕ
		|   ВидыДоходовНДФЛ.ОблагаетсяВоеннымСбором2021 <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
		|;
		|
		|ВЫБРАТЬ
		|	ТЧ.ДоходНДФЛ			КАК ДоходНДФЛ,
		|	ТЧ.ДоходНДФЛ.Код		КАК ДоходНДФЛКод,
		|	ТЧ.ВидСтавки	    	КАК ВидСтавки,
		|	ТЧ.НалоговыйПериод		КАК НалоговыйПериод,
		|	ТЧ.Доход		 		КАК Доход,
		|	ТЧ.Налог				КАК Налог,
		|	ТЧ.Льгота				КАК Льгота,
		|	ТЧ.КоличествоЛьгот	    КАК КоличествоЛьгот,
		|	ТЧ.Сторно				КАК Сторно,
		|	ТЧ.Авторасчет		 	КАК Авторасчет,
		|	ТЧ.Сотрудник			КАК Сотрудник,
		|	ТЧ.УвеличеннаяСтавка	КАК УвеличеннаяСтавка,
		|	ТЧ.ДоходПолный	    	КАК ДоходПолный
		|
		|ИЗ ВТНДФЛПолная КАК ТЧ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|   НДФЛВС.ДоходНДФЛ,
		|   НДФЛВС.ДоходНДФЛКод,
		|   НДФЛВС.ВидСтавки,
		|	НДФЛВС.ПериодРегистрации КАК НалоговыйПериод,
		|	0,
		|	0,
		|	NULL,
		|	0,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	НДФЛВС.Сотрудник,
		|   НДФЛВС.УвеличеннаяСтавка,
		|	0
		|ИЗ ВТНДФЛВС КАК НДФЛВС
	    |
		|УПОРЯДОЧИТЬ ПО Сотрудник, НалоговыйПериод, ДоходНДФЛКод
		|";
		
	КонецЕсли;	

	НДФЛ.Загрузить(Запрос.Выполнить().Выгрузить());


КонецПроцедуры // АвтозаполнениеНДФЛ

// Возвращает список начислений для использования при предварительном расчете
//
Функция ПолучитьСписокНачисленийДляПредварительногоРасчета() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета,
	               |	НачисленияДляПредварительногоРасчета.ВидРасчета КАК ВидРасчета1
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК ОсновныеНачисленияОрганизаций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачисленияДляПредварительногоРасчета КАК НачисленияДляПредварительногоРасчета
	               |		ПО НачисленияДляПредварительногоРасчета.ВидРасчета = ОсновныеНачисленияОрганизаций.Ссылка
	               |ГДЕ
	               |	(ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени
	               |		И ОсновныеНачисленияОрганизаций.ЗачетНормыВремени)
				   |		ИЛИ НЕ (НачисленияДляПредварительногоРасчета.ВидРасчета ЕСТЬ NULL)";
				   
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета"); 
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// КОММЕНТАРИИ РАСЧЕТОВ

Функция ВизуализироватьФормулуРасчета(Объект, Режим = "Текст") Экспорт

	СпособРасчета = Объект.СпособРасчета;
	
	Если Режим = "HTML" Тогда
		
		
		СтрокаФормулы ="
		|	<HTML><HEAD>
		|	</HEAD>
		|	<BODY vlink=#000 link=#000 scroll=auto rightMargin=0><FONT face=""MS Sans Serif"" size=1>
		|";
		
	КонецЕсли;
	
	Если  СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой Или
		СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.УдержаниеФиксированнойСуммой Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Фиксированная сумма>';uk='<Фіксована сума>'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>Фиксированная сумма</FONT>"
		КонецЕсли;
	ИначеЕсли  СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Фиксированная сумма>';uk='<Фіксована сума>'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>Фиксированная сумма</FONT>"
		КонецЕсли;
		
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммой Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Фиксированная сумма>, указанная в исполнительном листе';uk='<Фіксована сума>, зазначена у виконавчому листі'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>Фиксированная сумма, до удержания указанной в документе суммы</FONT>"
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Фиксированная сумма>, до удержания указанной в документе суммы';uk='<Фіксована сума>, до утримання зазначеної в документі суми'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>Фиксированная сумма, до удержания указанной в документе суммы</FONT>"
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Процент удержаний> * (<Расчетная база> - <Исчисленный НДФЛ>)';uk='<Відсоток утримань> * (<Розрахункова база> - <Обчислений ПДФО>)'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Процент удержаний</FONT> <FONT color=#FF0000> * </FONT> (<FONT color=#0000ff>Расчетная база</FONT> <FONT color=#FF0000> - </FONT> <FONT color=#0000ff>Исчисленный НДФЛ</FONT>)"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Процент удержаний> * (<Расчетная база> - <Исчисленный НДФЛ>), до удержания указанной в документе суммы';uk='<Відсоток утримань> * (<Розрахункова база> - <Обчислений ПДФО>), до утримання зазначеної в документі суми'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff><Процент удержаний></FONT> <FONT color=#FF0000> * </FONT> <FONT color=#FF0000>(</FONT><FONT color=#0000ff>Расчетная база</FONT> <FONT color=#FF0000> - </FONT> <FONT color=#0000ff>Исчисленный НДФЛ</FONT><FONT color=#FF0000>)</FONT>, до удержания указанной в документе суммы"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммой Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Фиксированная сумма>, указанная в исполнительном листе';uk='<Фіксована сума>, зазначена у виконавчому листі'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>Фиксированная сумма, до удержания указанной в документе суммы</FONT>"
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Фиксированная сумма>, до удержания указанной в документе суммы';uk='<Фіксована сума>, до утримання зазначеної в документі суми'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>Фиксированная сумма, до удержания указанной в документе суммы</FONT>"
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Процент удержаний> * (<Расчетная база> - <Исчисленный НДФЛ>)';uk='<Відсоток утримань> * (<Розрахункова база> - <Обчислений ПДФО>)'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Процент удержаний</FONT> <FONT color=#FF0000> * </FONT> (<FONT color=#0000ff>Расчетная база</FONT> <FONT color=#FF0000> - </FONT> <FONT color=#0000ff>Исчисленный НДФЛ</FONT>)"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Процент удержаний> * (<Расчетная база> - <Исчисленный НДФЛ>), до удержания указанной в документе суммы';uk='<Відсоток утримань> * (<Розрахункова база> - <Обчислений ПДФО>), до утримання зазначеної в документі суми'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff><Процент удержаний></FONT> <FONT color=#FF0000> * </FONT> <FONT color=#FF0000>(</FONT><FONT color=#0000ff>Расчетная база</FONT> <FONT color=#FF0000> - </FONT> <FONT color=#0000ff>Исчисленный НДФЛ</FONT><FONT color=#FF0000>)</FONT>, до удержания указанной в документе суммы"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Процент сбора> * <Сумма по исполнительному листу>';uk='<Відсоток збору> * <Сума по виконавчому листу>'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Процент сбора</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Сумма по исполнительному листу</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияАлиментов Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Коэффициент индексации> * <Сумма по исполнительному листу>';uk='<Коефіцієнт індексації> * <Сума по виконавчому листу>'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Коэффициент индексации</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Сумма по исполнительному листу</FONT>"			
		КонецЕсли;
	ИначеЕсли  СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = "<0>";
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = 0"
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = ""+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + НСтр("ru=' * Отработанное время в днях';uk=' * Відпрацьований час у днях'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + "</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Отработанное время в днях</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = "<"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + НСтр("ru='> * <Отработанное время в часах>';uk='> * <Відпрацьований час у годинах>'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + "</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Отработанное время в часах</FONT>"						
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Процент оплаты> * <Расчетная база>';uk='<Відсоток оплати> * <Розрахункова база>'")		
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Процент оплаты</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Расчетная база</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = "<"+Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения.Наименование + НСтр("ru='> * <Процент доплаты> * <Вечернее время в часах>';uk='> * <Відсоток доплати> * <Вечірній час в годинах>'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>"+Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения.Наименование + "</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Процент доплаты</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Вечернее время в часах</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = "<"+Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения.Наименование + НСтр("ru='> * <Процент доплаты> * <Ночное время в часах>';uk='> * <Відсоток доплати> * <Нічний час у годинах>'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>"+Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения.Наименование + "</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Процент доплаты</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Ночное время в часах</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку 
		Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска Тогда		
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Средний дневной (часовой) заработок> * <Время в днях (часах)>';uk='<Середній денний (годинний) заробіток> * <Час в днях (годинах)>'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Средний дневной (часовой) заработок</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Время в днях (часах)</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска Тогда		
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Средний дневной (часовой) заработок> * <Время в календарных днях)>';uk='<Середній денний (годинний) заробіток> * <Час у календарних днях)>'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Средний дневной заработок</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Время в календарных днях</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС Тогда		
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Средний дневной заработок> * <Время в календарных днях>';uk='<Середній денний заробіток> * <Час в календарних днях>'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Средний дневной заработок</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Время в календарных днях</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='Максимум(<Средний заработок> - <Начислено>, <0>)';uk='Максимум(<Середній заробіток> - <Нараховано>, <0>)'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Максимум</FONT><FONT color=#FF0000>(</FONT><FONT color=#0000ff>Средний заработок</FONT><FONT color=#FF0000> - </FONT><FONT color=#0000ff>Начислено</FONT> <FONT color=#FF0000>,</FONT> 0<FONT color=#FF0000>)</FONT>"		
		КонецЕсли;
		
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты
		Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений Тогда		
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='<Индексируемая сумма, с учетом ограничений> * <Коэффициент индексации на дату>';uk='<Сума, що індексується, з урахуванням обмежень> * <Коефіцієнт індексації на дату>'")
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Индексируемая сумма, с учетом ограничений</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Коэффициент индексации на дату</FONT>"			
		КонецЕсли;
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = "<"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + НСтр("ru='> / <Норма времени за месяц в днях> * <Отработанное время в днях>';uk='> / <Норма часу за місяць в днях> * <Відпрацьований час у днях>'")	
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ee>"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + "</FONT> <FONT color=#FF0000> / </FONT> <FONT color=#0000ee>Норма времени за месяц в днях</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ee>Отработанное время в днях</FONT>"			
		КонецЕсли;			
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = "<"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + НСтр("ru='> / <Норма времени за месяц в часах> * <Отработанное время в часах>';uk='> / <Норма часу за місяць в годинах> * <Відпрацьований час у годинах>'")								
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>"+Справочники.ПоказателиСхемМотивации.ОкладТариф.Наименование + "</FONT> <FONT color=#FF0000> / </FONT> <FONT color=#0000ff>Норма времени за месяц в часах</FONT> <FONT color=#FF0000> * </FONT> <FONT color=#0000ff>Отработанное время в часах</FONT>"			
		КонецЕсли;
   	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоМЗП Тогда
		Если Режим = "Текст" Тогда
			СтрокаФормулы = НСтр("ru='Максимум(<Минимальная зарплата>*<Расчетная база время>/<Норма времени за месяц> - <Расчетная база>, <0>)';uk='Максимум(<Мінімальна зарплата>*<Розрахункова база час>/<Норма часу за місяць> - <Розрахункова база>, <0>)'");
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|Результат = <FONT color=#0000ff>Максимум</FONT><FONT color=#FF0000>(</FONT><FONT color=#0000ff>Минимальная зарплата</FONT><FONT color=#FF0000> * <FONT color=#0000ff>Расчетная база время</FONT><FONT color=#FF0000> / <FONT color=#0000ff>Норма времени за месяц</FONT><FONT color=#FF0000>   - </FONT><FONT color=#0000ff>Расчетная база</FONT> <FONT color=#FF0000>,</FONT> 0<FONT color=#FF0000>)</FONT>"		
		КонецЕсли;
	
	ИначеЕсли Объект.ПроизвольнаяФормулаРасчета Тогда
		
		ФормулаРасчета	= Объект.ФормулаРасчета;
		
		Если Режим = "Текст" Тогда
			
			Для Каждого Показатель Из Объект.Показатели Цикл
				ПоказательДляФормулы = Строка(Показатель.Показатель);
				
				ФормулаРасчета	= СтрЗаменить(ФормулаРасчета, "ИсходныеДанные.Показатель"+Показатель.НомерСтроки, ПоказательДляФормулы);
			КонецЦикла;
			
			СтрокаФормулы	= ФормулаРасчета;
			
		Иначе
			СимволыДляЗамены = "/=-+*()?<,";
			
			НоваяФормулаРасчета = "";
			Для НомерСимвола = 1 По СтрДлина(ФормулаРасчета) Цикл
				Символ = Сред(ФормулаРасчета,НомерСимвола,1);
				Если Найти(СимволыДляЗамены,Символ) > 0 Тогда
					НоваяФормулаРасчета = НоваяФормулаРасчета + "<FONT color=#FF0000>" + Символ + "</FONT>"; 
				Иначе
					НоваяФормулаРасчета = НоваяФормулаРасчета + Символ;
				КонецЕсли;
			КонецЦикла;	
			
			ФормулаРасчета = НоваяФормулаРасчета;
			
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " NOT ", "<FONT color=#FF0000> NOT </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " OR ", "<FONT color=#FF0000> OR </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " AND ", "<FONT color=#FF0000> AND </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " И ", "<FONT color=#FF0000> И </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " ИЛИ ", "<FONT color=#FF0000> ИЛИ </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " НЕ ", "<FONT color=#FF0000> НЕ </FONT>"); 
			
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " not ", "<FONT color=#FF0000> not </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " or ", "<FONT color=#FF0000> or </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " and ", "<FONT color=#FF0000> and </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " и ", "<FONT color=#FF0000> и </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " или ", "<FONT color=#FF0000> или </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " не ", "<FONT color=#FF0000> не </FONT>");
			
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " Not ", "<FONT color=#FF0000> Not </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " Or ", "<FONT color=#FF0000> Or </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " And ", "<FONT color=#FF0000> And </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " Или ", "<FONT color=#FF0000> Или </FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, " Не ", "<FONT color=#FF0000> Не </FONT>");		
			
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, "Цел", "<FONT color=#0000ff>Цел</FONT>"); 
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, "Окр", "<FONT color=#0000ff>Окр</FONT>");
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, "Макс", "<FONT color=#0000ff>Макс</FONT>");
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, "Мин", "<FONT color=#0000ff>Мин</FONT>");
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, "ОценитьПо", "<FONT color=#0000ff>ОценитьПо</FONT>");		
			
			Для Каждого Показатель Из Объект.Показатели Цикл
				ПоказательДляФормулы = "<FONT color=#0000ff>" + Строка(Показатель.Показатель)+"</FONT>";
				
				ФормулаРасчета	= СтрЗаменить(ФормулаРасчета, "ИсходныеДанные.Показатель"+Показатель.НомерСтроки, ПоказательДляФормулы);
			КонецЦикла;
			
			СтрокаФормулы	= СтрокаФормулы + "Результат = " + ФормулаРасчета;
		КонецЕсли;
	Иначе
		Если Режим = "Текст" Тогда
			СтрокаФормулы = ""	
		Иначе
			СтрокаФормулы = СтрокаФормулы + "
			|</font></HTML>"
		КонецЕсли;
	КонецЕсли;
	
	Если Режим = "HTML" Тогда
				
		СтрокаФормулы = СтрокаФормулы + "
		|</font></HTML>"

	КонецЕсли;
	
    Возврат СтрокаФормулы;	
	
КонецФункции // ВизуализироватьФормулуРасчета()

Функция КомментарийРасчета(	ТекстСообщения, 
							РодительскаяСтрока = НеОпределено,
							ПредставлениеРасшифровкиКомментария = НеОпределено, 
							РасшифровкаКомментария = НеОпределено, 
							ВидСообщения = НеОпределено,
							РаскрытьКомментарий = Истина) Экспорт
	
	#Если Клиент Тогда
		Обработка = глЗначениеПеременной("глОбработкаСообщений");
		Если ВидСообщения = НеОпределено Тогда
			ВидСообщения = Перечисления.ВидыСообщений.Информация;
		КонецЕсли;
		Если РасшифровкаКомментария <> НеОпределено Тогда
			Расшифровки = Новый Массив;
			// расшифровка сообщений представляет собой массив структур "Представление+Расшифровка"
			Расшифровки.Добавить(Новый Структура("Представление,Расшифровка", ПредставлениеРасшифровкиКомментария, РасшифровкаКомментария));
		Иначе
			Расшифровки = НеОпределено;
		КонецЕсли;
		Возврат Обработка.ДобавитьСообщение(
								ТекстСообщения, 
								ВидСообщения, 
								Расшифровки, 
								РодительскаяСтрока, 
								РаскрытьКомментарий);
	#Иначе
		Сообщить(ТекстСообщения);
	#КонецЕсли
	
КонецФункции

Процедура ОшибкаРасчета(ТекстОшибки) Экспорт
	
	#Если Клиент Тогда
		Обработка = глЗначениеПеременной("глОбработкаСообщений");
		Обработка.ДобавитьСообщение(ТекстОшибки, Перечисления.ВидыСообщений.Ошибка);
	#Иначе
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
	#КонецЕсли
КонецПроцедуры


#Если Клиент Тогда
	
Процедура ПриВыводеСтрокиПлановыхНачислений(Элемент, ОформлениеСтроки, ДанныеСтроки, СведенияОВидахРасчета, ИспользуютсяТарифныеРазряды = Истина) Экспорт
		
	Если ОформлениеСтроки.Ячейки.Найти("Надбавка") = Неопределено Тогда
		СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.ВидРасчета);
	Иначе
		СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.Надбавка);
	КонецЕсли; 
	
	ТолькоПросмотрЯчеек = Ложь;
	
	ЕстьПоказатели = Ложь;
	Для СчПоказателей = 1 По 4 Цикл
		УстановитьТолькоПросмотр = ТолькоПросмотрЯчеек;
		Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
			ЕстьПоказатели = Истина;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
			Если ИспользуютсяТарифныеРазряды Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
			КонецЕсли;
			
		Иначе
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			Если ИспользуютсяТарифныеРазряды Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
		ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
		ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].ТолькоПросмотр = (НЕ СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"]) ИЛИ (УстановитьТолькоПросмотр);
		ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = УстановитьТолькоПросмотр;
	КонецЦикла;
	
	Если не ЕстьПоказатели Тогда
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст(НСтр("ru='<ввод при расчете>';uk='<введення при розрахунку>'"));
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
		ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	
	Если Не ОформлениеСтроки.Ячейки.Найти("ОтражатьВРегламентированномУчете") = Неопределено Тогда
		ОформлениеСтроки.Ячейки.ОтражатьВРегламентированномУчете.Видимость = ДанныеСтроки.Сотрудник.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАСЧЕТОВ

// Рассчитывает записи из переданного набора записей
//
// Параметры:
//	ИмяРегистра				- имя регистра, чьи записи будут рассчитаны
//	НаборЗаписейРегистра	- набор записей, которые надо рассчитать
//	НаборЗаписейРасчетСреднего
//	ГоловнаяОрганизация
//	ОбособленноеПодразделение
//	ТабличнаяЧастьДокумента
//	ОднократныйРасчетСреднего	- будево. Если Истина, то при расчете выполняется 
//								  однократный расчет среднего в не зависимости от количесвта различных 
//								  категорий видов расчета в наборе записей
//  МассивИндексыСтрокТабличнойЧасти	- массив с индексами строк табличного поля, для реализации
//										  расчета по одному сотруднику	
//	Физлицо								- ссылка Справочники.ФизическиеЛица, для реализации
//										  расчета по одному сотруднику	
//
// Возвращаемое значение:
//	Нет.
//
Процедура РассчитатьЗаписиРегистраРасчета(ИмяРегистра, 
												НаборЗаписейРегистра,
												ТабличнаяЧастьДокумента = Неопределено,
												МассивИндексыСтрокТабличнойЧасти = Неопределено,
												Сотрудники = Неопределено,
												КомментироватьРасчет = Ложь, 
 												СотрудникиРасчетОтОбратного = Неопределено) Экспорт
	Перем Организация;
												
	Если НаборЗаписейРегистра.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если	НЕ (ИмяРегистра = "Начисления" или
			ИмяРегистра = "ВзносыВФонды" или
			ИмяРегистра = "Удержания") 
			Тогда
		Возврат;
	КонецЕсли;
	
	// Получим максимальное число показателей			
	Если	ИмяРегистра = "Начисления" или
		ИмяРегистра = "Удержания"
		Тогда
		ЗапросНаКоличествоПоказателей = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(НачисленияПоказатели.НомерСтроки),0) КАК КолВоПоказателей
		|ИЗ");
		Если ИмяРегистра = "Начисления" Тогда
			ЗапросНаКоличествоПоказателей.Текст = ЗапросНаКоличествоПоказателей.Текст + "
			|	ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели";			
		ИначеЕсли ИмяРегистра = "Удержания" Тогда 		
			ЗапросНаКоличествоПоказателей.Текст = ЗапросНаКоличествоПоказателей.Текст + "
			|	ПланВидовРасчета.Удержания.Показатели КАК НачисленияПоказатели";
		КонецЕсли;
		ВыборкаКоличестваПоказателей = ЗапросНаКоличествоПоказателей.Выполнить().Выбрать();		
		ВыборкаКоличестваПоказателей.Следующий();
		КоличествоПоказателей = ВыборкаКоличестваПоказателей.КолВоПоказателей;
		
	Иначе
		КоличествоПоказателей = 0;
		
	КонецЕсли;

	
	// здесь предполагаем, что в наборе записей не может быть записей с разными периодами регистрации
	ПериодРегистрации = НаборЗаписейРегистра[0].ПериодРегистрации;
	Организация = НаборЗаписейРегистра[0].Организация;
	
	Регистратор = НаборЗаписейРегистра.Отбор.Регистратор.Значение;
	ИмяПВР = Метаданные.РегистрыРасчета[ИмяРегистра].ПланВидовРасчета.Имя;
	
	// получим массив видов расчета из набора записей
	ТаблицаВидовРасчета = НаборЗаписейРегистра.Выгрузить();
	ТаблицаВидовРасчета.Свернуть("ВидРасчета");
	ВидыРасчетов = ТаблицаВидовРасчета.ВыгрузитьКолонку("ВидРасчета");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Основной.СпособРасчета Как СпособРасчета
	|" + ?(ИмяПВР = "ВзносыВФонды",",
	|	1 ",",
	|	КатегорияРасчета")+" КАК КатегорияРасчета
	|" + ?(ИмяПВР = "Начисления",",
	|	Основной.ПериодДействияБазовый КАК ПериодДействияБазовый,
	|	Основной.ЗачетОтработанногоВремени,
	|	Основной.ЗачетНормыВремени,
	|	Основной.ЗачетКалендарных",",
	|	ЛОЖЬ КАК ЗачетОтработанногоВремени,
	|	ЛОЖЬ КАК ЗачетНормыВремени,
	|	ЛОЖЬ КАК ЗачетКалендарных");
	Для СчПоказателей = 1 По КоличествоПоказателей Цикл
		ТекстЗапроса = ТекстЗапроса + ",
		|	ВЫБОР
		|		КОГДА ТЧПоказатели.НомерСтроки = "+ СчПоказателей+"
		|			ТОГДА 
		|				ВЫБОР
		|					КОГДА ТЧПоказатели.Показатель.Предопределенный
		|						ТОГДА ТЧПоказатели.Показатель
		|					ИНАЧЕ NULL
		|				КОНЕЦ				
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Показатель" + СчПоказателей;
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ ПланВидовРасчета."+ИмяПВР+" КАК Основной
	|";
	Если КоличествоПоказателей > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ  ПланВидовРасчета."+ИмяПВР+".Показатели КАК ТЧПоказатели
		|	ПО Основной.Ссылка = ТЧПоказатели.Ссылка
		|";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|ГДЕ Основной.Ссылка В(&парамВидыРасчетов)
	|УПОРЯДОЧИТЬ ПО
	|	" + ?(ИмяПВР = "ВзносыВФонды","1","Основной.КатегорияРасчета.Порядок")+"
	|
	|ИТОГИ 
	|	МАКСИМУМ(ЗачетОтработанногоВремени),
	|	МАКСИМУМ(ЗачетНормыВремени),
	|	МАКСИМУМ(ЗачетКалендарных)
	|ПО КатегорияРасчета";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамВидыРасчетов", ВидыРасчетов);
	
	// получаем список категороий и способов расчета
	ВыборкаКатегорий = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// первая запись набора делается с пересчетом Фактического периода действия
	ТолькоЗапись = Ложь;
	
	Пока ВыборкаКатегорий.Следующий() Цикл
		
		// Получим структуру необходимых данных для расчетов текущей категории
		МассивСпособовРасчета	= Новый Массив;	// Массив способов расчета текущий категории
		МассивПоказателей		= Новый Массив;	// Массив видов показателей схем мотивации
		Календарные				= Ложь;
		НормаВремени			= Ложь;			// Признак необходимости получения нормы времени для видов расчета
		ОтработаноВремени		= Ложь;			// Признак необходимости получения отработанного времени для видов расчета
		НеобходимБазовыйПериод	= Ложь;			// Признак необходимости базового периода
		
		ВложеннаяВыборка = ВыборкаКатегорий.Выбрать();
		Пока ВложеннаяВыборка.Следующий() Цикл
			МассивСпособовРасчета.Добавить(ВложеннаяВыборка.СпособРасчета);
			
			Для Сч = 1 По КоличествоПоказателей Цикл
				Если ВложеннаяВыборка["Показатель"+Сч] <> Null Тогда
					МассивПоказателей.Добавить(ВложеннаяВыборка["Показатель"+Сч]);
				КонецЕсли;
			КонецЦикла;
			
			Если ИмяПВР = "Начисления" Тогда
				
				НормаВремени			= НормаВремени ИЛИ ВложеннаяВыборка.ЗачетНормыВремени;
				ОтработаноВремени		= ОтработаноВремени ИЛИ ВложеннаяВыборка.ЗачетОтработанногоВремени ИЛИ ВложеннаяВыборка.ЗачетНормыВремени;
				НеобходимБазовыйПериод	= НеобходимБазовыйПериод ИЛИ (НЕ ВложеннаяВыборка.ПериодДействияБазовый);
				
			КонецЕсли;
			
		КонецЦикла;
		
		НеобходимыеДанные = ПолучитьСтруктуруНеобходимыхДанных(МассивСпособовРасчета, НеобходимыеДанные, МассивПоказателей);
		НеобходимыеДанные.ОтработаноВремени	= НеобходимыеДанные.ОтработаноВремени ИЛИ ВыборкаКатегорий.ЗачетОтработанногоВремени;
		НеобходимыеДанные.НормаВремени		= НеобходимыеДанные.НормаВремени ИЛИ ВыборкаКатегорий.ЗачетНормыВремени;
		НеобходимыеДанные.Календарные		= НеобходимыеДанные.Календарные ИЛИ ВыборкаКатегорий.ЗачетКалендарных;
		НеобходимыеДанные.Вставить("ВТабличнойЧастиЕстьУчетВремени", НЕ ТабличнаяЧастьДокумента.Выгрузить().Колонки.Найти("ОплаченоДнейЧасов") = Неопределено);                     
		
		Если Не НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию Тогда
			НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию = ИмяРегистра = "Удержания" И НеобходимыеДанные.База
		КонецЕсли;
		
		Если НеобходимыеДанные.База Тогда
			НеобходимыеДанные.НормаВремениЗаМесяц	= НеобходимыеДанные.НормаВремениЗаМесяц ИЛИ НеобходимБазовыйПериод;
			НеобходимыеДанные.ОтработаноВремени		= НеобходимыеДанные.ОтработаноВремени ИЛИ НеобходимБазовыйПериод;
		КонецЕсли;
		
		Если ИмяПВР = "Начисления"  Тогда
			НеобходимыеДанные.НормаВремениЗаМесяц = Истина; // для предотвращения ложных сообщений об отсутствии графика
		КонецЕсли;
		
		// записываем набор перед расчетом каждой категории начислений
		НаборЗаписейРегистра.Записать(Истина, ТолькоЗапись);
		ТолькоЗапись = Истина;
		
		ИсходныеДанные = ПолучитьДанныеДляРасчета(ИмяРегистра, ВыборкаКатегорий.КатегорияРасчета, НеобходимыеДанные, Регистратор, Организация, ПериодРегистрации, , Сотрудники, КомментироватьРасчет);
		
		РассчитатьЗаписиНабора(ИсходныеДанные, НаборЗаписейРегистра, НеобходимыеДанные, ТабличнаяЧастьДокумента, МассивИндексыСтрокТабличнойЧасти, КомментироватьРасчет,, СотрудникиРасчетОтОбратного);
		НаборЗаписейРегистра.Записать(Истина, ТолькоЗапись);
		
		Если ИмяРегистра = "ВзносыВФонды"  Тогда
			
			ТолькоПоДвижениямТекущегоДокумента=ТипЗнч(Регистратор)=Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций");
			Если Не ТолькоПоДвижениямТекущегоДокумента Тогда
				
				ЭтоВзносы = Ложь;
				Если ТипЗнч(ТабличнаяЧастьДокумента) = Тип(НаборЗаписейРегистра.Отбор.Регистратор.Значение.Взносы) Тогда
					ЭтоВзносы = Истина;
				КонецЕсли;
				
				ИсходныеДанныеСторно = ПолучитьДанныеДляРасчетаСторноВзносовВФонды( Регистратор, ЭтоВзносы, Сотрудники, КомментироватьРасчет);
				РассчитатьЗаписиНабораСторноВзносовВФонды(ИсходныеДанныеСторно, НаборЗаписейРегистра, ТабличнаяЧастьДокумента, МассивИндексыСтрокТабличнойЧасти, КомментироватьРасчет);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РассчитатьЗаписиРегистраРасчета

// Производит расчет записей набора записей регистра расчета
// параметры:
//  ИсходныеДанные - результат запроса к исходным данным
//  НаборЗаписейРегистра - набор записей
//  ЗаписиДоходыНДФЛ - набор записей регистра доходов НДФЛ
//  ГоловнаяОрганизация - ссылка на организацию
//  ОбособленноеПодразделение - ссылка на обособленное подразделение
//	ТабличнаяЧастьДокумента - табличная часть документа, заполняется по результатам расчета
//
// возвращаемое значение:
//	нет
//
Процедура РассчитатьЗаписиНабора(ИсходныеДанные,
									НаборЗаписейРегистра,
									НеобходимыеДанные,
									ТабличнаяЧастьДокумента,
									МассивИндексыСтрокТабличнойЧасти = Неопределено,
									КомментироватьРасчет = Ложь, ФормаКомментариев = НеОпределено,
									СотрудникиРасчетОтОбратного = Неопределено)
	
	СтруктураПоиска = Новый Структура("НомерСтроки");
	
	// признаки расчета набора записей определенного регистра
	ОсновныеНачисленияОрганизаций = Ложь;
	УправленческиеРасчеты = Ложь;
	УправленческиеНачисления = Ложь;
	РегламентированныеУдержания = Ложь;
	РегламентированныеНачисления = Ложь;
	ВзносыВФонды = Ложь;
	Взносы = Ложь;
	ВзносыФОТ = Ложь;
	Если ТипЗнч(НаборЗаписейРегистра) = Тип("РегистрРасчетаНаборЗаписей.Начисления") Тогда
		ОсновныеНачисленияОрганизаций = Истина;
		РегламентированныеНачисления = Истина;
	ИначеЕсли ТипЗнч(НаборЗаписейРегистра) = Тип("РегистрРасчетаНаборЗаписей.Удержания") Тогда
		РегламентированныеУдержания = Истина;
	ИначеЕсли ТипЗнч(НаборЗаписейРегистра) = Тип("РегистрРасчетаНаборЗаписей.ВзносыВФонды") Тогда
		ВзносыВФонды = Истина;
		Если ТипЗнч(ТабличнаяЧастьДокумента) = Тип(НаборЗаписейРегистра.Отбор.Регистратор.Значение.Взносы) Тогда
			Взносы = Истина;
		Иначе
			ВзносыФОТ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПоказательРазмер = "Показатель1";
	
	
	// Соответствие для хранения графика с ошибками
	ГрафикиБезРабочегоВремени = Новый ТаблицаЗначений;
	ГрафикиБезРабочегоВремени.Колонки.Добавить("ГрафикРаботы");
	ГрафикиБезРабочегоВремени.Колонки.Добавить("ВидУчетаВремени");
	
	////Для Каждого СтрокаДвижений Из НаборЗаписейРегистра Цикл
	Пока ИсходныеДанные.Следующий() Цикл
		//////
		//////// дополнительная проверка для расчета от обраного
		//////// список расчитываемых сотрудников уменьшается, а набор записей остается прежним
		//////Если СотрудникиРасчетОтОбратного <> Неопределено Тогда
		//////	Если СотрудникиРасчетОтОбратного.НайтиПоЗначению(СтрокаДвижений.Сотрудник) = Неопределено Тогда
		//////		// Значение не найдено!
		//////		// Этот сотрудник уже расчитан
		//////		Продолжить;
		//////	КонецЕсли;		
		//////КонецЕсли;
		//////
		//////СтруктураПоиска.НомерСтроки = СтрокаДвижений.НомерСтроки;
		//////
		////////Это необходимо только для взносов - потом уберем
		//////НеобходимыеДанные.Вставить("СтруктураПоиска", СтруктураПоиска);
		//////
		//////Если ИсходныеДанные.НайтиСледующий(СтруктураПоиска) Тогда
		//////	
		//////	// Позиционирование на строке ТЧ
		//////	СтрокаТабличнойЧасти = Неопределено;
		//////	Если ТабличнаяЧастьДокумента <> Неопределено Тогда
		//////		
		//////		Если МассивИндексыСтрокТабличнойЧасти = Неопределено Тогда
		//////			
		//////			// Расчет всего документа
		//////			Если ВзносыВФонды Тогда
		//////				Если	Взносы 
		//////					И	СтрокаДвижений.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы
		//////					ИЛИ 
		//////						ВзносыФОТ 
		//////					И	СтрокаДвижений.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ
		//////					Тогда
		//////					СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(СтрокаДвижений.НомерСтрокиТЧ-1);
		//////				Иначе
		//////					Продолжить;
		//////				КонецЕсли;
		//////			Иначе
		//////				СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений));
		//////			КонецЕсли;
		//////			
		//////		Иначе
		//////			
		//////			//расчет по сотруднику
		//////			СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(МассивИндексыСтрокТабличнойЧасти.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений)));
		//////		КонецЕсли;
		//////		
		//////	КонецЕсли;
		//////	
		//////	РассчитатьЗаписьРегистраРасчета(СтрокаДвижений, ИсходныеДанные, НеобходимыеДанные, УправленческиеРасчеты, РегламентированныеНачисления, РегламентированныеУдержания, ОсновныеНачисленияОрганизаций, ВзносыВФонды, КомментироватьРасчет, ФормаКомментариев, ГрафикиБезРабочегоВремени);
		//////	
		//////	Если СтрокаДвижений.Авторасчет Тогда
		//////		
		//////		Если СтрокаТабличнойЧасти <> Неопределено Тогда
		//////			СтрокаТабличнойЧасти.Результат = СтрокаДвижений.Результат;
		//////			СтрокаТабличнойЧасти.РезультатУпр = СтрокаДвижений.РезультатУпр;
		//////			Если НеобходимыеДанные.ВТабличнойЧастиЕстьУчетВремени И ОсновныеНачисленияОрганизаций И СтрокаДвижений.Авторасчет Тогда
		//////				СтрокаТабличнойЧасти.ОплаченоДнейЧасов = СтрокаДвижений.ОплаченоДнейЧасов;
		//////			ИначеЕсли НеобходимыеДанные.ВТабличнойЧастиЕстьУчетВремени И СтрокаДвижений.Авторасчет Тогда
		//////				СтрокаТабличнойЧасти.ОплаченоДнейЧасов = 0;
		//////			КонецЕсли;
		//////		КонецЕсли;
		//////	
		//////		// если это данные по виду расчета, период действия которого является отработанным временем
		//////		// или учитывается как норма времени, то для рассчитываемой записи сохраним данные о времени
		//////		Если (НеобходимыеДанные.ВТабличнойЧастиЕстьУчетВремени И ОсновныеНачисленияОрганизаций ИЛИ УправленческиеНачисления) И СтрокаДвижений.Авторасчет Тогда
		//////			
		//////			СпособРасчета = ИсходныеДанные.СпособРасчета;
		//////			
		//////			БылоСообщениеОРабочемВремени = (
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку или 
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС или 
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка или 
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням или 
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам или
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке или
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке или
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы или
		//////			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы); 
		//////		
		//////			БылоСообщениеОВидеВремени = Ложь;
		//////		
		//////			Если ИсходныеДанные.ЗачетОтработанногоВремени Тогда
		//////				СтрокаДвижений.ОтработаноДней = 0;
		//////				СтрокаДвижений.ОтработаноЧасов = 0;
		//////				Если Не БылоСообщениеОРабочемВремени  Тогда
		//////					СообщениеОбОшибке = Ложь;
		//////					ОплачиваемоеВремя = ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, , СообщениеОбОшибке, ГрафикиБезРабочегоВремени);
		//////					БылоСообщениеОРабочемВремени = СообщениеОбОшибке;
		//////				КонецЕсли;
		//////				Если ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням 
		//////					Или СтрокаДвижений.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
		//////					СтрокаДвижений.ОтработаноДней = ИсходныеДанные.ОтработаноДней * ?(СтрокаДвижений.Сторно,-1,1);
		//////					СтрокаДвижений.ОтработаноЧасов = ИсходныеДанные.ОтработаноЧасов * ?(СтрокаДвижений.Сторно,-1,1);
		//////				Иначе
		//////					ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + СтрокаДвижений.ВидРасчета + ": Не задан вид учета времени");
		//////					БылоСообщениеОВидеВремени = Истина;
		//////				КонецЕсли;
		//////			КонецЕсли;
		//////		
		//////			Если ОсновныеНачисленияОрганизаций И ИсходныеДанные.ЗачетНормыВремени Тогда
		//////				СтрокаДвижений.НормаЧасов = 0;
		//////				СтрокаДвижений.НормаДней = 0;
		//////				Если ИсходныеДанные.НормаОплачиваемыхЧасов = NULL Тогда
		//////					Если Не БылоСообщениеОРабочемВремени Тогда
		//////						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + ": Нет рабочих дней в заданном периоде");
		//////					КонецЕсли;
		//////				ИначеЕсли ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням 
		//////					Или ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
		//////						СтрокаДвижений.НормаЧасов = ИсходныеДанные.НормаОплачиваемыхЧасов * ?(СтрокаДвижений.Сторно,-1,1);
		//////						СтрокаДвижений.НормаДней = ИсходныеДанные.НормаОплачиваемыхДней * ?(СтрокаДвижений.Сторно,-1,1);
		//////				ИначеЕсли Не БылоСообщениеОВидеВремени Тогда
		//////					ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + ": Не задан вид учета времени");
		//////				КонецЕсли;
		//////			КонецЕсли;
		//////		
		//////			Если ОсновныеНачисленияОрганизаций И ИсходныеДанные.ЗачетКалендарных Тогда
		//////				// только по основному назначению и без вяких замен
		//////				Если СтрокаДвижений.Назначение = СтрокаДвижений.Сотрудник Тогда
		//////					СтрокаДвижений.КалендарныеДни = ИсходныеДанные.КалендарныеДни * ?(СтрокаДвижений.Сторно,-1,1);
		//////				КонецЕсли;
		//////			КонецЕсли;
		//////		
		//////			// Перепишем данные из регистра в табличную часть документа
		//////			Если СтрокаТабличнойЧасти <> Неопределено тогда
		//////				Если ИсходныеДанные.ЗачетОтработанногоВремени Тогда
		//////					СтрокаТабличнойЧасти.ОтработаноДней = СтрокаДвижений.ОтработаноДней;
		//////					СтрокаТабличнойЧасти.ОтработаноЧасов = СтрокаДвижений.ОтработаноЧасов;
		//////				Иначе
		//////					СтрокаТабличнойЧасти.ОтработаноДней = 0;
		//////					СтрокаТабличнойЧасти.ОтработаноЧасов = 0;
		//////				КонецЕсли;
		//////			
		//////				Если ОсновныеНачисленияОрганизаций Тогда 
		//////					
		//////					Если ИсходныеДанные.ЗачетНормыВремени Тогда
		//////						СтрокаТабличнойЧасти.НормаДней = СтрокаДвижений.НормаДней;
		//////						СтрокаТабличнойЧасти.НормаЧасов = СтрокаДвижений.НормаЧасов;
		//////					Иначе
		//////						СтрокаТабличнойЧасти.НормаДней = 0;
		//////						СтрокаТабличнойЧасти.НормаЧасов = 0;
		//////					КонецЕсли;
		//////					
		//////					Если ИсходныеДанные.ЗачетКалендарных Тогда
		//////						СтрокаТабличнойЧасти.КалендарныеДни = СтрокаДвижений.КалендарныеДни;
		//////					Иначе
		//////						СтрокаТабличнойЧасти.КалендарныеДни = 0;
		//////					КонецЕсли;
		//////					
		//////				КонецЕсли;
		//////			
		//////			КонецЕсли;
		//////		
		//////		ИначеЕсли ВзносыВФонды И СтрокаДвижений.Авторасчет Тогда
		//////			Если СтрокаТабличнойЧасти <> НеОпределено Тогда
		//////				
		//////				СтрокаТабличнойЧасти.База                      = СтрокаДвижений.База;
		//////				СтрокаТабличнойЧасти.БазаВзноса                = СтрокаДвижений.БазаВзноса;
		//////				СтрокаТабличнойЧасти.СтатьяНалоговойДекларации = СтрокаДвижений.СтатьяНалоговойДекларации;
		//////				СтрокаТабличнойЧасти.Ставка                    = СтрокаДвижений.Ставка;
		//////				
		//////				Если ИсходныеДанные.ЗарплатаКВыплатеОрганизаций Тогда
		//////					СтрокаТабличнойЧасти.ПериодВзаиморасчетов	= ИсходныеДанные.Регистратор.ПериодРегистрации;
		//////				КонецЕсли;
		//////				
		//////			КонецЕсли;
		//////						
		//////		ИначеЕсли РегламентированныеУдержания И СтрокаДвижений.Авторасчет Тогда
		//////			Если СтрокаТабличнойЧасти <> НеОпределено Тогда
		//////				СтрокаТабличнойЧасти.Показатель1 = СтрокаДвижений[ПоказательРазмер];
		//////			КонецЕсли;
		//////		
		//////		КонецЕсли;
		//////	
		//////	КонецЕсли;
		//////	
		//////КонецЕсли;
		
		// нужно анализировать только записи, которые есть в списке Исходные данные
		СтрокаДвижений = НаборЗаписейРегистра[ИсходныеДанные.НомерСтроки - 1];
		
		// Позиционирование на строке ТЧ
		СтрокаТабличнойЧасти = Неопределено;
		Если ТабличнаяЧастьДокумента <> Неопределено Тогда
			
			Если ВзносыВФонды Тогда
				Если	Взносы 
					И	СтрокаДвижений.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы
					ИЛИ 
					ВзносыФОТ 
					И	СтрокаДвижений.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ
					Тогда
					СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(СтрокаДвижений.НомерСтрокиТЧ-1);
				Иначе
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли МассивИндексыСтрокТабличнойЧасти = Неопределено Тогда
				
				// Расчет всего документа
				СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений));
				
			Иначе
				
				//расчет по сотруднику
				СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(МассивИндексыСтрокТабличнойЧасти.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений)));
			КонецЕсли;
			
		КонецЕсли;
		
		РассчитатьЗаписьРегистраРасчета(СтрокаДвижений, ИсходныеДанные, НеобходимыеДанные, УправленческиеРасчеты, РегламентированныеНачисления, РегламентированныеУдержания, ОсновныеНачисленияОрганизаций, ВзносыВФонды, КомментироватьРасчет, ФормаКомментариев, ГрафикиБезРабочегоВремени);
		
		Если СтрокаДвижений.Авторасчет Тогда
			
			Если СтрокаТабличнойЧасти <> Неопределено Тогда
				СтрокаТабличнойЧасти.Результат = СтрокаДвижений.Результат;
				СтрокаТабличнойЧасти.РезультатУпр = СтрокаДвижений.РезультатУпр;
				Если НеобходимыеДанные.ВТабличнойЧастиЕстьУчетВремени И ОсновныеНачисленияОрганизаций И СтрокаДвижений.Авторасчет Тогда
					СтрокаТабличнойЧасти.ОплаченоДнейЧасов = СтрокаДвижений.ОплаченоДнейЧасов;
				ИначеЕсли НеобходимыеДанные.ВТабличнойЧастиЕстьУчетВремени И СтрокаДвижений.Авторасчет Тогда
					СтрокаТабличнойЧасти.ОплаченоДнейЧасов = 0;
				КонецЕсли;
			КонецЕсли;
			
			// если это данные по виду расчета, период действия которого является отработанным временем
			// или учитывается как норма времени, то для рассчитываемой записи сохраним данные о времени
			Если (НеобходимыеДанные.ВТабличнойЧастиЕстьУчетВремени И ОсновныеНачисленияОрганизаций ИЛИ УправленческиеНачисления) И СтрокаДвижений.Авторасчет Тогда
				
				СпособРасчета = ИсходныеДанные.СпособРасчета;
				
				БылоСообщениеОРабочемВремени = (
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку или 
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС или 
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка или 
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням или 
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам или
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке или
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке или
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы или
				СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы); 
				
				БылоСообщениеОВидеВремени = Ложь;
				
				Если ИсходныеДанные.ЗачетОтработанногоВремени Тогда
					СтрокаДвижений.ОтработаноДней = 0;
					СтрокаДвижений.ОтработаноЧасов = 0;
					Если Не БылоСообщениеОРабочемВремени  Тогда
						СообщениеОбОшибке = Ложь;
						ОплачиваемоеВремя = ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, , СообщениеОбОшибке, ГрафикиБезРабочегоВремени);
						БылоСообщениеОРабочемВремени = СообщениеОбОшибке;
					КонецЕсли;
					Если ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням 
						Или СтрокаДвижений.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
						СтрокаДвижений.ОтработаноДней = ИсходныеДанные.ОтработаноДней * ?(СтрокаДвижений.Сторно,-1,1);
						СтрокаДвижений.ОтработаноЧасов = ИсходныеДанные.ОтработаноЧасов * ?(СтрокаДвижений.Сторно,-1,1);
					Иначе
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + СтрокаДвижений.ВидРасчета + НСтр("ru=': Не задан вид учета времени';uk=': Не заданий вид обліку часу'"));
						БылоСообщениеОВидеВремени = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если ОсновныеНачисленияОрганизаций И ИсходныеДанные.ЗачетНормыВремени Тогда
					СтрокаДвижений.НормаЧасов = 0;
					СтрокаДвижений.НормаДней = 0;
					Если ИсходныеДанные.НормаОплачиваемыхЧасов = NULL Тогда
						Если Не БылоСообщениеОРабочемВремени Тогда
							ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет рабочих дней в заданном периоде';uk=': Немає робочих днів у заданому періоді'"));
						КонецЕсли;
					ИначеЕсли ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням 
						Или ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
						СтрокаДвижений.НормаЧасов = ИсходныеДанные.НормаОплачиваемыхЧасов * ?(СтрокаДвижений.Сторно,-1,1);
						СтрокаДвижений.НормаДней = ИсходныеДанные.НормаОплачиваемыхДней * ?(СтрокаДвижений.Сторно,-1,1);
					ИначеЕсли Не БылоСообщениеОВидеВремени Тогда
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не задан вид учета времени';uk=': Не заданий вид обліку часу'"));
					КонецЕсли;
				КонецЕсли;
				
				Если ОсновныеНачисленияОрганизаций И ИсходныеДанные.ЗачетКалендарных Тогда
					// только по основному назначению и без вяких замен
					Если СтрокаДвижений.Назначение = СтрокаДвижений.Сотрудник Тогда
						СтрокаДвижений.КалендарныеДни = ИсходныеДанные.КалендарныеДни * ?(СтрокаДвижений.Сторно,-1,1);
					КонецЕсли;
				КонецЕсли;
				
				// Перепишем данные из регистра в табличную часть документа
				Если СтрокаТабличнойЧасти <> Неопределено тогда
					Если ИсходныеДанные.ЗачетОтработанногоВремени Тогда
						СтрокаТабличнойЧасти.ОтработаноДней = СтрокаДвижений.ОтработаноДней;
						СтрокаТабличнойЧасти.ОтработаноЧасов = СтрокаДвижений.ОтработаноЧасов;
					Иначе
						СтрокаТабличнойЧасти.ОтработаноДней = 0;
						СтрокаТабличнойЧасти.ОтработаноЧасов = 0;
					КонецЕсли;
					
					Если ОсновныеНачисленияОрганизаций Тогда 
						
						Если ИсходныеДанные.ЗачетНормыВремени Тогда
							СтрокаТабличнойЧасти.НормаДней = СтрокаДвижений.НормаДней;
							СтрокаТабличнойЧасти.НормаЧасов = СтрокаДвижений.НормаЧасов;
						Иначе
							СтрокаТабличнойЧасти.НормаДней = 0;
							СтрокаТабличнойЧасти.НормаЧасов = 0;
						КонецЕсли;
						
						Если ИсходныеДанные.ЗачетКалендарных Тогда
							СтрокаТабличнойЧасти.КалендарныеДни = СтрокаДвижений.КалендарныеДни;
						Иначе
							СтрокаТабличнойЧасти.КалендарныеДни = 0;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ВзносыВФонды И СтрокаДвижений.Авторасчет Тогда
				Если СтрокаТабличнойЧасти <> НеОпределено Тогда
					
					СтрокаТабличнойЧасти.База                      = СтрокаДвижений.База;
					СтрокаТабличнойЧасти.БазаВзноса                = СтрокаДвижений.БазаВзноса;
					СтрокаТабличнойЧасти.СтатьяНалоговойДекларации = СтрокаДвижений.СтатьяНалоговойДекларации;
					СтрокаТабличнойЧасти.Ставка                    = СтрокаДвижений.Ставка;
					СтрокаТабличнойЧасти.СтавкаПолная              = СтрокаДвижений.СтавкаПолная;
					СтрокаТабличнойЧасти.РезультатПолная           = СтрокаДвижений.РезультатПолная;
					СтрокаТабличнойЧасти.БазаВычет                 = СтрокаДвижений.БазаВычет;
					СтрокаТабличнойЧасти.ТипНачисления             = СтрокаДвижений.ТипНачисления;
				
					Если ИсходныеДанные.ЗарплатаКВыплатеОрганизаций Тогда
						СтрокаТабличнойЧасти.ПериодВзаиморасчетов	= ИсходныеДанные.Регистратор.ПериодРегистрации;
					Иначе
						СтрокаТабличнойЧасти.БазаОтпускные = СтрокаДвижений.БазаОтпускные;
					КонецЕсли;
				СтрокаТабличнойЧасти.КоэффициентСтавки          = СтрокаДвижений.КоэффициентСтавки;
				СтрокаТабличнойЧасти.БазаДоначисление          = СтрокаДвижений.БазаДоначисление;
				СтрокаТабличнойЧасти.РезультатДоначисление     = СтрокаДвижений.РезультатДоначисление;

				КонецЕсли;
				
			ИначеЕсли РегламентированныеУдержания И СтрокаДвижений.Авторасчет Тогда
				Если СтрокаТабличнойЧасти <> НеОпределено Тогда
					СтрокаТабличнойЧасти.Показатель1 = СтрокаДвижений[ПоказательРазмер];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РассчитатьЗаписиНабора

Процедура РассчитатьЗаписиНабораСторноВзносовВФонды(ИсходныеДанныеСторно,
									НаборЗаписейРегистра,
									ТабличнаяЧастьДокумента,
									МассивИндексыСтрокТабличнойЧасти = Неопределено,
									КомментироватьРасчет = Ложь, ФормаКомментариев = НеОпределено)
	
	СтруктураПоиска = Новый Структура("НомерСтроки");
	ИсходныеДанныеСторно.Сбросить();
	Пока ИсходныеДанныеСторно.Следующий() Цикл
		
		Если ИсходныеДанныеСторно.ВидРасчета.СтавкаПоПериодуРегистрации Тогда
			Продолжить;
		КонецЕсли;
		
		Если КомментироватьРасчет Тогда
			КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет ';uk='Розрахунок '")+ИсходныеДанныеСторно.Налог+НСтр("ru=' за ';uk=' за '") + Формат(ИсходныеДанныеСторно.БазовыйПериодНачало,"ДФ='МММ гггг'"), , ИсходныеДанныеСторно.ВидРасчетаНаименование, ИсходныеДанныеСторно.ВидРасчета);
			
			КомментарийБазы = КомментарийРасчета(НСтр("ru='База сторно: ';uk='База сторно: '") + ИсходныеДанныеСторно.База, КомментарийВидаРасчета,,,, Ложь);
			КомментарийБазы = КомментарийРасчета(НСтр("ru='База с ограничением сторно: ';uk='База з обмеженням сторно: '") + ИсходныеДанныеСторно.БазаВзноса, КомментарийВидаРасчета,,,, Ложь);
			КомментарийРасчета(НСтр("ru='Сумма взноса сторно : ';uk='Сума внеска сторно : '") + ИсходныеДанныеСторно.Результат, КомментарийВидаРасчета);
			
		КонецЕсли;
			
		Если ИсходныеДанныеСторно.НомерСтрокиТЧ = NULL Тогда
			
			// аналогичная строка не нашлась надо создавать сторно запись
			// Названия всех переменных запроса соответствуют названиям измерений, 
			// ресурсов и реквизитов регистра расчета ВзносыВФонды
			Движение = НаборЗаписейРегистра.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ИсходныеДанныеСторно);	
			
			НоваяСтрока = ТабличнаяЧастьДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ИсходныеДанныеСторно);	
			
		Иначе
			//Движение = НаборЗаписейРегистра.Получить(МассивИндексыСтрокТабличнойЧасти.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений)));
			
			// все параметры совпали, достаточно просто откорректировать ресурсы
			Движение = НаборЗаписейРегистра.Получить(ИсходныеДанныеСторно.НомерСтрокиРегистратора-1);
			Движение.База		= Движение.База + ИсходныеДанныеСторно.База;
			Движение.БазаВзноса	= Движение.БазаВзноса + ИсходныеДанныеСторно.БазаВзноса;
			Движение.Результат	= Движение.Результат + ИсходныеДанныеСторно.Результат;
			Движение.РезультатУпр	= Движение.РезультатУпр + ИсходныеДанныеСторно.РезультатУпр;
			
			СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(ИсходныеДанныеСторно.НомерСтрокиТЧ-1);
			СтрокаТабличнойЧасти.База		= СтрокаТабличнойЧасти.База + ИсходныеДанныеСторно.База;
			СтрокаТабличнойЧасти.БазаВзноса	= СтрокаТабличнойЧасти.БазаВзноса + ИсходныеДанныеСторно.БазаВзноса;
			СтрокаТабличнойЧасти.Результат	= СтрокаТабличнойЧасти.Результат + ИсходныеДанныеСторно.Результат;
			СтрокаТабличнойЧасти.РезультатУпр	= СтрокаТабличнойЧасти.РезультатУпр + ИсходныеДанныеСторно.РезультатУпр;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РассчитатьЗаписиНабораСторноВзносовВФонды()


// Функция предназначена для получения структуры НеобходимыеДанные с элементами:
//			База
//			НормаВремени
//			ОтработаноВремени
// каждый из которых - булево и означает необходимость получения соотвю исходных данных для 
// расчета записей регистра расчета
// Параметр:
//	МассивСпособовРасчета - массив элементов типа СпособРасчетаСсылка или ПланВидовРасчетаСсылка
Функция ПолучитьСтруктуруНеобходимыхДанных(МассивСпособовРасчета, НеобходимыеДанные, МассивПоказателей) Экспорт
	
	НеобходимыеДанные = Новый Структура;
	НеобходимыеДанные.Вставить("База", Ложь);
	НеобходимыеДанные.Вставить("НормаВремени", Ложь);
	НеобходимыеДанные.Вставить("НормаВремениЗаМесяц", Ложь);
	НеобходимыеДанные.Вставить("ОтработаноВремени", Ложь);

	НеобходимыеДанные.Вставить("ИсчисленныйНДФЛ", Ложь);
	НеобходимыеДанные.Вставить("ПределПоДокументуОснованию", Ложь); //?
	НеобходимыеДанные.Вставить("НакопленныеДанныеПоДокументуОснованию", Ложь);
	НеобходимыеДанные.Вставить("ПоказателиСхемМотивации", Ложь);
	НеобходимыеДанные.Вставить("Стаж", Ложь);
	НеобходимыеДанные.Вставить("ВремяВКалендарныхДнях", Ложь);  //?
	НеобходимыеДанные.Вставить("КалендарныхДнейВмесяце", Ложь); //?
	
	НеобходимыеДанные.Вставить("КадровыеДанные", Ложь);
	НеобходимыеДанные.Вставить("БазаУдержаний", Ложь);
	НеобходимыеДанные.Вставить("ВыслугаЛет", Ложь);
	НеобходимыеДанные.Вставить("ПараметрыИсполнительногоЛиста", Ложь);
	НеобходимыеДанные.Вставить("Календарные", Ложь);
	
	НеобходимыеДанные.Вставить("ПараметрыПочты", Ложь);
	НеобходимыеДанные.Вставить("ПараметрыИндексацииАлиментов", Ложь);
	НеобходимыеДанные.Вставить("ИсчисленныеВзносы", Ложь);
 	
	НеобходимыеДанные.Вставить("СуммаКомпенсации", Ложь);
	НеобходимыеДанные.Вставить("НеобходимыИндексыИнфляции", Ложь);
	НеобходимыеДанные.Вставить("ИндексацияЗарплаты", Ложь);
	НеобходимыеДанные.Вставить("ИндексацияСоциальныхНачислений", Ложь);
	НеобходимыеДанные.Вставить("БазаИндексацииСовместителя", Ложь);

	НеобходимыеДанные.Вставить("ДоплатаДоМЗП", Ложь);
	НеобходимыеДанные.Вставить("МинимальнаяЗарплата", Ложь);

	// для расчета базы необходимо получить Минимальную зарплату для социальных групп
	тбСоциальныеГруппы = Новый ТаблицаЗначений;
	тбСоциальныеГруппы.Колонки.Добавить("СоцГруппа");
	СтрокатбСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
	СтрокатбСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.ДетиДо6;
	СтрокатбСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
	СтрокатбСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.ДетиДо18;
	СтрокатбСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
	СтрокатбСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.Трудоспособные; 
	СтрокатбСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
	СтрокатбСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.НеТрудоспособные;
	// полученные доп.параметры помещаем в структуру
	НеобходимыеДанные.Вставить("тбСоциальныеГруппы", тбСоциальныеГруппы);
	
	// данный Если... необходимо пополнять при появлении новых способ расчета или
	// видов расчета, которые не укладываются ни в один из способов
	Для Каждого СпособРасчета Из МассивСпособовРасчета Цикл
		Если 	
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам ИЛИ 
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
			Тогда
			НеобходимыеДанные.ОтработаноВремени = Истина;
			НеобходимыеДанные.НормаВремени = Истина;
			НеобходимыеДанные.НормаВремениЗаМесяц = Истина;
			НеобходимыеДанные.КадровыеДанные = Истина; 
			НеобходимыеДанные.Календарные = Истина; 
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
			НеобходимыеДанные.ОтработаноВремени   = Истина;
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
			НеобходимыеДанные.ОтработаноВремени   = Истина;
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Тогда
			НеобходимыеДанные.База = Истина;
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВыслугаЛет Тогда
			НеобходимыеДанные.База       = Истина;
			НеобходимыеДанные.ВыслугаЛет = Истина;
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнителныйЛистСУчетомОграничения Тогда
			НеобходимыеДанные.БазаУдержаний = Истина;
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом
			ИЛИ 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом Тогда
			НеобходимыеДанные.База = Истина;
			НеобходимыеДанные.ИсчисленныйНДФЛ = Истина;
			НеобходимыеДанные.ИсчисленныеВзносы = Истина;
			НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию = Истина;
			НеобходимыеДанные.ПараметрыИсполнительногоЛиста = Истина;	
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела
			ИЛИ 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела Тогда
			НеобходимыеДанные.База = Истина;
			НеобходимыеДанные.ИсчисленныйНДФЛ = Истина;
			НеобходимыеДанные.ИсчисленныеВзносы = Истина;
			НеобходимыеДанные.ПределПоДокументуОснованию = Истина;
			НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию = Истина;
			НеобходимыеДанные.ПараметрыИсполнительногоЛиста = Истина;	
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммой
			ИЛИ 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммой Тогда

			НеобходимыеДанные.БазаУдержаний = Истина;
			НеобходимыеДанные.ПараметрыИсполнительногоЛиста = Истина;	
			
			
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела
			ИЛИ 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела Тогда
			НеобходимыеДанные.ПределПоДокументуОснованию = Истина;
			НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию = Истина;
			НеобходимыеДанные.ПараметрыИсполнительногоЛиста = Истина;
			
		ИначеЕсли	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС 
			ИЛИ СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку 
			ИЛИ СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска 
			Тогда
			
			НеобходимыеДанные.ОтработаноВремени = Истина;
			НеобходимыеДанные.НормаВремени = Истина;
			НеобходимыеДанные.Календарные = Истина;
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Тогда
			НеобходимыеДанные.База = Истина;
			НеобходимыеДанные.НормаВремени = Истина;
			НеобходимыеДанные.ОтработаноВремени = Истина;
			НеобходимыеДанные.Календарные = Истина;
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор Тогда
			НеобходимыеДанные.База = Истина;
			НеобходимыеДанные.ПараметрыПочты =  Истина;
			НеобходимыеДанные.ПараметрыИсполнительногоЛиста = Истина;	
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияАлиментов Тогда
			НеобходимыеДанные.База = Истина;
			НеобходимыеДанные.ПараметрыИндексацииАлиментов =  Истина;
			НеобходимыеДанные.ПараметрыИсполнительногоЛиста = Истина;
			НеобходимыеДанные.НеобходимыИндексыИнфляции = Истина;	
			
			тбКоэффициентыИндексации = Новый ТаблицаЗначений;
			тбКоэффициентыИндексации.Колонки.Добавить("Начало");
			тбКоэффициентыИндексации.Колонки.Добавить("Конец");
			тбКоэффициентыИндексации.Колонки.Добавить("ИндексацияАлиментов");
			
			НеобходимыеДанные.Вставить("тбКоэффициентыИндексации", тбКоэффициентыИндексации);
			НеобходимыеДанные.Вставить("НачалоРасчетаИндексации", ДатаНачалаИндексацииАлиментов());
			НеобходимыеДанные.Вставить("ПорогИндексации", 0);
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.УдержаниеФиксированнойСуммой Тогда
			НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию = Истина;
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.КомпенсацияНевыплаченнойЗарплаты Тогда
			НеобходимыеДанные.СуммаКомпенсации = Истина;	
			НеобходимыеДанные.НеобходимыИндексыИнфляции = Истина;	
			
			тбКоэффициентыИнфляции = Новый ТаблицаЗначений;
			тбКоэффициентыИнфляции.Колонки.Добавить("Начало");
			тбКоэффициентыИнфляции.Колонки.Добавить("Конец");
			тбКоэффициентыИнфляции.Колонки.Добавить("КоэффициентИнфляции");
			
			НеобходимыеДанные.Вставить("тбКоэффициентыИнфляции", тбКоэффициентыИнфляции);
			
		ИначеЕсли   СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты
			Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений Тогда
			//НеобходимыеДанные.База = Истина;	
			НеобходимыеДанные.НеобходимыИндексыИнфляции = Истина;	
			НеобходимыеДанные.База = Истина;
			
			Если СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты Тогда
				НеобходимыеДанные.ИндексацияЗарплаты = Истина;
			ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений Тогда
				НеобходимыеДанные.ИндексацияСоциальныхНачислений = Истина;
			КонецЕсли;
			
			// для расчета коэффициента индексации необходимо заполнить таблицу с индексами инфляции
			тбКоэффициентыИндексации = Новый ТаблицаЗначений;
			тбКоэффициентыИндексации.Колонки.Добавить("Начало");
			тбКоэффициентыИндексации.Колонки.Добавить("Конец");
			тбКоэффициентыИндексации.Колонки.Добавить("ИндексацияЗарплаты");
			тбКоэффициентыИндексации.Колонки.Добавить("ИндексацияСоциальныхНачислений");
			
			
			// для расчета базы необходимо получить Минимальную зарплату для социальных групп
			тбСоциальныеГруппы = Новый ТаблицаЗначений;
			тбСоциальныеГруппы.Колонки.Добавить("СоцГруппа");
			
			СтрокатаСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
			СтрокатаСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.ДетиДо6;
			СтрокатаСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
			СтрокатаСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.ДетиДо18;
			СтрокатаСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
			СтрокатаСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.Трудоспособные; 
			СтрокатаСоциальныеГруппы = тбСоциальныеГруппы.Добавить();
			СтрокатаСоциальныеГруппы.СоцГруппа = Перечисления.СоциальныеГруппыНаселения.НеТрудоспособные;
			
			// полученные доп.параметры помещаем в структуру
			НеобходимыеДанные.Вставить("тбКоэффициентыИндексации", тбКоэффициентыИндексации);
			НеобходимыеДанные.Вставить("тбСоциальныеГруппы", тбСоциальныеГруппы);
			НеобходимыеДанные.Вставить("НачалоРасчетаИндексации", '2003.03.01');
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоМЗП Тогда
			НеобходимыеДанные.База = Истина;
	        НеобходимыеДанные.ДоплатаДоМЗП = Истина;
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
			НеобходимыеДанные.ПоказателиСхемМотивации = Истина;
			
		ИначеЕсли
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой или
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой 
			Тогда
			// ничего...
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Показатель Из МассивПоказателей Цикл
		
		НеобходимыеДанные.ОтработаноВремени = НеобходимыеДанные.ОтработаноВремени 
			Или Показатель = Справочники.ПоказателиСхемМотивации.ВремяВДнях 
			Или Показатель = Справочники.ПоказателиСхемМотивации.ВремяВЧасах;
			
		НеобходимыеДанные.НормаВремени = НеобходимыеДанные.НормаВремени 
			Или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениВДнях 
			Или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениВЧасах;
			
		НеобходимыеДанные.НормаВремениЗаМесяц = НеобходимыеДанные.НормаВремениЗаМесяц 
			Или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях 
			Или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах;
			
		НеобходимыеДанные.База = НеобходимыеДанные.База 
			Или Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБаза;
			
		НеобходимыеДанные.ВремяВКалендарныхДнях = НеобходимыеДанные.ВремяВКалендарныхДнях 
			Или Показатель = Справочники.ПоказателиСхемМотивации.ВремяВКалендарныхДнях;
		//НеобходимыеДанные.КалендарныхДнейВмесяце = НеобходимыеДанные.КалендарныхДнейВмесяце Или Показатель = Справочники.ПоказателиСхемМотивации.КалендарныхДнейВмесяце;
		НеобходимыеДанные.МинимальнаяЗарплата = НеобходимыеДанные.МинимальнаяЗарплата 
			Или Показатель = Справочники.ПоказателиСхемМотивации.МинимальнаяЗарплата 
			Или Показатель = Справочники.ПоказателиСхемМотивации.МинимальнаяЗарплатаЧасовая;

	КонецЦикла;
	
	Возврат НеобходимыеДанные;
КонецФункции

// Рассчитывает значение ресурса записи регистра расчета по ее реквизитам и дополнительным данным
//
// Параметры: 
//  СтрокаДвижений	- рассчитываемая запись регистра расчета
//  ИсходныеДанные	- выборка из результата запроса с исходными данными для расчета
//  УправленческиеРасчеты - булево, признак того, что это расчет управленческий
//  РегламентированныеНачисления - булево, признак того, что это регламентированное начисление
//  ОсновныеНачисленияОрганизаций - булево, признак того, что это именно основое регламентированное начисление
//
// Возвращаемое значение:
//  Нет.
//
Процедура РассчитатьЗаписьРегистраРасчета(СтрокаДвижений,
	ИсходныеДанные,
	НеобходимыеДанные,
	УправленческиеРасчеты,
	РегламентированныеНачисления,
	РегламентированныеУдержания,
	ОсновныеНачисленияОрганизаций,
	ВзносыВФонды,
	КомментироватьРасчет, ФормаКомментариев, ГрафикиБезРабочегоВремени)
	
	ВидРасчета = СтрокаДвижений.ВидРасчета;
	СпособРасчета = ИсходныеДанные.СпособРасчета;
	Результат = 0;
	КурсВалютыУпр = ?(ИсходныеДанные.ОтражатьВУпрУчете И ИсходныеДанные.КурсВалютыУпр<>NULL, ИсходныеДанные.КурсВалютыУпр, 0);
	
	РезультатПолучен = Истина;
	ПоказательРазмер = "Показатель1";
	
	// расчет будем проводить только для авторассчитываемой записи
	Если СтрокаДвижений.Авторасчет Тогда
		
		// этот Если... нужно расширять при появлении новых способов расчета или видов расчета,
		// которые не укладываются в тот или иной способ
		
		Если КомментироватьРасчет Тогда
			// основное назначение
			Если ВзносыВФонды Тогда
				КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет ';uk='Розрахунок '")+СтрокаДвижений.Налог+НСтр("ru=' за ';uk=' за '") + Формат(СтрокаДвижений.БазовыйПериодНачало,"ДФ='МММ гггг'"), , ИсходныеДанные.ВидРасчетаНаименование, СтрокаДвижений.ВидРасчета);
			Иначе
				Если РегламентированныеНачисления И СтрокаДвижений.Сотрудник <> СтрокаДвижений.Назначение Тогда
					КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет ';uk='Розрахунок '")+СтрокаДвижений.Назначение, , ИсходныеДанные.ВидРасчетаНаименование, СтрокаДвижений.ВидРасчета);
					КомментарийРасчета(НСтр("ru='Способ расчета: ';uk='Спосіб розрахунку: '") + ИсходныеДанные.СпособРасчета, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Порядок расчета: ';uk='Порядок розрахунку: '") + ВизуализироватьФормулуРасчета(ИсходныеДанные.ВидРасчета), КомментарийВидаРасчета);
				Иначе
					КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет ';uk='Розрахунок '"), , ИсходныеДанные.ВидРасчетаНаименование, СтрокаДвижений.ВидРасчета);
					КомментарийРасчета(НСтр("ru='Способ расчета: ';uk='Спосіб розрахунку: '") + ИсходныеДанные.СпособРасчета, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Порядок расчета: ';uk='Порядок розрахунку: '") + ВизуализироватьФормулуРасчета(ИсходныеДанные.ВидРасчета), КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Тогда
			// Размер - процент доплаты
			Если ИсходныеДанные.РезультатБаза = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисления ';uk=': Не визначені базові нарахування'"));
			Иначе
				Если КомментироватьРасчет Тогда
					КомментарийБазы = КомментарийРасчета(НСтр("ru='Базовые начисления составили всего: ';uk='Базові нарахування склали всього: '") + ИсходныеДанные.РезультатБаза, КомментарийВидаРасчета,,,, Ложь);
					РасшифровкаБазы = ИсходныеДанные.Выбрать();
					Пока РасшифровкаБазы.Следующий() Цикл
						Если РасшифровкаБазы.РезультатБаза <> 0 Тогда
							КомментарийРасчета(РасшифровкаБазы.ВидРасчетаРазрезНаименование + ": " + РасшифровкаБазы.РезультатБаза, КомментарийБазы);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если РегламентированныеУдержания Тогда
					УжеНачисленоВТекущемПериоде = ?(ИсходныеДанные.УжеНачисленоВТекущемПериоде = Null, 0, ИсходныеДанные.УжеНачисленоВТекущемПериоде);
					Результат = Макс(ИсходныеДанные.РезультатБаза * СтрокаДвижений[ПоказательРазмер]/100 - УжеНачисленоВТекущемПериоде,0);
					Если КомментироватьРасчет Тогда
						КомментарийРасчета(НСтр("ru='Процент: ';uk='Відсоток: '") + СтрокаДвижений[ПоказательРазмер], КомментарийВидаРасчета);
						КомментарийРасчета(НСтр("ru='Ранее начислено в текущем периоде: ';uk='Раніше нараховано в поточному періоді: '") + УжеНачисленоВТекущемПериоде, КомментарийВидаРасчета);
					КонецЕсли;
				Иначе
					Результат = ИсходныеДанные.РезультатБаза * СтрокаДвижений[ПоказательРазмер]/100;
					Если КомментироватьРасчет Тогда
						КомментарийРасчета(НСтр("ru='Процент: ';uk='Відсоток: '") + СтрокаДвижений[ПоказательРазмер], КомментарийВидаРасчета);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
				
			
			// ФиксированнойСуммой
			//		
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой 
			ИЛИ СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой 
			ИЛИ СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.УдержаниеФиксированнойСуммой Тогда
			Результат = СтрокаДвижений[ПоказательРазмер];
			
			// НулеваяСумма
			//		
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма Тогда
			// Ничего не считаем 
			

			// ПоМесячнойТарифнойСтавкеПоДням
			// ПоМесячнойТарифнойСтавкеПоЧасам
		ИначеЕсли
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням или 
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам
			Тогда
			
			НормаВремени = ?( СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням , СтрокаДвижений.НормаДнейЗаМесяц,СтрокаДвижений.НормаЧасовЗаМесяц);
			СообщениеОбОшибке = Ложь;
			ОтработаноВремениОсновное = ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, КомментарийВидаРасчета, СообщениеОбОшибке, ГрафикиБезРабочегоВремени);
			Если НЕ СообщениеОбОшибке И НормаВремени = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет рабочих дней в заданном периоде';uk=': Немає робочих днів у заданому періоді'"));
			КонецЕсли;
			Если НормаВремени <> 0 Тогда
				Результат = СтрокаДвижений[ПоказательРазмер] * ОтработаноВремениОсновное / НормаВремени;
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='Тарифная ставка: ';uk='Тарифна ставка: '") + СтрокаДвижений[ПоказательРазмер], КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Норма времени: ';uk='Норма часу: '") + НормаВремени, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;
			
			СтрокаДвижений.ОплаченоДнейЧасов = ОтработаноВремениОсновное * ?(СтрокаДвижений.Сторно,-1,1);
			
			// ПоЧасовойТарифнойСтавке
			// ПоДневнойТарифнойСтавке
			//
		ИначеЕсли
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке или
			СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке
			Тогда
			
			ОтработаноВремениОсновное = ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, КомментарийВидаРасчета, , ГрафикиБезРабочегоВремени);
			Результат = СтрокаДвижений[ПоказательРазмер] * ОтработаноВремениОсновное;
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Тарифная ставка: ';uk='Тарифна ставка: '") + СтрокаДвижений[ПоказательРазмер], КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Отработанное время: ';uk='Відпрацьований час: '") + ОтработаноВремениОсновное, КомментарийВидаРасчета);
			КонецЕсли;
			
			СтрокаДвижений.ОплаченоДнейЧасов = ОтработаноВремениОсновное * ?(СтрокаДвижений.Сторно,-1,1);			

			// ДоплатаЗаВечерниеЧасы
			//
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Тогда
			
			ОтработаноВремениОсновное	= ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, КомментарийВидаРасчета, , ГрафикиБезРабочегоВремени);
			ЧасовойТариф	= СтрокаДвижений.Показатель1;
			КоэффициентВечерних	= СтрокаДвижений.Показатель2/100;
			Результат = ЧасовойТариф * КоэффициентВечерних * ОтработаноВремениОсновное;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Коэффициент вечерних: ';uk='Коефіцієнт вечірніх: '") + СтрокаДвижений.Показатель2+"%", КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Часовой тариф: ';uk='Часовий тариф: '") + ЧасовойТариф, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Отработанное время: ';uk='Відпрацьований час: '") + ОтработаноВремениОсновное, КомментарийВидаРасчета);
			КонецЕсли;
			
			СтрокаДвижений.ОплаченоДнейЧасов = ОтработаноВремениОсновное * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// ДоплатаЗаНочныеЧасы
			//
		ИначеЕсли 	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
			
			ОтработаноВремениОсновное	= ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, КомментарийВидаРасчета, , ГрафикиБезРабочегоВремени);
			ЧасовойТариф	= СтрокаДвижений.Показатель1;
			КоэффициентНочных	= СтрокаДвижений.Показатель2/100;
			Результат = ЧасовойТариф * КоэффициентНочных * ОтработаноВремениОсновное;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Коэффициент ночных: ';uk='Коефіцієнт нічних: '")+СтрокаДвижений.Показатель2+"%", КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Часовой тариф: ';uk='Часовий тариф: '") + ЧасовойТариф, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Отработанное время: ';uk='Відпрацьований час: '") + ОтработаноВремениОсновное, КомментарийВидаРасчета);
			КонецЕсли;
			
			СтрокаДвижений.ОплаченоДнейЧасов = ОтработаноВремениОсновное * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// ПочтовыйСбор для исполнительных листов
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор Тогда
			
			Если ИсходныеДанные.РазмерПочтовогоПеревода = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определен размер почтового переода  ';uk=': Не визначено розмір поштового переказу '"));
			ИначеЕсли ИсходныеДанные.РазмерПочтовогоПеревода <> 0 И ИсходныеДанные.Ставка = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определена ставка почтового сбора  ';uk=': Не визначена ставка поштового збору '"));
			ИначеЕсли ИсходныеДанные.РазмерПочтовогоПеревода = 0 Тогда
			Иначе
				 
				РезультатБаза = ИсходныеДанные.РазмерПочтовогоПеревода;
				СуммаДополнительно = ИсходныеДанные.СуммаДополнительно;
				СуммаМинимальная = ИсходныеДанные.СуммаМинимальная; 
				//Результат = (РезультатБаза * ИсходныеДанные.Ставка + СуммаДополнительно) *1.2;
				//Убираем НДС согласно постановления ПНБУ №400 от 15.11.2011г.
				//или же оставляем согласно письма ДПСУ от 09.02.2012 № 1706/5/15-3416
				НеУчитыватьНДСДляПочтовогоСбора = ВариантыАлгоритмовРасчетаЗарплаты().НеУчитыватьНДСДляПочтовогоСбора;
				РазмерПочтовогоСбора = ?(РезультатБаза * ИсходныеДанные.Ставка < СуммаМинимальная, СуммаМинимальная,РезультатБаза * ИсходныеДанные.Ставка);
				Результат = (РазмерПочтовогоСбора + СуммаДополнительно) *?(ИсходныеДанные.Регистратор.ПериодРегистрации >= Дата(2012,1,1) И НеУчитыватьНДСДляПочтовогоСбора,1,1.2); 
				//Запишем ставку в размер
				СтрокаДвижений[ПоказательРазмер] = ИсходныеДанные.Ставка;
				
			КонецЕсли;
				// ИндексацияАлиментов для исполнительных листов
				//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияАлиментов Тогда
			
			Если ИсходныеДанные.БазаИндексации = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определен размер алиментов для индексации  ';uk=': Не визначений розмір аліментів для індексації '"));
			ИначеЕсли ИсходныеДанные.БазаИндексации = 0 Тогда
				//Дальше можно не проверять и не считать
			Иначе
	
				Начало = НачалоМесяца(?(ИсходныеДанные.НачалоИндексации = Null, Дата("00010101"), ИсходныеДанные.НачалоИндексации));
				Конец  = СтрокаДвижений.ПериодРегистрации;
				БазовыйМесяц = НачалоМесяца(ДобавитьМесяц(Макс(Начало, НеобходимыеДанные.НачалоРасчетаИндексации),-1));
				                          
				КоэффициентИндексации	= РассчитатьЗаписьРегистраРасчета_Индексация_Коэффициент( БазовыйМесяц, Конец, НеобходимыеДанные, "ИндексацияАлиментов" );
				
				РезультатБаза = МИН (ИсходныеДанные.БазаИндексации, ИсходныеДанные.АлиментыТрудоспособные);
				
				Результат = РезультатБаза * КоэффициентИндексации;
				
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='Базовый месяц: ';uk='Базовий місяць: '") + БазовыйМесяц, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Коэффициент индексации: ';uk='Коефіцієнт індексації: '") + КоэффициентИндексации, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='База: ';uk='База: '") + ИсходныеДанные.БазаИндексации, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Прожиточный минимум: ';uk='Прожитковий мінімум: '") + ИсходныеДанные.АлиментыТрудоспособные, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='База индексации: ';uk='База індексації: '") + РезультатБаза, КомментарийВидаРасчета);
				КонецЕсли;
				
			КонецЕсли;
	
			
			// ВыслугаЛет                                                      
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВыслугаЛет Тогда
			
			Если ИсходныеДанные.РезультатБаза = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определена база ';uk=': Не визначена база '"));
			ИначеЕсли ИсходныеДанные.СтавкаВыслуги = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных для расчета выслуги (проверьте список ""Начальные сведения о стаже работников организации"")';uk=': Немає даних для розрахунку вислуги (перевірте список ""Початкові відомості про стаж працівників організації"")'"));
			Иначе
				
				РезультатБаза = ИсходныеДанные.РезультатБаза; 
				Результат = РезультатБаза * ИсходныеДанные.СтавкаВыслуги;
				
			КонецЕсли;
			
			// ИсполнительныйЛистПроцентом
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом Тогда
			
			// Размер - процент удержания
			Если ИсходныеДанные.РезультатБаза = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисления ';uk=': Не визначені базові нарахування'"));
			Иначе                                                
				
				ИсчисленныйНДФЛ 			= ?(ИсходныеДанные.ИсчисленныйНДФЛ = Null, 0, ИсходныеДанные.ИсчисленныйНДФЛ);
				ИсчисленныеВзносы 			= ?(ИсходныеДанные.Взносы = Null, 0, ИсходныеДанные.Взносы);
				
				РезультатБаза = ИсходныеДанные.РезультатБаза - ИсчисленныйНДФЛ - ИсчисленныеВзносы;
				
				Результат = РезультатБаза * СтрокаДвижений[ПоказательРазмер] / 100;
				
			КонецЕсли;            
			
			// АлиментыПроцентом
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом Тогда
			
			// Размер - процент удержания
			Если ИсходныеДанные.РезультатБаза = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисленияя ';uk=': Не визначені базові нарахування'"));
			ИначеЕсли ИсходныеДанные.ДетейВДокументеВсего = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': В исполнительном листе на уплату алементов не указанны данные о детях ';uk=': У виконавчому листі на сплату аліментів не вказані дані про дітей '"));
			Иначе
				
				АлиментыДетиДо6 		= ?(ИсходныеДанные.АлиментыДетиДо6 = Null	, 0, ИсходныеДанные.АлиментыДетиДо6);
				АлиментыДетиДо18 		= ?(ИсходныеДанные.АлиментыДетиДо18 = Null	, 0, ИсходныеДанные.АлиментыДетиДо18);
				АлиментыТрудоспособные 	= ?(ИсходныеДанные.АлиментыТрудоспособные = Null	, 0, ИсходныеДанные.АлиментыТрудоспособные);

				ДетейВДокументе6 	= ?(ИсходныеДанные.ДетейВДокументе6 = Null	, 0, ИсходныеДанные.ДетейВДокументе6);
				ДетейВДокументе18 	= ?(ИсходныеДанные.ДетейВДокументе18 = Null	, 0, ИсходныеДанные.ДетейВДокументе18);
				ДетейВДокументе19 	= ?(ИсходныеДанные.ДетейВДокументе19 = Null	, 0, ИсходныеДанные.ДетейВДокументе19);
				
				ПределПоПрожиточнымМинимумам = ИсходныеДанные.ПроцентДоплатиПоАлиментам * (ДетейВДокументе6*АлиментыДетиДо6 
													+ АлиментыДетиДо18*ДетейВДокументе18
													+ АлиментыТрудоспособные*ДетейВДокументе19);
													
				// все дети указанные в исполнительном листе
				ДетейВДокументеВсего = ?(ИсходныеДанные.ДетейВДокументеВсего = Null	, 0, ИсходныеДанные.ДетейВДокументеВсего);
				
				// дети которые уже достигли возраста указанного вдокументе
				ДетейВДокументе 	 = ?(ИсходныеДанные.ДетейВДокументе = Null	, 0, ИсходныеДанные.ДетейВДокументе);
				Если ДетейВДокументеВсего = 0 Тогда
					Сообщить(""+СтрокаДвижений.Сотрудник + "; " + СтрокаДвижений.ВидРасчета + НСтр("ru=': В исполнительном листе на уплату алементов не указанны данные о детях ';uk=': У виконавчому листі на сплату аліментів не вказані дані про дітей '"), СтатусСообщения.Важное);
					Возврат;	
				КонецЕсли;	
				
				ИсчисленныйНДФЛ 			= ?(ИсходныеДанные.ИсчисленныйНДФЛ = Null  , 0, ИсходныеДанные.ИсчисленныйНДФЛ);
				ИсчисленныеВзносы 			= ?(ИсходныеДанные.Взносы = Null, 0, ИсходныеДанные.Взносы);
				
				РезультатБаза = ИсходныеДанные.РезультатБаза - ИсчисленныйНДФЛ - ИсчисленныеВзносы;
				
				Результат = (РезультатБаза * СтрокаДвижений[ПоказательРазмер]/100)*ДетейВДокументе/ДетейВДокументеВсего ;
				
				Если ИсходныеДанные.ПометкаУвеличиватьДоМинимума  Тогда
					Результат = Макс(Результат, ПределПоПрожиточнымМинимумам);
				КонецЕсли;
				
			КонецЕсли;
			
			
			// ИсполнительныйЛистПроцентомДоПредела
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела Тогда
			
			// Размер - процент удержания
			Если ИсходныеДанные.РезультатБаза = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисленияя ';uk=': Не визначені базові нарахування'"));
			Иначе
				
				ИсчисленныйНДФЛ 			= ?(ИсходныеДанные.ИсчисленныйНДФЛ = Null, 0, ИсходныеДанные.ИсчисленныйНДФЛ);
				ИсчисленныеВзносы 			= ?(ИсходныеДанные.Взносы = Null, 0, ИсходныеДанные.Взносы);
				УжеНачисленоВТекущемПериоде = ?(ИсходныеДанные.УжеНачисленоВТекущемПериоде = Null, 0, ИсходныеДанные.УжеНачисленоВТекущемПериоде);
				РезультатБаза = ИсходныеДанные.РезультатБаза - ИсчисленныйНДФЛ - ИсчисленныеВзносы;
				
				Результат = Макс((РезультатБаза * СтрокаДвижений[ПоказательРазмер]/100) - УжеНачисленоВТекущемПериоде, 0);
				
				ПределПоДокументуОснованию  = ?(ИсходныеДанные.ПределПоДокументуОснованию = Null, 0 ,ИсходныеДанные.ПределПоДокументуОснованию);
				УжеНачисленоЗаВсюИсторию 	= ?(ИсходныеДанные.УжеНачисленоЗаВсюИсторию = Null, 0, ИсходныеДанные.УжеНачисленоЗаВсюИсторию);
				
				// Ограничим результат расчета в случае достижения предела удержания
				Результат = Мин(Результат, ПределПоДокументуОснованию  - УжеНачисленоЗаВсюИсторию);

			КонецЕсли;
			
			// АлиментыПроцентомДоПредела
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела Тогда
			
			// Размер - процент удержания
			Если ИсходныеДанные.РезультатБаза = NULL Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисленияя ';uk=': Не визначені базові нарахування'"));
			ИначеЕсли ИсходныеДанные.ДетейВДокументеВсего = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': В исполнительном листе на уплату элементов не указанны данные о детях ';uk=': У виконавчому листі на сплату елементів не вказані дані про дітей '"));
			Иначе
				
				АлиментыДетиДо6 		= ?(ИсходныеДанные.АлиментыДетиДо6 = Null	, 0, ИсходныеДанные.АлиментыДетиДо6);
				АлиментыДетиДо18 		= ?(ИсходныеДанные.АлиментыДетиДо18 = Null	, 0, ИсходныеДанные.АлиментыДетиДо18);
				АлиментыТрудоспособные 	= ?(ИсходныеДанные.АлиментыТрудоспособные = Null	, 0, ИсходныеДанные.АлиментыТрудоспособные);

				ДетейВДокументе6 	= ?(ИсходныеДанные.ДетейВДокументе6 = Null	, 0, ИсходныеДанные.ДетейВДокументе6);
				ДетейВДокументе18 	= ?(ИсходныеДанные.ДетейВДокументе18 = Null	, 0, ИсходныеДанные.ДетейВДокументе18);
				ДетейВДокументе19 	= ?(ИсходныеДанные.ДетейВДокументе19 = Null	, 0, ИсходныеДанные.ДетейВДокументе19);
				
				ПределПоПрожиточнымМинимумам = ИсходныеДанные.ПроцентДоплатиПоАлиментам * (ДетейВДокументе6*АлиментыДетиДо6 
													+ АлиментыДетиДо18*ДетейВДокументе18
													+ АлиментыТрудоспособные*ДетейВДокументе19);
				
				// все дети указанные в исполнительном листе
				ДетейВДокументеВсего = ?(ИсходныеДанные.ДетейВДокументеВсего = Null	, 0, ИсходныеДанные.ДетейВДокументеВсего);
				
				// дети которые уже достигли возраста указанного вдокументе
				ДетейВДокументе 	 = ?(ИсходныеДанные.ДетейВДокументе = Null	, 0, ИсходныеДанные.ДетейВДокументе);
				Если ДетейВДокументеВсего = 0 Тогда
					ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': В исполнительном листе на уплату алементов не указанны данные о детях ';uk=': У виконавчому листі на сплату аліментів не вказані дані про дітей '"));
					Возврат;	
				КонецЕсли;	
				
				ИсчисленныйНДФЛ 			= ?(ИсходныеДанные.ИсчисленныйНДФЛ = Null  , 0, ИсходныеДанные.ИсчисленныйНДФЛ);
				ИсчисленныеВзносы 			= ?(ИсходныеДанные.Взносы = Null, 0, ИсходныеДанные.Взносы);
				
				РезультатБаза = ИсходныеДанные.РезультатБаза - ИсчисленныйНДФЛ - ИсчисленныеВзносы;
				
				УжеНачисленоВТекущемПериоде = ?(ИсходныеДанные.УжеНачисленоВТекущемПериоде = Null, 0, ИсходныеДанные.УжеНачисленоВТекущемПериоде);
				
				Если ДетейВДокументеВсего <> 0 Тогда
					Результат = Макс((РезультатБаза * СтрокаДвижений[ПоказательРазмер]/100)*ДетейВДокументе/ДетейВДокументеВсего - УжеНачисленоВТекущемПериоде, 0);
					
					Если ИсходныеДанные.ПометкаУвеличиватьДоМинимума  Тогда
						Результат = Макс(Результат, ПределПоПрожиточнымМинимумам);
					КонецЕсли;
				КонецЕсли; 
				
				// Ограничим результат расчета в случае достижения предела удержания
				ПределПоДокументуОснованию  = ?(ИсходныеДанные.ПределПоДокументуОснованию = Null, 0 ,ИсходныеДанные.ПределПоДокументуОснованию);
				УжеНачисленоЗаВсюИсторию 	= ?(ИсходныеДанные.УжеНачисленоЗаВсюИсторию = Null, 0, ИсходныеДанные.УжеНачисленоЗаВсюИсторию);
				
				Результат = Мин(Результат, ПределПоДокументуОснованию  - УжеНачисленоЗаВсюИсторию);
				
			КонецЕсли;
			
			// ИсполнительныйЛистФиксСуммой
			//		
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммой Тогда
			
			Результат = СтрокаДвижений[ПоказательРазмер];
			
			// АлиментыФиксСуммой
			//		
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммой Тогда
			
			
			Если ИсходныеДанные.ДетейВДокументеВсего = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': В исполнительном листе на уплату элементов не указанны данные о детях ';uk=': У виконавчому листі на сплату елементів не вказані дані про дітей '"));
			Иначе
				
				ДетейВДокументеВсего = ?(ИсходныеДанные.ДетейВДокументеВсего=NULL,0,ИсходныеДанные.ДетейВДокументеВсего);// все дети указанные в исполнительном листе
				ДетейВДокументе = ?(ИсходныеДанные.ДетейВДокументе=NULL,0,ИсходныеДанные.ДетейВДокументе);     // дети которые уже достигли возраста указанного вдокументе
				
				Результат = ?(ДетейВДокументеВсего = 0, 0, СтрокаДвижений[ПоказательРазмер] * ДетейВДокументе / ДетейВДокументеВсего);
				
			КонецЕсли;
			
			
			// ИсполнительныйЛистФиксСуммойДоПредела
			//		
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела Тогда
			
			ПределПоДокументуОснованию  = ?(ИсходныеДанные.ПределПоДокументуОснованию = Null, 0 ,ИсходныеДанные.ПределПоДокументуОснованию);
			УжеНачисленоЗаВсюИсторию 	= ?(ИсходныеДанные.УжеНачисленоЗаВсюИсторию = Null, 0, ИсходныеДанные.УжеНачисленоЗаВсюИсторию);
			
			// Ограничим результат расчета в случае достижения предела удержания
			Результат = Мин(СтрокаДвижений[ПоказательРазмер], ПределПоДокументуОснованию  - УжеНачисленоЗаВсюИсторию);
			
			
			// АлиментыФиксСуммойДоПредела
			//		
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела Тогда
			
			Если ИсходныеДанные.ДетейВДокументеВсего = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': В исполнительном листе на уплату элементов не указанны данные о детях ';uk=': У виконавчому листі на сплату елементів не вказані дані про дітей '"));
			Иначе
				
				ДетейВДокументеВсего = ИсходныеДанные.ДетейВДокументеВсего;// все дети указанные в исполнительном листе
				ДетейВДокументе = ИсходныеДанные.ДетейВДокументе;     // дети которые уже достигли возраста указанного вдокументе
				ПределПоДокументуОснованию  = ?(ИсходныеДанные.ПределПоДокументуОснованию = Null, 0 ,ИсходныеДанные.ПределПоДокументуОснованию);
				УжеНачисленоЗаВсюИсторию 	= ?(ИсходныеДанные.УжеНачисленоЗаВсюИсторию = Null, 0, ИсходныеДанные.УжеНачисленоЗаВсюИсторию);
				
				// Ограничим результат расчета в случае достижения предела удержания
				Результат = Мин(СтрокаДвижений[ПоказательРазмер] * ДетейВДокументе / ДетейВДокументеВсего, ПределПоДокументуОснованию  - УжеНачисленоЗаВсюИсторию);
			КонецЕсли;	
			
			
			// ДоплатаДоСреднегоЗаработка
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Тогда
			
			
			ЗаработокЗаЕдиницуВремени = СтрокаДвижений.Показатель1;
			
			ВидУчетаВремениДляСредней = СтрокаДвижений.ВидУчетаВремениДляСредней;
			Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.НормаОплачиваемыхДней = NULL, 0, ИсходныеДанные.НормаОплачиваемыхДней);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.НормаОплачиваемыхЧасов = NULL, 0, ИсходныеДанные.НормаОплачиваемыхЧасов);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.КалендарныеДни = NULL, 0, ИсходныеДанные.КалендарныеДни);
			Иначе
				ОплачиваемоеВремя = 0;
			КонецЕсли;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Сумма средней: ';uk='Сума середньої: '") + ЗаработокЗаЕдиницуВремени, КомментарийВидаРасчета);
				Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих днях): ';uk='Оплачуваний час (у робочих днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих часах): ';uk='Оплачуваний час (в робочих годинах): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в календарных днях): ';uk='Оплачуваний час (у календарних днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;
			
			СреднийЗаработок = ОплачиваемоеВремя * ЗаработокЗаЕдиницуВремени;
			РезультатБаза = ?(ИсходныеДанные.РезультатБаза = NULL, 0, ИсходныеДанные.РезультатБаза);
			
			Результат = Макс(СреднийЗаработок - РезультатБаза, 0);
			СтрокаДвижений.ОплаченоДнейЧасов = ОплачиваемоеВремя * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// ПоСреднемуЗаработкуДляОтпуска
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска 
			//ИЛИ СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.КомпенсацияОтпуска 
			Тогда
			
			ЗаработокЗаЕдиницуВремени = СтрокаДвижений.Показатель1;
			
			ВидУчетаВремениДляСредней = СтрокаДвижений.ВидУчетаВремениДляСредней;
			Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.НормаОплачиваемыхДней = NULL, 0, ИсходныеДанные.НормаОплачиваемыхДней);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.НормаОплачиваемыхЧасов = NULL, 0, ИсходныеДанные.НормаОплачиваемыхЧасов);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.КалендарныеДни = NULL, 0, ИсходныеДанные.КалендарныеДни);
			Иначе
				ОплачиваемоеВремя = 0;
			КонецЕсли;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Сумма средней: ';uk='Сума середньої: '") + ЗаработокЗаЕдиницуВремени, КомментарийВидаРасчета);
				Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих днях): ';uk='Оплачуваний час (у робочих днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих часах): ';uk='Оплачуваний час (в робочих годинах): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в календарных днях): ';uk='Оплачуваний час (у календарних днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;
			
			Результат = ОплачиваемоеВремя * ЗаработокЗаЕдиницуВремени;
			СтрокаДвижений.ОплаченоДнейЧасов = ОплачиваемоеВремя * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// ПоСреднемуЗаработкуКомпенсацияОтпуска
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска 
			Тогда
			
			ЗаработокЗаЕдиницуВремени = СтрокаДвижений.Показатель1;
			КалендарныхДней = СтрокаДвижений.Показатель2;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Сумма средней: ';uk='Сума середньої: '") + ЗаработокЗаЕдиницуВремени, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Время: ';uk='Час: '") + КалендарныхДней, КомментарийВидаРасчета);
			КонецЕсли;
			
			Результат = ЗаработокЗаЕдиницуВремени * КалендарныхДней;
			СтрокаДвижений.ОплаченоДнейЧасов = КалендарныхДней * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// ПоСреднемуЗаработку
			//
		ИначеЕсли  СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку 
			Тогда
			
			ЗаработокЗаЕдиницуВремени = СтрокаДвижений.Показатель1;
			ПроцентОплаты = ?(СтрокаДвижений.Показатель2 = 0, 100,СтрокаДвижений.Показатель2);
			
			ВидУчетаВремениДляСредней = СтрокаДвижений.ВидУчетаВремениДляСредней;
			Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.ОтработаноДней = NULL, 0, ИсходныеДанные.ОтработаноДней);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.ОтработаноЧасов = NULL, 0, ИсходныеДанные.ОтработаноЧасов);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.КалендарныеДни = NULL, 0, ИсходныеДанные.КалендарныеДни);
			ИначеЕсли ЗначениеЗаполнено(ИсходныеДанные.ВидУчетаВремени) Тогда
				Если ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням Тогда
					ОплачиваемоеВремя = ?(ИсходныеДанные.ОтработаноДней = NULL, 0, ИсходныеДанные.ОтработаноДней);
				ИначеЕсли ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
					ОплачиваемоеВремя = ?(ИсходныеДанные.ОтработаноЧасов = NULL, 0, ИсходныеДанные.ОтработаноЧасов);
				КонецЕсли;	
			Иначе
				ОплачиваемоеВремя = 0;
			КонецЕсли;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Сумма средней: ';uk='Сума середньої: '") + ЗаработокЗаЕдиницуВремени, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Процент оплаты: ';uk='Відсоток оплати: '") + ПроцентОплаты, КомментарийВидаРасчета);
				Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих днях): ';uk='Оплачуваний час (у робочих днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих часах): ';uk='Оплачуваний час (в робочих годинах): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в календарных днях): ';uk='Оплачуваний час (у календарних днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;
			
			Результат = ОплачиваемоеВремя * ЗаработокЗаЕдиницуВремени * ПроцентОплаты/100;
			СтрокаДвижений.ОплаченоДнейЧасов = ОплачиваемоеВремя * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// ПоСреднемуЗаработкуФСС
			//
		ИначеЕсли  СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС 
			Тогда
			
			ЗаработокЗаЕдиницуВремени = СтрокаДвижений.Показатель1;
			ПроцентОплаты = ?(СтрокаДвижений.Показатель2 = 0, 100,СтрокаДвижений.Показатель2);
			
			ВидУчетаВремениДляСредней = СтрокаДвижений.ВидУчетаВремениДляСредней;
			Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.НормаОплачиваемыхДней = NULL, 0, ИсходныеДанные.НормаОплачиваемыхДней);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.НормаОплачиваемыхЧасов = NULL, 0, ИсходныеДанные.НормаОплачиваемыхЧасов);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
				ОплачиваемоеВремя = ?(ИсходныеДанные.КалендарныеДни = NULL, 0, ИсходныеДанные.КалендарныеДни);
			ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками Тогда
				ОплачиваемоеВремя = День(СтрокаДвижений.ПериодДействияКонец)-День(СтрокаДвижений.ПериодДействияНачало)+1;
			Иначе
				ОплачиваемоеВремя = 0;
			КонецЕсли;
			
			Если КомментироватьРасчет Тогда
				КомментарийРасчета(НСтр("ru='Сумма средней: ';uk='Сума середньої: '") + ЗаработокЗаЕдиницуВремени, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Процент оплаты: ';uk='Відсоток оплати: '") + ПроцентОплаты, КомментарийВидаРасчета);
				Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих днях): ';uk='Оплачуваний час (у робочих днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в рабочих часах): ';uk='Оплачуваний час (в робочих годинах): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				ИначеЕсли ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоКалендарнымДням Тогда
					КомментарийРасчета(НСтр("ru='Оплачиваемое время (в календарных днях): ';uk='Оплачуваний час (у календарних днях): '") + ОплачиваемоеВремя, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;
			ПромежуточныйРезультат = Окр(ЗаработокЗаЕдиницуВремени * ПроцентОплаты/100,2);
			Результат = Окр(ОплачиваемоеВремя * ПромежуточныйРезультат,2);
			СтрокаДвижений.ОплаченоДнейЧасов = ОплачиваемоеВремя * ?(СтрокаДвижений.Сторно,-1,1);
			
			
			// КомпенсацияНевыплаченнойЗарплаты
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.КомпенсацияНевыплаченнойЗарплаты Тогда
			
			Если ИсходныеДанные.СуммаКомпенсации = NULL Тогда
				Сообщить(""+СтрокаДвижений.Физлицо + "; " + СтрокаДвижений.ВидРасчета + НСтр("ru=': нет данных о базовой сумме компенсации';uk=': немає даних про базову суму компенсації'"), СтатусСообщения.Важное);
			Иначе	
				
				Начало = ДобавитьМесяц(СтрокаДвижений.БазовыйПериодНачало, 1);
				Конец  = ДобавитьМесяц(СтрокаДвижений.ПериодРегистрации, -1);
				КоэффициентКомпенсации = РассчитатьЗаписьРегистраРасчета_КоэффициентКомпенсации( Начало, Конец, НеобходимыеДанные );
				
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='База компенсации: ';uk='База компенсації: '")+ИсходныеДанные.СуммаКомпенсации, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='КоэффициентКомпенсации: ';uk='КоэффициентКомпенсации: '")+КоэффициентКомпенсации, КомментарийВидаРасчета);
					КомментарийРасчета("Период расчета коєффициента: ("+Формат(Начало,"ДФ=""ММММ гггг 'г.' """)+", "+Формат(Конец,"ДФ=""ММММ гггг 'г.' """)+")", КомментарийВидаРасчета);
				КонецЕсли;
				
				Результат = ИсходныеДанные.СуммаКомпенсации * КоэффициентКомпенсации;
			КонецЕсли; 
			
		
			// ИндексацияЗарплаты
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты Тогда
			
			БазаИндексацияЗарплаты1 = ?(ИсходныеДанные.БазаИндексацияЗарплаты1 = NULL, 0, ИсходныеДанные.БазаИндексацияЗарплаты1);
			БазаИндексацияЗарплаты2 = ?(ИсходныеДанные.БазаИндексацияЗарплаты2 = NULL, 0, ИсходныеДанные.БазаИндексацияЗарплаты2);
			БазаИндексацияЗарплаты3 = ?(ИсходныеДанные.БазаИндексацияЗарплаты3 = NULL, 0, ИсходныеДанные.БазаИндексацияЗарплаты3);
			БазаИндексацияЗарплаты4 = ?(ИсходныеДанные.БазаИндексацияЗарплаты4 = NULL, 0, ИсходныеДанные.БазаИндексацияЗарплаты4);
			РезультатПолнаяБаза = БазаИндексацияЗарплаты1
			+ БазаИндексацияЗарплаты2
			+ БазаИндексацияЗарплаты3
			+ БазаИндексацияЗарплаты4;
			
			Если СтрокаДвижений.Назначение.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство Тогда
				Результат = 0;	
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='По внутреннему совместителю индексация не начисляется. Расчет индексации производится только по основному месту работы!';uk='По внутрішньому суміснику індексація не нараховується. Розрахунок індексації проводиться тільки за основним місцем роботи!'"));
				КонецЕсли;
				
			ИначеЕсли РезультатПолнаяБаза = 0 Тогда
				
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о базе индексации ';uk=': Немає даних про базу індексації '"));
			ИначеЕсли СтрокаДвижений.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство
				И НЕ ИсходныеДанные.ЕстьСправкаОБазеИндексацииСовместителя Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет сведений о базе индексации с основного места работы ';uk=': Немає відомостей про базу індексації з основного місця роботи '"));
				
			Иначе	
				Начало = ?(ИсходныеДанные.ИндексацияЗарплатыНачало = Null, Дата("00010101"), ИсходныеДанные.ИндексацияЗарплатыНачало);
				Конец  = ИсходныеДанные.ИндексацияЗарплатыКонец;
				БазовыйМесяц = Макс(Начало, НеобходимыеДанные.НачалоРасчетаИндексации);
				                          
				КоэффициентИндексации	= РассчитатьЗаписьРегистраРасчета_Индексация_Коэффициент( Начало, Конец, НеобходимыеДанные, "ИндексацияЗарплаты" );
				РезультатБаза			= РассчитатьЗаписьРегистраРасчета_Индексация_База( ИсходныеДанные, НеобходимыеДанные, "ИндексацияЗарплаты" );
				ПрожиточныйМинимум = ИсходныеДанные.ПорогИндексацияЗарплаты3;
				
	
				Если ИсходныеДанные.СпособОсновногоРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам
					или ИсходныеДанные.СпособОсновногоРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке
					или ИсходныеДанные.ОсновнойГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику Тогда
					Отработано = ?(ИсходныеДанные.ОтработаноЧасовБаза = NULL, 0, ИсходныеДанные.ОтработаноЧасовБаза);
					Норма = СтрокаДвижений.НормаЧасовЗаМесяц;
				Иначе
					Отработано = ?(ИсходныеДанные.ОтработаноДнейБаза = NULL, 0, ИсходныеДанные.ОтработаноДнейБаза);
					Норма = СтрокаДвижений.НормаДнейЗаМесяц;
				КонецЕсли;	
				
				Если НЕ ЗначениеЗаполнено(Отработано) Тогда
					//Отработанных дней не найдено, считать не надо
					КоэффициентИндексацииПропорционально = 0;
				ИначеЕсли Норма = 0 Тогда
					//норма не определена, начисляем полностью
					КоэффициентИндексацииПропорционально = 1;
				Иначе
					КоэффициентИндексацииПропорционально = Мин(Отработано/Норма,1);
				КонецЕсли;
				
				Если ИсходныеДанные.РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.НеПрименять Тогда
					//Пропорционально считаем только  фиксированную индексацию
	                РезультатФиксированнаяИндексация = Окр(?(ИсходныеДанные.РезультатФиксированнаяИндексация = Null, 0, ИсходныеДанные.РезультатФиксированнаяИндексация) * КоэффициентИндексацииПропорционально,2);
					Результат  = РезультатБаза * КоэффициентИндексации + РезультатФиксированнаяИндексация;
				ИначеЕсли ИсходныеДанные.РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.ДляНеполногоРабочегоВремени Тогда
					//Пропорционально считаем работающим не полное время и  фиксированную индексацию
	                РезультатФиксированнаяИндексация = Окр(?(ИсходныеДанные.РезультатФиксированнаяИндексация = Null, 0, ИсходныеДанные.РезультатФиксированнаяИндексация) * КоэффициентИндексацииПропорционально,2);
					Если ИсходныеДанные.ОсновнойГрафикРаботы.УчетНормыВремениПоОтдельномуГрафику Тогда
						РезультатБаза = ПрожиточныйМинимум;
						Результат  = РезультатБаза * КоэффициентИндексации * КоэффициентИндексацииПропорционально + РезультатФиксированнаяИндексация;
					Иначе
						Результат  = РезультатБаза * КоэффициентИндексации + РезультатФиксированнаяИндексация;
					КонецЕсли;
				Иначе
					//Пропорционально считаем все
					РезультатБаза = ПрожиточныйМинимум;
					РезультатФиксированнаяИндексация = Окр(?(ИсходныеДанные.РезультатФиксированнаяИндексация = Null, 0, ИсходныеДанные.РезультатФиксированнаяИндексация) * КоэффициентИндексацииПропорционально,2);
					Результат  = РезультатБаза * КоэффициентИндексации * КоэффициентИндексацииПропорционально + РезультатФиксированнаяИндексация;
				КонецЕсли;	
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='База индексации:';uk='База індексації:'") + РезультатБаза, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Базовый период: ';uk='Базовий період: '") + БазовыйМесяц, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Коэффициент индексации: ';uk='Коефіцієнт індексації: '") + КоэффициентИндексации, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Размер фиксированной индексации: ';uk='Розмір фіксованої індексації: '") + ИсходныеДанные.РезультатФиксированнаяИндексация, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Коэффициент фиксированной индексации: ';uk='Коефіцієнт фіксованої індексації: '") + КоэффициентИндексацииПропорционально, КомментарийВидаРасчета);
					КомментарийКоэффициентИндексацииПропорционально = "";
					Если КоэффициентИндексацииПропорционально > 0 И КоэффициентИндексацииПропорционально < 1 Тогда
						Если ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
							КомментарийКоэффициентИндексацииПропорционально = " (" + Окр(ИсходныеДанные.ОтработаноЧасовБаза, 0) + "/" + ИсходныеДанные.НормаЧасовЗаМесяц + ")";
						Иначе
							КомментарийКоэффициентИндексацииПропорционально = " (" + Окр(ИсходныеДанные.ОтработаноДнейБаза, 0) + "/" + ИсходныеДанные.НормаДнейЗаМесяц + ")";
						КонецЕсли	
					КонецЕсли;	
					КомментарийРасчета(НСтр("ru='Коэффициент индексации пропорционально: ';uk='Коефіцієнт індексації пропорційно: '") + Окр(КоэффициентИндексацииПропорционально, 4)+КомментарийКоэффициентИндексацииПропорционально, КомментарийВидаРасчета);
                    КомментарийРасчета(НСтр("ru='Фиксированная индексация: ';uk='Фіксована індексація: '") + РезультатФиксированнаяИндексация, КомментарийВидаРасчета);
				КонецЕсли;
				
				Если ТипЗнч(ИсходныеДанные.Регистратор) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") ИЛИ 
					ТипЗнч(ИсходныеДанные.Регистратор) = Тип("ДокументСсылка.ВводСведенийОПлановыхНачисленияхУдержаниях")Тогда
					СтрокаДвижений.ОплаченоДнейЧасов = РезультатФиксированнаяИндексация;
				КонецЕсли;	

				
			КонецЕсли;
			
			
			// ИндексацияСоциальныхНачислений
			//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений Тогда
			
			БазаИндексацияСоциальныхНачислений1 = ?(ИсходныеДанные.БазаИндексацияСоциальныхНачислений1 = NULL, 0, ИсходныеДанные.БазаИндексацияСоциальныхНачислений1);
			БазаИндексацияСоциальныхНачислений2 = ?(ИсходныеДанные.БазаИндексацияСоциальныхНачислений2 = NULL, 0, ИсходныеДанные.БазаИндексацияСоциальныхНачислений2);
			БазаИндексацияСоциальныхНачислений3 = ?(ИсходныеДанные.БазаИндексацияСоциальныхНачислений3 = NULL, 0, ИсходныеДанные.БазаИндексацияСоциальныхНачислений3);
			БазаИндексацияСоциальныхНачислений4 = ?(ИсходныеДанные.БазаИндексацияСоциальныхНачислений4 = NULL, 0, ИсходныеДанные.БазаИндексацияСоциальныхНачислений4);
			РезультатПолнаяБаза = БазаИндексацияСоциальныхНачислений1
			+ БазаИндексацияСоциальныхНачислений2
			+ БазаИндексацияСоциальныхНачислений3
			+ БазаИндексацияСоциальныхНачислений4;
			Если РезультатПолнаяБаза = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о базе ';uk=': Немає даних про базу '"));
			Иначе
	            
				Начало = ИсходныеДанные.ИндексацияСоциальныхНачисленийНачало;
				Конец  = ИсходныеДанные.ИндексацияСоциальныхНачисленийКонец;
		
				КоэффициентИндексации	= РассчитатьЗаписьРегистраРасчета_Индексация_Коэффициент( Начало, Конец, НеобходимыеДанные, "ИндексацияСоциальныхНачислений" );
				РезультатБаза			= РассчитатьЗаписьРегистраРасчета_Индексация_База( ИсходныеДанные, НеобходимыеДанные, "ИндексацияСоциальныхНачислений" );
					
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='База индексации соц.начислений:';uk='База індексації соц.нарахувань:'") + РезультатБаза, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Базовый период соц.начислений: ';uk='Базовий період соц.нарахувань: '") + Начало, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Коэффициент индексации соц.начислений: ';uk='Коефіцієнт індексації соц.нарахувань: '") + КоэффициентИндексации, КомментарийВидаРасчета);
				КонецЕсли;
				
				Результат  = РезультатБаза * КоэффициентИндексации;
			КонецЕсли;
		// ДоплатаДоМЗП
		//
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоМЗП Тогда
			
			РезультатБаза = ?(ИсходныеДанные.РезультатБаза = NULL, 0, ИсходныеДанные.РезультатБаза);
			МинимальнаяЗарплата = ?(ИсходныеДанные.МинЗПМесяц = NULL, 0, ИсходныеДанные.МинЗПМесяц);
			
			Если РезультатБаза = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о базе для доначисления до минимальной зарплаты ';uk=': Немає даних про базу для донарахування до мінімальної зарплати '"));
				
			ИначеЕсли МинимальнаяЗарплата = 0 Тогда
				ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о размере минимальной зарплаты ';uk=': Немає даних про розмір мінімальної зарплати '"));
				
			Иначе	
				
				Если ИсходныеДанные.СпособОсновногоРасчетаДляМинЗП = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам
					или ИсходныеДанные.СпособОсновногоРасчетаДляМинЗП = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
					Отработано = ИсходныеДанные.ОтработаноЧасовБаза;
					Норма = СтрокаДвижений.НормаЧасовЗаМесяц;
				Иначе
					Отработано = ИсходныеДанные.ОтработаноДнейБаза;
					Норма = СтрокаДвижений.НормаДнейЗаМесяц;
				КонецЕсли;	
				
				Если НЕ ЗначениеЗаполнено(Отработано) Тогда
					//Отработанных дней не найдено, считать не надо
					КоэффициентДоплаты = 0;
				ИначеЕсли Норма = 0 Тогда
					//норма не определена, начисляем полностью
					КоэффициентДоплаты = 1;
				Иначе
					КоэффициентДоплаты = Мин(Отработано/Норма,1);
				КонецЕсли;
				
				МинимальнаяЗарплатаПропорционально = Окр(МинимальнаяЗарплата*КоэффициентДоплаты,2);
				
				Результат = Макс(МинимальнаяЗарплатаПропорционально - РезультатБаза, 0);
					
				Если КомментироватьРасчет Тогда
					КомментарийБазы = КомментарийРасчета(НСтр("ru='Базовые начисления составили всего: ';uk='Базові нарахування склали всього: '") + ИсходныеДанные.РезультатБаза, КомментарийВидаРасчета,,,, Ложь);
					РасшифровкаБазы = ИсходныеДанные.Выбрать();
					Пока РасшифровкаБазы.Следующий() Цикл
						Если РасшифровкаБазы.РезультатБаза <> 0 Тогда
							КомментарийРасчета(РасшифровкаБазы.ВидРасчетаРазрезНаименование + ": " + РасшифровкаБазы.РезультатБаза, КомментарийБазы);
						КонецЕсли;
					КонецЦикла;
					
					КомментарийРасчета(НСтр("ru='Минимальная зарплата: ';uk='Мінімальна зарплата: '") + МинимальнаяЗарплата, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Минимальная зарплата пропорционально: ';uk='Мінімальна зарплата пропорційно: '") + МинимальнаяЗарплатаПропорционально, КомментарийВидаРасчета);
					
				КонецЕсли;
	
			КонецЕсли;

	
			
		ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
			
			// проверем все ли показатели получены			
			Для НомерСтроки = 1 По ИсходныеДанные.КоличествоПоказателей Цикл
				Если ИсходныеДанные["Показатель"+НомерСтроки] = Null Тогда
					ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': не получен Показатель ""';uk=': не отриманий Показник ""'") + ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] + """");
					РезультатПолучен = Ложь;
				ИначеЕсли КомментироватьРасчет Тогда
					КомментарийРасчета(ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"]+ ": " + Строка(ИсходныеДанные["Показатель"+НомерСтроки]), КомментарийВидаРасчета);
				КонецЕсли;
				
				// для показателя типа время запишем его в отработанное
				Если ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.НормаВремениВДнях.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.НормаВремениВЧасах.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.Время.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.ВремяВДнях.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.ВремяВКалендарныхДнях.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.ВремяВЧасах.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.ВечерниеВЧасах.Наименование
					ИЛИ ИсходныеДанные["Показатель"+НомерСтроки+"Наименование"] = Справочники.ПоказателиСхемМотивации.НочныеВЧасах.Наименование
					Тогда
					СтрокаДвижений.ОплаченоДнейЧасов = ИсходныеДанные["Показатель"+НомерСтроки];
				КонецЕсли;
				
			КонецЦикла;
				
			Если РезультатПолучен Тогда
				Попытка
					Результат = Вычислить(ИсходныеДанные.ФормулаРасчета);
				Исключение					
					КомментарийРасчета(ИсходныеДанные.СотрудникНаименование + "; " +ИсходныеДанные.ВидРасчетаНаименование +НСтр("ru=' Ошибка в формуле расчета!';uk=' Помилка у формулі розрахунку!'"), КомментарийВидаРасчета, ,,Перечисления.ВидыСообщений.Ошибка);
				КонецПопытки;
			КонецЕсли;
			
			Если ИсходныеДанные.ВидРасчета = ПланыВидовРасчета.Начисления.СтажВДнях Тогда
				Результат = ИсходныеДанные.ОтработаноДнейБаза;
			КонецЕсли;	
			Если ИсходныеДанные.ВидРасчета = ПланыВидовРасчета.Начисления.СтажВЧасах Тогда
				Результат = ИсходныеДанные.ОтработаноЧасовБаза;
			КонецЕсли;	
			
			// Взносы в фонды
			// 
		ИначеЕсли	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы 
			ИЛИ	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ Тогда
			
			Если СтрокаДвижений.ВидРасчета.СтавкаПоПериодуРегистрации Тогда
				
				Если НЕ СтрокаДвижений.Сторно Тогда
					
					БазаДо = ?(ИсходныеДанные.БазаДо = NULL, 0, ИсходныеДанные.БазаДо);
					БазаВзносаДо = ?(ИсходныеДанные.БазаВзносаДо = NULL, 0, ИсходныеДанные.БазаВзносаДо);
					База = ?(ИсходныеДанные.РезультатБаза = NULL, 0, ИсходныеДанные.РезультатБаза);
					БазаВычет = ?(ИсходныеДанные.БазаВычет = NULL, 0, ИсходныеДанные.БазаВычет);
					БазаВсего = База;
					
					БазаОтпускные = ?(ИсходныеДанные.РезультатБазаОтпускные = NULL, 0, ИсходныеДанные.РезультатБазаОтпускные);
					МинимальнаяБаза = ?(ИсходныеДанные.МинимальнаяБаза = NULL, 0, ИсходныеДанные.МинимальнаяБаза);
					БазаПолная = ?(ИсходныеДанные.БазаПолная = NULL, 0, ИсходныеДанные.БазаПолная);
					БазаДоначисление = 0;
					РезультатДоначисление = 0;
					
					Если ИсходныеДанные.РезультатБаза = NULL И НЕ (СтрокаДвижений.БазовыйПериодНачало < СтрокаДвижений.ПериодРегистрации И БазаДо <> 0 И БазаПолная <> 0) Тогда
						Если СтрокаДвижений.ВидРасчета.КатегорияРасчета <> Перечисления.КатегорииРасчетов.Первичное Тогда
							//Это нормальная ситуация, базы может и не быть, выдавать сообщения не нужно
						ИначеЕсли СтрокаДвижений.БазовыйПериодНачало < СтрокаДвижений.ПериодРегистрации Тогда
							//Это нормальная ситуация, базы за прошлый период может и не быть, выдавать сообщения не нужно
						ИначеЕсли СтрокаДвижений.БазовыйПериодНачало > СтрокаДвижений.ПериодРегистрации Тогда
							//Это нормальная ситуация, базы за будущий период может и не быть, выдавать сообщения не нужно	
						ИначеЕсли ТипЗнч(ИсходныеДанные.Регистратор) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций") Тогда
							//В ЗКВ это тоже нормально, могут быть "специфические выплаты"
						Иначе
							ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисления ';uk=': Не визначені базові нарахування'"));
						КонецЕсли;	
						СтрокаДвижений.База			= 0;
						СтрокаДвижений.БазаВзноса	= 0;
						СтрокаДвижений.БазаВычет	= БазаВычет;
						
					ИначеЕсли ИсходныеДанные.Предел = NULL Тогда
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о пределе ';uk=': Немає даних про межу '"));
						СтрокаДвижений.База			= 0;
						СтрокаДвижений.БазаВзноса	= 0;
						СтрокаДвижений.БазаВычет	= 0;
						
					ИначеЕсли (База-БазаДо) <> 0 И (ИсходныеДанные.Ставка = Неопределено ИЛИ ИсходныеДанные.Ставка = NULL) Тогда
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о ставке ';uk=': Немає даних про ставку '"));
						СтрокаДвижений.База			= 0;
						СтрокаДвижений.БазаВзноса	= 0;
						СтрокаДвижений.БазаВычет	= 0;
						
					Иначе
						
						Коэф = 1;
						Если	СтрокаДвижений.ДатаНачала <> СтрокаДвижений.БазовыйПериодНачало
							ИЛИ	СтрокаДвижений.ДатаОкончания <> СтрокаДвижений.БазовыйПериодКонец
							Тогда
							Коэф = ?( СтрокаДвижений.ОтработаноДнейВсего = 0, 1, СтрокаДвижений.ОтработаноДней / СтрокаДвижений.ОтработаноДнейВсего);
							
						КонецЕсли;
						
						Предел = ?(ИсходныеДанные.Предел = NULL, 0, ИсходныеДанные.Предел);
						Ставка = ?(ИсходныеДанные.Ставка = NULL, 0, ИсходныеДанные.Ставка);
						СтавкаПолная = ?(ИсходныеДанные.СтавкаПолная = NULL, 0, ИсходныеДанные.СтавкаПолная);
						Порог = ?(ИсходныеДанные.Порог = NULL, 0, ИсходныеДанные.Порог);
						НижнийПорог = ?(ИсходныеДанные.НижнийПорог = NULL, 0, ИсходныеДанные.НижнийПорог);
						КоэффициентСтавки = ?(ИсходныеДанные.КоэффициентСтавки = NULL, 0, ИсходныеДанные.КоэффициентСтавки);
						Если НЕ ИсходныеДанные.ПрименениеКоэффициентаЕСВ Тогда
							//Для тех, у кого коэффициент не нужен
							КоэффициентСтавки = 0;
						ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы Тогда
							//Для обычных взносов коэффициент не нужен
							КоэффициентСтавки = 0;
						ИначеЕсли КоэффициентСтавки = 0 Тогда
							//Коэффициент нужен, но не задан
							КоэффициентСтавки = 1;
						КонецЕсли;
						ИсползуетсяЕСВ1863 = ИсходныеДанные.ИсползуетсяЕСВ1863;
							
						БазаВзноса = Мин(Макс(Предел-БазаВычет,0), База);
						
						Если МинимальнаяБаза <> 0 И База <> 0 И БазаВычет = 0 Тогда
							БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0);
							БазаВзноса = БазаВзноса + БазаДоначисление;
						ИначеЕсли МинимальнаяБаза <> 0 И БазаДо <> 0 И БазаВзносаДо <> 0 И БазаВычет = 0 Тогда
							ДоначисленоРанее = Макс(БазаВзносаДо - БазаДо,0);
							БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0) - ДоначисленоРанее;
							БазаВзноса = БазаДоначисление;
						КонецЕсли;	

						Если НЕ ИсходныеДанные.ВидРасчета.ЕСВ Тогда
							База = (База - БазаДо) * Коэф;
							БазаВзноса = (БазаВзноса - БазаВзносаДо) * Коэф;
						Иначе	
							Если ИсходныеДанные.ВидРасчета.КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное
							   И СтрокаДвижений.БазовыйПериодНачало < ИсходныеДанные.Регистратор.ПериодРегистрации Тогда
								//Вообще-то, таких ситуаций быть не должно.
								//Но такое возможно, например, корректировка отпуска в прошедших периодах задним числом.
								//В этом случае не надо учитывать БазуДо, отнесем все сумму в доходы соответсвующего периода.
								//И в этом случае покажем корректировку
								Если База > 0 Тогда
									СтрокаДвижений.ТипНачисления = 2;
								ИначеЕсли База < 0 Тогда
									СтрокаДвижений.ТипНачисления = 3;
								КонецЕсли;	
							Иначе
								База = (База - БазаДо) * Коэф;
								БазаВзноса = (БазаВзноса - БазаВзносаДо) * Коэф;
							КонецЕсли;	
						КонецЕсли;
						
						Если База = 0 И БазаДо = 0 Тогда
							//Нет базы - нет и коэффициента
							КоэффициентСтавки = 0;
						КонецЕсли;
						РезультатПолная = 0;
						Если ИсползуетсяЕСВ1863 Тогда
							//Расчет при наличии доначисления должен быть ОТДЕЛЬНО по каждой сумме.
							//Общая сумма налога при этом может и не совпадать
							Результат = Окр((БазаВзноса - БазаДоначисление) * Окр(Ставка * ?(КоэффициентСтавки = 0, 1, КоэффициентСтавки),5),2);
							РезультатДоначисление  = Окр(БазаДоначисление * Ставка,2);
							Если СтавкаПолная > 0 Тогда
								РезультатПолная = Окр((БазаВзноса - БазаДоначисление) * Окр(СтавкаПолная * ?(КоэффициентСтавки = 0, 1, КоэффициентСтавки),5),2);
							КонецЕсли;	
						Иначе	
							Результат  = БазаВзноса * Окр(Ставка * ?(КоэффициентСтавки = 0, 1, КоэффициентСтавки),5);
							РезультатДоначисление  = 0;
							Если СтавкаПолная > 0 Тогда
								РезультатПолная  = БазаВзноса * Окр(СтавкаПолная * ?(КоэффициентСтавки = 0, 1, КоэффициентСтавки),5);
							КонецЕсли;	
						КонецЕсли;	
						//Согласно разъяснениями ГФС к доначислению не применяется понижающий коэффициент
						
						Результат = Результат + РезультатДоначисление;
						
						Если КомментироватьРасчет Тогда
							
							КомментарийБазы = КомментарийРасчета(НСтр("ru='Базовые начисления составили всего: ';uk='Базові нарахування склали всього: '") + БазаВсего, КомментарийВидаРасчета,,,, Ложь);
							РасшифровкаБазы = ИсходныеДанные.Выбрать();
							Пока РасшифровкаБазы.Следующий() Цикл
								Если РасшифровкаБазы.РезультатБаза <> NULL И РасшифровкаБазы.РезультатБаза <> 0 Тогда
									КомментарийРасчета(РасшифровкаБазы.ВидРасчетаРазрезНаименование + ": " + РасшифровкаБазы.РезультатБаза, КомментарийБазы);
								КонецЕсли;
							КонецЦикла;

							КомментарийРасчета(НСтр("ru='База расчетная: ';uk='База розрахункова: '") + База, КомментарийВидаРасчета,,,, Ложь);
							Если БазаДо <> 0 Тогда 
								КомментарийРасчета(НСтр("ru='База до: ';uk='База до: '") + БазаДо, КомментарийВидаРасчета,,,, Ложь);
							Конецесли;	
							Если БазаВычет <> 0 Тогда 
								КомментарийРасчета(НСтр("ru='База вычет: ';uk='База відрахування: '") + БазаВычет, КомментарийВидаРасчета,,,, Ложь);
							КонецЕсли;	
							КомментарийРасчета(НСтр("ru='База с учетом ограничений: ';uk='База з врахуванням обмежень: '") + БазаВзноса, КомментарийВидаРасчета,,,, Ложь);
							Если БазаДоначисление <> 0 Тогда
								КомментарийРасчета(НСтр("ru='	в т.ч. доначисление до минимальной базы : ';uk='	в т.ч. донарахування до мінімальної бази : '") + БазаДоначисление, КомментарийВидаРасчета);
							КонецЕсли;
							Если	СтрокаДвижений.ВидРасчета.СпособРасчетаПоШкале = Перечисления.СпособыРасчетаПоШкале.Прогрессивный Тогда 
								КомментарийРасчета(НСтр("ru='Расчет по прогрессивной шкале (Нижний порог, Порог): (';uk='Розрахунок по прогресивній шкалі (Нижній поріг, Поріг): ('")+НижнийПорог+", "+Порог+")", КомментарийВидаРасчета);
							КонецЕсли;
							КомментарийРасчета(НСтр("ru='Сумма предела : ';uk='Сума межі : '") + Предел, КомментарийВидаРасчета);
							
							Если МинимальнаяБаза <> 0 Тогда
								КомментарийРасчета(НСтр("ru='Минимальная база : ';uk='Мінімальна база : '") + МинимальнаяБаза, КомментарийВидаРасчета);
							КонецЕсли;
							КомментарийРасчета(НСтр("ru='Ставка : ';uk='Ставка : '") + Ставка, КомментарийВидаРасчета);
							Если КоэффициентСтавки <> 0 И КоэффициентСтавки <> 1 Тогда
								 КомментарийРасчета(НСтр("ru='Коэффициент ставки : ';uk='Коефіціент ставки : '") + КоэффициентСтавки, КомментарийВидаРасчета);
								 КомментарийРасчета(НСтр("ru='Ставка с учетом коэф. : ';uk='Ставка з урахуванням коеф. : '") + Окр(Ставка * КоэффициентСтавки,5), КомментарийВидаРасчета);
							КонецЕсли;	
							
							Если Коэф <> 1 Тогда
								КомментарийРасчета(НСтр("ru='	Коэффициент : ';uk='	Коефіцієнт : '") + Коэф, КомментарийВидаРасчета);
							КонецЕсли;

						КонецЕсли;
						
						//дополнительные реквизиты регистра расчетов взносы в фонды
						СтрокаДвижений.База			= База;
						СтрокаДвижений.БазаВзноса	= БазаВзноса;
						Результат					= Результат;
						СтрокаДвижений.БазаВычет	= БазаВычет;
						СтрокаДвижений.БазаОтпускные = БазаОтпускные;

						СтрокаДвижений.СтатьяНалоговойДекларации	= ИсходныеДанные.СтатьяНалоговойДекларации;
						СтрокаДвижений.Ставка						= Ставка;
						СтрокаДвижений.СтавкаПолная					= СтавкаПолная;
						СтрокаДвижений.РезультатПолная				= РезультатПолная;
						СтрокаДвижений.КоэффициентСтавки	= КоэффициентСтавки;
						СтрокаДвижений.БазаДоначисление	= БазаДоначисление;
						
						Если СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы Тогда
							Результат  = Окр(Результат,2);
						ИначеЕсли ИсползуетсяЕСВ1863 Тогда
							//законом предусмотрено округнление до 3 знаков
							//но в отчете все равно предусмотрено округление только до 2 знаков
							Результат  = Окр(Результат,2);
						КонецЕсли; 
						
					КонецЕсли;
					
				Иначе
					//Сторно
					СтрокаДвижений.База = 0;
					СтрокаДвижений.БазаВзноса = 0;
					СтрокаДвижений.БазаВычет = 0;
					СтрокаДвижений.БазаОтпускные = 0;
					СтрокаДвижений.БазаДоначисление = 0;
				КонецЕсли
				
			Иначе
				
				Если НЕ СтрокаДвижений.Сторно Тогда
					
					Если ИсходныеДанные.РезультатБаза = NULL Тогда
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Не определены базовые начисления ';uk=': Не визначені базові нарахування'"));
					ИначеЕсли ИсходныеДанные.Предел = NULL Тогда
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о пределе ';uk=': Немає даних про межу '"));
					ИначеЕсли ИсходныеДанные.РезультатБаза <> 0 И (ИсходныеДанные.Ставка = Неопределено ИЛИ ИсходныеДанные.Ставка = NULL) Тогда
						ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': Нет данных о ставке ';uk=': Немає даних про ставку '"));
					Иначе
						Если КомментироватьРасчет Тогда
							КомментарийБазы = КомментарийРасчета(НСтр("ru='Базовые начисления составили всего: ';uk='Базові нарахування склали всього: '") + ИсходныеДанные.РезультатБаза, КомментарийВидаРасчета,,,, Ложь);
							РасшифровкаБазы = ИсходныеДанные.Выбрать();
							Пока РасшифровкаБазы.Следующий() Цикл
								Если РасшифровкаБазы.РезультатБаза <> 0 Тогда
									КомментарийРасчета(РасшифровкаБазы.ВидРасчетаРазрезНаименование + ": " + РасшифровкаБазы.РезультатБаза, КомментарийБазы);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						Коэф = 1;
						Если	СтрокаДвижений.ДатаНачала <> СтрокаДвижений.БазовыйПериодНачало
							ИЛИ	СтрокаДвижений.ДатаОкончания <> СтрокаДвижений.БазовыйПериодКонец
							Тогда
							Коэф = ?( СтрокаДвижений.ОтработаноДнейВсего = 0, 1, СтрокаДвижений.ОтработаноДней / СтрокаДвижений.ОтработаноДнейВсего);
							
						КонецЕсли;
						
						Предел = ?(ИсходныеДанные.Предел = NULL, 0, ИсходныеДанные.Предел);
						Ставка = ?(ИсходныеДанные.Ставка = NULL, 0, ИсходныеДанные.Ставка);
						Порог = ?(ИсходныеДанные.Порог = NULL, 0, ИсходныеДанные.Порог);
						НижнийПорог = ?(ИсходныеДанные.НижнийПорог = NULL, 0, ИсходныеДанные.НижнийПорог);
						
						БазаЗаМесяц = ?(ИсходныеДанные.РезультатБаза = NULL, 0, ИсходныеДанные.РезультатБаза);
						БазаВзносаЗаМесяц = Мин(Предел, БазаЗаМесяц);
						Если	СтрокаДвижений.ВидРасчета.СпособРасчетаПоШкале = Перечисления.СпособыРасчетаПоШкале.Прогрессивный Тогда 
							БазаЗаМесяц = Макс( Мин(Порог, БазаЗаМесяц)- НижнийПорог, 0);
							БазаВзносаЗаМесяц = Макс( Мин(Порог, БазаВзносаЗаМесяц)- НижнийПорог, 0);
						КонецЕсли;
						
						РезультатЗаМесяц  = БазаВзносаЗаМесяц * Ставка;
						
						БазаВзноса = БазаВзносаЗаМесяц * Коэф;
						База       = БазаЗаМесяц * Коэф;
						Результат  = РезультатЗаМесяц * Коэф;
						
						Если КомментироватьРасчет Тогда
							Если	СтрокаДвижений.ВидРасчета.СпособРасчетаПоШкале = Перечисления.СпособыРасчетаПоШкале.Прогрессивный Тогда 
								КомментарийРасчета(НСтр("ru='Расчет по прогрессивной шкале (Нижний порог, Порог): (';uk='Розрахунок по прогресивній шкалі (Нижній поріг, Поріг): ('")+НижнийПорог+", "+Порог+")", КомментарийВидаРасчета);
							КонецЕсли;
							КомментарийРасчета(НСтр("ru='Сумма предела : ';uk='Сума межі : '") + Предел, КомментарийВидаРасчета);
							КомментарийРасчета(НСтр("ru='Сумма дохода за месяц: ';uk='Сума доходу за місяць: '") + БазаЗаМесяц, КомментарийВидаРасчета);
							КомментарийРасчета(НСтр("ru='Сумма дохода за месяц с учетом предела : ';uk='Сума доходу за місяць із урахуванням межі: '") + БазаВзносаЗаМесяц, КомментарийВидаРасчета);
							Если Коэф <> 1 Тогда
								КомментарийРасчета(НСтр("ru='	Коэффициент : ';uk='	Коефіцієнт : '") + Коэф, КомментарийВидаРасчета);
							КонецЕсли;
						КонецЕсли;
						
						//дополнительные реквизиты регистра расчетов взносы в фонды
						СтрокаДвижений.База			= База;
						СтрокаДвижений.БазаВзноса	= БазаВзноса;
						Результат					= Результат;
						
						СтрокаДвижений.СтатьяНалоговойДекларации	= ИсходныеДанные.СтатьяНалоговойДекларации;
						СтрокаДвижений.Ставка						= Ставка;
						
						//СтрокаДвижений.БазаЗаМесяц			= БазаЗаМесяц;
						//СтрокаДвижений.БазаВзносаЗаМесяц	= БазаВзносаЗаМесяц;
						
						Если СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ Тогда
							Результат  = Окр(Результат,6);
						Иначе
							Результат  = Окр(Результат,2);
						КонецЕсли; 
						
					КонецЕсли;
					
				Иначе
					//Сторно
					СтрокаДвижений.База = -СтрокаДвижений.База;
					СтрокаДвижений.БазаВзноса = -СтрокаДвижений.БазаВзноса;
				КонецЕсли
				
			КонецЕсли;
			
			
		Иначе // Не найден способ расчета
			ОшибкаРасчета(ИсходныеДанные.СотрудникНаименование + "; " + ИсходныеДанные.ВидРасчетаНаименование + НСтр("ru=': вид расчета не предусмотрен';uk=': вид розрахунку не передбачено'"));
		КонецЕсли;
		
		Если ИсходныеДанные.ОтражатьВУпрУчете И ИсходныеДанные.ОтражатьВРеглУчете Тогда
			СтрокаДвижений.РезультатУпр = ?(КурсВалютыУпр <> 0, (Результат /КурсВалютыУпр) * ?(СтрокаДвижений.Сторно,-1,1),  0);
			Если СтрокаДвижений.Сторно Тогда
				СтрокаДвижений.Результат = Результат * -1;
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='Расчет сторно';uk='Розрахунок сторно'"), КомментарийВидаРасчета, , , Перечисления.ВидыСообщений.ВажнаяИнформация);
				КонецЕсли;
				Если	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы 
				ИЛИ	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ Тогда
					СтрокаДвижений.РезультатДоначисление = РезультатДоначисление * -1;
				КонецЕсли;	
				
			Иначе
				СтрокаДвижений.Результат = Результат;
				Если	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы 
				ИЛИ	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ Тогда
					СтрокаДвижений.РезультатДоначисление = РезультатДоначисление;
				КонецЕсли;	
			КонецЕсли;
			
		ИначеЕсли ИсходныеДанные.ОтражатьВРеглУчете Тогда
			СтрокаДвижений.РезультатУпр = 0;
			Если СтрокаДвижений.Сторно Тогда
				СтрокаДвижений.Результат = Результат * -1;
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='Расчет сторно';uk='Розрахунок сторно'"), КомментарийВидаРасчета, , , Перечисления.ВидыСообщений.ВажнаяИнформация);
				КонецЕсли;
			Иначе
				СтрокаДвижений.Результат = Результат;
				Если	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы 
				ИЛИ	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ Тогда
					СтрокаДвижений.РезультатДоначисление = РезультатДоначисление;
				КонецЕсли;
			КонецЕсли;
			
		Иначе  // чистый упр учет
			Если СтрокаДвижений.Сторно Тогда
				СтрокаДвижений.РезультатУпр = Результат * -1;
				Если КомментироватьРасчет Тогда
					КомментарийРасчета(НСтр("ru='Расчет сторно';uk='Розрахунок сторно'"), КомментарийВидаРасчета, , , Перечисления.ВидыСообщений.ВажнаяИнформация);
				КонецЕсли;
			Иначе
				СтрокаДвижений.РезультатУпр = Результат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если КомментироватьРасчет Тогда
			КомментарийРасчета(НСтр("ru='Результат расчета: ';uk='Результат розрахунку: '") + СтрокаДвижений.Результат, КомментарийВидаРасчета);
			Если	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Взносы 
			ИЛИ	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ Тогда
				Если СтрокаДвижений.РезультатДоначисление <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	в т.ч. на сумму доначисления до минимальной базы: ';uk='	в т.ч. на суму донарахування до мінімальної бази: '") + СтрокаДвижений.РезультатДоначисление, КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
//	
КонецПроцедуры  // РассчитатьЗаписьРегистраРасчета

// Рассчитывает коэффициент из переданного набора записей
//
// Параметры: 
//  Начало				- дата		- первый месяц, который нужно учитывать в расчете
//  Конец				- дата		- последний месяц, который нужно учитывать в расчете
//  НеобходимыеДанные	- структура	- структура с необходимыми общими данными для расчета
//
// Возвращаемое значение:
//  Число, если меньше 0,01, то 0
//
Функция		РассчитатьЗаписьРегистраРасчета_КоэффициентКомпенсации( Начало, Конец, НеобходимыеДанные )
	
	СтруктураОтбора = Новый Структура(); //можно будет сократить на пару секунд время
	СтруктураОтбора.Вставить("Начало", Начало);
	СтруктураОтбора.Вставить("Конец", Конец);
	
	МассивКоэффициентов = НеобходимыеДанные.тбКоэффициентыИнфляции.НайтиСтроки(СтруктураОтбора);
	
	Если МассивКоэффициентов.Количество() = 1 Тогда
		
		// результат уже рассчитан
		Результат = МассивКоэффициентов[0].КоэффициентИнфляции;
		
	Иначе
		
		// рассчитываем первый раз
		Результат = 1;
		
		// проверим не пропущен ли какой-то из месяцев
		ТекМесяц = НачалоМесяца(Начало);
		Пока ТекМесяц <= Конец Цикл
			Если НеобходимыеДанные.тбИндексыИнфляции.Найти(ТекМесяц,"Период") = Неопределено  Тогда
				Сообщить(НСтр("ru='Отсутствует информация об индексе инфляции за: ';uk='Відсутня інформація про індекс інфляції за: '") + Формат(ТекМесяц, "ДФ=ММММ-гггг"));
				Возврат 0;
			КонецЕсли; 
			ТекМесяц = ДобавитьМесяц(ТекМесяц, 1);
		КонецЦикла; 
		
		
		Для каждого ТекущаяСтрока Из НеобходимыеДанные.тбИндексыИнфляции Цикл
			
			Если ТекущаяСтрока.Период < Начало
				Или ТекущаяСтрока.Период > Конец Тогда
				
				Продолжить;			
			КонецЕсли; 
			Результат = Результат * ТекущаяСтрока.ИндексИнфляции;
			
		КонецЦикла;  
		
		текСтрока = НеобходимыеДанные.тбКоэффициентыИнфляции.Добавить();
		текСтрока.Начало              = Начало;
		текСтрока.Конец               = Конец;
		текСтрока.КоэффициентИнфляции = Результат;
		
	КонецЕсли;   
	
	Возврат ?( Результат < 1, 0, Результат - 1 ); 
	
КонецФункции // РассчитатьЗаписьРегистраРасчета_КоэффициентКомпенсации()

// Рассчитывает коэффициент индексации за заданный период и записывает значение во временный массив
// если во временном массиве уже есть значение коэффициента за период, то повторного расчета не производится
// возвращается значение, рассчитанное ранее 
//
// Параметры: 
//  Начало				- дата		- первый месяц, который нужно учитывать в расчете
//  Конец				- дата		- последний месяц, который нужно учитывать в расчете
//  НеобходимыеДанные	- структура - структура с необходимыми общими данными для расчета
//  ИмяИндексации		- строка	- "ИндексацияЗарплаты" или "ИндексацияСоциальныхНачислений"
//
// Возвращаемое значение:
//  число, если меньше 0,01, то 0
//
Функция		РассчитатьЗаписьРегистраРасчета_Индексация_Коэффициент(знач Начало, Конец, НеобходимыеДанные, ИмяИндексации )
	
	Начало = Макс(Добавитьмесяц(НачалоМесяца(Начало),1), НеобходимыеДанные.НачалоРасчетаИндексации);
	Если Конец < Начало Тогда
		Возврат 0;
	КонецЕсли;
	
	
	СтркОтбора = Новый Структура("Начало, Конец");
	СтркОтбора.Начало = Начало;
	СтркОтбора.Конец  = Конец;
	масКоэффициентыИндексации = НеобходимыеДанные.тбКоэффициентыИндексации.НайтиСтроки(СтркОтбора);
	
	Если масКоэффициентыИндексации.Количество() <> 0 
		И масКоэффициентыИндексации[0][ИмяИндексации] <> Неопределено Тогда
		
		//коэффициент уже рассчитан
		Коэф = масКоэффициентыИндексации[0][ИмяИндексации];
		
	Иначе
		
		// такого коэффициента в таблице еще нет
		Коэф = 1; 
		ТекКоэф = 1;            // умножаем коэф., до достижения порога индексации  
		
		ОкончаниеПериода = ДобавитьМесяц(НачалоМесяца(Конец), -2); 
		
		Для каждого ТекущаяСтрока Из НеобходимыеДанные.тбИндексыИнфляции Цикл
			
			Если ТекущаяСтрока.Период < Начало
				Или ТекущаяСтрока.Период > ОкончаниеПериода Тогда
				
				Продолжить;			
			КонецЕсли; 
			
			ТекКоэф = ТекКоэф * ТекущаяСтрока.ИндексИнфляции;
			
			//Если порог индексации по документу не задан, тогда используем вариант алгоритма по индексу инфляции
			ПорогИндексации = ?(НеобходимыеДанные.ПорогИндексации = 0, ТекущаяСтрока.ПорогИндексации, НеобходимыеДанные.ПорогИндексации);
			
			Если Окр(ТекКоэф, 3) > ПорогИндексации Тогда
				
				Коэф = Коэф * Окр(ТекКоэф, 3); 
				ТекКоэф = 1;
				
			КонецЕсли;
			
			//ОбщегоНазначения.СообщитьСлужебнуюИнформацию("Отладка: расчет индексации по "+ НеобходимыеДанные.Сотрудник + " в периоде "+ Формат(ТекущаяСтрока.Период, "ДФ= ММММ - гггг ") + " коэффициент = " + Коэф);
			
		КонецЦикла; 
		
		
		Коэф = Окр(Коэф,3) - 1;
		//ОбщегоНазначения.СообщитьСлужебнуюИнформацию("Отладка: коэффициент = "+ Окр(Коэф,3));
		
		// запомним рассчитанный результат
		текСтрока 		 = НеобходимыеДанные.тбКоэффициентыИндексации.Добавить();
		текСтрока.Начало = Начало;
		текСтрока.Конец  = Конец;
		текСтрока[ИмяИндексации] = Коэф;
		
	КонецЕсли; 
	
	Возврат Коэф;
	
КонецФункции // РассчитатьЗаписьРегистраРасчета_Индексация_Коэффициент()

// Рассчитывает сумму базы для индексации зарплаты с учетом прожиточных минимумов различных социальных групп
//
// Параметры
//  ИсходныеДанные		- выборка	- выборка из результата запроса с исходными данными для расчета
//  НеобходимыеДанные	- структура - структура с необходимыми общими данными для расчета
//  ИмяИндексации		- строка	- "ИндексацияЗарплаты" или "ИндексацияСоциальныхНачислений"
//
// Возвращаемое значение:
//  число
//
Функция		РассчитатьЗаписьРегистраРасчета_Индексация_База(ИсходныеДанные, НеобходимыеДанные, ИмяИндексации)
	
	Если ИмяИндексации = "ИндексацияЗарплаты" Тогда
		БазаИндексацииСовместителя = ?(ИсходныеДанные.БазаИндексацииСовместителя = NULL ИЛИ ИсходныеДанные.БазаИндексацииСовместителя = Неопределено, 0, ИсходныеДанные.БазаИндексацииСовместителя);
	Иначе
		БазаИндексацииСовместителя = 0;
	КонецЕсли;
	
	
	табПороги = НеобходимыеДанные.тбСоциальныеГруппы.Скопировать();
	табПороги.Колонки.Добавить("База");
	табПороги.Колонки.Добавить("Порог");
	КвоСоцГрупп = табПороги.Количество();
	
	Для Инд = 1  По КвоСоцГрупп Цикл
		
		табПороги[Инд-1].База = ИсходныеДанные["База" + ИмяИндексации + Инд];
		табПороги[Инд-1].Порог = ИсходныеДанные["Порог" + ИмяИндексации + Инд];
		
	КонецЦикла;
	
	// считаем что совместители всегда работают по статье трудоспособные
	табПороги[2].База = табПороги[2].База + БазаИндексацииСовместителя;
	
	табПороги.Сортировать("Порог");
	
	РезультатБаза = 0;
	РезультатПолнаяБаза = 0;
	Для Инд = 1  По КвоСоцГрупп Цикл
		РезультатБаза = РезультатБаза + Мин( табПороги[Инд-1].База, табПороги[Инд-1].Порог - РезультатБаза);
		РезультатПолнаяБаза = РезультатПолнаяБаза + табПороги[Инд-1].База;
	КонецЦикла;
	
	РезультатБаза = Макс(РезультатБаза - БазаИндексацииСовместителя, 0);
	
	Если (РезультатПолнаяБаза - БазаИндексацииСовместителя) <> ИсходныеДанные["РезультатБаза"+ИмяИндексации]
		и ИсходныеДанные["РезультатБаза"+ИмяИндексации] <> 0 Тогда
		
		РезультатБаза = РезультатБаза * ИсходныеДанные["РезультатБаза"+ИмяИндексации] / (РезультатПолнаяБаза - БазаИндексацииСовместителя);
	КонецЕсли; 
	
	ОбщегоНазначения.СообщитьСлужебнуюИнформацию(НСтр("ru='Отладка: база индексации = ';uk='Налагодження: база індексації = '") + РезультатБаза);
	
	Возврат РезультатБаза;
	
КонецФункции // РассчитатьЗаписьРегистраРасчета_Индексация_База()

Функция ПолучитьКэффициентРезерваотпусков(Организация, Период) Экспорт
	
	Учет = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ИспользованиеРезерваОтпусков;
	Если НЕ Учет Тогда
		//учет не ведется, коэффициент 0
		Возврат 0;
	КонецЕсли;
	
	Срез = РегистрыСведений.КоэффициентРезерваОтпусков.СрезПоследних(Период,Новый Структура ("Организация", Организация));
	Если Срез.Количество() = 0 Тогда
		//коэффициент не задан, по умолчанию 1
		Возврат 1;
	Конецесли;
	
	Возврат Срез[0].Коэффициент;
	
КонецФункции



//////////////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ И ФУНКЦИИ, получение данных расчета

// Функция предназначена для получения оплачиваемого времени по результату запроса при расчете:
//
// Параметры:
//	ИсходныеДанные - строка выборки из результат запроса, по которой вернуть время
//
// Возвращаемое значение:
//	Число - размер оплачиваемого времени в днях/часах
//
Функция ОплачиваемоеВремя(ИсходныеДанные, СтрокаДвижений, КомментироватьРасчет, КомментарийВладелец, СообщениеОбОшибке = Ложь, ГрафикиБезРабочегоВремени)
	
	ОплачиваемоеВремя = 0;
	РасшифровкаКомментария = НеОпределено;
	ВажностьКомментария = НеОпределено;
	ОплачиваемоеВремя = ИсходныеДанные.ОтработаноВремени;
	
	Если ИсходныеДанные.ОтработаноВремени = Null Тогда
		СообщениеОбОшибке = Истина;
		Возврат 0;
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда
		Если ИсходныеДанные.СпособВводаВремени = 1 Тогда // введено сводно табелем или индивид. графиком
			РасшифровкаКомментария = Новый Массив;
			РасшифровкаКомментария.Добавить("РаботаСДиалогами.ОткрытьГрафик");
			РасшифровкаКомментария.Добавить(СтрокаДвижений.Сотрудник);
			РасшифровкаКомментария.Добавить(СтрокаДвижений.ПериодДействия);
			ТекстКомментария = НСтр("ru='Оплачиваемое время введено сводно за весь период работы ';uk='Оплачуваний час введений зведений за весь період роботи '");
			ПредставлениеРасшифровки = НСтр("ru='табелем учета рабочего времени';uk='табелем обліку робочого часу'");
			ВажностьКомментария = Перечисления.ВидыСообщений.ВажнаяИнформация;
		Иначе
			РасшифровкаКомментария = Новый Массив;
			РасшифровкаКомментария.Добавить("РаботаСДиалогами.ОткрытьГрафик");
			РасшифровкаКомментария.Добавить(СтрокаДвижений.ГрафикРаботы);
			РасшифровкаКомментария.Добавить(СтрокаДвижений.ПериодДействия);
			Если ТипЗнч(СтрокаДвижений.ГрафикРаботы) = Тип("СправочникСсылка.ГрафикиРаботы") Тогда
				ТекстКомментария = НСтр("ru='Оплачиваемое время рассчитано по графику работы: ';uk='Оплачуваний час розрахований за графіком роботи: '");
				ПредставлениеРасшифровки = ИсходныеДанные.ГрафикРаботыНаименование;
			Иначе
				ТекстКомментария = НСтр("ru='Оплачиваемое время рассчитано по индивидуальному графику работы или по табелю учета рабочего времени. ';uk='Оплачуваний час розрахований за індивідуальним графіком роботи або за табелем обліку робочого часу. '");
				ПредставлениеРасшифровки = НСтр("ru='Подробнее...';uk='Докладніше...'");
				ВажностьКомментария = Перечисления.ВидыСообщений.ВажнаяИнформация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ИсходныеДанные.ВидУчетаВремени <> Перечисления.ВидыУчетаВремени.ПоДням Тогда
		//Если ИсходныеДанные.ВидРасчета.ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное
		//	ИЛИ ИсходныеДанные.ВидРасчета.ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы Тогда
			ОплачиваемоеВремя = ИсходныеДанные.ОтработаноЧасов;
		//Иначе
		//	ОплачиваемоеВремя = ИсходныеДанные.ОтработаноВремени - ИсходныеДанные.ОтработаноЧасовПоТабелюОтклонение;
		//КонецЕсли;
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда
		КомментарийРасчета(НСтр("ru='Оплачиваемое время ';uk='Оплачуваний час '") + ?(ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням, НСтр("ru='(в днях) ';uk='(у днях) '"), НСтр("ru='(в часах) ';uk='(в годинах) '")) + ОплачиваемоеВремя, КомментарийВладелец);
		КомментарийРасчета(НСтр("ru='Вид учета времени: ';uk='Вид обліку часу: '") + ИсходныеДанные.ВидУчетаВремени, КомментарийВладелец);
		КомментарийРасчета(ТекстКомментария, КомментарийВладелец, ПредставлениеРасшифровки, РасшифровкаКомментария, ВажностьКомментария);
	КонецЕсли;
	
	Если ОплачиваемоеВремя = 0 И СтрокаДвижений.НормаДнейЗаМесяц = 0 И СтрокаДвижений.НормаЧасовЗаМесяц = 0 Тогда
		КлючПоиска = Новый Структура("ГрафикРаботы,ВидУчетаВремени");
		КлючПоиска.ВидУчетаВремени = ИсходныеДанные.ВидУчетаВремени;
		КлючПоиска.ГрафикРаботы = СтрокаДвижений.ГрафикРаботы;
		
		КоличествоСтрокГрафика = ГрафикиБезРабочегоВремени.НайтиСтроки(КлючПоиска).Количество();
		Если КомментироватьРасчет Или КоличествоСтрокГрафика = 0 Тогда
			РасшифровкаКомментария = Новый Массив;
			РасшифровкаКомментария.Добавить("РаботаСДиалогами.ОткрытьГрафик");
			
			Если ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоВечернимЧасам Тогда
				ТекстВидаВремени = НСтр("ru='вечерних часов';uk='вечірніх годин'");
			ИначеЕсли ИсходныеДанные.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда
				ТекстВидаВремени = НСтр("ru='ночных часов';uk='нічних годин'");
			Иначе
				ТекстВидаВремени = НСтр("ru='рабочих дней';uk='робочих днів'");
			КонецЕсли;
			
			Если ИсходныеДанные.СпособВводаВремени = 1 ИЛИ ИсходныеДанные.СпособВводаВремени = 2 Тогда
				РасшифровкаКомментария.Добавить(СтрокаДвижений.Сотрудник);
				РасшифровкаКомментария.Добавить(СтрокаДвижений.ПериодДействия);
				Если КомментироватьРасчет Тогда
					ТекстКомментария = НСтр("ru='В табеле учета рабочего времени за ';uk='У табелі обліку робочого часу за '") + Формат(СтрокаДвижений.ПериодДействия, "ДФ='MMММ yyyy ""г.""'") + НСтр("ru=' нет ';uk=' немає '") + ТекстВидаВремени + НСтр("ru='! Необходимо заполнить ';uk='! Необхідно заповнити '");
				Иначе
					ФИО = ИсходныеДанные.СотрудникНаименование;
					
					ТекстКомментария = НСтр("ru='У ';uk='У '") + ФИО + НСтр("ru=' в табеле учета рабочего времени за ';uk=' у табелі обліку робочого часу за '") + Формат(СтрокаДвижений.ПериодДействия, "ДФ='MMММ yyyy ""г.""'") + НСтр("ru=' нет ';uk=' немає '") + ТекстВидаВремени + НСтр("ru='! Необходимо заполнить ';uk='! Необхідно заповнити '");
				КонецЕсли;
				
				КомментарийРасчета(ТекстКомментария, КомментарийВладелец, "документ", РасшифровкаКомментария, Перечисления.ВидыСообщений.Ошибка);
				Если КоличествоСтрокГрафика = 0 Тогда
					НоваяСтрока = ГрафикиБезРабочегоВремени.Добавить();
					НоваяСтрока.ВидУчетаВремени = ИсходныеДанные.ВидУчетаВремени;
					НоваяСтрока.ГрафикРаботы = СтрокаДвижений.Сотрудник;
				КонецЕсли;
				
				
			Иначе
				РасшифровкаКомментария.Добавить(СтрокаДвижений.ГрафикРаботы);
				РасшифровкаКомментария.Добавить(СтрокаДвижений.ПериодДействия);
				Если ТипЗнч(СтрокаДвижений.ГрафикРаботы) = Тип("СправочникСсылка.ГрафикиРаботы") Тогда
					КомментарийРасчета(НСтр("ru='В графике нет ';uk='У графіку немає '") + ТекстВидаВремени + НСтр("ru=' за ';uk=' за '") + Формат(СтрокаДвижений.ПериодДействия, "ДФ='MMММ yyyy ""г.""'") + НСтр("ru=' Необходимо заполнить график: ';uk=' Необхідно заповнити графік: '"), КомментарийВладелец, ИсходныеДанные.ГрафикРаботыНаименование, РасшифровкаКомментария, Перечисления.ВидыСообщений.Ошибка);
				Иначе
					Если КомментироватьРасчет Тогда
						ТекстКомментария = НСтр("ru='В индивидуальном графике или табеле учета рабочего времени за ';uk='В індивідуальному графіку або табелі обліку робочого часу за '") + Формат(СтрокаДвижений.ПериодДействия, "ДФ='MMММ yyyy ""г.""'") + НСтр("ru=' нет ';uk=' немає '") + ТекстВидаВремени + НСтр("ru='. Необходимо заполнить ';uk='. Необхідно заповнити '");
					Иначе
						ФИО = ИсходныеДанные.СотрудникНаименование;
						
						ТекстКомментария = НСтр("ru='У ';uk='У '") + ФИО + НСтр("ru=' в индивидуальном графике или табеле учета рабочего времени за ';uk=' в індивідуальному графіку або табелі обліку робочого часу за '") + Формат(СтрокаДвижений.ПериодДействия, "ДФ='MMММ yyyy ""г.""'") + НСтр("ru=' нет ';uk=' немає '") + ТекстВидаВремени + НСтр("ru='. Необходимо заполнить ';uk='. Необхідно заповнити '");
					КонецЕсли;
					
					КомментарийРасчета(ТекстКомментария, КомментарийВладелец, "документ", РасшифровкаКомментария, Перечисления.ВидыСообщений.Ошибка);
				КонецЕсли;
				Если КоличествоСтрокГрафика = 0 Тогда
					НоваяСтрока = ГрафикиБезРабочегоВремени.Добавить();
					НоваяСтрока.ВидУчетаВремени = ИсходныеДанные.ВидУчетаВремени;
					НоваяСтрока.ГрафикРаботы = СтрокаДвижений.ГрафикРаботы;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		СообщениеОбОшибке = Истина;
	КонецЕсли;
	
	Возврат ОплачиваемоеВремя;
	
КонецФункции // ОплачиваемоеВремя()

// Возвращает список алгоритмов начислений, являющихся почасовыми отклонениями
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокНачисленийПочасовыхОтклонений() Экспорт

	СписокСпособов = Новый СписокЗначений;
	 
	СписокСпособов.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	СписокСпособов.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);

	Возврат СписокСпособов

КонецФункции // ПолучитьСписокДополнительныхВариантовНачислений()

Функция ПолучитьТекстПоказателя(НеобходимыеДанные, ВидПВР, Предопределенный = Ложь, КоличествоПоказателей, КомментироватьРасчет)		
	
	Если 	НеобходимыеДанные.ОтработаноВремени или 
		НеобходимыеДанные.НормаВремениЗаМесяц или
		НеобходимыеДанные.Стаж или
		НеобходимыеДанные.ВремяВКалендарныхДнях или
		НеобходимыеДанные.База Тогда
		Если ВидПВР = "Удержания"  Тогда
			Показатель1Текст = "ВЫБОР "+
			?(НеобходимыеДанные.ВремяВКалендарныхДнях, "
			|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ВремяВКалендарныхДнях)
			|		ТОГДА РАЗНОСТЬДАТ(ФактическийПериодДействия.БазовыйПериодНачало, ФактическийПериодДействия.БазовыйПериодКонец, ДЕНЬ) + 1  ", "")+"
			|";
			////?(НеобходимыеДанные.КалендарныхДнейВмесяце, "
			////|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.КалендарныхДнейВмесяце)
			////|		ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало,МЕСЯЦ), КОНЕЦПЕРИОДА(Основной.БазовыйПериодКонец,МЕСЯЦ), ДЕНЬ) + 1  ", "");
			////
		Иначе
			Показатель1Текст = "ВЫБОР "+
			?(НеобходимыеДанные.ВремяВКалендарныхДнях, "                 
			|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ВремяВКалендарныхДнях)
			|		ТОГДА РАЗНОСТЬДАТ(ФактическийПериодДействия.ПериодДействияНачало, ФактическийПериодДействия.ПериодДействияКонец, ДЕНЬ) + 1 ", "")+"
			|";
			
		КонецЕсли;
		
		Показатель1Текст = Показатель1Текст +
		?(НеобходимыеДанные.ОтработаноВремени, "
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ВремяВДнях)  
		|		ТОГДА ВЫБОР	КОГДА ВремяВведенноеВЦеломЗаПериод.УчетПоТабелю
		|						ТОГДА ВремяВведенноеВЦеломЗаПериод.ОтработаноДнейПоТабелю
		|					КОГДА ВремяПоТабелю.УчетПоТабелю
		|						ТОГДА ВремяПоТабелю.ОтработаноДнейПоТабелю
		|					КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|						ТОГДА ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
		|					ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
		|			КОНЕЦ 
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ВремяВЧасах)
		|		ТОГДА ВЫБОР	КОГДА ВремяВведенноеВЦеломЗаПериод.УчетПоТабелю
		|						ТОГДА ВремяВведенноеВЦеломЗаПериод.ОтработаноЧасовПоТабелю
		|					КОГДА ВремяПоТабелю.УчетПоТабелю
		|						ТОГДА ВремяПоТабелю.ОтработаноЧасовПоТабелю
		|					КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|						ТОГДА ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
		|					ИНАЧЕ ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
		|			КОНЕЦ","") + 
		?(НеобходимыеДанные.НормаВремени, "
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВДнях)
		|		ТОГДА ВЫБОР КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
		|				ТОГДА ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия  
		|				ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия 
		|			КОНЕЦ
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах)
		|		ТОГДА ВЫБОР КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
		|				ТОГДА ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия  
		|			ИНАЧЕ ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия    
		|			КОНЕЦ","") +
		?(НеобходимыеДанные.НормаВремениЗаМесяц, "
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях)
		|		ТОГДА ВЫБОР КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
		|				ТОГДА ДанныеГрафика.ОсновноеЗначениеПериодДействия 
		|				ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеПериодДействия 
		|			КОНЕЦ
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах)
		|		ТОГДА ВЫБОР КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням) 
		|				ТОГДА ДанныеГрафика.ДополнительноеЗначениеПериодДействия 
		|			ИНАЧЕ ДанныеГрафика.ОсновноеЗначениеПериодДействия 
		|		КОНЕЦ", "");
		
			////|				ТОГДА ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
			////|			ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
		Показатель1Текст = Показатель1Текст +		
		?(НеобходимыеДанные.База, "
		|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.РасчетнаяБаза)
		|		ТОГДА База.РезультатБаза", "");	
		Показатель1Текст = Показатель1Текст+
			?(НеобходимыеДанные.МинимальнаяЗарплата, "                 
			|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.МинимальнаяЗарплата)
			|		ТОГДА МинимальнаяЗарплата.МинЗПМесяц
			|	КОГДА Показатели.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.МинимальнаяЗарплатаЧасовая)
			|		ТОГДА МинимальнаяЗарплата.МинЗПЧас", ""); 	

		Если Предопределенный ИЛИ КоличествоПоказателей = 0 Тогда
			
			Показатель1Текст = Показатель1Текст + "				
			|ИНАЧЕ 0
			|КОНЕЦ ";
		Иначе
			Показатель1Текст = Показатель1Текст + "				
			|ИНАЧЕ ВЫБОР КОГДА Показатели.Показатель1.ТипПоказателя В (&ШкальныеПоказатели)
			|		ТОГДА Показатели.Показатель1
			|	    ИНАЧЕ  Основной.Показатель1 / ВЫБОР КОГДА Показатели.Показатель1.ТипПоказателя В (&ПроцентныеПоказатели) ТОГДА 100 ИНАЧЕ 1 КОНЕЦ
			|КОНЕЦ КОНЕЦ";
			
		КонецЕсли;
	Иначе
		Если Предопределенный ИЛИ КоличествоПоказателей = 0 Тогда
			
			Показатель1Текст = Показатель1Текст + "				
			|ИНАЧЕ 0
			|КОНЕЦ ";
		Иначе
			
			Показатель1Текст = "ВЫБОР 
			|КОГДА Показатели.Показатель1.ТипПоказателя В (&ШкальныеПоказатели)
			|		ТОГДА Показатели.Показатель1
			|	  	ИНАЧЕ  Основной.Показатель1 / ВЫБОР КОГДА Показатели.Показатель1.ТипПоказателя В (&ПроцентныеПоказатели) ТОГДА 100 ИНАЧЕ 1 КОНЕЦ
			|КОНЕЦ";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Показатель1Текст;
	
КонецФункции //ПолучитьТекстПоказателя

// Получает данные для расчета ресурсов записей регистра расчета
//
//	ИмяРегистра - строка, имя регистра расчета
//	КатегорияРасчета - ссылка на значение перечисленич КатегорииРасчетов
//	НеобходимыеДанные - Структура с элементами 
//			База,
//			НормаВремени,
//			ОтработаноВремени,
//			...
//	Регистратор - ссылка на документ
//	Организация - ссылка на организацию по которой проводится Регистратор
//	ПериодРегистрации
//	Перерасчет - булево - признак того, что получаем данные для случая перерасчета
//	Физлица - массив ссылок на физлиц - выбранные для перерасчета физлица, или массив содержащий ссылку
//			  на физлицо по которому производится расчет (расчет по одному работнику из документа)	
//
// Возвращает выборку результата запроса
Функция ПолучитьДанныеДляРасчета(ИмяРегистра,
									КатегорияРасчета,
									НеобходимыеДанные,
									Регистратор,
									Организация,
									ПериодРегистрации,
									Перерасчет = Ложь,
									Сотрудники = Неопределено,
									КомментироватьРасчет = Ложь, ФормаКомментариев = НеОпределено) Экспорт

	Если НеобходимыеДанные.НеобходимыИндексыИнфляции Тогда
		// индексы инфляции
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
		Запрос.УстановитьПараметр("парамДатаИзмененияПорогаИндексации", ДатаИзмененияПорогаИндексации());
		
		Запрос.Текст = "
		|ВЫБРАТЬ 
		|	ИндексыИнфляции.Период			КАК Период, 
		|	ИндексыИнфляции.Индекс			КАК ИндексИнфляции,
		|   ВЫБОР КОГДА ИндексыИнфляции.Период >= &парамДатаИзмененияПорогаИндексации 
		|    ТОГДА 1.03
		|    ИНАЧЕ 1.01
		|   КОНЕЦ КАК ПорогИндексации
		| 
		|	ИЗ РегистрСведений.ИндексИнфляции КАК ИндексыИнфляции
		| 
		|ГДЕ ИндексыИнфляции.Период <= &парамПериодРегистрации
		|УПОРЯДОЧИТЬ ПО 
		|	ИндексыИнфляции.Период ВОЗР
		|";
		
		тбИндексыИнфляции = Запрос.Выполнить().Выгрузить();
		НеобходимыеДанные.Вставить("тбИндексыИнфляции", тбИндексыИнфляции);
		
		
		// Проверим правильно ли заполнены ли все социальные группы у базовых начислений индексации
		// иначе могут быть проблемы в расчете индексации
		Запрос.Текст = "
		|ВЫБРАТЬ 
		|	ИндексацияБазовые.ВидРасчета,
		|	ИндексацияБазовые.ВидРасчета.СоциальнаяГруппа
		|ИЗ  ПланВидовРасчета.Начисления.БазовыеВидыРасчета КАК ИндексацияБазовые
		|ГДЕ	ИндексацияБазовые.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ИндексацияЗарплаты)
		|	И	ИндексацияБазовые.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ПустаяСсылка)		
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Индексация = ПланыВидовРасчета.Начисления.ИндексацияЗарплаты;
			КомментарийОшибки = КомментарийРасчета(НСтр("ru='Индексация зарплаты может рассчитаться неверно! Не установлена социальная группа у расчетов: ';uk='Індексація зарплати може бути розрахована не вірно! Не встановлено соціальну групу у розрахунків: '"), , Индексация.Наименование, Индексация, Перечисления.ВидыСообщений.ВажнаяИнформация);
			Пока Выборка.Следующий() Цикл
				КомментарийРасчета("", КомментарийОшибки,Выборка.ВидРасчета.Наименование,Выборка.ВидРасчета);
			КонецЦикла;
		КонецЕсли;
	
		

	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////
	// Вложенные запросы
	// для получения данных расчета
	// Реализованы как временные таблицы
	Если Истина Тогда 
		
		// НакопленныеДанные
		Если Истина Тогда 
			// уже начислено по другим регистраторам в данном расчетном периоде и за всю историю
			// применяется для расчета удержаний "нарастающим итогом за месяц"
			//	Поля:
			//		Сотрудник
			//		ДокументОснование
			//		ВидРасчета
			//		УжеНачисленоВТекущемПериоде
			//		УжеНачисленоЗаВсюИсторию
			//	Описание:
			//		суммирует результаты по видам расчета и документам-основаниям
			//
			НакопленныеДанныеТекст = " 
			|ВЫБРАТЬ
			|	НакопленныеДанные.Сотрудник,
			|	НакопленныеДанные.ВидРасчета,
			|	НакопленныеДанные.ДокументОснование,
			|";
			Если Регистратор.ОтражатьВРеглУчете Тогда
				НакопленныеДанныеТекст = НакопленныеДанныеТекст + " 
				|	СУММА(ВЫБОР КОГДА НакопленныеДанные.ПериодРегистрации  = Основной.ПериодРегистрации ТОГДА НакопленныеДанные.Результат ИНАЧЕ 0 КОНЕЦ) КАК УжеНачисленоВТекущемПериоде,
				|	СУММА(ВЫБОР КОГДА НакопленныеДанные.ПериодРегистрации <= Основной.ПериодРегистрации ТОГДА НакопленныеДанные.Результат ИНАЧЕ 0 КОНЕЦ) КАК УжеНачисленоЗаВсюИсторию
				|";
			Иначе
				НакопленныеДанныеТекст = НакопленныеДанныеТекст + " 
				|	СУММА(ВЫБОР КОГДА НакопленныеДанные.ПериодРегистрации  = Основной.ПериодРегистрации ТОГДА НакопленныеДанные.РезультатУпр ИНАЧЕ 0 КОНЕЦ) КАК УжеНачисленоВТекущемПериоде,
				|	СУММА(ВЫБОР КОГДА НакопленныеДанные.ПериодРегистрации <= Основной.ПериодРегистрации ТОГДА НакопленныеДанные.РезультатУпр ИНАЧЕ 0 КОНЕЦ) КАК УжеНачисленоЗаВсюИсторию
				|";
			КонецЕсли;
			НакопленныеДанныеТекст = НакопленныеДанныеТекст + " 
			|ПОМЕСТИТЬ ВТНакопленныеДанные
			|ИЗ
			|	РегистрРасчета.Удержания КАК Основной
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК НакопленныеДанные
			|		ПО 
			|			НакопленныеДанные.Сотрудник = Основной.Сотрудник
			|			И НакопленныеДанные.ВидРасчета = Основной.ВидРасчета
			|			И НакопленныеДанные.ПериодРегистрации <= Основной.ПериодРегистрации
			|			И НакопленныеДанные.Организация = Основной.Организация
			|			И НакопленныеДанные.ДокументОснование = Основной.ДокументОснование
			|			И НакопленныеДанные.Регистратор <> Основной.Регистратор
			|
			|ГДЕ
			|	Основной.Регистратор = &парамРегистратор И Основной.Авторасчет
			|
			|СГРУППИРОВАТЬ ПО
			|	НакопленныеДанные.Сотрудник,
			|	НакопленныеДанные.ВидРасчета,
			|	НакопленныеДанные.ДокументОснование
			|ИНДЕКСИРОВАТЬ ПО 
			|	НакопленныеДанные.Сотрудник,
			|	НакопленныеДанные.ВидРасчета,
			|	НакопленныеДанные.ДокументОснование";
		КонецЕсли; 
		
		// ВремяПоТабелю*
		Если Истина Тогда 
			//	данные по отработанному времени и норме времени по методу "сплошной регистрации" в текущем периоде регистрации
			//	Поля 
			//		НомерСтроки
			//		ОтработаноДнейПоТабелю
			//		ОтработаноЧасовПоТабелю
			//		ОтработаноЧасовПоТабелюОтклонение
			//
			//	Описание                       
			//	Суммируем отработанное время и норму времени в заданном периоде действия для каждой строки начисления
			//	из регистра РабочееВремяРаботниковОрганизаций 
			ВремяПоТабелюТекст = 
			"ВЫБРАТЬ
			|	Основной.НомерСтроки КАК НомерСтроки,
			|	Истина КАК УчетПоТабелю,
			|	СУММА(ВЫБОР КОГДА Основной.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ОтработанноеВремя.ВидИспользованияРабочегоВремени
			|				ТОГДА 
			|					ВЫБОР КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|							ТОГДА ОтработанноеВремя.Дней
			|						ИНАЧЕ ОтработанноеВремя.Часов
			|					КОНЕЦ
			|				ИНАЧЕ 0
			|			КОНЕЦ) КАК ОсновноеЗначениеПоТабелю,
			|	СУММА(ВЫБОР
			|			КОГДА Основной.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ОтработанноеВремя.ВидИспользованияРабочегоВремени
			|				ТОГДА ОтработанноеВремя.Дней
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОтработаноДнейПоТабелю,
			|	СУММА(ВЫБОР
			|			КОГДА Основной.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ОтработанноеВремя.ВидИспользованияРабочегоВремени
			|				ТОГДА ОтработанноеВремя.Часов
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОтработаноЧасовПоТабелю
			|ПОМЕСТИТЬ ВТВремяПоТабелю
			|
			|ИЗ РегистрРасчета.Начисления КАК Основной
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК ОтработанноеВремя
			|		ПО		Основной.Сотрудник = ОтработанноеВремя.Сотрудник
			|			И	Основной.Назначение = ОтработанноеВремя.Назначение
			|			И	(ОтработанноеВремя.Период МЕЖДУ Основной.ПериодДействияНачало И Основной.ПериодДействияКонец)
			|			И	((НЕ ОтработанноеВремя.ВЦеломЗаПериод))
			|
			|ГДЕ
			|	Основной.Регистратор = &парамРегистратор
			|	И Основной.Авторасчет
			|
			|СГРУППИРОВАТЬ ПО
			|	Основной.НомерСтроки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НомерСтроки";
		КонецЕсли; 
		
		// ВТВремяВведенноеВЦеломЗаПериод*
		Если Истина Тогда 
			ВремяВведенноеВЦеломЗаПериодТекст = 
			"ВЫБРАТЬ
			|	Основной.НомерСтроки КАК НомерСтроки,
			|	Истина КАК УчетПоТабелю,
			|	СУММА(ВЫБОР
			|			КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|				ТОГДА ОтработанноеВремя.Дней
			|			ИНАЧЕ ОтработанноеВремя.Часов
			|		КОНЕЦ) КАК ОсновноеЗначениеПоТабелю,
			|	СУММА(ВЫБОР
			|			КОГДА Основной.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ОтработанноеВремя.ВидИспользованияРабочегоВремени
			|				ТОГДА ОтработанноеВремя.Дней
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОтработаноДнейПоТабелю,
			|	СУММА(ВЫБОР
			|			КОГДА Основной.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ОтработанноеВремя.ВидИспользованияРабочегоВремени
			|				ТОГДА ОтработанноеВремя.Часов
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОтработаноЧасовПоТабелю
			|ПОМЕСТИТЬ ВТВремяВведенноеВЦеломЗаПериод
			|ИЗ
			|	РегистрРасчета.Начисления КАК Основной
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК ОтработанноеВремя
			|		ПО Основной.Сотрудник = ОтработанноеВремя.Сотрудник
			|		    И Основной.Назначение = ОтработанноеВремя.Назначение
			|			И ОтработанноеВремя.Период = Основной.ПериодДействия
			|			И Основной.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ОтработанноеВремя.ВидИспользованияРабочегоВремени
			|			И (ОтработанноеВремя.ВЦеломЗаПериод)
			|ГДЕ
			|	Основной.Регистратор = &парамРегистратор
			|	И Основной.Авторасчет
			|
			|СГРУППИРОВАТЬ ПО
			|	Основной.НомерСтроки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НомерСтроки";
		КонецЕсли; 
		
	КонецЕсли; 
	// Конец определения текстов вложенных запросов
	/////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос();
	НеобходимаБаза = НеобходимыеДанные.База;
	НеобходимГрафик = НеобходимыеДанные.НормаВремени ИЛИ НеобходимыеДанные.ОтработаноВремени ИЛИ НеобходимыеДанные.Календарные ИЛИ НеобходимыеДанные.НормаВремениЗаМесяц;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	// параметры запросов
	Запрос.УстановитьПараметр("парамРегистратор", Регистратор);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("парамСотрудники", Сотрудники);
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета"	, Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("парамВалютаУпрУчета", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ОсновнойГрафикРаботыПредприятий", Константы.ОсновнойГрафикРаботыПредприятий.Получить());
	
	// категория начисления (удержания)
	Запрос.УстановитьПараметр("парамКатегорияНачисления", КатегорияРасчета);
	
	Если ИмяРегистра = "Начисления" или 
			ИмяРегистра = "Удержания" Тогда
		Условие = "ВидРасчета.КатегорияРасчета = &парамКатегорияНачисления И Регистратор = &парамРегистратор И Авторасчет";
		ВнешнееУсловие = "Основной.ВидРасчета.КатегорияРасчета = &парамКатегорияНачисления И Основной.Регистратор = &парамРегистратор";
	Иначе
		Условие = "Регистратор = &парамРегистратор И Авторасчет";
		ВнешнееУсловие = "Основной.Регистратор = &парамРегистратор И Основной.Сотрудник В (&парамСотрудники)";
	КонецЕсли;
	
	// для формирования ИТОГИ при комментировании расчета
	ПоляЗапросаМаксимум = Новый Массив;
	ПоляЗапросаСумма = Новый Массив;
	
	Если ИмяРегистра = "Начисления" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ 
		|Основной.Регистратор							Как Регистратор,
		|Основной.Регистратор.ОтражатьВУпрУчете			Как ОтражатьВУпрУчете,
		|Основной.Регистратор.ОтражатьВРеглУчете		Как ОтражатьВРеглУчете, 
		|Основной.НомерСтроки							Как НомерСтроки,
		|Основной.ВидРасчета							Как ВидРасчета,
		|Основной.ВидРасчета.Наименование				Как ВидРасчетаНаименование,
		|Основной.ВидРасчета.ПериодДействияБазовый		Как ВидРасчетаПериодДействияБазовый,
		|Основной.Сотрудник								Как Сотрудник,
		|Основной.Сотрудник.Наименование				Как СотрудникНаименование,
		|Основной.Назначение							Как Назначение,
		|Основной.ПериодДействияНачало					Как ПериодДействияНачало,
		|Основной.ПериодДействияКонец					Как ПериодДействияКонец,
		|ЕСТЬNULL(Основной.ВидРасчета.ЗачетОтработанногоВремени, ЛОЖЬ)	Как ЗачетОтработанногоВремени,
		|ЕСТЬNULL(Основной.ВидРасчета.ЗачетНормыВремени, ЛОЖЬ)			Как ЗачетНормыВремени,
		|ЕСТЬNULL(Основной.ВидРасчета.ЗачетКалендарных, ЛОЖЬ)			Как ЗачетКалендарных,
		|Основной.ВидУчетаВремени						Как ВидУчетаВремени,
		|Основной.ВидРасчета.СпособРасчета				Как СпособРасчета, 
		|Основной.ВидРасчета.ДоходНДФЛ					Как ДоходНДФЛ,
		|Основной.НормаДнейЗаМесяц					Как НормаДнейЗаМесяц, 
		|Основной.НормаЧасовЗаМесяц					Как НормаЧасовЗаМесяц
		|";
		
		Если КомментироватьРасчет Тогда
			ПоляЗапросаМаксимум.Добавить("Сотрудник");
			ПоляЗапросаМаксимум.Добавить("СотрудникНаименование");
			ПоляЗапросаМаксимум.Добавить("ПериодДействияНачало");
			ПоляЗапросаМаксимум.Добавить("ПериодДействияКонец");
			ПоляЗапросаМаксимум.Добавить("ЗачетОтработанногоВремени");
			ПоляЗапросаМаксимум.Добавить("ЗачетНормыВремени");
			ПоляЗапросаМаксимум.Добавить("ЗачетКалендарных");
			ПоляЗапросаМаксимум.Добавить("ВидУчетаВремени");
			ПоляЗапросаМаксимум.Добавить("СпособРасчета");
			//ПоляЗапросаМаксимум.Добавить("ВариантАлгоритмаРасчета");
			ПоляЗапросаМаксимум.Добавить("ДоходНДФЛ");
			ПоляЗапросаМаксимум.Добавить("ВидРасчета");
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаНаименование");
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаПериодДействияБазовый");
			ПоляЗапросаМаксимум.Добавить("НормаДнейЗаМесяц");
			ПоляЗапросаМаксимум.Добавить("НормаЧасовЗаМесяц");
			ПоляЗапросаМаксимум.Добавить("ОтражатьВУпрУчете");
			ПоляЗапросаМаксимум.Добавить("ОтражатьВРеглУчете");
		КонецЕсли;
		
		Если Регистратор.ОтражатьВУпрУчете Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	ВЫБОР	КОГДА	&парамВалютаУпрУчета = &парамВалютаРегламентУчета 
			|			ТОГДА 1 
			|			ИНАЧЕ ВалютыУпр.Курс/ВалютыУпр.Кратность КОНЕЦ
			|														КАК КурсВалютыУпр
			|";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("КурсВалютыУпр");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ПоказателиСхемМотивации Тогда
			
			// Получим максимальное число показателей			
			Если Истина Тогда
		
				ТекстКолВоПоказателей =
				"ВЫБРАТЬ
				|	МАКСИМУМ(ВложенныйЗапрос.НомерСтроки) КАК КолВоПоказателей
				|ИЗ
				|	РегистрРасчета."+ИмяРегистра+" КАК Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|	(ВЫБРАТЬ
				|		Показатели.Ссылка,
				|		Показатели.НомерСтроки КАК НомерСтроки
				|	ИЗ
				|		ПланВидовРасчета."+ИмяРегистра+".Показатели КАК Показатели) КАК ВложенныйЗапрос
				|	ПО ВложенныйЗапрос.Ссылка = Основной.ВидРасчета
				|ГДЕ "+ВнешнееУсловие;
				
				Запрос.Текст = ТекстКолВоПоказателей;
				ВыборкаКоличестваПоказателей = Запрос.Выполнить().Выбрать();
				ВыборкаКоличестваПоказателей.Следующий();
				КоличествоПоказателей = ?(ВыборкаКоличестваПоказателей.КолВоПоказателей=NULL,0,ВыборкаКоличестваПоказателей.КолВоПоказателей);		
			КонецЕсли;
			
			Если КоличествоПоказателей = 0 Тогда
				ТекстЗапроса = ТекстЗапроса + ",
				| 0 КАК КоличествоПоказателей,";
			Иначе
				ТекстЗапроса = ТекстЗапроса + ",
				| Показатели.КоличествоПоказателей КАК КоличествоПоказателей,";
				Если КомментироватьРасчет Тогда
					ПоляЗапросаМаксимум.Добавить("КоличествоПоказателей");
				КонецЕсли;
			КонецЕсли;
			
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ФормулаРасчета");
			КонецЕсли;
				
			ТекстЗапроса = ТекстЗапроса + "
			| Основной.ВидРасчета.ФормулаРасчета КАК ФормулаРасчета";
			Для СчПоказателей = 1 По КоличествоПоказателей Цикл
				ТекстЗапроса = ТекстЗапроса + ", 
				|Показатели.Показатель" + СчПоказателей+".Наименование Как Показатель" + СчПоказателей + "Наименование";
				
				Если КомментироватьРасчет Тогда
					ПоляЗапросаМаксимум.Добавить("Показатель" + СчПоказателей + "Наименование");
				КонецЕсли;
			КонецЦикла;			
			
			Показатель1Текст = ПолучитьТекстПоказателя(НеобходимыеДанные,ИмяРегистра,, КоличествоПоказателей, КомментироватьРасчет);
			Если КоличествоПоказателей > 6 Тогда
				// получим текст запроса для предопределенных показателей
				Показатель1ТекстПредопределенный = ПолучитьТекстПоказателя(НеобходимыеДанные,ИмяРегистра, Истина, КоличествоПоказателей, КомментироватьРасчет);
			КонецЕсли;
			
			Для СчПоказателей = 1 По КоличествоПоказателей Цикл
				Если СчПоказателей > 6 Тогда					
					ПоказательТекст = СтрЗаменить(Показатель1ТекстПредопределенный, "Показатель1", "Показатель"+СчПоказателей);
				Иначе
					ПоказательТекст = СтрЗаменить(Показатель1Текст, "Показатель1", "Показатель"+СчПоказателей);
				КонецЕсли;					
				ТекстЗапроса = ТекстЗапроса + ", 
			   	|" + ПоказательТекст + " Как Показатель"+СчПоказателей;
				
				Если КомментироватьРасчет Тогда
					ПоляЗапросаМаксимум.Добавить("Показатель" + СчПоказателей);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Базы	
		Если НеобходимаБаза Тогда
			Если Регистратор.ОтражатьВРеглУчете Тогда
				Если КомментироватьРасчет Тогда
					ТекстЗапроса = ТекстЗапроса + ",
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.РезультатБаза ИНАЧЕ База.РезультатБаза КОНЕЦ Как РезультатБаза,
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.ВидРасчетаРазрез ИНАЧЕ База.ВидРасчетаРазрез КОНЕЦ Как ВидРасчетаРазрез,
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.ВидРасчетаРазрез.Наименование ИНАЧЕ База.ВидРасчетаРазрез.Наименование КОНЕЦ Как ВидРасчетаРазрезНаименование";
					Если НеобходимыеДанные.ИндексацияЗарплаты ИЛИ НеобходимыеДанные.ДоплатаДоМЗП Тогда
	                	ТекстЗапроса = ТекстЗапроса + ",
						|БазаНазначенияИнд.ОтработаноДнейБаза Как ОтработаноДнейБаза,
						|БазаНазначенияИнд.ОтработаноЧасовБаза Как ОтработаноЧасовБаза";
					КонецЕсли;
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрез");
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрезНаименование");
				Иначе 
					ТекстЗапроса = ТекстЗапроса + ",
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.РезультатБаза ИНАЧЕ База.РезультатБаза КОНЕЦ Как РезультатБаза,
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.ОтработаноДнейБаза ИНАЧЕ База.ОтработаноДнейБаза КОНЕЦ Как ОтработаноДнейБаза,
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.ОтработаноЧасовБаза ИНАЧЕ База.ОтработаноЧасовБаза КОНЕЦ Как ОтработаноЧасовБаза";
				КонецЕсли;
				
			Иначе
				Если КомментироватьРасчет Тогда
					ТекстЗапроса = ТекстЗапроса + ",
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.РезультатУпрБаза ИНАЧЕ База.РезультатУпрБаза КОНЕЦ Как РезультатБаза,
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.ВидРасчетаРазрез ИНАЧЕ База.ВидРасчетаРазрез КОНЕЦ Как ВидРасчетаРазрез,
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.ВидРасчетаРазрез.Наименование ИНАЧЕ База.ВидРасчетаРазрез.Наименование КОНЕЦ Как ВидРасчетаРазрезНаименование";
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрез");
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрезНаименование");
				Иначе 
					ТекстЗапроса = ТекстЗапроса + ",
					|ВЫБОР КОГДА Основной.ВидРасчета.БазаПоНазначению ТОГДА БазаНазначения.РезультатУпрБаза ИНАЧЕ База.РезультатУпрБаза КОНЕЦ Как РезультатБаза";
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимГрафик Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	Основной.ГрафикРаботы.Наименование КАК ГрафикРаботыНаименование";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ГрафикРаботыНаименование");
			КонецЕсли;
		КонецЕсли;

		Если НеобходимыеДанные.НормаВремени Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|	ВЫБОР	КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|				ТОГДА ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
			|			ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
			|	КОНЕЦ КАК НормаОплачиваемыхДней,
			|	ВЫБОР	КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|				ТОГДА ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
			|			ИНАЧЕ ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
			|	КОНЕЦ КАК НормаОплачиваемыхЧасов
			|";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("НормаОплачиваемыхЧасов");
				ПоляЗапросаМаксимум.Добавить("НормаОплачиваемыхДней");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.Календарные Тогда		
			ТекстЗапроса = ТекстЗапроса + ", 
			|	ЕСТЬNULL(ДанныеГрафика.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия,0) КАК КалендарныеДни";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("КалендарныеДни");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ОтработаноВремени Тогда
			
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") ИЛИ 
					ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВводСведенийОПлановыхНачисленияхУдержаниях")Тогда

				//Не используем табеля. Вместо фактического периода действия - период действия	
					
				ТекстЗапроса = ТекстЗапроса + ", 
				|	3 КАК СпособВводаВремени,
				|	ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеПериодДействия, 0) КАК ОтработаноВремени,
				|	ЕСТЬNULL(ВЫБОР	КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
				|				ТОГДА ДанныеГрафика.ОсновноеЗначениеПериодДействия
				|			ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеПериодДействия
				|			КОНЕЦ, 0) КАК ОтработаноДней,
				|	ЕСТЬNULL(ВЫБОР	КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
				|				ТОГДА ДанныеГрафика.ДополнительноеЗначениеПериодДействия
				|			ИНАЧЕ ДанныеГрафика.ОсновноеЗначениеПериодДействия
				|			КОНЕЦ, 0) КАК ОтработаноЧасов
				|";
				
			Иначе
				
				ТекстЗапроса = ТекстЗапроса + ", 
				|	ВЫБОР	КОГДА ВремяВведенноеВЦеломЗаПериод.УчетПоТабелю ТОГДА 1
				|			КОГДА ВремяПоТабелю.УчетПоТабелю ТОГДА 2
				|			ИНАЧЕ 3
				|	КОНЕЦ КАК СпособВводаВремени,
				|	ЕСТЬNULL(ВЫБОР	КОГДА ВремяВведенноеВЦеломЗаПериод.УчетПоТабелю
				|				ТОГДА ВремяВведенноеВЦеломЗаПериод.ОсновноеЗначениеПоТабелю
				|			КОГДА ВремяПоТабелю.УчетПоТабелю
				|				ТОГДА ВремяПоТабелю.ОсновноеЗначениеПоТабелю
				|			ИНАЧЕ
				|				ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
				|	КОНЕЦ, 0) КАК ОтработаноВремени,
				|	ЕСТЬNULL(ВЫБОР	КОГДА ВремяВведенноеВЦеломЗаПериод.УчетПоТабелю
				|				ТОГДА ВремяВведенноеВЦеломЗаПериод.ОтработаноДнейПоТабелю
				|			КОГДА ВремяПоТабелю.УчетПоТабелю
				|				ТОГДА ВремяПоТабелю.ОтработаноДнейПоТабелю
				|			КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
				|				ТОГДА ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
				|			ИНАЧЕ ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
				|	КОНЕЦ, 0) КАК ОтработаноДней,
				|	ЕСТЬNULL(ВЫБОР	КОГДА ВремяВведенноеВЦеломЗаПериод.УчетПоТабелю
				|				ТОГДА ВремяВведенноеВЦеломЗаПериод.ОтработаноЧасовПоТабелю
				|			КОГДА ВремяПоТабелю.УчетПоТабелю
				|				ТОГДА ВремяПоТабелю.ОтработаноЧасовПоТабелю
				|			КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
				|				ТОГДА ДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
				|			ИНАЧЕ ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
				|	КОНЕЦ, 0) КАК ОтработаноЧасов
				|";
			КонецЕсли;	
				
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ОтработаноВремени");
				ПоляЗапросаМаксимум.Добавить("ОтработаноДней");
				ПоляЗапросаМаксимум.Добавить("ОтработаноЧасов");
			КонецЕсли;
		КонецЕсли;
		
		// Допрасчеты
		Если НеобходимыеДанные.ВыслугаЛет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|СтавкиВыслуги.Ставка 		КАК СтавкаВыслуги";
		
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("СтавкаВыслуги");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ИндексацияЗарплаты Тогда
			
			ТекстЗапроса = ТекстЗапроса + ", 
			|ДанныеПоИндексацииЗарплаты.ИндексацияНачало	Как ИндексацияЗарплатыНачало, 
			|ДанныеПоИндексацииЗарплаты.ИндексацияКонец		Как ИндексацияЗарплатыКонец,
			|
			|ДанныеПоИндексацииЗарплаты.БазаСоцГруппы1		КАК БазаИндексацияЗарплаты1, 
			|ДанныеПоИндексацииЗарплаты.БазаСоцГруппы2		КАК БазаИндексацияЗарплаты2, 
			|ДанныеПоИндексацииЗарплаты.БазаСоцГруппы3		КАК БазаИндексацияЗарплаты3, 
			|ДанныеПоИндексацииЗарплаты.БазаСоцГруппы4		КАК БазаИндексацияЗарплаты4,
			|
			|ДанныеПоИндексацииЗарплаты.ПорогСоцГруппы1	КАК ПорогИндексацияЗарплаты1,
			|ДанныеПоИндексацииЗарплаты.ПорогСоцГруппы2	КАК ПорогИндексацияЗарплаты2,
			|ДанныеПоИндексацииЗарплаты.ПорогСоцГруппы3	КАК ПорогИндексацияЗарплаты3,
			|ДанныеПоИндексацииЗарплаты.ПорогСоцГруппы4	КАК ПорогИндексацияЗарплаты4,
			|
			|ДанныеПоИндексацииЗарплаты.ЕстьСправкаОБазеИндексацииСовместителя КАК ЕстьСправкаОБазеИндексацииСовместителя,
			|ДанныеПоИндексацииЗарплаты.БазаИндексацииСовместителей	Как БазаИндексацииСовместителя,
			|ДанныеПоИндексацииЗарплаты.РезультатБаза		КАК РезультатБазаИндексацияЗарплаты,
			|ДанныеПоИндексацииЗарплаты.РезультатФиксированнаяИндексация	КАК РезультатФиксированнаяИндексация,
			|ДанныеПоИндексацииЗарплаты.РасчетИндексацииПропорционально		КАК РасчетИндексацииПропорционально,
			|ДанныеПоИндексацииЗарплаты.СпособОсновногоРасчета		КАК СпособОсновногоРасчета,
			|ДанныеПоИндексацииЗарплаты.ОсновнойГрафикработы		КАК ОсновнойГрафикработы";

			
			Если КомментироватьРасчет Тогда
				
				ПоляЗапросаМаксимум.Добавить("ИндексацияЗарплатыНачало");
				ПоляЗапросаМаксимум.Добавить("ИндексацияЗарплатыКонец");
				
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияЗарплаты1");
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияЗарплаты2");
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияЗарплаты3");
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияЗарплаты4");
				
				ПоляЗапросаМаксимум.Добавить("БазаИндексацияЗарплаты1");
				ПоляЗапросаМаксимум.Добавить("БазаИндексацияЗарплаты2");
				ПоляЗапросаМаксимум.Добавить("БазаИндексацияЗарплаты3");
				ПоляЗапросаМаксимум.Добавить("БазаИндексацияЗарплаты4");
				
				ПоляЗапросаМаксимум.Добавить("ЕстьСправкаОБазеИндексацииСовместителя");
				ПоляЗапросаМаксимум.Добавить("БазаИндексацииСовместителя");
				ПоляЗапросаМаксимум.Добавить("РезультатБазаИндексацияЗарплаты");
				
				ПоляЗапросаМаксимум.Добавить("РезультатФиксированнаяИндексация");
				ПоляЗапросаМаксимум.Добавить("РасчетИндексацииПропорционально");
				ПоляЗапросаМаксимум.Добавить("СпособОсновногоРасчета");
				ПоляЗапросаМаксимум.Добавить("ОсновнойГрафикработы");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НеобходимыеДанные.ИндексацияСоциальныхНачислений Тогда
			
			ТекстЗапроса = ТекстЗапроса + ", 
			|ДанныеПоИндексацииСоциальныхНачислений.ИндексацияНачало	Как ИндексацияСоциальныхНачисленийНачало, 
			|ДанныеПоИндексацииСоциальныхНачислений.ИндексацияКонец		Как ИндексацияСоциальныхНачисленийКонец,
			|
			|ДанныеПоИндексацииСоциальныхНачислений.БазаСоцГруппы1		КАК БазаИндексацияСоциальныхНачислений1, 
			|ДанныеПоИндексацииСоциальныхНачислений.БазаСоцГруппы2		КАК БазаИндексацияСоциальныхНачислений2, 
			|ДанныеПоИндексацииСоциальныхНачислений.БазаСоцГруппы3		КАК БазаИндексацияСоциальныхНачислений3, 
			|ДанныеПоИндексацииСоциальныхНачислений.БазаСоцГруппы4		КАК БазаИндексацияСоциальныхНачислений4,
			|
			|ДанныеПоИндексацииСоциальныхНачислений.ПорогСоцГруппы1	КАК ПорогИндексацияСоциальныхНачислений1,
			|ДанныеПоИндексацииСоциальныхНачислений.ПорогСоцГруппы2	КАК ПорогИндексацияСоциальныхНачислений2,
			|ДанныеПоИндексацииСоциальныхНачислений.ПорогСоцГруппы3	КАК ПорогИндексацияСоциальныхНачислений3,
			|ДанныеПоИндексацииСоциальныхНачислений.ПорогСоцГруппы4	КАК ПорогИндексацияСоциальныхНачислений4,
			|
			|ДанныеПоИндексацииСоциальныхНачислений.РезультатБаза		КАК РезультатБазаИндексацияСоциальныхНачислений";
			
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ИндексацияСоциальныхНачисленийНачало");
				ПоляЗапросаМаксимум.Добавить("ИндексацияСоциальныхНачисленийКонец");
				
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияСоциальныхНачислений1");
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияСоциальныхНачислений2");
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияСоциальныхНачислений3");
				ПоляЗапросаМаксимум.Добавить("ПорогИндексацияСоциальныхНачислений4");
				
				ПоляЗапросаСумма.Добавить("БазаИндексацияСоциальныхНачислений1");
				ПоляЗапросаСумма.Добавить("БазаИндексацияСоциальныхНачислений2");
				ПоляЗапросаСумма.Добавить("БазаИндексацияСоциальныхНачислений3");
				ПоляЗапросаСумма.Добавить("БазаИндексацияСоциальныхНачислений4");
				
				ПоляЗапросаСумма.Добавить("РезультатБазаИндексацияСоциальныхНачислений");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.СуммаКомпенсации Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|Задолженность.СуммаВзаиморасчетовОстаток КАК СуммаКомпенсации";   
			
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("СуммаКомпенсации");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ДоплатаДоМЗП ИЛИ НеобходимыеДанные.МинимальнаяЗарплата Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|	МинимальнаяЗарплата.МинЗПМесяц КАК МинЗПМесяц,
			|	МинимальнаяЗарплата.МинЗПЧас КАК МинЗПЧас,
			|	МинимальнаяЗарплата.СпособОсновногоРасчета КАК СпособОсновногоРасчетаДляМинЗП";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("МинЗПМесяц");
				ПоляЗапросаМаксимум.Добавить("МинЗПЧас");
				ПоляЗапросаМаксимум.Добавить("СпособОсновногоРасчетаДляМинЗП");
			КонецЕсли;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ РегистрРасчета.Начисления Как Основной";
		
		Если НеобходимыеДанные.ПоказателиСхемМотивации Тогда
			
			// ВТПоказатели
			Если Истина Тогда
				// получим временную таблицу с расчетом показателей
				ТекстЗапросаПоказатели = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Основной.ВидРасчета,
				|	МАКСИМУМ(ВСЕПоказатели.НомерСтроки) КАК КоличествоПоказателей";
				Для СчПоказателей = 1 По КоличествоПоказателей Цикл
					ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + ",
					|	Показатели"+ СчПоказателей + ".Показатель КАК Показатель" + СчПоказателей;
				КонецЦикла;
				ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
				|ПОМЕСТИТЬ ВТПоказатели
				|ИЗ
				|	РегистрРасчета."+ИмяРегистра +" КАК Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета."+ИмяРегистра+".Показатели КАК ВСЕПоказатели
				|	ПО Основной.ВидРасчета = ВСЕПоказатели.Ссылка";
				Для СчПоказателей = 1 По КоличествоПоказателей Цикл
					ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
					|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета."+ИмяРегистра+".Показатели КАК Показатели"+ СчПоказателей + "
					|	ПО Основной.ВидРасчета = Показатели"+ СчПоказателей + ".Ссылка 
					|	И  Показатели"+ СчПоказателей + ".НомерСтроки = "+ СчПоказателей;
				КонецЦикла;
				ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
				|ГДЕ " + ВнешнееУсловие + "
				|СГРУППИРОВАТЬ ПО
				|	Основной.ВидРасчета";
				Для СчПоказателей = 1 По КоличествоПоказателей Цикл
					ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + ",
					|	Показатели"+ СчПоказателей + ".Показатель";
				КонецЦикла;
				ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
				|ИНДЕКСИРОВАТЬ ПО Основной.ВидРасчета";		
				
				Запрос.Текст = ТекстЗапросаПоказатели;
				Запрос.Выполнить();
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
            |ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
			|ПО Показатели.ВидРасчета = Основной.ВидРасчета";
			
			Если НеобходимыеДанные.КалендарныхДнейВмесяце ИЛИ НеобходимыеДанные.ВремяВКалендарныхДнях Тогда  
				ТекстЗапроса = ТекстЗапроса + "
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ФактическийПериодДействия(Регистратор = &парамРегистратор) КАК ФактическийПериодДействия
				|ПО ФактическийПериодДействия.НомерСтроки = Основной.НомерСтроки";
			КонецЕсли;
			
		КонецЕсли;
		
		Если Регистратор.ОтражатьВУпрУчете Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	// курсы упр. валюты 
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамПериодРегистрации) КАК ВалютыУпр
			|	ПО  ВалютыУпр.Валюта = &парамВалютаУпрУчета 
			|";
		КонецЕсли;
		
		Если НеобходимыеДанные.Стаж Тогда
			// присоединение к данным о стаже
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеОСтаже			
			|ПО ДанныеОСтаже.Сотрудник = Основной.Сотрудник
			|И	ДанныеОСтаже.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)";
			
			Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
		КонецЕсли;
		
		Если НеобходимаБаза Тогда
			Если КомментироватьРасчет Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|ЛЕВОЕ СОЕДИНЕНИЕ (
				|ВЫБРАТЬ
				|	РезультатБаза КАК РезультатБаза,
				|	РезультатУпрБаза КАК РезультатУпрБаза,
				|	ОтработаноДнейБаза КАК ОтработаноДнейБаза,
				|	ОтработаноЧасовБаза КАК ОтработаноЧасовБаза,
				|	ВидРасчетаРазрез КАК ВидРасчетаРазрез,
				|	Регистратор КАК Регистратор,
				|	НомерСтроки КАК НомерСтроки
				|ИЗ РегистрРасчета.Начисления.БазаНачисления(&парамИзмеренияОсновного, &парамИзмеренияБазового, &парамРазрезы, " + Условие + ") Как База1
				|) КАК База
				|ПО Основной.Регистратор = База.Регистратор И Основной.НомерСтроки = База.НомерСтроки
				| И НЕ(Основной.ВидРасчета.БазаПоНазначению) 
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ (
				|ВЫБРАТЬ
				|	РезультатБаза КАК РезультатБаза,
				|	РезультатУпрБаза КАК РезультатУпрБаза,
				|	ОтработаноДнейБаза КАК ОтработаноДнейБаза,
				|	ОтработаноЧасовБаза КАК ОтработаноЧасовБаза,
				|	ВидРасчетаРазрез КАК ВидРасчетаРазрез,
				|	Регистратор КАК Регистратор,
				|	НомерСтроки КАК НомерСтроки
				|ИЗ РегистрРасчета.Начисления.БазаНачисления(&парамИзмеренияОсновногоНазначения, &парамИзмеренияБазовогоНазначения, &парамРазрезы, " + Условие + ") Как База1
				|) КАК БазаНазначения
				|ПО Основной.Регистратор = БазаНазначения.Регистратор И Основной.НомерСтроки = БазаНазначения.НомерСтроки
				|И Основной.ВидРасчета.БазаПоНазначению"; 
				Если НеобходимыеДанные.ИндексацияЗарплаты ИЛИ НеобходимыеДанные.ДоплатаДоМЗП Тогда
					ТекстЗапроса = ТекстЗапроса + "
						|ЛЕВОЕ СОЕДИНЕНИЕ (
						|ВЫБРАТЬ
						|	РезультатБаза КАК РезультатБаза,
						|	ОтработаноДнейБаза КАК ОтработаноДнейБаза,
						|	ОтработаноЧасовБаза КАК ОтработаноЧасовБаза,
						|	ОплаченоДнейЧасовБаза КАК ОплаченоДнейЧасовБаза,
						|	Регистратор КАК Регистратор,
						|	НомерСтроки КАК НомерСтроки
						|ИЗ РегистрРасчета.Начисления.БазаНачисления(&парамИзмеренияОсновногоНазначения, &парамИзмеренияБазовогоНазначения, , " + Условие + ") Как База1
						|) КАК БазаНазначенияИнд
						|ПО Основной.Регистратор = БазаНазначенияИнд.Регистратор И Основной.НомерСтроки = БазаНазначенияИнд.НомерСтроки";
				КонецЕсли;					
				
				Разрезы = Новый Массив;
				Разрезы.Добавить("ВидРасчета");
				Запрос.УстановитьПараметр("парамРазрезы", Разрезы);
				
			Иначе
				ТекстЗапроса = ТекстЗапроса + "
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.БазаНачисления(&парамИзмеренияОсновного, &парамИзмеренияБазового, , " + Условие + ") Как База
				|ПО База.Регистратор = Основной.Регистратор И База.НомерСтроки = Основной.НомерСтроки
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.БазаНачисления(&парамИзмеренияОсновногоНазначения, &парамИзмеренияБазовогоНазначения, , " + Условие + ") Как БазаНазначения
				|ПО БазаНазначения.Регистратор = Основной.Регистратор И БазаНазначения.НомерСтроки = Основной.НомерСтроки";
				
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимГрафик Тогда
			
			Запрос.Текст = ВремяПоТабелюТекст;
			Запрос.Выполнить();
			ВремяПоТабелюТекст = "ВТВремяПоТабелю";
			
			Запрос.Текст = ВремяВведенноеВЦеломЗаПериодТекст;
			Запрос.Выполнить();
			ВремяВведенноеВЦеломЗаПериодТекст = "ВТВремяВведенноеВЦеломЗаПериод";
			
			// присоединяем к данным графика
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(" + Условие +  ") Как ДанныеГрафика
			|ПО Основной.Регистратор = ДанныеГрафика.Регистратор И Основной.НомерСтроки = ДанныеГрафика.НомерСтроки
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяПоТабелю КАК ВремяПоТабелю
			|ПО Основной.НомерСтроки = ВремяПоТабелю.НомерСтроки
			|ЛЕВОЕ СОЕДИНЕНИЕ " + ВремяВведенноеВЦеломЗаПериодТекст + " КАК ВремяВведенноеВЦеломЗаПериод
			|ПО Основной.НомерСтроки = ВремяВведенноеВЦеломЗаПериод.НомерСтроки
			|";
			
		КонецЕсли;
		
		// допрасчеты
		Если НеобходимыеДанные.ВыслугаЛет Тогда
			
			//ВТСведенияОСтаже
			Если Истина Тогда
				ТекстЗапросаВТ = "
				|ВЫБРАТЬ
				|  ПриказОПриеме.Сотрудник		КАК Сотрудник,
				|  ПриказОПриеме.ДатаПриема		КАК ДатаПриема,
				|  ОбщийСтаж.ВидСтажа			КАК ВидСтажа,
				|  СУММА( ЕСТЬNULL(ОбщийСтаж.ДнейСтажа, 0))  КАК ДнейСтажа
				|ПОМЕСТИТЬ ВТСведенияОСтаже	
				|	ИЗ (	ВЫБРАТЬ 
				|           	МИНИМУМ(Работники.Период) КАК ДатаПриема,
				|				Работники.Сотрудник	КАК Сотрудник
				|			ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники
				|   		ГДЕ Работники.Сотрудник В (&парамСотрудники)
				|			СГРУППИРОВАТЬ ПО Работники.Сотрудник
				|	) КАК ПриказОприеме
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ ( 
				|	ВЫБРАТЬ
				|		Стаж.ФизЛицо,
				|		Стаж.ДнейСтажа,
				|		Стаж.ВидСтажа
				|	ИЗ РегистрСВедений.НачальныеСведенияОСтажеРаботниковОрганизации КАК Стаж
				|	ГДЕ	Стаж.Организация	= &парамОрганизация
				|
				|) КАК ОбщийСтаж		
				|	ПО ОбщийСтаж.ФизЛицо = ПриказОПриеме.Сотрудник.ФизЛицо 
				|   
				|СГРУППИРОВАТЬ ПО  
				|  ПриказОПриеме.Сотрудник,
				|  ОбщийСтаж.ВидСтажа,
				|  ПриказОПриеме.ДатаПриема
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТСведенияОСтаже = "ВТСведенияОСтаже"; 
			КонецЕсли;
			
				
			//ВТПараметрыВыслуги
			Если Истина Тогда
				ТекстЗапросаВТ =  "
				| ВЫБРАТЬ 
				|  ПараметрыВыслуги.Порог   		 	КАК Порог,
				|  ПараметрыВыслуги.СпособУчетаСтажа  	КАК СпособУчетаСтажа,
				|  ПараметрыВыслуги.Ставка  			КАК Ставка,
				|  МАКСИМУМ(ПараметрыВыслуги1.Порог)    КАК НижнийПорог
				|ПОМЕСТИТЬ ВТПараметрыВыслуги
				|
				|  ИЗ РегистрСведений.ШкалаВыслугиЛет.СрезПоследних(&парамПериодРегистрации) КАК ПараметрыВыслуги
				|
				| ЛЕВОЕ СОЕДИНЕНИЕ (
				| 	ВЫБРАТЬ 
				|  		ПараметрыВыслуги.СпособУчетаСтажа	КАК СпособУчетаСтажа,
				|  		ПараметрыВыслуги.Ставка  			КАК Ставка,
				|  		ПараметрыВыслуги.Порог   			КАК Порог
				|
				|  		ИЗ РегистрСведений.ШкалаВыслугиЛет.СрезПоследних(&парамПериодРегистрации) КАК ПараметрыВыслуги
				|
				|   ) КАК ПараметрыВыслуги1
				| ПО  ПараметрыВыслуги1.СпособУчетаСтажа = ПараметрыВыслуги.СпособУчетаСтажа
				|	И ПараметрыВыслуги1.Порог    < ПараметрыВыслуги.Порог
				|
				| СГРУППИРОВАТЬ ПО 
				|  ПараметрыВыслуги.Порог, 
				|  ПараметрыВыслуги.СпособУчетаСтажа,
				|  ПараметрыВыслуги.Ставка
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();				
				ТекстЗапросаВТПараметрыВыслуги = "ВТПараметрыВыслуги";				
			 КонецЕсли;
			  
			ТекстЗапроса = ТекстЗапроса + "
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТСведенияОСтаже + "  КАК Стаж
				|ПО   (Стаж.ВидСтажа = Основной.ВидРасчета.ВидСтажа Или  Стаж.ВидСтажа ЕСТЬ NULL )
				|   И Стаж.Сотрудник  = Основной.Сотрудник
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ  " + ТекстЗапросаВТПараметрыВыслуги + "  КАК СтавкиВыслуги
				|ПО   (Стаж.ВидСтажа.СпособУчетаСтажа = СтавкиВыслуги.СпособУчетаСтажа ИЛИ Стаж.ВидСтажа ЕСТЬ NULL)
				|   И ВЫБОР КОГДА Стаж.ДнейСтажа ЕСТЬ NULL ТОГДА Стаж.ДатаПриема ИНАЧЕ ДОБАВИТЬКДАТЕ( Стаж.ДатаПриема, ДЕНЬ, - Стаж.ДнейСтажа) КОНЕЦ <= ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало), ГОД, - СтавкиВыслуги.НижнийПорог )
				|   И ВЫБОР КОГДА Стаж.ДнейСтажа ЕСТЬ NULL ТОГДА Стаж.ДатаПриема ИНАЧЕ ДОБАВИТЬКДАТЕ( Стаж.ДатаПриема, ДЕНЬ, - Стаж.ДнейСтажа) КОНЕЦ > ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало), ГОД, - СтавкиВыслуги.Порог )
				|
				|";
		КонецЕсли;

			
		Если НеобходимыеДанные.ИндексацияЗарплаты Тогда

			ПрименяетсяФиксированнаяИндексация = (ПроведениеРасчетов.ДатаВвводаФиксированнойИндексации() <= Регистратор.Дата);
			РасчетИндексацииПропорционально = ВариантыАлгоритмовРасчетаЗарплаты().РасчетИндексацииПропорционально;
			Запрос.УстановитьПараметр("парамРасчетИндексацииПропорционально",?(ЗначениеЗаполнено(РасчетИндексацииПропорционально),РасчетИндексацииПропорционально,Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.НеПрименять));
			
			ПрименяетсяИндексацияПоДожностям = (ПроведениеРасчетов.ДатаВвводаИндексацииПоДожностям() <= Регистратор.Дата);
			Запрос.УстановитьПараметр("ДатаИзмененияПорядкаИндексации", ДатаИзмененияПорядкаИндексации());
			
			Если ВариантыАлгоритмовРасчетаЗарплаты().ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьПоИндексуИнфляции Тогда
				//Порог по документу не нужен
				ПорогИндексации = 0;
			Иначе
				ПорогИндексации = ?(ПроведениеРасчетов.ДатаИзмененияПорогаИндексации() <= Регистратор.Дата, 1.03, 1.01);
			КонецЕсли;	
			НеобходимыеДанные.Вставить("ПорогИндексации", ПорогИндексации);
			
			//	ВТИндексироватьСотрудниковПоПериодам
			Если Истина Тогда
				//	Описание:
				// 		В этой таблице только сотрудники по которым есть Вид расчета Индексация и периоды по которым надо расчиать тндексацию
				//		Для п.1.
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		Доход.Сотрудник									КАК Сотрудник, 
				|		Доход.ПодразделениеОрганизации					КАК ПодразделениеОрганизации,
				|		Доход.Должность									КАК Должность,
				|		НАЧАЛОПЕРИОДА(Доход.БазовыйПериодНачало, МЕСЯЦ)	КАК ДатаНачала 
				|ПОМЕСТИТЬ ВТИндексироватьСотрудниковПоПериодам	
				|   ИЗ РегистрРасчета.Начисления КАК Доход
				|	ГДЕ 	Доход.Регистратор = &парамРегистратор 
				|		И	Доход.Сотрудник В (&парамСотрудники) 
				//|		И	Доход.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ИндексацияЗарплаты) 
				|		И	Доход.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты) 
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТИндексироватьСотрудниковПоПериодам = "ВТИндексироватьСотрудниковПоПериодам";
			КонецЕсли;
			
			//	ВТИндексированныйДоходСовместителей
			Если Истина Тогда
				//	Описание:
				// 		Доход совместителей с других мест работы
				//		Для п.1.
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Доход.Сотрудник				КАК Сотрудник, 
				|		Доход.ДатаДействия			КАК ДатаНачала, 
				|		СУММА(Доход.БазаИндексации)	КАК БазаИндексацииСовместителей 
				|ПОМЕСТИТЬ ВТИндексированныйДоходСовместителей	
				|   ИЗ РегистрСведений.ИндексированныйДоходСовместителей.СрезПоследних(&парамПериодРегистрации, 
				|   		Сотрудник в (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ "+ТекстЗапросаВТИндексироватьСотрудниковПоПериодам+" ) ) КАК Доход
				|	СГРУППИРОВАТЬ ПО 
				|		Доход.Сотрудник, 
				|		Доход.ДатаДействия 
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТИндексированныйДоходСовместителей = "ВТИндексированныйДоходСовместителей";
			КонецЕсли;
			
			//	ВТБазовыеПериодыИндексации
			Если Истина Тогда
 				ТекстЗапросаВТ = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				// Отбор возможных базовых периодов.
				// Это могут быть записи по нужным сотрудникам, либо записи по местам работы (с пустым сотрудником)
				|  ПараметрыРасчетаИндексации.Сотрудник,
				|  ПараметрыРасчетаИндексации.ПодразделениеОрганизации,
				|  ПараметрыРасчетаИндексации.Должность,
				|  ПараметрыРасчетаИндексации.Период
				|ПОМЕСТИТЬ ВТВсеДанныеПараметрыРасчетаИндексации
				|ИЗ РегистрСведений.КоэффициентыПовышенияОкладов Как ПараметрыРасчетаИндексации
				|ГДЕ 
				|	ПараметрыРасчетаИндексации.Организация = &парамОрганизация	
				|   И (ПараметрыРасчетаИндексации.Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Основной.Сотрудник ИЗ ВТИндексироватьСотрудниковПоПериодам КАК Основной)
				|      ИЛИ ПараметрыРасчетаИндексации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка))
				|ИНДЕКСИРОВАТЬ ПО
				|  Сотрудник
				|;
				|
				// Во-первых, учитываем базовые периоды по месту работы
				// Это могут быть записи по нужному сотруднику на нужном месте, либо записи по месту работы (с пустым сотрудником)
				// Применяется только если уже применяется индексация по должностям
				|ВЫБРАТЬ
				|   Основной.Сотрудник,
				|   Основной.ДатаНачала,
				|   Основной.ПодразделениеОрганизации,
				|   Основной.Должность,
				|   МАКСИМУМ(ПараметрыРасчетаИндексации.Период) КАК Период
				|ПОМЕСТИТЬ ВТПериодыПараметрыРасчетаИндексации1	
				|ИЗ ВТИндексироватьСотрудниковПоПериодам Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеПараметрыРасчетаИндексации Как ПараметрыРасчетаИндексации
				|	ПО Основной.ПодразделениеОрганизации = ПараметрыРасчетаИндексации.ПодразделениеОрганизации 
				|    И Основной.Должность = ПараметрыРасчетаИндексации.Должность
				|    И (Основной.Сотрудник = ПараметрыРасчетаИндексации.Сотрудник
				|      ИЛИ ПараметрыРасчетаИндексации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка))
				|    И ВЫБОР КОГДА &ДатаИзмененияПорядкаИндексации  > НАЧАЛОПЕРИОДА(Основной.ДатаНачала, МЕСЯЦ)
				|   	ТОГДА КОНЕЦПЕРИОДА(Основной.ДатаНачала, МЕСЯЦ) >= ПараметрыРасчетаИндексации.Период
				|     	ИНАЧЕ Основной.ДатаНачала > ПараметрыРасчетаИндексации.Период КОНЕЦ
				|    И "+ ?(ПрименяетсяИндексацияПоДожностям, "ИСТИНА","ЛОЖЬ")+ "
				|
				|СГРУППИРОВАТЬ ПО 
				|		Основной.Сотрудник,
				|		Основной.ДатаНачала,
				|  		Основной.ПодразделениеОрганизации,
				|  		Основной.Должность
				|;
				|
				// Во-вторых, учитываем базовые периоды по нужному сотруднику без указания места работы
				// Эти записи могли быть введены до введения новых правил индексации
				|ВЫБРАТЬ
				|   Основной.Сотрудник,
				|   Основной.ДатаНачала,
				|   МАКСИМУМ(ПараметрыРасчетаИндексации.Период) КАК Период
				|ПОМЕСТИТЬ ВТПериодыПараметрыРасчетаИндексации2	
				|ИЗ ВТИндексироватьСотрудниковПоПериодам Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеПараметрыРасчетаИндексации Как ПараметрыРасчетаИндексации
				|	ПО ПараметрыРасчетаИндексации.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) 
				|    И ПараметрыРасчетаИндексации.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
				|    И Основной.Сотрудник = ПараметрыРасчетаИндексации.Сотрудник
				|    И ВЫБОР КОГДА &ДатаИзмененияПорядкаИндексации  > НАЧАЛОПЕРИОДА(Основной.ДатаНачала, МЕСЯЦ)
				|   	ТОГДА КОНЕЦПЕРИОДА(Основной.ДатаНачала, МЕСЯЦ) >= ПараметрыРасчетаИндексации.Период
				|     	ИНАЧЕ Основной.ДатаНачала > ПараметрыРасчетаИндексации.Период КОНЕЦ
				|
				|СГРУППИРОВАТЬ ПО 

				|		Основной.Сотрудник,
				|		Основной.ДатаНачала
				|;
				|
				// Даты приема на работу
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				// Отбор возможных базовых периодов.
				// Это могут быть записи по нужным сотрудникам, либо записи по местам работы (с пустым сотрудником)
				|  РаботникиОрганизаций.Сотрудник,
				|  РаботникиОрганизаций.Период КАК ДатаПриемаНаРаботу
				|ПОМЕСТИТЬ ВТВсеДатыПриемаНаРаботу
				|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПервых(,Организация = &парамОрганизация И Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Основной.Сотрудник ИЗ ВТИндексироватьСотрудниковПоПериодам КАК Основной)) Как РаботникиОрганизаций
				|ИНДЕКСИРОВАТЬ ПО
				|  Сотрудник
				|;
				|
				|ВЫБРАТЬ
				|   Основной.Сотрудник,
				|   Основной.ДатаНачала,
				|	"+ ?(ПрименяетсяИндексацияПоДожностям, "ЕСТЬNULL(ПериодыПараметрыРасчетаИндексации1.Период,ПериодыПараметрыРасчетаИндексации2.Период)","ПериодыПараметрыРасчетаИндексации2.Период")+ " КАК БазовыйПериодИндексации,
				|   ДатыПриемаНаРаботу.ДатаПриемаНаРаботу КАК ДатаПриемаСотрудника
				|ПОМЕСТИТЬ ВТБазовыеПериодыИндексации	
				|ИЗ ВТИндексироватьСотрудниковПоПериодам Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыПараметрыРасчетаИндексации1 Как ПериодыПараметрыРасчетаИндексации1
				|	ПО Основной.Сотрудник = ПериодыПараметрыРасчетаИндексации1.Сотрудник 
				|    И Основной.ДатаНачала = ПериодыПараметрыРасчетаИндексации1.ДатаНачала
				|    И Основной.ПодразделениеОрганизации = ПериодыПараметрыРасчетаИндексации1.ПодразделениеОрганизации
				|    И Основной.Должность = ПериодыПараметрыРасчетаИндексации1.Должность
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыПараметрыРасчетаИндексации2 Как ПериодыПараметрыРасчетаИндексации2
				|	ПО Основной.Сотрудник = ПериодыПараметрыРасчетаИндексации2.Сотрудник 
				|    И Основной.ДатаНачала = ПериодыПараметрыРасчетаИндексации2.ДатаНачала
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДатыПриемаНаРаботу Как ДатыПриемаНаРаботу
				|	ПО Основной.Сотрудник = ДатыПриемаНаРаботу.Сотрудник 
				|
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТБазовыеПериодыИндексации = "ВТБазовыеПериодыИндексации";
			КонецЕсли;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТБазовыеПериодыИндексации";
			
			//	ВТПараметрыФиксированнойИндексации
			Если Истина Тогда
				ТекстЗапросаВТ = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				|  ПараметрыФиксированнойИндексации.Сотрудник,
				|	"+ ?(ПрименяетсяИндексацияПоДожностям, "ПараметрыФиксированнойИндексации.ПодразделениеОрганизации","ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)")+ " КАК ПодразделениеОрганизации,
				|	"+ ?(ПрименяетсяИндексацияПоДожностям, "ПараметрыФиксированнойИндексации.Должность","ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)")+ " КАК Должность,
				|  ПараметрыФиксированнойИндексации.Размер,
				|  ПараметрыФиксированнойИндексации.Период
				|ПОМЕСТИТЬ ВТВсеДанныеПараметрыФиксированнойИндексации
				|ИЗ РегистрСведений.ПараметрыФиксированнойИндексации Как ПараметрыФиксированнойИндексации
				|ГДЕ ПараметрыФиксированнойИндексации.Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Основной.Сотрудник ИЗ ВТИндексироватьСотрудниковПоПериодам КАК Основной)
				|  И ПараметрыФиксированнойИндексации.ПодразделениеОрганизации "+ ?(ПрименяетсяИндексацияПоДожностям, "<>","=")+ " ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|  И ПараметрыФиксированнойИндексации.Должность "+ ?(ПрименяетсяИндексацияПоДожностям, "<>","=")+ " ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
				|ИНДЕКСИРОВАТЬ ПО
				|  Сотрудник
				|;
				|
				|ВЫБРАТЬ
				|   Основной.Сотрудник,
				|   Основной.ДатаНачала,
				|  Основной.ПодразделениеОрганизации,
				|  Основной.Должность,
				|   МАКСИМУМ(ПараметрыФиксированнойИндексации.Период) КАК Период
				|ПОМЕСТИТЬ ВТПериодыПараметрыФиксированнойИндексации	
				|	ИЗ ВТИндексироватьСотрудниковПоПериодам Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеПараметрыФиксированнойИндексации Как ПараметрыФиксированнойИндексации
				|	ПО Основной.Сотрудник = ПараметрыФиксированнойИндексации.Сотрудник 
				|	 И "+ ?(ПрименяетсяИндексацияПоДожностям, "Основной.ПодразделениеОрганизации","ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)")+ " = ПараметрыФиксированнойИндексации.ПодразделениеОрганизации 
				|	 И "+ ?(ПрименяетсяИндексацияПоДожностям, "Основной.Должность","ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)")+ " = ПараметрыФиксированнойИндексации.Должность 
				|    И КОНЕЦПЕРИОДА(Основной.ДатаНачала, МЕСЯЦ) >= ПараметрыФиксированнойИндексации.Период
				|
				|СГРУППИРОВАТЬ ПО 
				|		Основной.Сотрудник,
				|		Основной.ДатаНачала,
				|  		Основной.ПодразделениеОрганизации,
				|  		Основной.Должность
				|;
				|
				|ВЫБРАТЬ
				|   Основной.Сотрудник,
				|   Основной.ДатаНачала,
				|   ПараметрыФиксированнойИндексации.Размер КАК Результат
				|ПОМЕСТИТЬ ВТПараметрыФиксированнойИндексации	
				|	ИЗ ВТПериодыПараметрыФиксированнойИндексации Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеПараметрыФиксированнойИндексации Как ПараметрыФиксированнойИндексации
				|	ПО Основной.Сотрудник = ПараметрыФиксированнойИндексации.Сотрудник 
				|	 И "+ ?(ПрименяетсяИндексацияПоДожностям, "Основной.ПодразделениеОрганизации","ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)")+ " = ПараметрыФиксированнойИндексации.ПодразделениеОрганизации 
				|	 И "+ ?(ПрименяетсяИндексацияПоДожностям, "Основной.Должность","ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)")+ " = ПараметрыФиксированнойИндексации.Должность
				|    И Основной.Период = ПараметрыФиксированнойИндексации.Период
				|
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
			КонецЕсли;
			//	ВТИндексацияРасчетПропорционально
			Если Истина Тогда
				ТекстЗапросаВТ = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				|  ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
				|  ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета КАК СпособОсновногоРасчета
				|ПОМЕСТИТЬ ВТВсеДанныеПлановыеНачисленияРаботниковОрганизаций
				|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации,МЕСЯЦ), 
				|	Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Основной.Сотрудник ИЗ ВТИндексироватьСотрудниковПоПериодам КАК Основной)
 				|	И ВидРасчета <> ВидРасчетаИзмерение) Как ПлановыеНачисленияРаботниковОрганизаций
				|
				|ИНДЕКСИРОВАТЬ ПО
				|  Сотрудник
				|;
				|
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				|  РаботникиОрганизаций.Сотрудник,
				|  РаботникиОрганизаций.ГрафикРаботы КАК ОсновнойГрафикРаботы
				|ПОМЕСТИТЬ ВТВсеДанныеРаботникиОрганизаций
				|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации,МЕСЯЦ), 
				|	Сотрудник В (ВЫБРАТЬ РАЗЛИЧНЫЕ Основной.Сотрудник ИЗ ВТИндексироватьСотрудниковПоПериодам КАК Основной)) Как РаботникиОрганизаций
				|
				|ИНДЕКСИРОВАТЬ ПО
				|  Сотрудник
				|;
                |
				|ВЫБРАТЬ
				|   ВсеДанные.Сотрудник,
				|   МАКСИМУМ(ВсеДанные.СпособОсновногоРасчета) КАК СпособОсновногоРасчета,
				|   МАКСИМУМ(ВсеДанные.ОсновнойГрафикРаботы) КАК ОсновнойГрафикРаботы
				|ПОМЕСТИТЬ ВТИндексацияРасчетПропорционально	
				|ИЗ
				|		(ВЫБРАТЬ
				|   		ВсеДанныеПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
				|   		ВсеДанныеПлановыеНачисленияРаботниковОрганизаций.СпособОсновногоРасчета КАК СпособОсновногоРасчета,
				|   		NULL КАК ОсновнойГрафикРаботы
				|		 ИЗ ВТВсеДанныеПлановыеНачисленияРаботниковОрганизаций Как ВсеДанныеПлановыеНачисленияРаботниковОрганизаций
				|
				|        ОБЪЕДИНИТЬ ВСЕ
				|
				|		ВЫБРАТЬ
				|   		ВсеДанныеРаботникиОрганизаций.Сотрудник,
				|   		NULL КАК СпособОсновногоРасчета,
				|   		ВсеДанныеРаботникиОрганизаций.ОсновнойГрафикРаботы КАК ОсновнойГрафикРаботы
				|		 ИЗ ВТВсеДанныеРаботникиОрганизаций Как ВсеДанныеРаботникиОрганизаций
				|      ) КАК ВсеДанные
				|СГРУППИРОВАТЬ ПО
				| ВсеДанные.Сотрудник
				|
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
			КонецЕсли;
			
			//	ВТБазаИндексацииЗарплаты
			Если Истина Тогда 
				//	Описание:
				// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
				//		Для п.1.
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Основной.НомерСтроки КАК НомерСтроки, 
				|   	Основной.Сотрудник				КАК Сотрудник,
				|   	НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)	КАК ДатаНачала,
				|   	Основной.ВидРасчета				КАК ВидРасчета,
				|   	СУММА(БазаИзНачислений.Результат)	КАК РезультатБаза,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо6)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы1,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо18)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы2,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы3,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.НеТрудоспособные)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы4
				|ПОМЕСТИТЬ ВТБазаИндексацииЗарплаты	
				|		ИЗ РегистрРасчета.Начисления КАК Основной
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
				|	ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|		И	НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
				|		И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|	ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|		И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				|
				|	ГДЕ		Основной.Регистратор = &парамРегистратор 
				|		И	Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты) 
				|   	И	Основной.Сотрудник в (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ "+ТекстЗапросаВТИндексироватьСотрудниковПоПериодам+" )
				|
				|	СГРУППИРОВАТЬ ПО 
				|   	Основной.Сотрудник,
				|       Основной.НомерСтроки,
				|   	Основной.БазовыйПериодНачало,
				|   	Основной.ВидРасчета
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТБазаИндексацииЗарплаты = "ВТБазаИндексацииЗарплаты";
			КонецЕсли; 
		
			//	ВТПрожиточныеМинимумыИндексации
			Если Истина Тогда
				//	Описание:
				// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
				//		
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Основной.ДатаНачала		КАК ДатаНачала, 
				|		ПрожМинСоцГруппы1.Размер	КАК ПорогСоцГруппы1, 
				|		ПрожМинСоцГруппы2.Размер	КАК ПорогСоцГруппы2, 
				|		ПрожМинСоцГруппы3.Размер	КАК ПорогСоцГруппы3, 
				|		ПрожМинСоцГруппы4.Размер	КАК ПорогСоцГруппы4 
				| 
				|ПОМЕСТИТЬ ВТПрожиточныеМинимумыИндексации	
				|   ИЗ (
				|		ВЫБРАТЬ 
				|			ПериодыИндексации.ДатаНачала		КАК ДатаНачала, 
				|			МАКСИМУМ(ПрожМинСоцГруппы1.Период)	КАК ПериодСоцГруппа1, 
				|			МАКСИМУМ(ПрожМинСоцГруппы2.Период)	КАК ПериодСоцГруппа2, 
				|			МАКСИМУМ(ПрожМинСоцГруппы3.Период)	КАК ПериодСоцГруппа3, 
				|			МАКСИМУМ(ПрожМинСоцГруппы4.Период)	КАК ПериодСоцГруппа4 
				|		ИЗ (
				|   		ВЫБРАТЬ РАЗЛИЧНЫЕ
				|           	Периоды.ДатаНачала КАК ДатаНачала
				|			ИЗ " + ТекстЗапросаВТИндексироватьСотрудниковПоПериодам + " КАК Периоды
				|   		) КАК ПериодыИндексации
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы1
				|       ПО	ПрожМинСоцГруппы1.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо6)
				|       	И	ПрожМинСоцГруппы1.Период <= ПериодыИндексации.ДатаНачала
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы2
				|       ПО	ПрожМинСоцГруппы2.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо18)
				|       	И	ПрожМинСоцГруппы2.Период <= ПериодыИндексации.ДатаНачала
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы3
				|       ПО	ПрожМинСоцГруппы3.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
				|       	И	ПрожМинСоцГруппы3.Период <= ПериодыИндексации.ДатаНачала
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы4
				|       ПО	ПрожМинСоцГруппы4.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.НеТрудоспособные)
				|       	И	ПрожМинСоцГруппы4.Период <= ПериодыИндексации.ДатаНачала
				| 
				|		СГРУППИРОВАТЬ ПО 
				|			ПериодыИндексации.ДатаНачала 
				|    ) КАК Основной
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы1
				|	ПО		ПрожМинСоцГруппы1.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо6)
				|		И	ПрожМинСоцГруппы1.Период = Основной.ПериодСоцГруппа1
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы2
				|	ПО		ПрожМинСоцГруппы2.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо18)
				|		И	ПрожМинСоцГруппы2.Период = Основной.ПериодСоцГруппа2
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы3
				|	ПО		ПрожМинСоцГруппы3.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
				|		И	ПрожМинСоцГруппы3.Период = Основной.ПериодСоцГруппа3
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы4
				|	ПО		ПрожМинСоцГруппы4.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.НеТрудоспособные)
				|		И	ПрожМинСоцГруппы4.Период = Основной.ПериодСоцГруппа4
				| 
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТПрожиточныеМинимумыИндексации = "ВТПрожиточныеМинимумыИндексации";
			КонецЕсли;
	
			//	ВТДанныеПоИндексации
			Если Истина Тогда
				//	Описание:
				// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
				//		Для п.1.
				
				Если ПрименяетсяФиксированнаяИндексация Тогда
					//Индексацию считаем от месяца перед приемом на работу
					ТекстНачалоИндексации ="НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(БазовыеПериодыИндексации.ДатаПриемаСотрудника, МЕСЯЦ, -1), МЕСЯЦ)";
				Иначе
					//Индексацию считаем от даты приема
					ТекстНачалоИндексации ="БазовыеПериодыИндексации.ДатаПриемаСотрудника";
				КонецЕсли;	
				
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		База.Сотрудник					КАК Сотрудник, 
				|		База.НомерСтроки				КАК НомерСтроки, 
				|		База.ДатаНачала					КАК БазовыйПериодНачало, 
				|       База.ВидРасчета					КАК ВидРасчета,
				|		База.ДатаНачала					КАК ИндексацияКонец,
				|		База.РезультатБаза				КАК РезультатБаза, 
				|		База.БазаСоцГруппы1				КАК БазаСоцГруппы1, 
				|		База.БазаСоцГруппы2				КАК БазаСоцГруппы2, 
				|		База.БазаСоцГруппы3				КАК БазаСоцГруппы3, 
				|		База.БазаСоцГруппы4				КАК БазаСоцГруппы4, 
				|
				|		ПрожиточныеМинимумы.ПорогСоцГруппы1	КАК ПорогСоцГруппы1, 
				|		ПрожиточныеМинимумы.ПорогСоцГруппы2	КАК ПорогСоцГруппы2, 
				|		ПрожиточныеМинимумы.ПорогСоцГруппы3	КАК ПорогСоцГруппы3, 
				|		ПрожиточныеМинимумы.ПорогСоцГруппы4	КАК ПорогСоцГруппы4, 
				|
				|		ЕСТЬNULL(БазовыеПериодыИндексации.БазовыйПериодИндексации, НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(БазовыеПериодыИндексации.ДатаПриемаСотрудника, МЕСЯЦ, -1), МЕСЯЦ))	КАК ИндексацияНачало,
				|
				|		ВЫБОР КОГДА ДоходСовместителя.Сотрудник ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ		Как ЕстьСправкаОБазеИндексацииСовместителя,
				|		ДоходСовместителя.БазаИндексацииСовместителей		Как БазаИндексацииСовместителей,
				|
				|		ПараметрыФиксированнойИндексации.Результат		Как РезультатФиксированнаяИндексация,
				|		&парамРасчетИндексацииПропорционально	КАК РасчетИндексацииПропорционально,
				|		ЕСТЬNULL(ИндексацияРасчетПропорционально.СпособОсновногоРасчета,ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням))	КАК СпособОсновногоРасчета,
				|		ЕСТЬNULL(ИндексацияРасчетПропорционально.ОсновнойГрафикРаботы,ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка))		Как ОсновнойГрафикРаботы

				|	 
				|ПОМЕСТИТЬ ВТДанныеПоИндексации	
				|	ИЗ " + ТекстЗапросаВТИндексироватьСотрудниковПоПериодам + " Как Основной
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ   " + ТекстЗапросаВТБазаИндексацииЗарплаты + " КАК База
				|	ПО		Основной.Сотрудник = База.Сотрудник 
				|		И	Основной.ДатаНачала = База.ДатаНачала 
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПрожиточныеМинимумыИндексации + " КАК ПрожиточныеМинимумы
				|	ПО		Основной.ДатаНачала = ПрожиточныеМинимумы.ДатаНачала
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТБазовыеПериодыИндексации + " КАК БазовыеПериодыИндексации
				|	ПО		Основной.Сотрудник = БазовыеПериодыИндексации.Сотрудник
				|		И	Основной.ДатаНачала	= БазовыеПериодыИндексации.ДатаНачала
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТИндексированныйДоходСовместителей + " КАК ДоходСовместителя
				|	ПО		Основной.Сотрудник = ДоходСовместителя.Сотрудник
				|		И	Основной.ДатаНачала	= ДоходСовместителя.ДатаНачала
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметрыФиксированнойИндексации  КАК ПараметрыФиксированнойИндексации
				|	ПО		Основной.Сотрудник = ПараметрыФиксированнойИндексации.Сотрудник
				|		И	Основной.ДатаНачала	= ПараметрыФиксированнойИндексации.ДатаНачала
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИндексацияРасчетПропорционально  КАК ИндексацияРасчетПропорционально
				|	ПО		Основной.Сотрудник = ИндексацияРасчетПропорционально.Сотрудник
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТДанныеПоИндексации = "ВТДанныеПоИндексации";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТДанныеПоИндексации+" КАК ДанныеПоИндексацииЗарплаты
			|ПО		Основной.НомерСтроки = ДанныеПоИндексацииЗарплаты.НомерСтроки
			|";
		КонецЕсли;
		
		Если НеобходимыеДанные.ИндексацияСоциальныхНачислений Тогда
			
			//	ВТИндексироватьСНСотрудниковПоПериодам
			Если Истина Тогда
				//	Описание:
				// 		В этой таблице только сотрудники по которым есть Вид расчета Индексация социальных начислений и периоды по которым надо расчиать тндексацию
				//
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		Доход.Сотрудник									КАК Сотрудник, 
				|		НАЧАЛОПЕРИОДА(Доход.БазовыйПериодНачало, МЕСЯЦ)	КАК ДатаНачала 
				|ПОМЕСТИТЬ ВТИндексироватьСНСотрудниковПоПериодам	
				|   ИЗ РегистрРасчета.Начисления КАК Доход
				|	ГДЕ 	Доход.Регистратор = &парамРегистратор 
				|		И	Доход.Сотрудник В (&парамСотрудники) 
				|		И	Доход.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений) 
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТИндексироватьСНСотрудниковПоПериодам = "ВТИндексироватьСНСотрудниковПоПериодам";
			КонецЕсли;
			
			//	ВТБазаИндексацииСН
			Если Истина Тогда 
				//	Описание:
				// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
				//		Для п.1.
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Основной.НомерСтроки				 КАК НомерСтроки, 
				|   	Основной.Сотрудник					КАК Сотрудник,
				|   	НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)	КАК ДатаНачала,
				|   	Основной.ВидРасчета					КАК ВидРасчета,
				|   	МАКСИМУМ(Пособия.Период)			КАК БазовыйПериодИндексации,
				|   	СУММА(БазаИзНачислений.Результат)	КАК РезультатБаза,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо6)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы1,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо18)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы2,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы3,
				|   	СУММА(ВЫБОР КОГДА	БазаИзНачислений.ВидРасчета.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.НеТрудоспособные)
				|                   	ТОГДА   БазаИзНачислений.Результат
				|                   ИНАЧЕ		0
				|				КОНЕЦ )				КАК БазаСоцГруппы4
				|ПОМЕСТИТЬ ВТБазаИндексацииСН	
				|		ИЗ РегистрРасчета.Начисления КАК Основной
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
				|	ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|		И	НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
				|		И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|	ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|		И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				|
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ  РегистрСведений.РазмерыЗаконодательноУстановленныхВыплат КАК Пособия
				|	ПО		Пособия.ВидРасчета = БазаИзНачислений.ВидРасчета
				|		И	Пособия.Период <= Основной.БазовыйПериодНачало
				|
				|	ГДЕ		Основной.Регистратор = &парамРегистратор 
				|		И	Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений) 
				|   	И	Основной.Сотрудник в (ВЫБРАТЬ РАЗЛИЧНЫЕ Сотрудник ИЗ "+ТекстЗапросаВТИндексироватьСНСотрудниковПоПериодам+" )
				|
				|	СГРУППИРОВАТЬ ПО 
				|   	Основной.Сотрудник,
				|       Основной.НомерСтроки,
				|   	Основной.БазовыйПериодНачало,
				|   	Основной.ВидРасчета
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТБазаИндексацииСН = "ВТБазаИндексацииСН";
			КонецЕсли; 
		
			//	ВТПрожиточныеМинимумыИндексацииСН
			Если Истина Тогда
				//	Описание:
				// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
				//		
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Основной.ДатаНачала		КАК ДатаНачала, 
				|		ПрожМинСоцГруппы1.Размер	КАК ПорогСоцГруппы1, 
				|		ПрожМинСоцГруппы2.Размер	КАК ПорогСоцГруппы2, 
				|		ПрожМинСоцГруппы3.Размер	КАК ПорогСоцГруппы3, 
				|		ПрожМинСоцГруппы4.Размер	КАК ПорогСоцГруппы4 
				| 
				|ПОМЕСТИТЬ ВТПрожиточныеМинимумыИндексацииСН	
				|   ИЗ (
				|		ВЫБРАТЬ 
				|			ПериодыИндексации.ДатаНачала		КАК ДатаНачала, 
				|			МАКСИМУМ(ПрожМинСоцГруппы1.Период)	КАК ПериодСоцГруппа1, 
				|			МАКСИМУМ(ПрожМинСоцГруппы2.Период)	КАК ПериодСоцГруппа2, 
				|			МАКСИМУМ(ПрожМинСоцГруппы3.Период)	КАК ПериодСоцГруппа3, 
				|			МАКСИМУМ(ПрожМинСоцГруппы4.Период)	КАК ПериодСоцГруппа4 
				|		ИЗ (
				|   		ВЫБРАТЬ РАЗЛИЧНЫЕ
				|           	Периоды.ДатаНачала КАК ДатаНачала
				|			ИЗ " + ТекстЗапросаВТИндексироватьСНСотрудниковПоПериодам + " КАК Периоды
				|   		) КАК ПериодыИндексации
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы1
				|       ПО	ПрожМинСоцГруппы1.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо6)
				|       	И	ПрожМинСоцГруппы1.Период <= ПериодыИндексации.ДатаНачала
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы2
				|       ПО	ПрожМинСоцГруппы2.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо18)
				|       	И	ПрожМинСоцГруппы2.Период <= ПериодыИндексации.ДатаНачала
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы3
				|       ПО	ПрожМинСоцГруппы3.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
				|       	И	ПрожМинСоцГруппы3.Период <= ПериодыИндексации.ДатаНачала
				| 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы4
				|       ПО	ПрожМинСоцГруппы4.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.НеТрудоспособные)
				|       	И	ПрожМинСоцГруппы4.Период <= ПериодыИндексации.ДатаНачала
				| 
				|		СГРУППИРОВАТЬ ПО 
				|			ПериодыИндексации.ДатаНачала 
				|    ) КАК Основной
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы1
				|	ПО		ПрожМинСоцГруппы1.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо6)
				|		И	ПрожМинСоцГруппы1.Период = Основной.ПериодСоцГруппа1
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы2
				|	ПО		ПрожМинСоцГруппы2.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.ДетиДо18)
				|		И	ПрожМинСоцГруппы2.Период = Основной.ПериодСоцГруппа2
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы3
				|	ПО		ПрожМинСоцГруппы3.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
				|		И	ПрожМинСоцГруппы3.Период = Основной.ПериодСоцГруппа3
				| 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожМинСоцГруппы4
				|	ПО		ПрожМинСоцГруппы4.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.НеТрудоспособные)
				|		И	ПрожМинСоцГруппы4.Период = Основной.ПериодСоцГруппа4
				| 
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТПрожиточныеМинимумыИндексацииСН = "ВТПрожиточныеМинимумыИндексацииСН";
			КонецЕсли;
	
			//	ВТДанныеПоИндексацииСН
			Если Истина Тогда
				//	Описание:
				// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
				//		Для п.1.
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		База.Сотрудник					КАК Сотрудник, 
				|		База.НомерСтроки				КАК НомерСтроки, 
				|		База.ДатаНачала					КАК БазовыйПериодНачало, 
				|       База.ВидРасчета					КАК ВидРасчета,
				|		База.ДатаНачала					КАК ИндексацияКонец,
				|		База.РезультатБаза				КАК РезультатБаза, 
				|		База.БазаСоцГруппы1				КАК БазаСоцГруппы1, 
				|		База.БазаСоцГруппы2				КАК БазаСоцГруппы2, 
				|		База.БазаСоцГруппы3				КАК БазаСоцГруппы3, 
				|		База.БазаСоцГруппы4				КАК БазаСоцГруппы4, 
				|
				|		ПрожиточныеМинимумы.ПорогСоцГруппы1	КАК ПорогСоцГруппы1, 
				|		ПрожиточныеМинимумы.ПорогСоцГруппы2	КАК ПорогСоцГруппы2, 
				|		ПрожиточныеМинимумы.ПорогСоцГруппы3	КАК ПорогСоцГруппы3, 
				|		ПрожиточныеМинимумы.ПорогСоцГруппы4	КАК ПорогСоцГруппы4, 
				|
				|		База.БазовыйПериодИндексации	КАК ИндексацияНачало
				|	 
				|ПОМЕСТИТЬ ВТДанныеПоИндексацииСН	
				|	ИЗ " + ТекстЗапросаВТИндексироватьСНСотрудниковПоПериодам + " Как Основной
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ   " + ТекстЗапросаВТБазаИндексацииСН + " КАК База
				|	ПО		Основной.Сотрудник = База.Сотрудник 
				|		И	Основной.ДатаНачала = База.ДатаНачала 
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПрожиточныеМинимумыИндексацииСН + " КАК ПрожиточныеМинимумы
				|	ПО		Основной.ДатаНачала = ПрожиточныеМинимумы.ДатаНачала
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТДанныеПоИндексацииСН = "ВТДанныеПоИндексацииСН";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТДанныеПоИндексацииСН+" КАК ДанныеПоИндексацииСоциальныхНачислений
			|ПО		Основной.НомерСтроки = ДанныеПоИндексацииСоциальныхНачислений.НомерСтроки
			|";
			////
			////ИзмеренияБазы = Новый Массив(1);
			////ИзмеренияБазы[0] = "ВидРасчета";    
			////Запрос.УстановитьПараметр("парамРазрезы", ИзмеренияБазы);
			////
			////Запрос.УстановитьПараметр("парамИндексацияСоциальныхНачислений", Перечисления.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений);
			////
			////Измерения = Новый Массив(2);
			////Измерения[0] = "ФизЛицо";
			////Измерения[1] = "Организация";
			////// для начислений сопоставляемые измерения основного и базового регистров совпадают
			////Запрос.УстановитьПараметр("парамИзмеренияИндексация", Измерения);
			////
			////Запрос.Текст = "";//БазаИндексацииСоциальныхНачисленийТекст;
			////Запрос.Выполнить();
			////БазаИндексацииСоциальныхНачисленийТекст = "ВТБазаИндексацииСоциальныхНачислений";
			////ТекстЗапроса = ТекстЗапроса + "
			////|ЛЕВОЕ СОЕДИНЕНИЕ ("+БазаИндексацииСоциальныхНачисленийТекст+") КАК ДанныеПоИндексацииСоциальныхНачислений
			////|ПО Основной.НомерСтроки = ДанныеПоИндексацииЗарплаты.НомерСтроки";
		КонецЕсли;
		
		Если НеобходимыеДанные.СуммаКомпенсации Тогда
			ТекстЗапроса = ТекстЗапроса + " 
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&парамПериодРегистрации, Организация = &парамОрганизация) КАК Задолженность
			|ПО   Задолженность.ПериодВзаиморасчетов = Основной.БазовыйПериодНачало
			|   И Задолженность.Сотрудник = Основной.Сотрудник
			|
			|";
		КонецЕсли;
		Если НеобходимыеДанные.ДоплатаДоМЗП ИЛИ НеобходимыеДанные.МинимальнаяЗарплата Тогда 
			
			Запрос.УстановитьПараметр("парамМинимальнаяЗарплата", НеобходимыеДанные.МинимальнаяЗарплата);
			
			ТекстЗапросаВТ = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|		Доход.Сотрудник	КАК Сотрудник,
				|		Доход.Назначение	КАК Назначение,
				|		НАЧАЛОПЕРИОДА(Доход.БазовыйПериодНачало, МЕСЯЦ)	КАК ДатаНачала 
				|ПОМЕСТИТЬ ВТДоплатыМинЗППоПериодам	
				|   ИЗ РегистрРасчета.Начисления КАК Доход
				|	ГДЕ 	Доход.Регистратор = &парамРегистратор 
				|		И	Доход.Сотрудник В (&парамСотрудники) 
				|		И	(Доход.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоМЗП)
				|		     ИЛИ &парамМинимальнаяЗарплата)
				|;
				|
				|ВЫБРАТЬ 
				|  МинимальнаяОплатаТруда.Размер,
				|  МинимальнаяОплатаТруда.ПоЧасовая,
				|  МинимальнаяОплатаТруда.Период
				|ПОМЕСТИТЬ ВТВсеДанныеМинЗП
				|ИЗ РегистрСведений.МинимальнаяОплатаТруда Как МинимальнаяОплатаТруда
				|;
				|
				|ВЫБРАТЬ
				|   Основной.Сотрудник,
				|   Основной.Назначение,
				|   Основной.ДатаНачала,
				|   МАКСИМУМ(ВсеДанныеМинЗП.Период) КАК Период
				|ПОМЕСТИТЬ ВТПериодыДанныеМинЗП	
				|	ИЗ ВТДоплатыМинЗППоПериодам Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеМинЗП Как ВсеДанныеМинЗП
				|	ПО Основной.ДатаНачала >= ВсеДанныеМинЗП.Период
				|
				|СГРУППИРОВАТЬ ПО 
				|   	Основной.Сотрудник,
				|   	Основной.Назначение,
				|		Основной.ДатаНачала
				|;
				|
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				|  ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
				|  ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета КАК СпособОсновногоРасчета
				|ПОМЕСТИТЬ ВТВсеДанныеПлановыеНачисленияРаботниковОрганизацийДляМинЗП
				|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации,МЕСЯЦ), 
				|	Сотрудник В (ВЫБРАТЬ Назначение КАК Сотрудник ИЗ ВТДоплатыМинЗППоПериодам)
 				|	И ВидРасчета <> ВидРасчетаИзмерение) Как ПлановыеНачисленияРаботниковОрганизаций
				|
				|ИНДЕКСИРОВАТЬ ПО
				|  Сотрудник
				|;
				|ВЫБРАТЬ
				|   Основной.ДатаНачала,
				|   Основной.Сотрудник,
				|   Основной.Назначение,
				|   ЕСТЬNULL(ВсеДанныеМинЗП.Размер, 0) КАК МинЗПМесяц,
				|   ЕСТЬNULL(ВсеДанныеМинЗП.ПоЧасовая, 0) КАК МинЗПЧас,
				|   ЕСТЬNULL(ПлановыеНачисления.СпособОсновногоРасчета, ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПомесячнойТарифнойСтавкеПоДням)) КАК СпособОсновногоРасчета
				|ПОМЕСТИТЬ ВТМинимальнаяЗарплата	
				|	ИЗ ВТПериодыДанныеМинЗП Как Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеМинЗП Как ВсеДанныеМинЗП
				|	ПО Основной.Период = ВсеДанныеМинЗП.Период
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеДанныеПлановыеНачисленияРаботниковОрганизацийДляМинЗП Как ПлановыеНачисления
				|	ПО Основной.Назначение = ПлановыеНачисления.Сотрудник
				|ИНДЕКСИРОВАТЬ ПО
				|  Основной.Сотрудник,
				|  Основной.ДатаНачала
				|
				|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
				
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТМинимальнаяЗарплата КАК МинимальнаяЗарплата
			|ПО Основной.Сотрудник = МинимальнаяЗарплата.Сотрудник
			| И Основной.Назначение = МинимальнаяЗарплата.Назначение
			| И НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) = МинимальнаяЗарплата.ДатаНачала";
		КонецЕсли;

				
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ " + ВнешнееУсловие;
		
	КонецЕсли;
	
	Если ИмяРегистра = "Удержания" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ 
		|	Основной.Регистратор Как Регистратор, 
		|	Основной.Регистратор.ОтражатьВУпрУчете		Как ОтражатьВУпрУчете,
		|	Основной.Регистратор.ОтражатьВРеглУчете		Как ОтражатьВРеглУчете, 
		|	Основной.НомерСтроки Как НомерСтроки, 
		|	Основной.Сотрудник Как Сотрудник, 
		|	Основной.Сотрудник.Наименование Как СотрудникНаименование, 
		|	Основной.ВидРасчета Как ВидРасчета,
		|	Истина Как ВидРасчетаПериодДействияБазовый,
		|	Основной.ВидРасчета.Наименование Как ВидРасчетаНаименование,
		|	Основной.ВидРасчета.СпособРасчета Как СпособРасчета";
		
		Если КомментироватьРасчет Тогда
			ПоляЗапросаМаксимум.Добавить("Сотрудник");
			ПоляЗапросаМаксимум.Добавить("СотрудникНаименование");
			ПоляЗапросаМаксимум.Добавить("ВидРасчета");
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаНаименование");
			ПоляЗапросаМаксимум.Добавить("СпособРасчета");
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаПериодДействияБазовый");
			ПоляЗапросаМаксимум.Добавить("ОтражатьВУпрУчете");
			ПоляЗапросаМаксимум.Добавить("ОтражатьВРеглУчете");
			ПоляЗапросаМаксимум.Добавить("Регистратор"); 
		КонецЕсли;
		
		Если Регистратор.ОтражатьВУпрУчете Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	ВЫБОР	КОГДА	&парамВалютаУпрУчета = &парамВалютаРегламентУчета 
			|			ТОГДА 1 
			|			ИНАЧЕ ВалютыУпр.Курс/ВалютыУпр.Кратность КОНЕЦ 
			|																КАК КурсВалютыУпр
			|";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("КурсВалютыУпр");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ПоказателиСхемМотивации Тогда
			
			// Получим максимальное число показателей			
			Если Истина Тогда
		
				ТекстКолВоПоказателей =
				"ВЫБРАТЬ
				|	МАКСИМУМ(ВложенныйЗапрос.НомерСтроки) КАК КолВоПоказателей
				|ИЗ
				|	РегистрРасчета."+ИмяРегистра+" КАК Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|	(ВЫБРАТЬ
				|		Показатели.Ссылка,
				|		Показатели.НомерСтроки КАК НомерСтроки
				|	ИЗ
				|		ПланВидовРасчета."+ИмяРегистра+".Показатели КАК Показатели) КАК ВложенныйЗапрос
				|	ПО ВложенныйЗапрос.Ссылка = Основной.ВидРасчета
				|ГДЕ "+ВнешнееУсловие;
				
				Запрос.Текст = ТекстКолВоПоказателей;
				ВыборкаКоличестваПоказателей = Запрос.Выполнить().Выбрать();
				ВыборкаКоличестваПоказателей.Следующий();
				КоличествоПоказателей = ?(ВыборкаКоличестваПоказателей.КолВоПоказателей=NULL,0,ВыборкаКоличестваПоказателей.КолВоПоказателей);		
			КонецЕсли;
			
			Если КоличествоПоказателей = 0 Тогда
				ТекстЗапроса = ТекстЗапроса + ",
				| 0 КАК КоличествоПоказателей,";
			Иначе
				ТекстЗапроса = ТекстЗапроса + ",
				| Показатели.КоличествоПоказателей КАК КоличествоПоказателей,";
				Если КомментироватьРасчет Тогда
					ПоляЗапросаМаксимум.Добавить("КоличествоПоказателей");
				КонецЕсли;
			КонецЕсли;
			
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ФормулаРасчета");
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			| Основной.ВидРасчета.ФормулаРасчета КАК ФормулаРасчета";
			Для СчПоказателей = 1 По КоличествоПоказателей Цикл
				ТекстЗапроса = ТекстЗапроса + ", 
				|Показатели.Показатель" + СчПоказателей+".Наименование Как Показатель" + СчПоказателей + "Наименование";
				
				Если КомментироватьРасчет Тогда
					ПоляЗапросаМаксимум.Добавить("Показатель" + СчПоказателей + "Наименование");
				КонецЕсли;
			КонецЦикла;			
			
			Показатель1Текст = ПолучитьТекстПоказателя(НеобходимыеДанные,ИмяРегистра,, КоличествоПоказателей, КомментироватьРасчет);
			Если КоличествоПоказателей > 6 Тогда
				// получим текст запроса для предопределенных показателей
				Показатель1ТекстПредопределенный = ПолучитьТекстПоказателя(НеобходимыеДанные,ИмяРегистра, Истина, КоличествоПоказателей, КомментироватьРасчет);
			КонецЕсли;
			
			Для СчПоказателей = 1 По КоличествоПоказателей Цикл
				Если СчПоказателей > 6 Тогда					
					ПоказательТекст = СтрЗаменить(Показатель1ТекстПредопределенный, "Показатель1", "Показатель"+СчПоказателей);
				Иначе
					ПоказательТекст = СтрЗаменить(Показатель1Текст, "Показатель1", "Показатель"+СчПоказателей);
				КонецЕсли;					
				ТекстЗапроса = ТекстЗапроса + ", 
			   	|" + ПоказательТекст + " Как Показатель"+СчПоказателей;
				
				Если КомментироватьРасчет Тогда
					ПоляЗапросаМаксимум.Добавить("Показатель" + СчПоказателей);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НеобходимыеДанные.ПределПоДокументуОснованию Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|	Основной.ДокументОснование.Предел Как ПределПоДокументуОснованию";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ПределПоДокументуОснованию");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимаБаза Тогда
			Если Регистратор.ОтражатьВРеглУчете Тогда
				Если КомментироватьРасчет Тогда
					ТекстЗапроса = ТекстЗапроса + ",
					|База.РезультатБаза Как РезультатБаза,
					|База.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
					|База.ВидРасчетаРазрез.Наименование КАК ВидРасчетаРазрезНаименование";
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрез");
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрезНаименование");
				Иначе 
					ТекстЗапроса = ТекстЗапроса + ",
					|База.РезультатБаза КАК РезультатБаза";
				КонецЕсли;
				
			Иначе 
				Если КомментироватьРасчет Тогда
					ТекстЗапроса = ТекстЗапроса + ",
					|База.РезультатУпрБаза Как РезультатБаза,
					|База.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
					|База.ВидРасчетаРазрез.Наименование КАК ВидРасчетаРазрезНаименование";
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрез");
					ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрезНаименование");
				Иначе 
					ТекстЗапроса = ТекстЗапроса + ",
					|База.РезультатУпрБаза КАК РезультатБаза";
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|НакопленныеДанные.УжеНачисленоВТекущемПериоде     КАК УжеНачисленоВТекущемПериоде,
			|НакопленныеДанные.УжеНачисленоЗаВсюИсторию        КАК УжеНачисленоЗаВсюИсторию";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("УжеНачисленоВТекущемПериоде");
				ПоляЗапросаМаксимум.Добавить("УжеНачисленоЗаВсюИсторию");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ИсчисленныеВзносы Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|ИсчисленныеВзносы.Взносы КАК Взносы";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("Взносы");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ИсчисленныйНДФЛ Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|ИсчисленныйНДФЛ.НДФЛ КАК ИсчисленныйНДФЛ";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("ИсчисленныйНДФЛ");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ПараметрыИсполнительногоЛиста Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|ИсполниетльныеЛисты_ДетиДо6.Размер          	КАК АлиментыДетиДо6,
			|ИсполниетльныеЛисты_ДетиДо18.Размер          	КАК АлиментыДетиДо18,
			|ИсполниетльныеЛисты_Трудоспособные.Размер		КАК АлиментыТрудоспособные,
			|ИсполниетльныеЛисты.Предел          			КАК Предел,
			|ИсполниетльныеЛисты.ПометкаУвеличиватьДоМинимума КАК ПометкаУвеличиватьДоМинимума,
			|ИсполниетльныеЛисты.ДетейВДокументеВсего       КАК ДетейВДокументеВсего,
			|ИсполниетльныеЛисты.ДетейВДокументе6      		КАК ДетейВДокументе6,
			|ИсполниетльныеЛисты.ДетейВДокументе18     		КАК ДетейВДокументе18,
			|ИсполниетльныеЛисты.ДетейВДокументе19     		КАК ДетейВДокументе19,
			|ИсполниетльныеЛисты.ДетейВДокументе            КАК ДетейВДокументе,
			|ИсполниетльныеЛисты.НачалоИндексации			КАК НачалоИндексации,
			|&парамПроцентДоплатиПоАлиментам				КАК ПроцентДоплатиПоАлиментам";

			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("АлиментыДетиДо6");
				ПоляЗапросаМаксимум.Добавить("АлиментыДетиДо18");
				ПоляЗапросаМаксимум.Добавить("АлиментыТрудоспособные");
				ПоляЗапросаМаксимум.Добавить("Предел");
				ПоляЗапросаМаксимум.Добавить("ПометкаУвеличиватьДоМинимума");
				ПоляЗапросаМаксимум.Добавить("ДетейВДокументеВсего");
				ПоляЗапросаМаксимум.Добавить("ДетейВДокументе6");
				ПоляЗапросаМаксимум.Добавить("ДетейВДокументе18");
				ПоляЗапросаМаксимум.Добавить("ДетейВДокументе19");
				ПоляЗапросаМаксимум.Добавить("ДетейВДокументе");
				ПоляЗапросаМаксимум.Добавить("НачалоИндексации");
				ПоляЗапросаМаксимум.Добавить("ПроцентДоплатиПоАлиментам");
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ПараметрыПочты Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|ПочтовыеПереводы.РазмерПочтовогоПеревода		КАК РазмерПочтовогоПеревода,
			|ПараметрыПочты.СуммаДополнительно				КАК СуммаДополнительно,
			|ПараметрыПочты.СуммаМинимальная				КАК СуммаМинимальная,
			|ПараметрыПочты.Ставка 							КАК Ставка";   
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("РазмерПочтовогоПеревода");
				ПоляЗапросаМаксимум.Добавить("СуммаДополнительно");
				ПоляЗапросаМаксимум.Добавить("СуммаМинимальная"); 
				ПоляЗапросаМаксимум.Добавить("Ставка"); 
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимыеДанные.ПараметрыИндексацииАлиментов Тогда
			ТекстЗапроса = ТекстЗапроса + ", 
			|ПараметрыИндексацииАлиментов.БазаИндексации	КАК БазаИндексации";   
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("БазаИндексации");
			КонецЕсли;
		КонецЕсли;

		
		ТекстЗапроса = ТекстЗапроса + "
		|	ИЗ РегистрРасчета."+ИмяРегистра+" Как Основной";
		
		
		Если Регистратор.ОтражатьВУпрУчете Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	// курсы упр. валюты 
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамПериодРегистрации) КАК ВалютыУпр
			|	ПО  ВалютыУпр.Валюта = &парамВалютаУпрУчета 
			|";
		КонецЕсли;
		
		Если НеобходимыеДанные.ПоказателиСхемМотивации Тогда
			
			// ВТПоказатели
			Если Истина Тогда
				// получим временную таблицу с расчетом показателей
				ТекстЗапросаПоказатели = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Основной.ВидРасчета,
				|	МАКСИМУМ(ВСЕПоказатели.НомерСтроки) КАК КоличествоПоказателей";
				Для СчПоказателей = 1 По КоличествоПоказателей Цикл
					ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + ",
					|	Показатели"+ СчПоказателей + ".Показатель КАК Показатель" + СчПоказателей;
				КонецЦикла;
				ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
				|ПОМЕСТИТЬ ВТПоказатели
				|ИЗ
				|	РегистрРасчета."+ИмяРегистра +" КАК Основной
				|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета."+ИмяРегистра+".Показатели КАК ВСЕПоказатели
				|	ПО Основной.ВидРасчета = ВСЕПоказатели.Ссылка";
				Для СчПоказателей = 1 По КоличествоПоказателей Цикл
					ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
					|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета."+ИмяРегистра+".Показатели КАК Показатели"+ СчПоказателей + "
					|	ПО Основной.ВидРасчета = Показатели"+ СчПоказателей + ".Ссылка 
					|	И  Показатели"+ СчПоказателей + ".НомерСтроки = "+ СчПоказателей;
				КонецЦикла;
				ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
				|ГДЕ " + ВнешнееУсловие + "
				|СГРУППИРОВАТЬ ПО
				|	Основной.ВидРасчета";
				Для СчПоказателей = 1 По КоличествоПоказателей Цикл
					ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + ",
					|	Показатели"+ СчПоказателей + ".Показатель";
				КонецЦикла;
				ТекстЗапросаПоказатели = ТекстЗапросаПоказатели + "
				|ИНДЕКСИРОВАТЬ ПО Основной.ВидРасчета";		
				
				Запрос.Текст = ТекстЗапросаПоказатели;
				Запрос.Выполнить();
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
            |ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
			|ПО Показатели.ВидРасчета = Основной.ВидРасчета";
			
			Если НеобходимыеДанные.КалендарныхДнейВмесяце Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ФактическийПериодДействия(Регистратор = &парамРегистратор) КАК ФактическийПериодДействия
				|ПО ФактическийПериодДействия.НомерСтроки = Основной.НомерСтроки";
			КонецЕсли;
			
		КонецЕсли;
		
		Если НеобходимаБаза Тогда
			
			Если КомментироватьРасчет Тогда
				
				// ВТБазыСКоментарием
				//	Описание:
				// 		Альтернатива таблице РегистрРасчета.ВзносыВФонды.БазаНачисления(
				//
				ТекстЗапросаВТ = "
				|		ВЫБРАТЬ 
				|			Основной.Регистратор КАК Регистратор, 
				|			Основной.НомерСтроки КАК НомерСтроки, 
				|			БазаИзНачислений.ВидРасчета КАК ВидРасчетаРазрез, 
				|			СУММА(БазаИзНачислений.Результат)		КАК РезультатБаза,
				|			СУММА(БазаИзНачислений.РезультатУпр)		КАК РезультатУпрБаза 
				|ПОМЕСТИТЬ ВТБазыСКоментарием	
				|		ИЗ РегистрРасчета.Удержания КАК Основной
				| 
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
				|		ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|			И	БазаИзНачислений.ПериодРегистрации = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
				|			И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|		ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|			И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				| 
				|		ГДЕ 	Основной.Регистратор = &парамРегистратор
				|			И	Основной.Сотрудник В (&парамСотрудники)
				| 
				|		СГРУППИРОВАТЬ ПО 
				|			Основной.Регистратор, 
				|			Основной.НомерСтроки, 
				|			БазаИзНачислений.ВидРасчета 
				| 
				|       ОБЪЕДИНИТЬ ВСЕ
				|		ВЫБРАТЬ 
				|			Основной.Регистратор КАК Регистратор, 
				|			Основной.НомерСтроки КАК НомерСтроки, 
				|			БазаИзНачислений.ВидРасчета КАК ВидРасчетаРазрез, 
				|			СУММА(БазаИзНачислений.Результат)		КАК РезультатБаза,
				|			СУММА(БазаИзНачислений.РезультатУпр)		КАК РезультатУпрБаза 
				|		ИЗ РегистрРасчета.Удержания КАК Основной
				| 
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК БазаИзНачислений
				|		ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|			И	БазаИзНачислений.ПериодРегистрации = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
				|			И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|		ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|			И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				| 
				|		ГДЕ 	Основной.Регистратор = &парамРегистратор
				|			И	Основной.Сотрудник В (&парамСотрудники)
				| 
				|		СГРУППИРОВАТЬ ПО 
				|			Основной.Регистратор, 
				|			Основной.НомерСтроки, 
				|			БазаИзНачислений.ВидРасчета 
				| ";

				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТБазыСКоментарием = "ВТБазыСКоментарием";
				
				ТекстЗапроса = ТекстЗапроса + "
				|ЛЕВОЕ СОЕДИНЕНИЕ ВТБазыСКоментарием КАК База
				|ПО Основной.Регистратор = База.Регистратор И Основной.НомерСтроки = База.НомерСтроки
				|";
			Иначе
				
				// ВТБазы
				//	Описание:
				// 		Альтернатива таблице РегистрРасчета.ВзносыВФонды.БазаНачисления(
				//
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ 
				|		Основной.Регистратор КАК Регистратор, 
				|		Основной.НомерСтроки КАК НомерСтроки, 
				|		СУММА(Основной.РезультатБаза)	КАК РезультатБаза,
				|		СУММА(Основной.РезультатУпрБаза)	КАК РезультатУпрБаза 
				|ПОМЕСТИТЬ ВТБазы	
				|		ИЗ (
				|		ВЫБРАТЬ 
				|			Основной.Регистратор КАК Регистратор, 
				|			Основной.НомерСтроки КАК НомерСтроки, 
				|			Основной.ВидРасчета КАК Взнос, 
				|			Основной.Сотрудник КАК Сотрудник, 
				|			БазаИзНачислений.ВидРасчета КАК ВидРасчета, 
				|			БазаИзНачислений.Результат		КАК РезультатБаза,
				|			БазаИзНачислений.РезультатУпр		КАК РезультатУпрБаза
				|		ИЗ РегистрРасчета.Удержания КАК Основной
				| 
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
				|		ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|			И	БазаИзНачислений.ПериодРегистрации = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
				|			И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|		ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|			И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				| 
				|		ГДЕ Основной.Регистратор = &парамРегистратор
				|			И	Основной.Сотрудник В (&парамСотрудники)
				| 
				|       ОБЪЕДИНИТЬ ВСЕ
				|		ВЫБРАТЬ 
				|			Основной.Регистратор КАК Регистратор, 
				|			Основной.НомерСтроки КАК НомерСтроки, 
				|			Основной.ВидРасчета КАК Взнос, 
				|			Основной.Сотрудник КАК Сотрудник, 
				|			БазаИзНачислений.ВидРасчета КАК ВидРасчета, 
				|			БазаИзНачислений.Результат		КАК РезультатБаза,
				|			БазаИзНачислений.РезультатУпр		КАК РезультатУпрБаза
				|		ИЗ РегистрРасчета.Удержания КАК Основной
				| 
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК БазаИзНачислений
				|		ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|			И	БазаИзНачислений.ПериодРегистрации = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
				|			И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|		ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|			И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				| 
				|		ГДЕ Основной.Регистратор = &парамРегистратор
				|			И	Основной.Сотрудник В (&парамСотрудники)
				| 
				|	)КАК Основной 
				| 
				|	СГРУППИРОВАТЬ ПО 
				|		Основной.Регистратор, 
				|		Основной.НомерСтроки 
				| ";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапроса = ТекстЗапроса + "
				|ЛЕВОЕ СОЕДИНЕНИЕ ВТБазы КАК База
				|ПО Основной.Регистратор = База.Регистратор И Основной.НомерСтроки = База.НомерСтроки";
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НеобходимыеДанные.НакопленныеДанныеПоДокументуОснованию Тогда
			Запрос.Текст = НакопленныеДанныеТекст;
			Запрос.Выполнить();
			НакопленныеДанныеТекст = "ВТНакопленныеДанные";
			
			// присоединяем сводные данные по документу основанию
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ "+НакопленныеДанныеТекст+" КАК НакопленныеДанные
			|ПО 
			|	НакопленныеДанные.Сотрудник = Основной.Сотрудник
			|	И НакопленныеДанные.ВидРасчета = Основной.ВидРасчета
			|	И НакопленныеДанные.ДокументОснование = Основной.ДокументОснование";
		КонецЕсли;
		
		Если НеобходимыеДанные.ИсчисленныеВзносы Тогда
			Запрос.УстановитьПараметр("парамЭтоВзносыПоРаботнику", Перечисления.СпособыРасчетаОплатыТруда.Взносы);
			
			ИсчисленныеВзносыТекст = "
			|ВЫБРАТЬ
			|	ВзносыВФонды.Сотрудник      КАК Сотрудник,
			|	СУММА(ВзносыВФонды.Результат) КАК Взносы
			|ПОМЕСТИТЬ ВТИсчисленныеВзносы
			|ИЗ
			|	РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
			|
			|ГДЕ  ВзносыВФонды.Организация = &парамОрганизация
			|	И ВзносыВФонды.ПериодРегистрации = &парамПериодРегистрации
			|	И ВзносыВФонды.ВидРасчета.СпособРасчета в (&парамЭтоВзносыПоРаботнику)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзносыВФонды.Сотрудник
			|ИНДЕКСИРОВАТЬ ПО 
			|	Сотрудник";
			
			Запрос.Текст = ИсчисленныеВзносыТекст;
			Запрос.Выполнить();
			ИсчисленныеВзносыТекст = "ВТИсчисленныеВзносы";
		
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ " + ИсчисленныеВзносыТекст + " КАК ИсчисленныеВзносы
			|ПО Основной.Сотрудник = ИсчисленныеВзносы.Сотрудник
			|
			|";
			
		КонецЕсли;
		
		Если НеобходимыеДанные.ИсчисленныйНДФЛ Тогда
			ИсчисленныйНДФЛТекст = "
			|ВЫБРАТЬ
			|	ВзаиморасчетыПоНДФЛ.Сотрудник		КАК Сотрудник,
			|	СУММА(ВзаиморасчетыПоНДФЛ.Налог)	КАК НДФЛ
			|ПОМЕСТИТЬ ВТИсчисленныйНДФЛ
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК ВзаиморасчетыПоНДФЛ
			|
			|ГДЕ
			|	ВзаиморасчетыПоНДФЛ.Организация = &парамОрганизация
			|	И НАЧАЛОПЕРИОДА(ВзаиморасчетыПоНДФЛ.Период,Месяц) = НАЧАЛОПЕРИОДА(&парамПериодРегистрации,Месяц)
			|	И ВзаиморасчетыПоНДФЛ.ВидДвижения = &парамПриход
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзаиморасчетыПоНДФЛ.Сотрудник
			|ИНДЕКСИРОВАТЬ ПО 
			|	Сотрудник";
			
			Запрос.Текст = ИсчисленныйНДФЛТекст;
			Запрос.Выполнить();
			ИсчисленныйНДФЛТекст = "ВТИсчисленныйНДФЛ";
			
			// присоединяем данные по исчисленному НДФЛ
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ "+ИсчисленныйНДФЛТекст+" КАК ИсчисленныйНДФЛ
			|ПО Основной.Сотрудник = ИсчисленныйНДФЛ.Сотрудник";
			
		КонецЕсли;
				
		Если НеобходимыеДанные.ПараметрыИсполнительногоЛиста Тогда
			Запрос.УстановитьПараметр("парамДетиДо6"	, Перечисления.СоциальныеГруппыНаселения.ДетиДо6);
			Запрос.УстановитьПараметр("парамДетиДо18"	, Перечисления.СоциальныеГруппыНаселения.ДетиДо18);
			Запрос.УстановитьПараметр("парамТрудоспособные", Перечисления.СоциальныеГруппыНаселения.Трудоспособные);
			
			Запрос.УстановитьПараметр("парамПериодРегистрации6"		, ДобавитьМесяц(ПериодРегистрации, -6*12));
			Запрос.УстановитьПараметр("парамПериодРегистрации18"	, ДобавитьМесяц(ПериодРегистрации, -18*12));
			Если ПериодРегистрации >= Дата(2017,6,1) Тогда
				Запрос.УстановитьПараметр("парамПроцентДоплатиПоАлиментам", 0.5);
			Иначе
				Запрос.УстановитьПараметр("парамПроцентДоплатиПоАлиментам", 0.3);
			Конецесли;	
			
			// ВТДанныеПоИспольнительномуЛисту
			Если Истина Тогда
				ТекстЗапросаВТ = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ТабличнаяЧастьДети.Ссылка                              КАК ИсполнительныйЛист, 
				|	ТабличнаяЧастьДети.Ссылка.ТарифПочты                   КАК ПочтовыйТариф, 
				|	ТабличнаяЧастьДети.Ссылка.Предел                       КАК Предел,
				|	ТабличнаяЧастьДети.Ссылка.ПометкаУвеличиватьДоМинимума КАК ПометкаУвеличиватьДоМинимума,
				|	КОЛИЧЕСТВО ( РАЗЛИЧНЫЕ ТабличнаяЧастьДети.ФизЛицо)     КАК ДетейВДокументеВсего,
				|	КОЛИЧЕСТВО ( РАЗЛИЧНЫЕ АктуальныеДети.ФизЛицо)         КАК ДетейВДокументе,
				|	КОЛИЧЕСТВО ( РАЗЛИЧНЫЕ АктуальныеДети_ДетиДо6.ФизЛицо)			КАК ДетейВДокументе6,
				|	КОЛИЧЕСТВО ( РАЗЛИЧНЫЕ АктуальныеДети_ДетиДо18.ФизЛицо)			КАК ДетейВДокументе18,
				|	КОЛИЧЕСТВО ( РАЗЛИЧНЫЕ АктуальныеДети_Трудоспособные.ФизЛицо)	КАК ДетейВДокументе19,
				|	ТабличнаяЧастьДети.Ссылка.НачалоИндексации КАК НачалоИндексации
				|ПОМЕСТИТЬ ВТДанныеПоИспольнительномуЛисту
				|
				|ИЗ	Документ.ИсполнительныйЛист.Дети КАК ТабличнаяЧастьДети
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист.Дети КАК АктуальныеДети
				|ПО   АктуальныеДети.ГодОкончания >= ГОД(&парамПериодРегистрации) 
				|   И АктуальныеДети.Ссылка = ТабличнаяЧастьДети.Ссылка
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист.Дети КАК АктуальныеДети_ДетиДо6
				|ПО   НАЧАЛОПЕРИОДА(АктуальныеДети_ДетиДо6.ФизЛицо.ДатаРождения, ГОД) >= &парамПериодРегистрации6 
				|	И НАЧАЛОПЕРИОДА(АктуальныеДети_ДетиДо6.ФизЛицо.ДатаРождения, ГОД) <  &парамПериодРегистрации
				|	И АктуальныеДети_ДетиДо6.ГодОкончания >= ГОД(&парамПериодРегистрации) 
				|   И АктуальныеДети_ДетиДо6.Ссылка = ТабличнаяЧастьДети.Ссылка
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист.Дети КАК АктуальныеДети_ДетиДо18
				|ПО   НАЧАЛОПЕРИОДА(АктуальныеДети_ДетиДо18.ФизЛицо.ДатаРождения, ГОД) >= &парамПериодРегистрации18 
				|	И НАЧАЛОПЕРИОДА(АктуальныеДети_ДетиДо18.ФизЛицо.ДатаРождения, ГОД) <  &парамПериодРегистрации6
				|	И АктуальныеДети_ДетиДо18.ГодОкончания >= ГОД(&парамПериодРегистрации)
				|   И АктуальныеДети_ДетиДо18.Ссылка = ТабличнаяЧастьДети.Ссылка
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист.Дети КАК АктуальныеДети_Трудоспособные
				|ПО   НАЧАЛОПЕРИОДА(АктуальныеДети_Трудоспособные.ФизЛицо.ДатаРождения, ГОД) <  &парамПериодРегистрации18
				|	И АктуальныеДети_Трудоспособные.ГодОкончания >= ГОД(&парамПериодРегистрации)
				|   И АктуальныеДети_Трудоспособные.Ссылка = ТабличнаяЧастьДети.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ТабличнаяЧастьДети.Ссылка
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
			КонецЕсли;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДанныеПоИспольнительномуЛисту";
			
			// присоединяем данные для расчета исполнительных листов
			ТекстЗапроса = ТекстЗапроса + "
			|		
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоИспольнительномуЛисту КАК ИсполниетльныеЛисты
			|ПО   Основной.ДокументОснование = ИсполниетльныеЛисты.ИсполнительныйЛист 
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы.СрезПоследних(&парамПериодРегистрации) КАК ИсполниетльныеЛисты_ДетиДо6
			|ПО   ИсполниетльныеЛисты_ДетиДо6.СоциальнаяГруппа = &парамДетиДо6 
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы.СрезПоследних(&парамПериодРегистрации) КАК ИсполниетльныеЛисты_ДетиДо18
			|ПО   ИсполниетльныеЛисты_ДетиДо18.СоциальнаяГруппа = &парамДетиДо18 
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы.СрезПоследних(&парамПериодРегистрации) КАК ИсполниетльныеЛисты_Трудоспособные
			|ПО   ИсполниетльныеЛисты_Трудоспособные.СоциальнаяГруппа = &парамТрудоспособные"; 
		КонецЕсли;
				
		Если НеобходимыеДанные.ПараметрыПочты Тогда
			Запрос.УстановитьПараметр("СпособРасчетаПочтовыйСбор", Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор);
			
			// ВТРазмерПочтовогоПеревода
			Если Истина Тогда 
				// 
				//
				ТекстЗапросаВТ =  "
				|ВЫБРАТЬ
				|	Основная.Сотрудник КАК Сотрудник,
				|	Основная.Организация,
				|	Основная.ДокументОснование,
				|	СУММА(Дополнительная.Результат) КАК РазмерПочтовогоПеревода
				|ПОМЕСТИТЬ ВТРазмерПочтовогоПеревода
				|ИЗ
				|	РегистрРасчета.Удержания КАК Основная
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК Дополнительная
				|		ПО Основная.ПериодРегистрации = Дополнительная.ПериодРегистрации
				|			И Основная.Сотрудник = Дополнительная.Сотрудник
				|			И Основная.Организация = Дополнительная.Организация
				|			И Основная.ДокументОснование = Дополнительная.ДокументОснование
				|			И Основная.ВидРасчета <> Дополнительная.ВидРасчета
				|ГДЕ
				|	Основная.Регистратор = &парамРегистратор
				|	И Основная.ВидРасчета.СпособРасчета = &СпособРасчетаПочтовыйСбор
				|
				|СГРУППИРОВАТЬ ПО
				|	Основная.Сотрудник,
				|	Основная.Организация,
				|	Основная.ДокументОснование
				|ИНДЕКСИРОВАТЬ ПО 
				|	Сотрудник
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТДвиженияРаботников = "ВТРазмерПочтовогоПеревода";
			КонецЕсли; 
			
			// ВТПараметрыПочты
			Если Истина Тогда 
				// 
				//
				ТекстЗапросаВТ =  "
				|ВЫБРАТЬ 
				|  ПараметрыПочты.ПочтовыйТариф  			КАК ПочтовыйТариф,
				|  ПараметрыПочты.Порог   		 			КАК Порог,
				|  ЕСТЬNULL(ПараметрыПочты.НижнийПорог, 0)	КАК НижнийПорог,
				|  ПочтовыеСборыСтавки.Ставка   		 	КАК Ставка,
				|  ПочтовыеСборыСтавки.СуммаДополнительно	КАК СуммаДополнительно,
				|  ПочтовыеСборыСтавки.СуммаМинимальная		КАК СуммаМинимальная
				|  
				|ПОМЕСТИТЬ ВТПараметрыПочты
				|ИЗ (
				|	ВЫБРАТЬ 
				|	  ПочтовыеСборыПериод.ПочтовыйТариф  		КАК ПочтовыйТариф,
				|	  ПочтовыеСборыПериод.Период   		 		КАК Период,
				|	  ПочтовыеСборыПериод.Порог   		 		КАК Порог,
				|	  МАКСИМУМ(ПочтовыеСборы.Порог)   	КАК НижнийПорог
				|
				|	ИЗ (
				|		ВЫБРАТЬ 
				|		  	ПочтовыеСборыПериод.ПочтовыйТариф  	КАК ПочтовыйТариф,
				|		  	ПочтовыеСборыПериод.Период  		КАК Период,
				|		  	ПочтовыеСборы.Порог   				КАК Порог
				|
				|		  	ИЗ (
				|	 			ВЫБРАТЬ   
				|					ПочтовыеСборы.ПочтовыйТариф  		КАК ПочтовыйТариф,
				|					МАКСИМУМ(ПочтовыеСборы.Период)  	КАК Период
				|		  		ИЗ РегистрСведений.ШкалаПочтовыхСборов КАК ПочтовыеСборы
				|				ГДЕ ПочтовыеСборы.Период <= &парамПериодРегистрации
				|				СГРУППИРОВАТЬ ПО
				|		  			ПочтовыеСборы.ПочтовыйТариф
				|		  	) КАК ПочтовыеСборыПериод
				|		  	ЛЕВОЕ СОЕДИНЕНИЕ  РегистрСведений.ШкалаПочтовыхСборов КАК ПочтовыеСборы
				|		  	ПО ПочтовыеСборы.ПочтовыйТариф = ПочтовыеСборыПериод.ПочтовыйТариф
				|		  	И ПочтовыеСборы.Период = ПочтовыеСборыПериод.Период
				|
				|	   ) КАК ПочтовыеСборыПериод
				|	 
				|	ЛЕВОЕ СОЕДИНЕНИЕ  РегистрСведений.ШкалаПочтовыхСборов КАК ПочтовыеСборы
				|	 ПО  ПочтовыеСборыПериод.ПочтовыйТариф = ПочтовыеСборы.ПочтовыйТариф
				|		И ПочтовыеСборыПериод.Период       = ПочтовыеСборы.Период
				|		И ПочтовыеСборы.Порог        < ПочтовыеСборыПериод.Порог
				|
				|	СГРУППИРОВАТЬ ПО 
				|	  ПочтовыеСборыПериод.ПочтовыйТариф,
				|	  ПочтовыеСборыПериод.Период,
				|	  ПочтовыеСборыПериод.Порог
				|  
				|) КАК ПараметрыПочты
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ  РегистрСведений.ШкалаПочтовыхСборов КАК ПочтовыеСборыСтавки
				| ПО  ПараметрыПочты.ПочтовыйТариф	= ПочтовыеСборыСтавки.ПочтовыйТариф
				|	И ПараметрыПочты.Период		= ПочтовыеСборыСтавки.Период
				|	И ПараметрыПочты.Порог        		= ПочтовыеСборыСтавки.Порог
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТДвиженияРаботников = "ВТПараметрыПочты";
			КонецЕсли;
			
			// присоединяем данные для расчета почтового сбора
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерПочтовогоПеревода КАК ПочтовыеПереводы
			|ПО Основной.Сотрудник = ПочтовыеПереводы.Сотрудник И
			|	Основной.Организация = ПочтовыеПереводы.Организация И
			|	Основной.ДокументОснование = ПочтовыеПереводы.ДокументОснование
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметрыПочты КАК ПараметрыПочты
			|ПО ПочтовыеПереводы.ДокументОснование.ТарифПочты = ПараметрыПочты.ПочтовыйТариф 
			|	И ПочтовыеПереводы.РазмерПочтовогоПеревода <= ПараметрыПочты.Порог
			|	И ПочтовыеПереводы.РазмерПочтовогоПеревода > ПараметрыПочты.НижнийПорог
			|";
			
		КонецЕсли;
		
		Если НеобходимыеДанные.ПараметрыИндексацииАлиментов Тогда
			Запрос.УстановитьПараметр("СпособРасчетаИндексацияАлиментов", Перечисления.СпособыРасчетаОплатыТруда.ИндексацияАлиментов);
			
			// ВТПараметрыИндексацииАлиментов
			Если Истина Тогда 
				// 
				//
				ТекстЗапросаВТ =  "
				|ВЫБРАТЬ
				|	Основная.Сотрудник КАК Сотрудник,
				|	Основная.Организация,
				|	Основная.ДокументОснование,
				|	СУММА(Дополнительная.Результат) КАК БазаИндексации
				|ПОМЕСТИТЬ ВТПараметрыИндексацииАлиментов
				|ИЗ
				|	РегистрРасчета.Удержания КАК Основная
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК Дополнительная
				|		ПО Основная.ПериодРегистрации = Дополнительная.ПериодРегистрации
				|			И Основная.Сотрудник = Дополнительная.Сотрудник
				|			И Основная.Организация = Дополнительная.Организация
				|			И Основная.ДокументОснование = Дополнительная.ДокументОснование
				|			И Основная.ВидРасчета <> Дополнительная.ВидРасчета
				|			И Основная.ВидРасчета.КатегорияРасчета.Порядок > Дополнительная.ВидРасчета.КатегорияРасчета.Порядок
				|ГДЕ
				|	Основная.Регистратор = &парамРегистратор
				|	И Основная.ВидРасчета.СпособРасчета = &СпособРасчетаИндексацияАлиментов
				|
				|СГРУППИРОВАТЬ ПО
				|	Основная.Сотрудник,
				|	Основная.Организация,
				|	Основная.ДокументОснование
				|ИНДЕКСИРОВАТЬ ПО 
				|	Сотрудник
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТДвиженияРаботников = "ВТПараметрыИндексацииАлиментов";
			КонецЕсли; 
			
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметрыИндексацииАлиментов КАК ПараметрыИндексацииАлиментов
			|ПО Основной.Сотрудник = ПараметрыИндексацииАлиментов.Сотрудник И
			|	Основной.Организация = ПараметрыИндексацииАлиментов.Организация И
			|	Основной.ДокументОснование = ПараметрыИндексацииАлиментов.ДокументОснование
			|";
			
		КонецЕсли;

		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ " + ВнешнееУсловие;
		
	КонецЕсли;	
		
	Если ИмяРегистра = "ВзносыВФонды" Тогда
		
		НеобходимаБаза = Истина;
		ТолькоПоДвижениямТекущегоДокумента=ТипЗнч(Регистратор)=Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций");
		
		ИспользуетсяЕСВ = ИспользуетсяЕСВ(Регистратор.ПериодРегистрации);
		Запрос.УстановитьПараметр("РасчетЗКВ",ТолькоПоДвижениямТекущегоДокумента);
		Запрос.УстановитьПараметр("ПрименятьКоэффициентЕСВДляАвансов",РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Регистратор.Организация)).ПрименятьКоэффициентЕСВДляАвансов);
		
		Запрос.УстановитьПараметр("ИсползуетсяЕСВ1573",(Регистратор.ПериодРегистрации >= ДатаИзмененияЕСВ1573()));
		Запрос.УстановитьПараметр("ИсползуетсяЕСВ1863",(Регистратор.ПериодРегистрации >= ДатаИзмененияЕСВ1863()));
		
		Запрос.УстановитьПараметр("МассивНалогиБезКоэффициента",СписокНалогиБезКоэффициента());
		
		Запрос.УстановитьПараметр("ИсползуетсяЕСВ3688",(Регистратор.ПериодРегистрации >= ДатаИзмененияЕСВ3688()));
		
		ТекстЗапроса = 
		"ВЫБРАТЬ 
		|	Основной.Регистратор				Как Регистратор, 
		|	Основной.Регистратор.ОтражатьВУпрУчете	Как ОтражатьВУпрУчете, 
		|	Основной.Регистратор.ОтражатьВРеглУчете	Как ОтражатьВРеглУчете, 
		|	ВЫБОР КОГДА Основной.Регистратор ССЫЛКА Документ.ЗарплатаКВыплатеОрганизаций ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ	Как ЗарплатаКВыплатеОрганизаций,
		|	Основной.НомерСтроки				Как НомерСтроки, 
		|	Основной.Сотрудник					Как Сотрудник, 
		|	Основной.Сотрудник.Наименование		Как СотрудникНаименование, 
		|	Основной.Предел 					Как Предел,
		|	Основной.ВидРасчета 				Как ВидРасчета,
		|	Основной.ВидРасчета.Наименование	Как ВидРасчетаНаименование,
		|	Основной.ВидРасчета.СпособРасчета	Как СпособРасчета,
		|	Основной.Налог 						Как Налог,
		|	Основной.НомерПорога                КАК НомерПорога, 
		|	Основной.МинимальнаяБаза 			Как МинимальнаяБаза,
		|	ВЫБОР 
		|	  КОГДА НЕ &ИсползуетсяЕСВ1573 
		|		ТОГДА ЛОЖЬ
		|	  КОГДА Основной.Налог В (&МассивНалогиБезКоэффициента) 
		|		ТОГДА ЛОЖЬ
		|	  КОГДА &РасчетЗКВ И НЕ &ПрименятьКоэффициентЕСВДляАвансов 
		|		ТОГДА ЛОЖЬ
		|	  КОГДА &ИсползуетсяЕСВ1863
		|		ТОГДА ИСТИНА
		|	  КОГДА Основной.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы) 
		|		ТОГДА ЛОЖЬ
		|	  КОГДА Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВторогоУровня) ИЛИ Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеТретьегоУровня) 
		|		ТОГДА ЛОЖЬ
		|	  ИНАЧЕ ИСТИНА 
		|	КОНЕЦ КАК ПрименениеКоэффициентаЕСВ,
		|	КоэффициентыСтавкиВзносовФОТ.КоэффициентСтавки КАК КоэффициентСтавки,
        |   &ИсползуетсяЕСВ1863 КАК ИсползуетсяЕСВ1863,
		|	ВЫБОР КОГДА Основной.ВидРасчета.СтавкаПоПериодуРегистрации ТОГДА ВсеВзносыПоМесяцуРегистрации.СтатьяНалоговойДекларации	ИНАЧЕ ВсеВзносы.СтатьяНалоговойДекларации КОНЕЦ			КАК СтатьяНалоговойДекларации, 
		|	ВЫБОР КОГДА Основной.ВидРасчета.СтавкаПоПериодуРегистрации ТОГДА ВсеВзносыПоМесяцуРегистрации.Ставка					ИНАЧЕ ВсеВзносы.Ставка КОНЕЦ                     		КАК Ставка, 
		|	ВЫБОР КОГДА Основной.ВидРасчета.СтавкаПоПериодуРегистрации ТОГДА ВсеВзносыПоМесяцуРегистрации.СтавкаПолная				ИНАЧЕ ВсеВзносы.СтавкаПолная КОНЕЦ                     	КАК СтавкаПолная,
		|	ВЫБОР КОГДА Основной.ВидРасчета.СтавкаПоПериодуРегистрации ТОГДА ВсеВзносыПоМесяцуРегистрации.НижнийПорог				ИНАЧЕ ВсеВзносы.НижнийПорог КОНЕЦ						КАК НижнийПорог,
		|	ВЫБОР КОГДА Основной.ВидРасчета.СтавкаПоПериодуРегистрации ТОГДА ВсеВзносыПоМесяцуРегистрации.Порог						ИНАЧЕ ВсеВзносы.Порог КОНЕЦ								КАК Порог
		|"; 
			
		Если КомментироватьРасчет Тогда
			ПоляЗапросаМаксимум.Добавить("Регистратор");
			ПоляЗапросаМаксимум.Добавить("Сотрудник");
			ПоляЗапросаМаксимум.Добавить("ЗарплатаКВыплатеОрганизаций");
			ПоляЗапросаМаксимум.Добавить("СотрудникНаименование");
			ПоляЗапросаМаксимум.Добавить("Предел");
			ПоляЗапросаМаксимум.Добавить("ВидРасчета");
			ПоляЗапросаМаксимум.Добавить("СпособРасчета");
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаНаименование");
			ПоляЗапросаМаксимум.Добавить("Налог");
			ПоляЗапросаМаксимум.Добавить("НомерПорога");
			ПоляЗапросаМаксимум.Добавить("МинимальнаяБаза");
			ПоляЗапросаМаксимум.Добавить("КоэффициентСтавки");
			ПоляЗапросаМаксимум.Добавить("ПрименениеКоэффициентаЕСВ");
			ПоляЗапросаМаксимум.Добавить("ИсползуетсяЕСВ1863");
			
			ПоляЗапросаМаксимум.Добавить("СтатьяНалоговойДекларации");
			ПоляЗапросаМаксимум.Добавить("Ставка");
			ПоляЗапросаМаксимум.Добавить("НижнийПорог");
			ПоляЗапросаМаксимум.Добавить("Порог");
			ПоляЗапросаМаксимум.Добавить("СтавкаПолная");
			ПоляЗапросаМаксимум.Добавить("ОтражатьВУпрУчете");
			ПоляЗапросаМаксимум.Добавить("ОтражатьВРеглУчете");
		КонецЕсли;
		
		Если Регистратор.ОтражатьВУпрУчете Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	ВЫБОР	КОГДА	&парамВалютаУпрУчета = &парамВалютаРегламентУчета 
			|			ТОГДА 1 
			|			ИНАЧЕ ВалютыУпр.Курс/ВалютыУпр.Кратность КОНЕЦ 
			|																КАК КурсВалютыУпр
			|";
			Если КомментироватьРасчет Тогда
				ПоляЗапросаМаксимум.Добавить("КурсВалютыУпр");
			КонецЕсли;
		КонецЕсли;
		

		//Базы + БазыДо	
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|БазСКоментарием.РезультатБаза Как РезультатБаза,
			|БазСКоментарием.РезультатБазаОтпускные КАК РезультатБазаОтпускные,
			|БазСКоментарием.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
			|БазСКоментарием.ВидРасчетаРазрез.Наименование КАК ВидРасчетаРазрезНаименование,
			|БазВычет.РезультатБаза КАК БазаВычет,
			|БазПолные.РезультатБаза КАК БазаПолная,			
			|БазДо.БазаДо КАК БазаДо,
			|БазДо.БазаВзносаДо КАК БазаВзносаДо";
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрез");
			ПоляЗапросаМаксимум.Добавить("ВидРасчетаРазрезНаименование");
			ПоляЗапросаМаксимум.Добавить("БазаВычет");
			ПоляЗапросаМаксимум.Добавить("БазаДо");
			ПоляЗапросаМаксимум.Добавить("БазаВзносаДо");
			ПоляЗапросаСумма.Добавить("РезультатБазаОтпускные");
			ПоляЗапросаМаксимум.Добавить("БазаПолная");
		Иначе 
			ТекстЗапроса = ТекстЗапроса + ",
			|Баз.РезультатБаза КАК РезультатБаза,
			|Баз.РезультатБазаОтпускные КАК РезультатБазаОтпускные,
			|БазВычет.РезультатБаза КАК БазаВычет,
			|БазПолные.РезультатБаза КАК БазаПолная,
			|БазДо.БазаДо КАК БазаДо,
			|БазДо.БазаВзносаДо КАК БазаВзносаДо";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|	ИЗ РегистрРасчета.ВзносыВФонды Как Основной";
		
		Если Регистратор.ОтражатьВУпрУчете Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	// курсы упр. валюты 
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамПериодРегистрации) КАК ВалютыУпр
			|	ПО  ВалютыУпр.Валюта = &парамВалютаУпрУчета 
			|";
		КонецЕсли;
		
		// ВТБазы
		Если Истина Тогда 
			
			Если ИспользуетсяЕСВ Тогда
				
				Запрос.УстановитьПараметр("СписокДекретныеПоЕСВ",СписокДекретныеПоЕСВ());
				Запрос.УстановитьПараметр("СписокГПХПоЕСВ",СписокГПХПоЕСВ());
				
				ТекстФильтрПоПериодам = "				И	ВЫБОР КОГДА БазаИзНачислений.ВидРасчета.ЭтоБольничные //Больничные
										|			ИЛИ  БазаИзНачислений.ВидРасчета В (&СписокГПХПоЕСВ) //Оплата по договору ГПХ
										|			ИЛИ  БазаИзНачислений.ВидРасчета В (&СписокДекретныеПоЕСВ) //Декретные
										|			ИЛИ  НЕ Основной.ВидРасчета.ЕСВ //Это старый взнос
										|			ТОГДА	НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			    И   БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
										|           КОГДА БазаИзНачислений.ВидРасчета.ЭтоОтпускные //Отпускные
										|               И НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = &парамПериодРегистрации
										|			ТОГДА НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			    И   БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
										|           КОГДА БазаИзНачислений.ВидРасчета.ЭтоОтпускные //Отпускные
										|               И НЕ БазаИзНачислений.Сторно
										|			ТОГДА НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			    И   БазаИзНачислений.ПериодРегистрации = &парамПериодРегистрации
										|			ИНАЧЕ	((НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			    И   БазаИзНачислений.ПериодРегистрации = &парамПериодРегистрации
										|               И   НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) = &парамПериодРегистрации) //Начислено в текущем месяце за этот месяц
										|               ИЛИ (НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) < НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			    И   БазаИзНачислений.ПериодРегистрации = &парамПериодРегистрации
										|               И   НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) = &парамПериодРегистрации) //Начислено в текущем месяце за предыдущий месяц
										|               ИЛИ (НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			    И   БазаИзНачислений.ПериодРегистрации < &парамПериодРегистрации
										|               И   НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) = &парамПериодРегистрации)) //Начислено в предыдущем месяце за текущий месяц
										|
										|           КОНЕЦ
										|";	
			Иначе
				ТекстФильтрПоПериодам = "			И	НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
										|			И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации";	
			КонецЕсли;
			
			//	Описание:
			// 		Альтернатива таблице РегистрРасчета.ВзносыВФонды.БазаНачисления(
			//
			ТекстЗапросаВТ = "
			|		ВЫБРАТЬ 
			|			Основной.Регистратор КАК Регистратор, 
			|			Основной.НомерСтроки КАК НомерСтроки, 
			|			Основной.ВидРасчета КАК ВидРасчета,
			|			Основной.Сотрудник КАК Сотрудник,
			|			Основной.ТипНачисления КАК ТипНачисления,
			|           ВЫБОР
			|            КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТМобилизованные)
			|            ТОГДА 4
			|			 ИНАЧЕ Основной.ВидРасчета.КатегорияРасчета.Порядок 
			|			КОНЕЦ КАК Порядок,
			|			Основной.Налог КАК Налог,
			|			НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) КАК БазовыйПериодНачало, 
			|			СУММА(ВЫБОР КОГДА БазаИзНачислений.ВидРасчета.ЭтоОтпускные И БазаИзНачислений.ПериодРегистрации = &парамПериодРегистрации ТОГДА БазаИзНачислений.Результат ИНАЧЕ 0 КОНЕЦ)	КАК РезультатБазаОтпускные, 
			|			СУММА(БазаИзНачислений.Результат)		КАК РезультатБаза 
			|ПОМЕСТИТЬ ВТБазы	
			|		ИЗ РегистрРасчета.ВзносыВФонды КАК Основной
			| 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
			|		ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
			|"+ТекстФильтрПоПериодам+"
			|  			" + ?(ТолькоПоДвижениямТекущегоДокумента," И БазаИзНачислений.Регистратор = &парамРегистратор", "") + "
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|		ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|			И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			| 
			|		ГДЕ Основной.Регистратор = &парамРегистратор
			|			И	Основной.Сотрудник В (&парамСотрудники)
			| 
			|		СГРУППИРОВАТЬ ПО 
			|			Основной.Регистратор, 
			|			Основной.НомерСтроки,
			|			Основной.ВидРасчета,
			|			Основной.Сотрудник,
			|			Основной.ТипНачисления,
			|           ВЫБОР
			|            КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТМобилизованные)
			|            ТОГДА 4
			|			 ИНАЧЕ Основной.ВидРасчета.КатегорияРасчета.Порядок 
			|			КОНЕЦ,
			|			Основной.Налог,
			|			НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) 
			| ";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТБазы = "ВТБазы";
		КонецЕсли; 
		
		// ВТБазыДо 
		Если Истина Тогда 
			
			Если ИспользуетсяЕСВ Тогда
				
				МассивПенсионный = Новый СписокЗначений();
				МассивПенсионный.Добавить(ПланыВидоврасчета.ВзносыВФонды.Пенсионный20050101);
				МассивПенсионный.Добавить(ПланыВидоврасчета.ВзносыВФонды.Пенсионный20070101);
				
				МассивПенсионныйФОТ = Новый СписокЗначений();
				МассивПенсионныйФОТ.Добавить(ПланыВидоврасчета.ВзносыВФонды.ПенсионныйФОТ20050101);
				
				Запрос.УстановитьПараметр("МассивПенсионный",МассивПенсионный);
				Запрос.УстановитьПараметр("МассивПенсионныйФОТ",МассивПенсионныйФОТ);
				Запрос.УстановитьПараметр("ДатаЕСВ",ДатаВводаЕСВ());
				
				
				//Здесь отбираем по принципу - если начисляется в 2011 году, и за этот период начислено еще в 2010,
				//то базу до определяем по пенсионному фонду
				ТекстФильтр = "			И ВЫБОР КОГДА НАЧАЛОПЕРИОДА(БазаИзВзносов.ПериодРегистрации, МЕСЯЦ) >= &ДатаЕСВ
							  |				ТОГДА Основной.Налог = БазаИзВзносов.Налог
							  |			  КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВ)
							  |				ТОГДА Основной.Налог = БазаИзВзносов.Налог ИЛИ БазаИзВзносов.ВидРасчета В (&МассивПенсионный)
							  |			  КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТ)
							  |				ТОГДА Основной.Налог = БазаИзВзносов.Налог ИЛИ БазаИзВзносов.ВидРасчета В (&МассивПенсионныйФОТ)
							  |				ИНАЧЕ Основной.Налог = БазаИзВзносов.Налог
							  |			КОНЕЦ";	
			Иначе
				ТекстФильтр = "			И	Основной.Налог = БазаИзВзносов.Налог";	
			КонецЕсли;
			
			//	Описание:
			// 		суммы уже начисленные ранее по анализируемым в расчете периодам
			//
			ТекстЗапросаВТ = "
			|		ВЫБРАТЬ 
			|			Основной.Регистратор КАК Регистратор,
			|			Основной.НомерСтроки КАК НомерСтроки,
			|			Основной.ВидРасчета КАК ВидРасчета,
			|			Основной.Сотрудник КАК Сотрудник,
			|			Основной.ТипНачисления КАК ТипНачисления,
			|           ВЫБОР
			|            КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТМобилизованные)
			|            ТОГДА 4
			|			 ИНАЧЕ Основной.ВидРасчета.КатегорияРасчета.Порядок 
			|			КОНЕЦ КАК Порядок,
			|			Основной.Налог КАК Налог,
			|			НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ) КАК БазовыйПериодНачало,
			|			СУММА(БазаИзВзносов.База)		КАК БазаДо, 
			|			СУММА(БазаИзВзносов.БазаВзноса)	КАК БазаВзносаДо 
			|ПОМЕСТИТЬ ВТБазыДо	
			|		ИЗ РегистрРасчета.ВзносыВФонды  КАК Основной
			| 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВзносыВФонды КАК БазаИзВзносов
			|		ПО		Основной.Сотрудник = БазаИзВзносов.Сотрудник  
			|"+ТекстФильтр+"
			|			И	НАЧАЛОПЕРИОДА(БазаИзВзносов.БазовыйПериодНачало, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
			|			И	БазаИзВзносов.ПериодРегистрации < &парамПериодРегистрации
			|  			" + ?(ТолькоПоДвижениямТекущегоДокумента," И БазаИзВзносов.Регистратор = &парамРегистратор", "") + "
			| 
			|		ГДЕ Основной.Регистратор = &парамРегистратор
			|			И	Основной.Сотрудник В (&парамСотрудники)
			| 
			|		СГРУППИРОВАТЬ ПО 
			|			Основной.Регистратор, 
			|			Основной.НомерСтроки,
			|			Основной.ВидРасчета,
			|			Основной.Сотрудник,
			|			Основной.ТипНачисления,
			|           ВЫБОР
			|            КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВФОТМобилизованные)
			|            ТОГДА 4
			|			 ИНАЧЕ Основной.ВидРасчета.КатегорияРасчета.Порядок 
			|			КОНЕЦ,
			|			Основной.Налог,
			|			НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, МЕСЯЦ)
			| ";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТБазыДо = "ВТБазыДо";
		КонецЕсли; 
		
				// ВТБазыВычет
		Если Истина Тогда
			
			//БазаВычет - база взносов ЕСВ, которая имеет более высокий порядок в расчете.
			//Для оплаты взносов с оплаты по ГПХ - это взносы с основной зарплаты
			//Для оплаты взносов с больничных - это взносы с основной зарплаты и взносы с оплаты по ГПХ
			//Используется при определении базы взноса с учетом общего Предела.
			//Т.е. предел при расчете будет уменьшен на сумму БазаВычет
			
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ
			|       Результаты.Регистратор КАК Регистратор, 
			|		Результаты.НомерСтроки КАК НомерСтроки, 
			|		СУММА(Результаты.Результат)		КАК РезультатБаза
			|ПОМЕСТИТЬ ВТБазыВычет
			|    ИЗ(
			|		ВЫБРАТЬ 
			|			Основной.Регистратор КАК Регистратор, 
			|			Основной.НомерСтроки КАК НомерСтроки, 
			|			База.РезультатБаза   КАК Результат 
			|		ИЗ ВТБазы КАК Основной
			| 
			|		ЛЕВОЕ СОЕДИНЕНИЕ 
			//Если по взносу есть База, то она будет включать в себя и БазуДо
			//Но если Базы в этом периоде нет, то БазуДо надо учесть все равно
			|			(ВЫБРАТЬ
			|			 ЕСТЬNULL(Базы.Регистратор,БазыДо.Регистратор) КАК Регистратор, 
			|			 ЕСТЬNULL(Базы.НомерСтроки,БазыДо.НомерСтроки) КАК НомерСтроки, 
			|			 ЕСТЬNULL(Базы.ВидРасчета,БазыДо.ВидРасчета) КАК ВидРасчета,
			|			 ЕСТЬNULL(Базы.ВидРасчета.СпособРасчета,БазыДо.ВидРасчета.СпособРасчета) КАК СпособРасчета,
			|			 ЕСТЬNULL(Базы.Порядок,БазыДо.Порядок) КАК Порядок,
			|			 ЕСТЬNULL(Базы.Сотрудник,БазыДо.Сотрудник) КАК Сотрудник,
			|			 ЕСТЬNULL(Базы.ТипНачисления,БазыДо.ТипНачисления) КАК ТипНачисления,
			|			 НАЧАЛОПЕРИОДА(ЕСТЬNULL(Базы.БазовыйПериодНачало,БазыДо.БазовыйПериодНачало), МЕСЯЦ) КАК БазовыйПериодНачало,
			|			 ВЫБОР 
			|			  КОГДА ЕСТЬNULL(Базы.РезультатБаза,0) <> 0 ТОГДА Базы.РезультатБаза
			|             ИНАЧЕ ЕСТЬNULL(БазыДо.БазаВзносаДо,0)
			|            КОНЕЦ КАК РезультатБаза
			|			 ИЗ ВТБазы КАК Базы
			|			 ПОЛНОЕ СОЕДИНЕНИЕ ВТБазыДо КАК БазыДо
			|			 ПО Базы.НомерСтроки = БазыДо.НомерСтроки ) КАК База 
			|		ПО Основной.Сотрудник = База.Сотрудник
			|        И Основной.БазовыйПериодНачало = База.БазовыйПериодНачало
			|		 И Основной.ВидРасчета.СпособРасчета = База.СпособРасчета
			|        И Основной.Порядок > База.Порядок
			|        И База.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВМобилизованные)
			|		) КАК Результаты	
			|			
			| 
			|		СГРУППИРОВАТЬ ПО 
			|			Результаты.Регистратор, 
			|			Результаты.НомерСтроки 
			| 
			|";
			
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТБазы = "ВТБазы";
		КонецЕсли; 

		// ВТБазыПолные
		Если Истина Тогда
			
			//БазаПолная - общая база взносов ЕСВ, за исключением взносов ГПХ
			//С 2016 - года - ГПХ тоже включается
			
			ТекстЗапросаВТ = "
			|ВЫБРАТЬ
			|	ЕСТЬNULL(Базы.Регистратор,БазыДо.Регистратор) КАК Регистратор, 
			|	ЕСТЬNULL(Базы.НомерСтроки,БазыДо.НомерСтроки) КАК НомерСтроки, 
			|	ЕСТЬNULL(Базы.ВидРасчета,БазыДо.ВидРасчета) КАК ВидРасчета,
			|	ЕСТЬNULL(Базы.ВидРасчета.СпособРасчета,БазыДо.ВидРасчета.СпособРасчета) КАК СпособРасчета,
			|	ЕСТЬNULL(Базы.ВидРасчета.КатегорияРасчета,БазыДо.ВидРасчета.КатегорияРасчета) КАК КатегорияРасчета,
			|	ЕСТЬNULL(Базы.Порядок,БазыДо.Порядок) КАК Порядок,
			|	ЕСТЬNULL(Базы.Налог,БазыДо.Налог) КАК Налог,
			|	ЕСТЬNULL(Базы.Сотрудник,БазыДо.Сотрудник) КАК Сотрудник,
			|	ЕСТЬNULL(Базы.ТипНачисления,БазыДо.ТипНачисления) КАК ТипНачисления,
			|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(Базы.БазовыйПериодНачало,БазыДо.БазовыйПериодНачало), МЕСЯЦ) КАК БазовыйПериодНачало,
			|	ВЫБОР 
			|	  КОГДА ЕСТЬNULL(Базы.РезультатБаза,0) <> 0 ТОГДА Базы.РезультатБаза
			|     ИНАЧЕ ЕСТЬNULL(БазыДо.БазаДо,0)
			|   КОНЕЦ КАК РезультатБаза
			|ПОМЕСТИТЬ ВТБазыИБазыДо
			|ИЗ ВТБазы КАК Базы
			|	ПОЛНОЕ СОЕДИНЕНИЕ ВТБазыДо КАК БазыДо
			|	ПО Базы.НомерСтроки = БазыДо.НомерСтроки
			|;
			|
			|	ВЫБРАТЬ
			|       Результаты.Регистратор КАК Регистратор, 
			|		Результаты.НомерСтроки КАК НомерСтроки, 
			|		СУММА(Результаты.Результат)		КАК РезультатБаза
			|ПОМЕСТИТЬ ВТБазыПолные
			|    ИЗ(
			|		ВЫБРАТЬ 
			|			Основной.Регистратор КАК Регистратор, 
			|			Основной.НомерСтроки КАК НомерСтроки, 
			|			База.Порядок   КАК Порядок, 
			|			МАКСИМУМ(База.РезультатБаза)   КАК Результат 
			|		ИЗ ВТБазыИБазыДо КАК Основной
			| 
			|		ЛЕВОЕ СОЕДИНЕНИЕ 
			|		ВТБазыИБазыДо КАК База 
			|		ПО Основной.Сотрудник = База.Сотрудник
			|        И Основной.БазовыйПериодНачало = База.БазовыйПериодНачало
			|		 И Основной.СпособРасчета = База.СпособРасчета
			|		 И База.Налог  <> ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТМобилКомп) 
			|		 И (&ИсползуетсяЕСВ3688 
			|		  ИЛИ
			//Не считаем базу для ЕСВ с ГПХ и не учитываем ее в самой базе
			|        (Основной.КатегорияРасчета <>  ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПервогоУровня)
			|        И База.КатегорияРасчета <>  ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПервогоУровня)))
			|		СГРУППИРОВАТЬ ПО Основной.Регистратор,Основной.НомерСтроки,База.Порядок   	
			|		) КАК Результаты	
			|			
			| 
			|		СГРУППИРОВАТЬ ПО 
			|			Результаты.Регистратор, 
			|			Результаты.НомерСтроки 
			| 
			|";
			
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли; 
		
		//	ВТКоэффициентыСтавкиВзносовФОТ
		Если Истина Тогда
			ТекстЗапросаВТ = "
 			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
 			|	КоэффициентыСтавкиВзносовФОТ.КоэффициентСтавки
			|ПОМЕСТИТЬ ВТКоэффициентыСтавкиВзносовФОТ
			|ИЗ
 			|	РегистрСведений.КоэффициентыСтавкиВзносовФОТ КАК КоэффициентыСтавкиВзносовФОТ
			|ГДЕ
			|	КоэффициентыСтавкиВзносовФОТ.Организация = &парамОрганизация
			|	И КоэффициентыСтавкиВзносовФОТ.МесяцНачисления = &парамПериодРегистрации
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТКоэффициентыСтавкиВзносовФОТ = "ВТКоэффициентыСтавкиВзносовФОТ";
		КонецЕсли;
		
		//	ВТПолнаяШкалаПоМесяцуРегистрации
		Если Истина Тогда
			//	Описание:
			// 		Тут получаем все Параметры таблицы ШкалаСтавокНалогов сгруппированые по Налоговым пеиодам
			// 		Так как налог одновременно не может быть и для всех организация и для одно достаточно вытащить все с пустой орг. и по текущей
			//
			ТекстЗапросаВТ = "
 			|		ВЫБРАТЬ 
 			|			ВсяШкала.Налог			КАК Налог,
 			|			ВсяШкала.Период			КАК Период,
 			|			ВсяШкала.Организация	КАК Организация,
 			|			ВсяШкала.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
 			|			ВсяШкала.Ставка						КАК Ставка,
 			|			ВсяШкала.СтавкаПолная				КАК СтавкаПолная,
 			|			ЕСТЬNULL(ШкалаНижнийПорог.Порог,0)	КАК НижнийПорог,
 			|			ВсяШкала.Порог						КАК Порог,
 			|			ВсяШкала.НомерПорога				КАК НомерПорога,
 			|			ВсяШкала.НомерПорога.Порядок		КАК НомерПорогаПорядок,
 			|			ВсяШкала.НижнийНомерПорогаПорядок	КАК НижнийНомерПорогаПорядок,
 			|			ШкалаНижнийПорог.НомерПорога		КАК НижнийНомерПорога
			|ПОМЕСТИТЬ ВТПолнаяШкалаПоМесяцуРегистрации	
 			|		ИЗ (	ВЫБРАТЬ 
 			|					ШкалаПериодОрганизация.Налог		КАК Налог,
 			|					ШкалаПериодОрганизация.Период		КАК Период,
 			|					ШкалаПериодОрганизация.Организация	КАК Организация,
 			|					Шкала.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
 			|					Шкала.Ставка					КАК Ставка,
 			|					Шкала.СтавкаПолная				КАК СтавкаПолная,			
 			|					Шкала.Порог						КАК Порог,
 			|					Шкала.НомерПорога				КАК НомерПорога,
 			|					Шкала.НомерПорога.Порядок		КАК НомерПорогаПорядок,
 			|					МАКСИМУМ(ШкалаНижнийПорог.НомерПорога.Порядок)  КАК НижнийНомерПорогаПорядок
 			|				ИЗ (
 			|						ВЫБРАТЬ 
 			|							ШкалаСтавок.Налог	КАК Налог,
 			|							ШкалаСтавок.Период	КАК Период,
 			|							МАКСИМУМ(ШкалаСтавок.Организация)	КАК Организация
 			|						ИЗ (
 			|							ВЫБРАТЬ 
 			|								ШкалаСтавокНалогов.Налог							КАК Налог,
 			|								МАКСИМУМ(ШкалаСтавокНалогов.Период)				КАК Период
 			|							ИЗ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавокНалогов
 			|							ГДЕ		ШкалаСтавокНалогов.Период  <= КОНЕЦПЕРИОДА( &парамПериодРегистрации, МЕСЯЦ )
 			|								И	(ШкалаСтавокНалогов.Организация = (&парамОрганизация) ИЛИ ШкалаСтавокНалогов.Организация =  ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
 			|							СГРУППИРОВАТЬ ПО
 			|					   			ШкалаСтавокНалогов.Налог
 			|					   	) КАК ШкалаСтавокПериод
 			|					   	
 			|					   	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавок	
 			|					   	ПО		ШкалаСтавокПериод.Налог = ШкалаСтавок.Налог	   	
 			|					   		И	ШкалаСтавокПериод.Период = ШкалаСтавок.Период
 			|					 		И	(ШкалаСтавок.Организация = (&парамОрганизация) ИЛИ ШкалаСтавок.Организация =  ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
 			|							
 			|						СГРУППИРОВАТЬ ПО
 			|					   		ШкалаСтавок.Налог,
 			|					   		ШкалаСтавок.Период
 			|				) КАК ШкалаПериодОрганизация
 			|				   
 			|				   
 			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК Шкала	
 			|				ПО		ШкалаПериодОрганизация.Налог = Шкала.Налог	   	
 			|					И	ШкалаПериодОрганизация.Период = Шкала.Период
 			|					И	ШкалаПериодОрганизация.Организация = Шкала.Организация

 			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаНижнийПорог	
 			|				ПО		ШкалаПериодОрганизация.Налог = ШкалаНижнийПорог.Налог	   	
 			|					И	ШкалаПериодОрганизация.Период = ШкалаНижнийПорог.Период
 			|					И	ШкалаПериодОрганизация.Организация = ШкалаНижнийПорог.Организация
 			|					И	ШкалаНижнийПорог.НомерПорога.Порядок < Шкала.НомерПорога.Порядок

 			|			 	СГРУППИРОВАТЬ ПО 
 			|					ШкалаПериодОрганизация.Налог,
 			|					ШкалаПериодОрганизация.Период,
 			|					ШкалаПериодОрганизация.Организация,
 			|					Шкала.СтатьяНалоговойДекларации,
 			|					Шкала.Ставка,
 			|					Шкала.СтавкаПолная,			
 			|					Шкала.Порог,
 			|					Шкала.НомерПорога,
 			|					Шкала.НомерПорога.Порядок
 			|	) КАК ВсяШкала

 			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаНижнийПорог	
 			|	ПО		ВсяШкала.Налог = ШкалаНижнийПорог.Налог	   	
 			|	И	ВсяШкала.Период = ШкалаНижнийПорог.Период
 			|	И	ВсяШкала.Организация = ШкалаНижнийПорог.Организация
 			|	И	ШкалаНижнийПорог.НомерПорога.Порядок = ВсяШкала.НижнийНомерПорогаПорядок
			|
			|	ИНДЕКСИРОВАТЬ ПО
			|		 Налог, НомерПорогаПорядок 
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТПолнаяШкалаПоМесяцуРегистрации = "ВТПолнаяШкалаПоМесяцуРегистрации";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПолнаяШкалаПоМесяцуРегистрации";
		
		//	ВТПолнаяШкала
		Если Истина Тогда
			
			//	ВТМесяцыДляАнализа
			Если Истина Тогда
				//	Описание:
				// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
				// 		сгруппированные по периодам действия
				//
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		Взносы.Налог										КАК Налог,    
				|		НАЧАЛОПЕРИОДА(Взносы.БазовыйПериодНачало, МЕСЯЦ)	КАК НалоговыйПериод,    
				|		Взносы.ДатаНачала									КАК ДатаНачала    
				|
				|ПОМЕСТИТЬ ВТМесяцыДляАнализа	
				|	ИЗ	РегистрРасчета.ВзносыВФонды КАК Взносы
				|	ГДЕ		Взносы.Регистратор = &парамРегистратор
				|		И	Взносы.Сотрудник в ( &парамСотрудники )
				|
				|	ИНДЕКСИРОВАТЬ ПО
				|		Налог, НалоговыйПериод, ДатаНачала
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТМесяцыДляАнализа = "ВТМесяцыДляАнализа";
			КонецЕсли;
			
			//	ВТШкалаПоНалоговымПериодам
			Если Истина Тогда
				//	Описание:
				// 		Тут получаем все Параметры таблицы ШкалаСтавокНалогов сгруппированые по Налоговым пеиодам
				// 		Так как налог одновременно не может быть и для всех организация и для одно достаточно вытащить все с пустой орг. и по текущей
				//
				ТекстЗапросаВТ = "
				|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				|       ШкалаПоНалоговымПериодам.Налог				КАК Налог,
				|		ШкалаПоНалоговымПериодам.НалоговыйПериод	КАК НалоговыйПериод,    
				|		ВЫБОР КОГДА ШкалаПоНалоговымПериодам.НалоговыйПериод < Шкала.Период ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ	КАК ИзменениеСтавкиВСерединеМесяца,    
				|		ШкалаПоНалоговымПериодам.ДатаНачала			КАК ДатаНачала,    
				|		ШкалаПоНалоговымПериодам.Организация		КАК Организация,    
				|       Шкала.НомерПорога							КАК НомерПорога,
				|       Шкала.НомерПорога.Порядок					КАК НомерПорогаПорядок,
				|       Шкала.СтатьяНалоговойДекларации				КАК СтатьяНалоговойДекларации,
				|       Шкала.Ставка								КАК Ставка,
				|       Шкала.СтавкаПолная							КАК СтавкаПолная,
				|       Шкала.Порог									КАК Порог
				|
				|ПОМЕСТИТЬ ВТШкалаПоНалоговымПериодам	
				|   ИЗ  (
				|		ВЫБРАТЬ
				|			Месяцы1.НалоговыйПериод				КАК НалоговыйПериод,    
				|			Месяцы1.Налог						КАК Налог,
				|			Месяцы1.ДатаНачала					КАК ДатаНачала,
				|			Месяцы1.Период						КАК Период,
				|			МАКСИМУМ(ШкалаСтавокНалогов.Организация)		КАК Организация  
				|			ИЗ	(
				|			ВЫБРАТЬ
				|				Месяцы.НалоговыйПериод				КАК НалоговыйПериод,    
				|				Месяцы.Налог						КАК Налог,
				|				Месяцы.ДатаНачала					КАК ДатаНачала,
				|				МАКСИМУМ(ШкалаСтавокНалогов.Период)	КАК Период
				|				ИЗ	" + ТекстЗапросаВТМесяцыДляАнализа + " КАК Месяцы
				|
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавокНалогов
				|			ПО		Месяцы.Налог = ШкалаСтавокНалогов.Налог
				|				И	ШкалаСтавокНалогов.Период <= Месяцы.ДатаНачала
				|				И	ШкалаСтавокНалогов.Период <= КОНЕЦПЕРИОДА(&ПарамПериодРегистрации, МЕСЯЦ)
				|       		И	(ШкалаСтавокНалогов.Организация = (&парамОрганизация) ИЛИ ШкалаСтавокНалогов.Организация = (&ПустаяОрганизация)) 
				|
				|			СГРУППИРОВАТЬ ПО
				|				Месяцы.НалоговыйПериод,    
				|				Месяцы.Налог,
				|				Месяцы.ДатаНачала
				|   	) КАК Месяцы1
				|
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК ШкалаСтавокНалогов
				|		ПО		Месяцы1.Налог = ШкалаСтавокНалогов.Налог
				|			И	ШкалаСтавокНалогов.Период = Месяцы1.Период
				|       	И	(ШкалаСтавокНалогов.Организация = (&парамОрганизация) ИЛИ ШкалаСтавокНалогов.Организация = (&ПустаяОрганизация)) 
				|
				|		СГРУППИРОВАТЬ ПО
				|			Месяцы1.НалоговыйПериод,    
				|			Месяцы1.Налог,
				|			Месяцы1.ДатаНачала,
				|			Месяцы1.Период
				|   ) КАК ШкалаПоНалоговымПериодам
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов КАК Шкала
				|	ПО		ШкалаПоНалоговымПериодам.Налог			= Шкала.Налог
				|		И	ШкалаПоНалоговымПериодам.Организация	= Шкала.Организация 
				|		И	ШкалаПоНалоговымПериодам.Период = Шкала.Период 
				|
				|	ИНДЕКСИРОВАТЬ ПО
				|		НалоговыйПериод
				|";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТШкалаПоНалоговымПериодам = "ВТШкалаПоНалоговымПериодам";
			КонецЕсли;
			
			//	Описание:
			// 		Тут получаем все Параметры таблицы ШкалаСтавокНалогов сгруппированые по Налоговым пеиодам
			// 		Так как налог одновременно не может быть и для всех организация и для одно достаточно вытащить все с пустой орг. и по текущей
			//
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ
			|      	ШкалаСтавок.Налог							КАК Налог,
			|		ШкалаСтавок.НалоговыйПериод					КАК НалоговыйПериод,    
			|      	ШкалаСтавок.ДатаНачала						КАК ДатаНачала,
			|      	ШкалаСтавок.НомерПорога						КАК НомерПорога,
			|      	ШкалаСтавок.СтатьяНалоговойДекларации		КАК СтатьяНалоговойДекларации,
			|		ШкалаСтавок.ИзменениеСтавкиВСерединеМесяца	КАК ИзменениеСтавкиВСерединеМесяца,    
			|      	ШкалаСтавок.Ставка							КАК Ставка,
			|      	ШкалаСтавок.СтавкаПолная					КАК СтавкаПолная,
			|      	ШкалаСтавок.Порог							КАК Порог,
			|		ВЫБОР КОГДА НижнийШкала.НомерПорога ЕСТЬ NULL ТОГДА 0 ИНАЧЕ НижнийШкала.Порог КОНЕЦ	КАК НижнийПорог  
			|
			|ПОМЕСТИТЬ ВТПолнаяШкала	
			|   ИЗ  (
			|		ВЫБРАТЬ
			|       	ШкалаСтавок.Налог							КАК Налог,
			|			ШкалаСтавок.НалоговыйПериод					КАК НалоговыйПериод,    
			|       	ШкалаСтавок.ДатаНачала						КАК ДатаНачала,
			|       	ШкалаСтавок.НомерПорога						КАК НомерПорога,
			|       	ШкалаСтавок.НомерПорогаПорядок				КАК НомерПорогаПорядок,
			|       	ШкалаСтавок.СтатьяНалоговойДекларации		КАК СтатьяНалоговойДекларации,
			|			ШкалаСтавок.ИзменениеСтавкиВСерединеМесяца	КАК ИзменениеСтавкиВСерединеМесяца,    
			|       	ШкалаСтавок.Ставка							КАК Ставка,
			|       	ШкалаСтавок.СтавкаПолная					КАК СтавкаПолная,			
			|       	ШкалаСтавок.Порог							КАК Порог,
			|			МАКСИМУМ(Шкала.ДатаНачала)				КАК НижнийДатаНачала,  
			|			МАКСИМУМ(Шкала.НомерПорогаПорядок) 		КАК НижнийНомерПорогаПорядок  
			|			ИЗ " + ТекстЗапросаВТШкалаПоНалоговымПериодам + " КАК ШкалаСтавок
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШкалаПоНалоговымПериодам + " КАК Шкала
			|		ПО		ШкалаСтавок.НалоговыйПериод = Шкала.НалоговыйПериод
			|			И	ШкалаСтавок.Налог = Шкала.Налог 
			|       	И	ШкалаСтавок.ДатаНачала >= Шкала.ДатаНачала 
			|       	И	ШкалаСтавок.НомерПорогаПорядок > Шкала.НомерПорогаПорядок 
			|		СГРУППИРОВАТЬ ПО
			|       	ШкалаСтавок.Налог,
			|			ШкалаСтавок.НалоговыйПериод,    
			|       	ШкалаСтавок.ДатаНачала,
			|       	ШкалаСтавок.НомерПорога,
			|       	ШкалаСтавок.НомерПорогаПорядок,
			|       	ШкалаСтавок.СтатьяНалоговойДекларации,
			|			ШкалаСтавок.ИзменениеСтавкиВСерединеМесяца,    
			|       	ШкалаСтавок.Ставка,
			|       	ШкалаСтавок.СтавкаПолная,
			|       	ШкалаСтавок.Порог
			|   ) КАК ШкалаСтавок
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТШкалаПоНалоговымПериодам + " КАК НижнийШкала
			|	ПО		ШкалаСтавок.НалоговыйПериод		= НижнийШкала.НалоговыйПериод
			|		И	ШкалаСтавок.Налог				= НижнийШкала.Налог
			|		И	ШкалаСтавок.НижнийНомерПорогаПорядок	= НижнийШкала.НомерПорогаПорядок
			|		И	ШкалаСтавок.НижнийДатаНачала	= НижнийШкала.ДатаНачала 
			|
			|	ИНДЕКСИРОВАТЬ ПО
			|		 НалоговыйПериод, Налог, НомерПорога 
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТПолнаяШкала = "ВТПолнаяШкала";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПолнаяШкала";
		
		
		// присоединяем к базе
		Если КомментироватьРасчет Тогда
			
			// ВТБазыСКоментарием
			Если Истина Тогда
				//	Описание:
				// 		Альтернатива таблице РегистрРасчета.ВзносыВФонды.БазаНачисления(
				//
				ТекстЗапросаВТ = "
				|		ВЫБРАТЬ 
				|			Основной.Регистратор КАК Регистратор, 
				|			Основной.НомерСтроки КАК НомерСтроки, 
				|			БазаИзНачислений.ВидРасчета КАК ВидРасчетаРазрез,
				|			ВЫБОР КОГДА БазаИзНачислений.Результат >= 0 ТОГДА 1 ИНАЧЕ -1 КОНЕЦ КАК Знак,
				|			СУММА(ВЫБОР КОГДА БазаИзНачислений.ВидРасчета.ЭтоОтпускные И БазаИзНачислений.ПериодРегистрации = &парамПериодРегистрации ТОГДА БазаИзНачислений.Результат ИНАЧЕ 0 КОНЕЦ)	КАК РезультатБазаОтпускные,
				|			СУММА(БазаИзНачислений.Результат)		КАК РезультатБаза 
				|ПОМЕСТИТЬ ВТБазыСКоментарием	
				|		ИЗ РегистрРасчета.ВзносыВФонды КАК Основной
				| 
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
				|		ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				| "+ТекстФильтрПоПериодам+"
				|  			" + ?(ТолькоПоДвижениямТекущегоДокумента," И БазаИзНачислений.Регистратор = &парамРегистратор", "") + "
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|		ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|			И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				| 
				|		ГДЕ 	Основной.Регистратор = &парамРегистратор
				|			И	Основной.Сотрудник В (&парамСотрудники)
				| 
				|		СГРУППИРОВАТЬ ПО 
				|			Основной.Регистратор, 
				|			Основной.НомерСтроки, 
				|			БазаИзНачислений.ВидРасчета,
				|			ВЫБОР КОГДА БазаИзНачислений.Результат >= 0 ТОГДА 1 ИНАЧЕ -1 КОНЕЦ
				| ";
				Запрос.Текст = ТекстЗапросаВТ;
				Запрос.Выполнить();
				ТекстЗапросаВТБазыСКоментарием = "ВТБазыСКоментарием";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТБазы+" КАК Баз
			|ПО Основной.Регистратор = Баз.Регистратор И Основной.НомерСтроки = Баз.НомерСтроки
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТБазыВычет КАК БазВычет
			|ПО Основной.Регистратор = БазВычет.Регистратор И Основной.НомерСтроки = БазВычет.НомерСтроки
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТБазыПолные КАК БазПолные
			|ПО Основной.Регистратор = БазПолные.Регистратор И Основной.НомерСтроки = БазПолные.НомерСтроки
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТБазыСКоментарием+" КАК БазСКоментарием
			|ПО Основной.Регистратор = БазСКоментарием.Регистратор И Основной.НомерСтроки = БазСКоментарием.НомерСтроки
			|";
		Иначе
	
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТБазы+" КАК Баз
			|ПО Основной.Регистратор = Баз.Регистратор И Основной.НомерСтроки = Баз.НомерСтроки
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТБазыВычет КАК БазВычет
			|ПО Основной.Регистратор = БазВычет.Регистратор И Основной.НомерСтроки = БазВычет.НомерСтроки
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТБазыПолные КАК БазПолные
			|ПО Основной.Регистратор = БазПолные.Регистратор И Основной.НомерСтроки = БазПолные.НомерСтроки";
			
		КонецЕсли;
				
		// присоединяем к базе
		Мод = "ВЫБОР КОГДА Рез<0 ТОГДА -Рез ИНАЧЕ Рез КОНЕЦ";
		ТекстЗапроса = ТекстЗапроса + "
		|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТБазыДо+" КАК БазДо
		|ПО Основной.НомерСтроки = БазДо.НомерСтроки
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПолнаяШкалаПоМесяцуРегистрации + " Как ВсеВзносыПоМесяцуРегистрации
		|ПО		Основной.Налог		= ВсеВзносыПоМесяцуРегистрации.Налог 
		|	И ( Основной.НомерПорога <> ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.ПустаяСсылка) И Основной.НомерПорога = ВсеВзносыПоМесяцуРегистрации.НомерПорога
		|		ИЛИ	Основной.НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.ПустаяСсылка)
		|		И	("+СтрЗаменить (Мод,"Рез","ЕСТЬNULL(Баз.РезультатБаза, 0)")+" > ВсеВзносыПоМесяцуРегистрации.НижнийПорог ИЛИ ВсеВзносыПоМесяцуРегистрации.НижнийПорог = 0 ) 
		|		И	"+СтрЗаменить (Мод,"Рез","ЕСТЬNULL(Баз.РезультатБаза, 0)")+" <= ВсеВзносыПоМесяцуРегистрации.Порог
		|        )
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТПолнаяШкала + " Как ВсеВзносы
		|ПО		Основной.Налог		= ВсеВзносы.Налог 
		|	И	Основной.ДатаНачала	= ВсеВзносы.ДатаНачала 
		|   И ВЫБОР КОГДА Основной.НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.ПустаяСсылка)
		|           ТОГДА ( "+СтрЗаменить (Мод,"Рез","Баз.РезультатБаза")+" > ВсеВзносы.НижнийПорог 
		|           И "+СтрЗаменить (Мод,"Рез","Баз.РезультатБаза")+" <= ВсеВзносы.Порог )
		|           ИНАЧЕ Основной.НомерПорога = ВсеВзносы.НомерПорога  КОНЕЦ
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТКоэффициентыСтавкиВзносовФОТ + " Как КоэффициентыСтавкиВзносовФОТ
		|ПО		Основной.Налог.Родитель	= ЗНАЧЕНИЕ(Справочник.Налоги.ВзносыФОТ) 
		|";
		
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ " + ВнешнееУсловие;
	КонецЕсли;
		
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО НомерСтроки";
	Если (НеобходимаБаза ИЛИ НеобходимыеДанные.ИндексацияЗарплаты ИЛИ НеобходимыеДанные.ИндексацияСоциальныхНачислений ИЛИ НеобходимыеДанные.ДоплатаДоМЗП) И КомментироватьРасчет Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ИТОГИ";
		Для Каждого Поле Из ПоляЗапросаМаксимум Цикл
			ТекстЗапроса = ТекстЗапроса + "
			|	МАКСИМУМ(" + Поле + "),";
			Зпт = ",";
		КонецЦикла;
		Для Каждого Поле Из ПоляЗапросаСумма Цикл
			ТекстЗапроса = ТекстЗапроса + "
			|	СУММА(" + Поле + "),";
			Зпт = ",";
		КонецЦикла;
		ТекстЗапроса = ТекстЗапроса + "
		|	СУММА(РезультатБаза)";
		Если НеобходимыеДанные.ИндексацияЗарплаты ИЛИ НеобходимыеДанные.ДоплатаДоМЗП Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	МАКСИМУМ(ОтработаноДнейБаза),
			|	МАКСИМУМ(ОтработаноЧасовБаза)";
		КонецЕсли;	
		ТекстЗапроса = ТекстЗапроса + "
		|ПО
		|	НомерСтроки";
	КонецЕсли;
	
	Если	ИмяРегистра = "Начисления" Тогда
		// измерения сопоставления
		Измерения = Новый Массив(2);
		Измерения[0] = "Организация";     
		Измерения[1] = "Сотрудник";
		// для начислений сопоставляемые измерения основного и базового регистов совпадают
		Запрос.УстановитьПараметр("парамИзмеренияОсновного", Измерения);
		Запрос.УстановитьПараметр("парамИзмеренияБазового", Измерения);
		// для начислений сопоставляемые измерения основного и базового регистов совпадают
		// измерения сопоставления
		Измерения = Новый Массив(3);
		Измерения[0] = "Организация";     
		Измерения[1] = "Сотрудник";
		Измерения[2] = "Назначение";
		Запрос.УстановитьПараметр("парамИзмеренияОсновногоНазначения", Измерения);
		Запрос.УстановитьПараметр("парамИзмеренияБазовогоНазначения", Измерения);
		// список способов расчета, являющихся почасовыми отклонениями
		Запрос.УстановитьПараметр("парамСписокПочасовыхОтклонений", ПолучитьСписокНачисленийПочасовыхОтклонений());
		
	ИначеЕсли	ИмяРегистра = "УправленческиеНачисления" ИЛИ
				ИмяРегистра = "УправленческиеУдержания"
		Тогда
		// измерения сопоставления для управленческих регистров
		Измерения = Новый Массив(1);
		Измерения[0] = "Физлицо";
		// для начислений сопоставляемые измерения основного и базового регистов совпадают
		Запрос.УстановитьПараметр("парамИзмеренияОсновного", Измерения);
		Запрос.УстановитьПараметр("парамИзмеренияБазового", Измерения);
		
	Иначе
		// измерения сопоставления для удержаний
		Измерения = Новый Массив(1);
		Измерения[0] = "Сотрудник";
		//Измерения[1] = "Организация";
		// для удержаний сопоставляемые измерения основного и базового регистов разные
		Запрос.УстановитьПараметр("парамИзмеренияОсновного", Измерения);
		Запрос.УстановитьПараметр("парамИзмеренияБазового", Измерения);
		
	КонецЕсли;
	
	ПроцентныеПоказатели = Новый Массив;
	ПроцентныеПоказатели.Добавить(Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная);
	ПроцентныеПоказатели.Добавить(Перечисления.ТипыПоказателейСхемМотивации.Процентный);
	Запрос.УстановитьПараметр("ПроцентныеПоказатели", ПроцентныеПоказатели);
	
	ШкальныеПоказатели = Новый Массив;
	ШкальныеПоказатели.Добавить(Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная);
	ШкальныеПоказатели.Добавить(Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая);
	Запрос.УстановитьПараметр("ШкальныеПоказатели", ШкальныеПоказатели);				
	
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьДанныеДляРасчета()

Функция ПолучитьДанныеДляРасчетаСторноВзносовВФонды( Регистратор, ЭтоВзносы , Сотрудники = НеОпределено, КомментироватьРасчет = Ложь, ФормаКомментариев = НеОпределено)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамРегистратор",		Регистратор);
	Запрос.УстановитьПараметр("парамОрганизация",		Регистратор.Организация );
	Запрос.УстановитьПараметр("парамПериодРегистрации",	Регистратор.ПериодРегистрации );
	Запрос.УстановитьПараметр("парамСотрудники",		Сотрудники);
	Запрос.УстановитьПараметр("парамСпособРасчета", ?(ЭтоВзносы, Перечисления.СпособыРасчетаОплатыТруда.Взносы, Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ));
	
	//	ВТВзносыРегистратора
	Если Истина Тогда
		//	Описание:
		// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Основной.НомерСтрокиТЧ				КАК НомерСтрокиТЧ, 
		|		Основной.НомерСтроки				КАК НомерСтроки, 
		|		Основной.Сотрудник					КАК Сотрудник, 
		|		Основной.Налог						КАК Налог, 
		|		Основной.НомерПорога        		КАК НомерПорога, 
		|		Основной.БазовыйПериодНачало		КАК БазовыйПериодНачало, 
		|		Основной.ВидРасчета				 	Как ВидРасчета, 
		|		Основной.Предел                   	Как Предел, 
		|		Основной.Ставка                   	Как Ставка, 
		|		Основной.СтатьяНалоговойДекларации  КАК СтатьяНалоговойДекларации, 
		|		Основной.ДатаНачала        			КАК ДатаНачала, 
		|		Основной.ДатаОкончания        		КАК ДатаОкончания 
		|
		|ПОМЕСТИТЬ ВТВзносыРегистратора	
		|
		|	ИЗ РегистрРасчета.ВзносыВФонды КАК Основной
		|	ГДЕ		Основной.Регистратор = &парамРегистратор
		|		И	Основной.Сотрудник В (&парамСотрудники)
		|		И	Основной.ВидРасчета.СпособРасчета = &парамСпособРасчета
		|
		|	ИНДЕКСИРОВАТЬ ПО
		|		Сотрудник, Налог, НомерПорога
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТВзносыРегистратора = "ВТВзносыРегистратора";
	КонецЕсли;
	
	//	ВТРаботникиПоПериодамИНалоги
	Если Истина Тогда
		//	Описание:
		// 		Сотрудники по которым есть зарегистрированные записи по начислениям в периодеРегистрации 
		// 		сгруппированные по периодам действия
		//
		ТекстЗапроса = "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Основной.ПериодРегистрации		КАК ПериодРегистрации, 
		|		Основной.Организация			КАК Организация, 
		|		Основной.Сотрудник				КАК Сотрудник, 
		|		Основной.Налог					КАК Налог, 
		|		Основной.БазовыйПериодНачало	КАК БазовыйПериодНачало, 
		|		Основной.БазовыйПериодКонец		КАК БазовыйПериодКонец 
		|
		|ПОМЕСТИТЬ ВТРаботникиПоПериодамИНалоги	
		|	ИЗ РегистрРасчета.ВзносыВФонды КАК Основной
		|
		|	ГДЕ		Основной.Регистратор = &парамРегистратор
		|		И	Основной.Сотрудник В (&парамСотрудники)
		|		И	Основной.Авторасчет
		|
		|	ИНДЕКСИРОВАТЬ ПО
		|		Сотрудник,
		|		Налог,
		|		БазовыйПериодНачало
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		ТекстЗапросаВТРаботникиПоПериодамИНалоги = "ВТРаботникиПоПериодамИНалоги";
	КонецЕсли;
	
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	ИСТИНА			 	  			КАК Сторно, 
	|	ИСТИНА							КАК Авторасчет, 
	|	Основной.ПериодРегистрации  	КАК ПериодРегистрации, 
	|	Основной.Организация  			КАК Организация, 
	|	Основной.Сотрудник 	  			КАК Сотрудник, 
	|	Основной.Налог                  КАК Налог, 
	|	Основной.БазовыйПериодНачало	КАК БазовыйПериодНачало, 
	|	Основной.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
	|
	|	ВзносыДо.ВидРасчета				 			Как ВидРасчета, 
	|	ВзносыДо.ВидРасчета.Наименование 			Как ВидРасчетаНаименование, 
	|	ВзносыДо.Предел                   			Как Предел, 
	|	ВзносыДо.Ставка                   			Как Ставка, 
	|	ВзносыДо.СтатьяНалоговойДекларации        	КАК СтатьяНалоговойДекларации, 
	|	ВзносыДо.НомерПорога        				КАК НомерПорога, 
	|	ВзносыДо.ДатаНачала        					КАК ДатаНачала, 
	|	ВзносыДо.ДатаОкончания        				КАК ДатаОкончания,
	|
	|	ВзносыРегистратора.НомерСтроки        		КАК НомерСтрокиРегистратора, 
	|	ВзносыРегистратора.НомерСтрокиТЧ        	КАК НомерСтрокиТЧ, 
	|
	|	-ВзносыДо.База			КАК База, 
	|	-ВзносыДо.БазаВзноса	КАК БазаВзноса, 
	|	-ВзносыДо.Результат		КАК Результат, 
	|	-ВзносыДо.РезультатУпр	КАК РезультатУпр 
	| 
	|	ИЗ " + ТекстЗапросаВТРаботникиПоПериодамИНалоги + " КАК Основной
	| 
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ (
	|		ВЫБРАТЬ 
	|			ВзносыВФонды.Сотрудник                  КАК Сотрудник, 
	|			ВзносыВФонды.Налог        				КАК Налог, 
	|			ВзносыВФонды.БазовыйПериодНачало		КАК БазовыйПериодНачало, 
	|			ВзносыВФонды.ВидРасчета        			КАК ВидРасчета, 
	|			ВзносыВФонды.Предел        				КАК Предел, 
	|			ВзносыВФонды.Ставка						КАК Ставка, 
	|			ВзносыВФонды.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации, 
	|			ВзносыВФонды.НомерПорога        		КАК НомерПорога, 
	|			ВзносыВФонды.ДатаНачала        			КАК ДатаНачала, 
	|			ВзносыВФонды.ДатаОкончания        		КАК ДатаОкончания, 
	|			СУММА(ВзносыВФонды.База)        КАК База, 
	|			СУММА(ВзносыВФонды.БазаВзноса)	КАК БазаВзноса, 
	|			СУММА(ВзносыВФонды.Результат)	КАК Результат, 
	|			СУММА(ВзносыВФонды.РезультатУпр)	КАК РезультатУпр
	|
	|		ИЗ РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|
	|		ГДЕ ВзносыВФонды.ПериодРегистрации < &парамПериодРегистрации
	|		И	ВзносыВФонды.Регистратор <> &парамРегистратор
	|		И	ВзносыВФонды.Организация = &парамОрганизация
	|		И	ВзносыВФонды.Сотрудник В (&парамСотрудники)
	|		И	НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало, МЕСЯЦ) В (ВЫБРАТЬ РАЗЛИЧНЫЕ Периоды.БазовыйПериодНачало ИЗ " + ТекстЗапросаВТРаботникиПоПериодамИНалоги + " КАК Периоды )
	|		И	ВзносыВФонды.ВидРасчета.СпособРасчета = &парамСпособРасчета
	|
	|		СГРУППИРОВАТЬ ПО
	|			ВзносыВФонды.Сотрудник, 
	|			ВзносыВФонды.Налог, 
	|			ВзносыВФонды.БазовыйПериодНачало, 
	|			ВзносыВФонды.ВидРасчета, 
	|			ВзносыВФонды.Предел, 
	|			ВзносыВФонды.Ставка, 
	|			ВзносыВФонды.СтатьяНалоговойДекларации, 
	|			ВзносыВФонды.НомерПорога, 
	|			ВзносыВФонды.ДатаНачала, 
	|			ВзносыВФонды.ДатаОкончания 
	| 
	|	) КАК ВзносыДо 
	| 	ПО		Основной.Сотрудник = ВзносыДо.Сотрудник
	|		И	Основной.Налог = ВзносыДо.Налог
	|		И	Основной.БазовыйПериодНачало = НАЧАЛОПЕРИОДА(ВзносыДо.БазовыйПериодНачало, МЕСЯЦ) 
	| 
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТВзносыРегистратора + " КАК ВзносыРегистратора
	|   ПО		ВзносыДо.Сотрудник = ВзносыРегистратора.Сотрудник
	|   	И	ВзносыДо.Налог = ВзносыРегистратора.Налог
	|   	И	ВзносыДо.НомерПорога = ВзносыРегистратора.НомерПорога
	|   	И	ВзносыДо.БазовыйПериодНачало = ВзносыРегистратора.БазовыйПериодНачало
	|   	И	ВзносыДо.ВидРасчета = ВзносыРегистратора.ВидРасчета
	|   	И	ВзносыДо.Предел = ВзносыРегистратора.Предел
	|   	И	ВзносыДо.Ставка = ВзносыРегистратора.Ставка
	|   	И	ВзносыДо.СтатьяНалоговойДекларации = ВзносыРегистратора.СтатьяНалоговойДекларации
	|   	И	ВзносыДо.ДатаНачала = ВзносыРегистратора.ДатаНачала
	|   	И	ВзносыДо.ДатаОкончания = ВзносыРегистратора.ДатаОкончания
	|
	| ГДЕ	НЕ ВзносыДо.Результат ЕСТЬ NULL
	|	 И (ВзносыДо.База <> 0 
	|	ИЛИ ВзносыДо.БазаВзноса <> 0 
	|	ИЛИ ВзносыДо.Результат <> 0)
	|"; 

	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, ЭтоНачисление, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета = Неопределено) Экспорт
	
	Если ВыборкаПоСтрокамДокумента.ПроизвольнаяФормулаРасчета Тогда
		Для СчПоказателя = 1 По Мин(ВыборкаПоСтрокамДокумента.КоличествоПоказателей, 6) Цикл
			ТипПоказателя = ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя + "ТипПоказателя"];
			ВозможностьИзменения = ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя + "ВозможностьИзменения"];
			ЗапрашиватьПриКадровыхПеремещениях = ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя + "ЗапрашиватьПриКадровыхПеремещениях"];
			Если ВозможностьИзменения = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется И ЗапрашиватьПриКадровыхПеремещениях
				Или ВозможностьИзменения = Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете	Тогда
				
				// проверка постоянных показателей
				Если ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя] = 0 Тогда
					// размер 
					Если Не ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя + "Предопределенный"]
						и ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная
						и ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая
						 Тогда
						ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru=' не указан размер показателя ';uk=' не вказаний розмір показника '") + ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя+"Наименование"], Отказ, Заголовок);
					КонецЕсли;
				КонецЕсли;
				// валюта (для денежного показателя)
				Если ИспользуютсяНачисленияВВалюте Тогда
					Если ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Денежный
						И (НЕ ВыборкаПоСтрокамДокумента["Показатель" + СчПоказателя + "Предопределенный"] ИЛИ ВыборкаПоСтрокамДокумента.ВидРасчета.ЗачетОтработанногоВремени) 
						и НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента["Валюта" + СчПоказателя]) 
						 Тогда
						ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке +  НСтр("ru='не указана валюта!';uk='не вказана валюта!'"), Отказ, Заголовок);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если ИспользуютсяНачисленияВВалюте Тогда
			// Валюта
			Если СоответствиеВалютныеСпособыРасчета[ВыборкаПоСтрокамДокумента.СпособРасчета] И 
				Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Валюта1) И 
				СпособРасчетаТребуетРазмер(ВыборкаПоСтрокамДокумента.СпособРасчета)
				и ВыборкаПоСтрокамДокумента.КоличествоПоказателей > 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не задана валюта!';uk='не задана валюта!'"), Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
		// Размер оплаты
		Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить И СпособРасчетаТребуетРазмер(ВыборкаПоСтрокамДокумента.СпособРасчета)
		И ВыборкаПоСтрокамДокумента.КоличествоПоказателей > 0 Тогда
			Если ЭтоНачисление И (ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы ИЛИ ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы) Тогда
				Если ВыборкаПоСтрокамДокумента.Показатель2 = 0 Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан размер начисления!';uk='не зазначений розмір нарахування!'"), Отказ, Заголовок);
				КонецЕсли;	
			ИначеЕсли ЭтоНачисление И ВыборкаПоСтрокамДокумента.Показатель1 = 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан размер начисления!';uk='не зазначений розмір нарахування!'"), Отказ, Заголовок);
			ИначеЕсли Не ЭтоНачисление И ВыборкаПоСтрокамДокумента.Показатель1 = 0 Тогда 
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан размер удержания!';uk='не вказаний розмір утримання!'"), Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
			
		
	КонецЕсли;
	
КонецПроцедуры //ПроверкаПоказаетелей

//Функция выполняет оценку значения по оценочной шкале
//	Параметр:
//		Показатель - значение, которое оцениванием
//		Шкала - показатель - оценочная шкала
//	Возвращает:
//		Значение, которое соответствует оценочной шкале
//
Функция ОценитьПо(Показатель, Шкала) Экспорт 
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 	
	  "ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА СоставШкалОценкиПоказателейРасчета.ШкалаОценкиПоказателя.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
	 |			ТОГДА СоставШкалОценкиПоказателейРасчета.Размер / 100
	 |		ИНАЧЕ СоставШкалОценкиПоказателейРасчета.Размер
	 |	КОНЕЦ КАК Значение
	 |ИЗ
	 |	РегистрСведений.СоставШкалОценкиПоказателейРасчета КАК СоставШкалОценкиПоказателейРасчета
	 |ГДЕ
	 |	СоставШкалОценкиПоказателейРасчета.ШкалаОценкиПоказателя = &Шкала
	 |	И &Показатель > СоставШкалОценкиПоказателейРасчета.ЗначениеС
	 |			И &Показатель <= СоставШкалОценкиПоказателейРасчета.ЗначениеПо";
	 
	 Запрос.УстановитьПараметр("Показатель", Показатель);
	 Запрос.УстановитьПараметр("Шкала", Шкала);
	 
	 Запрос.Текст = ТекстЗапроса;
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Возврат Выборка.Значение;
		 
	 КонецЦикла;
	 
	 ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не выполнена оценка по шкале!';uk='Не виконана оцінка за шкалою!'"));
	 Возврат 0;
	
КонецФункции //ОценитьПо



//////////////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ И ФУНКЦИИ, связанные с расчетом НДФЛ

// Рассчитывает записи НДФЛ из переданного набора записей
//
// Параметры: 
//  НеобходимыеДанные		- структура со многими параметрами, необходимыми для расчета
//  ТабличнаяЧастьДокумента - табличная часть документа, структура тч должна быть одинаковой 
//                            со структурой регистра
// Возвращаемое значение:
//  Нет.
//
Процедура РассчитатьЗаписиНДФЛ(НаборЗаписейРегистра, ТабличнаяЧастьДокумента = НеОпределено, МассивИндексыСтрок = НеОпределено, Сотрудники, КомментироватьРасчет = НеОпределено, ФормаКомментариев = НеОпределено) Экспорт
	
	Если НаборЗаписейРегистра.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// здесь предполагаем, что в наборе записей не может быть записей с разными периодами регистрации
	ПериодРегистрации = НаборЗаписейРегистра[0].Период;

	Регистратор = НаборЗаписейРегистра.Отбор.Регистратор.Значение;
	
	ИсходныеДанные = ПолучитьДанныеДляРасчетаНДФЛ(Регистратор, Сотрудники, КомментироватьРасчет, ФормаКомментариев);
	РассчитатьЗаписиНабораНДФЛ(	ИсходныеДанные,
								НаборЗаписейРегистра,
								ТабличнаяЧастьДокумента, 
								МассивИндексыСтрок,
								КомментироватьРасчет, ФормаКомментариев);

	НаборЗаписейРегистра.Записать();
								
КонецПроцедуры // РассчитатьНДФЛ

// Получает данные для расчета ресурсов записей регистра расчета
//
//	ИмяРегистра - строка, имя регистра расчета
//	КатегорияРасчета - ссылка на значение перечисленич КатегорииРасчетов
//	НеобходимыеДанные - Структура с элементами 
//			База,
//			НормаВремени,
//			ОтработаноВремени,
//			...
//	Регистратор - ссылка на документ
//	Организация - ссылка на организацию по которой проводится Регистратор
//	ПериодРегистрации
//	Перерасчет - булево - признак того, что получаем данные для случая перерасчета
//	Физлица - массив ссылок на физлиц - выбранные для перерасчета физлица, или массив содержащий ссылку
//			  на физлицо по которому производится расчет (расчет по одному работнику из документа)	
//
// Возвращает выборку результата запроса
Функция ПолучитьДанныеДляРасчетаНДФЛ(Регистратор,
									Сотрудники = Неопределено,
									КомментироватьРасчет = Ложь, ФормаКомментариев = НеОпределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТолькоПоДвижениямТекущегоДокумента=ТипЗнч(Регистратор)=Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций");
	Запрос.УстановитьПараметр("парамСотрудники", Сотрудники);
	Запрос.УстановитьПараметр("парамРегистратор", Регистратор );
	Запрос.УстановитьПараметр("парамОрганизация", Регистратор.Организация );
	Запрос.УстановитьПараметр("парамПериодРегистрации", Регистратор.ПериодРегистрации);
	
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета"	, Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("парамВалютаУпрУчета", Константы.ВалютаУправленческогоУчета.Получить());
	
	Запрос.УстановитьПараметр("парамПриход",				ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("парамТрудоспособные",		Перечисления.СоциальныеГруппыНаселения.Трудоспособные);
	
	СписокЛьгот = Новый СписокЗначений;
	СписокЛьгот.Добавить(Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_612а);
	СписокЛьгот.Добавить(Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_612б);
	СписокЛьгот.Добавить(Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_612в);
	СписокЛьгот.Добавить(Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_613е);
	СписокЛьгот.Добавить(Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_16912);
	СписокЛьгот.Добавить(Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_16912ВР);
	Запрос.УстановитьПараметр("парамРазрешенныеДублиЛьгот",	СписокЛьгот);
	Запрос.УстановитьПараметр("парамБазоваяЛьгота",         Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_611);
	
	ИспользуетсяНК = ИспользуетсяНК(Регистратор.ПериодРегистрации);
	ВариантНДФЛ = ВариантыАлгоритмовРасчетаЗарплаты().РасчетНДФЛ17;
	Используется3609 = (ДатаИзмененияНК3609() <=  Регистратор.Дата);
	Используется1578 = (ДатаИзмененияНК1578() <=  Регистратор.Дата);
	
	Запрос.УстановитьПараметр("ИспользуетсяНК", ИспользуетсяНК);
	Запрос.УстановитьПараметр("ВариантНДФЛ", ВариантНДФЛ);
	Запрос.УстановитьПараметр("Используется3609", Используется3609);
	//ВОЕННЫЙ СБОР
	Запрос.УстановитьПараметр("ВидДоходаВС", Справочники.ВидыДоходовНДФЛ.ВоенныйСбор);
	Запрос.УстановитьПараметр("ВидСтавкиВС", Перечисления.ВидыСтавокНДФЛ.ВоенныйСбор);
	
	Запрос.УстановитьПараметр("Используется3609", Используется3609);
	Запрос.УстановитьПараметр("Используется1578", Используется1578);
	
	/////////////////////////////////////////////////////////////////////
	// Вложенные запросы
	// для получения данных расчета
	// Реализованы как временные таблицы
	Если Истина Тогда 
		
		// ВТСотрудникиПоНалоговымПериодам
		Если Истина Тогда
			// Определяем Сотрудников с Периодами по которым надо рассчитать НДФЛ
			ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Основной.Сотрудник	КАК Сотрудник, 
			|	Основной.НалоговыйПериод	КАК НалоговыйПериод
			|ПОМЕСТИТЬ ВТСотрудникиПоНалоговымПериодам
			|ИЗ	РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК Основной
			|ГДЕ	Основной.Регистратор = &парамРегистратор
			|	И	Основной.Сотрудник в (&парамСотрудники)
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТСотрудникиПоНалоговымПериодам = "ВТСотрудникиПоНалоговымПериодам";
		КонецЕсли;	
		
		// ВТСотрудникиПоНалоговымПериодамИСтрокам
		Если ВариантНДФЛ = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Основной.Сотрудник	КАК Сотрудник, 
			|	Основной.НомерСтроки		КАК НомерСтроки,
			|	Основной.ДоходНДФЛ			КАК ДоходНДФЛ,
			|	Основной.НалоговыйПериод	КАК НалоговыйПериод
			|
			|ПОМЕСТИТЬ ВТСотрудникиПоНалоговымПериодамИСтрокам
			|ИЗ	РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК Основной
			|ГДЕ	Основной.Регистратор = &парамРегистратор
			|	И	Основной.Сотрудник в (&парамСотрудники)
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ВТСотрудникиПоНалоговымПериодамИСтрокам = "ВТСотрудникиПоНалоговымПериодамИСтрокам";
		КонецЕсли;	
		
		// ВТНалоговыеПериоды
		Если Истина Тогда
			// Определяем Сотрудников с Периодами по которым надо рассчитать НДФЛ
			ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Основной.НалоговыйПериод	КАК НалоговыйПериод
			|ПОМЕСТИТЬ ВТНалоговыеПериоды
			|ИЗ	" + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Основной
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТНалоговыеПериоды = "ВТНалоговыеПериоды";
		КонецЕсли;	
		
		// ВТДоход
		Если Истина Тогда
			
			Если ИспользуетсяНК Тогда
				Запрос.УстановитьПараметр("СписокДекретныеПоЕСВ",СписокДекретныеПоЕСВ());
				ТекстНП = "ВЫБОР КОГДА Начисления.ВидРасчета.ЭтоБольничные //Больничные
						|ИЛИ (Начисления.ВидРасчета.ЭтоОтпускные  И НЕ Начисления.Сторно) //Отпускные
						|ИЛИ  Начисления.ВидРасчета В (&СписокДекретныеПоЕСВ) //Декретные						
						|ТОГДА Начисления.ПериодДействия
						|ИНАЧЕ Начисления.ПериодРегистрации
						|КОНЕЦ";
			Иначе
				ТекстНП = "Начисления.ПериодДействия";
			КонецЕсли;
			
			Если НЕ ИспользуетсяНК ИЛИ ВариантНДФЛ = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения Тогда
				// Получает суммы начисленного дохода Сотрудников в разрезе ПериодовДействия и Видов доходов
				// Суммы по расчетам, которые действуют в текущем периоде
				//
				Если Регистратор.ПериодРегистрации < ДатаИзмененияСхемыУчетаВС() Тогда
					ТекстЗапросаВТ = "
					|  	ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
					|		Начисления.ПериодРегистрации   		КАК ПериодРегистрации,
					|		Начисления.ВидРасчета.ДоходНДФЛ    	КАК ДоходНДФЛ,
					|		СУММА( Начисления.Результат )		КАК Доход
					|ПОМЕСТИТЬ ВТДоходБезУчетаВС
					|	ИЗ	" + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Основной
					|	 
					|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
					|   ПО		Основной.Сотрудник = Начисления.Сотрудник
					|   	И	Основной.НалоговыйПериод = "+ТекстНП+"
					|		И	Начисления.ПериодРегистрации <=	&парамПериодРегистрации
					|		"+?(ТолькоПоДвижениямТекущегоДокумента,"И Начисления.Регистратор=&парамРегистратор","")+"
					|
					|   СГРУППИРОВАТЬ ПО
					|		Основной.Сотрудник,
					|		Основной.НалоговыйПериод,
					|		Начисления.ПериодРегистрации,
					|		Начисления.ВидРасчета.ДоходНДФЛ
					|;
					|
					|	ВЫБРАТЬ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
					|		Основной.ПериодРегистрации    		КАК ПериодРегистрации,
					|		&ВидДоходаВС    					КАК ДоходНДФЛ,
					|		Основной.Доход						КАК Доход
					|ПОМЕСТИТЬ ВТДоходВС
					|	ИЗ	ВТДоходБезУчетаВС КАК Основной
					|   ГДЕ ((Основной.ДоходНДФЛ.ВидСтавкиВоенныйСбор = &ВидСтавкиВС И НЕ &Используется1578)
					|       ИЛИ
					|   	(Основной.ДоходНДФЛ.ВидСтавкиРезидента <> ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.НеОблагается) 
					|   	И Основной.ДоходНДФЛ.ВидСтавкиВоенныйСбор <> ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.НеОблагается) 
					|   	И &Используется1578))
					|;
					|
					|   ВЫБРАТЬ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
					|		Основной.ДоходНДФЛ 					КАК ДоходНДФЛ,
					|		СУММА(Основной.Доход)				КАК Доход
					|ПОМЕСТИТЬ ВТДоход
					|	ИЗ	ВТДоходБезУчетаВС КАК Основной
					|   СГРУППИРОВАТЬ ПО
					|       Основной.Сотрудник,
					|		Основной.НалоговыйПериод,
					|		Основной.ДоходНДФЛ
					|
					|   ОБЪЕДИНИТЬ ВСЕ
					|
					|   ВЫБРАТЬ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.ПериодРегистрации    		КАК НалоговыйПериод,
					|		Основной.ДоходНДФЛ 					КАК ДоходНДФЛ,
					|		СУММА(Основной.Доход)				КАК Доход
					|	ИЗ	ВТДоходВС КАК Основной
					|   СГРУППИРОВАТЬ ПО
					|       Основной.Сотрудник,
					|		Основной.ПериодРегистрации,
					|		Основной.ДоходНДФЛ
					|
					|";
				Иначе
					ТекстЗапросаВТ = "
					|  	ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
					|		Начисления.ПериодРегистрации   		КАК ПериодРегистрации,
					|		Начисления.ВидРасчета.ДоходНДФЛ    	КАК ДоходНДФЛ,
					|		СУММА( Начисления.Результат )		КАК Доход
					|ПОМЕСТИТЬ ВТДоходБезУчетаВС
					|	ИЗ	" + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Основной
					|	 
					|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
					|   ПО		Основной.Сотрудник = Начисления.Сотрудник
					|   	И	Основной.НалоговыйПериод = "+ТекстНП+"
					|		И	Начисления.ПериодРегистрации <=	&парамПериодРегистрации
					|		"+?(ТолькоПоДвижениямТекущегоДокумента,"И Начисления.Регистратор=&парамРегистратор","")+"
					|
					|   СГРУППИРОВАТЬ ПО
					|		Основной.Сотрудник,
					|		Основной.НалоговыйПериод,
					|		Начисления.ПериодРегистрации,
					|		Начисления.ВидРасчета.ДоходНДФЛ
					|;
					|
					|   ВЫБРАТЬ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
					|		Основной.ПериодРегистрации    		КАК ПериодРегистрации,
					|		Основной.ДоходНДФЛ.ОблагаетсяВоеннымСбором2021	КАК ДоходНДФЛ,
					|		Основной.Доход 						КАК Доход
					|ПОМЕСТИТЬ ВТДоходВС
					|	ИЗ	ВТДоходБезУчетаВС КАК Основной
					|   ГДЕ
					|   	Основной.ДоходНДФЛ.ОблагаетсяВоеннымСбором2021 <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
					|;
					|
					|   ВЫБРАТЬ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
					|		Основной.ДоходНДФЛ 					КАК ДоходНДФЛ,
					|		СУММА(Основной.Доход)				КАК Доход
					|ПОМЕСТИТЬ ВТДоход
					|	ИЗ	ВТДоходБезУчетаВС КАК Основной
					|   СГРУППИРОВАТЬ ПО
					|       Основной.Сотрудник,
					|		Основной.НалоговыйПериод,
					|		Основной.ДоходНДФЛ
					|
					|   ОБЪЕДИНИТЬ ВСЕ
					|
					|   ВЫБРАТЬ
					|		Основной.Сотрудник    				КАК Сотрудник,
					|		Основной.ПериодРегистрации    		КАК НалоговыйПериод,
					|		Основной.ДоходНДФЛ 					КАК ДоходНДФЛ,
					|		СУММА(Основной.Доход)				КАК Доход
					|	ИЗ	ВТДоходВС КАК Основной
					|   СГРУППИРОВАТЬ ПО
					|       Основной.Сотрудник,
					|		Основной.ПериодРегистрации,
					|		Основной.ДоходНДФЛ
					|
					|";

				КонецЕсли;
				
			Иначе //Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы
				ТекстЗапросаВТ = "
				|  	ВЫБРАТЬ
				|		Основной.Сотрудник    				КАК Сотрудник,
				|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
				|		Основной.ДоходНДФЛ    				КАК ДоходНДФЛ,
				|		Основной.НомерСтроки   				КАК НомерСтроки,
				|		СУММА( Начисления.Результат )		КАК Доход
				|ПОМЕСТИТЬ ВТДоход
				|	ИЗ	" + ВТСотрудникиПоНалоговымПериодамИСтрокам + " КАК Основной
				|	 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
				|   ПО		Основной.Сотрудник = Начисления.Сотрудник
				|   	И	Основной.НалоговыйПериод = "+ТекстНП+"
				|		И	Начисления.ПериодРегистрации <=	&парамПериодРегистрации
				|		И	Начисления.ВидРасчета.ДоходНДФЛ = Основной.ДоходНДФЛ
				|		"+?(ТолькоПоДвижениямТекущегоДокумента,"И Начисления.Регистратор=&парамРегистратор","")+"
				|
				|   СГРУППИРОВАТЬ ПО
				|		Основной.Сотрудник,
				|		Основной.НалоговыйПериод,
				|		Основной.ДоходНДФЛ,
				|		Основной.НомерСтроки
				|";
				
			КонецЕсли;	
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТДоход = "ВТДоход";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДоход";
		
		// ВТДоходЛьготы
		Если Истина Тогда
			// Получает суммы начисленного дохода Сотрудников в разрезе ПериодовДействия и Видов доходов
			// Суммы по расчетам, которые действуют в текущем периоде
			//
			ТекстЗапросаВТ = "
			|  	ВЫБРАТЬ
			|		Основной.Сотрудник    				КАК Сотрудник,
			|		Основной.НалоговыйПериод    		КАК НалоговыйПериод,
			|		СУММА( Начисления.Результат )		КАК Доход
			|ПОМЕСТИТЬ ВТДоходЛьготы
			|	ИЗ	" + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Основной
			|	 
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
			|   ПО		Основной.Сотрудник = Начисления.Сотрудник
			|   	И	Основной.НалоговыйПериод = "+ТекстНП+"
			|		И	Начисления.ПериодРегистрации <=	&парамПериодРегистрации
			|		"+?(ТолькоПоДвижениямТекущегоДокумента,"И Начисления.Регистратор=&парамРегистратор","")+"
			|
			|  ГДЕ Начисления.ВидРасчета.ДоходНДФЛ.ЭтоМесячныйДоход
			|      И Начисления.ВидРасчета.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ)
			|      И Начисления.ВидРасчета.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42)
			|
			|   СГРУППИРОВАТЬ ПО
			|		Основной.Сотрудник,
			|		Основной.НалоговыйПериод
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТДоходЛьготы = "ВТДоходЛьготы";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДоходЛьготы";
		
		// ВТВзносы
		Если Истина Тогда
			
			Если ИспользуетсяНК Тогда
				ТекстНП = "ВЫБОР КОГДА БазаИзНачислений.ВидРасчета.ЭтоБольничные //Больничные
						|ИЛИ (БазаИзНачислений.ВидРасчета.ЭтоОтпускные  И НЕ БазаИзНачислений.Сторно) //Отпускные
						|ТОГДА НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ)
						|ИНАЧЕ БазаИзНачислений.ПериодРегистрации
						|КОНЕЦ";
			Иначе
				ТекстНП = "НАЧАЛОПЕРИОДА(БазаИзНачислений.ПериодДействия, МЕСЯЦ)";
			КонецЕсли;
			
			Если НЕ ИспользуетсяНК ИЛИ ВариантНДФЛ = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения Тогда
				// Получает суммы взносов в фонды социального страхования Сотрудников в разрезе Налогового периода
				// только по доходу 01
				ТекстЗапросаВТ = "
				|ВЫБРАТЬ
				|	Основной.Сотрудник,
				|	Основной.НалоговыйПериод,
				|	Основной.ДоходНДФЛ,
				|	СУММА(ВЫБОР КОГДА Основной.БазаВзноса <> 0 И Основной.БазаДоходаНДФЛ < Основной.БазаВзноса
				|					ТОГДА Основной.Взнос*Основной.БазаДоходаНДФЛ/Основной.БазаВзноса 
				|				КОГДА Основной.БазаВзноса <> 0 И Основной.БазаДоходаНДФЛ >= Основной.БазаВзноса
				|					ТОГДА Основной.Взнос 
				|				ИНАЧЕ 0 
				|			КОНЕЦ) КАК СуммаВзносов,
				|	0 КАК БазаВзносов,
				|	0 КАК СуммаВзносовБЛ,
				|	0 КАК БазаВзносовБЛ
				|ПОМЕСТИТЬ ВТВзносы
				|ИЗ (
				|	ВЫБРАТЬ
				|		Основной.Сотрудник,
				|		Основной.НалоговыйПериод,
				|		Основной.ДоходНДФЛ,
				|		Основной.ВидРасчета,
				|		Основной.БазаВзноса,
				|		Основной.Взнос,
				|		СУММА(БазаИзНачислений.Результат) КАК БазаДоходаНДФЛ
				|	ИЗ (
				|			  ВЫБРАТЬ
				|				Основной.Сотрудник,
				|				Основной.НалоговыйПериод,
				|				Основной.ДоходНДФЛ,
				|				ВзносыВФонды.ВидРасчета,
				|				СУММА( ВзносыВФонды.База )			КАК БазаВзноса,
				|				СУММА( ВзносыВФонды.Результат )		КАК Взнос
				|			ИЗ	(
				
				|				ВЫБРАТЬ
				|					Основной.Сотрудник, 
				|					Основной.НалоговыйПериод,
				|					Основной.ДоходНДФЛ
				|				ИЗ	РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК Основной
				|				ГДЕ	Основной.Регистратор = &парамРегистратор
				|					И	Основной.Сотрудник в (&парамСотрудники)
				|					И	Основной.ДоходНДФЛ.ЭтоМесячныйДоход
				|					И   (&Используется3609 ИЛИ (Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ) И Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42)))
				|			) КАК Основной
				|
				|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
				|			   ПО		Основной.Сотрудник			= ВзносыВФонды.Сотрудник
				|				   И	Основной.НалоговыйПериод	= НАЧАЛОПЕРИОДА( ВзносыВФонды.БазовыйПериодНачало, МЕСЯЦ )
				|					И	ВзносыВФонды.ПериодРегистрации			<=	&парамПериодРегистрации
				|					И	ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.Взносы)
				|		"+?(ТолькоПоДвижениямТекущегоДокумента,"И ВзносыВФонды.Регистратор=&парамРегистратор","")+"
				|
				|			СГРУППИРОВАТЬ ПО
				|				Основной.Сотрудник,
				|				Основной.НалоговыйПериод,
				|				Основной.ДоходНДФЛ,
				|				ВзносыВФонды.ВидРасчета
				|	) КАК Основной
				|	 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК БазаИзНачислений
				|	ПО		Основной.Сотрудник = БазаИзНачислений.Сотрудник  
				|		И	БазаИзНачислений.ВидРасчета.ДоходНДФЛ = Основной.ДоходНДФЛ 
				|		И	"+ТекстНП+" = Основной.НалоговыйПериод
				|		И	БазаИзНачислений.ПериодРегистрации <= &парамПериодРегистрации
				|		" + ?(ТолькоПоДвижениямТекущегоДокумента," И БазаИзНачислений.Регистратор = &парамРегистратор", "") + "
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК БазовыеВидыРасчета
				|	ПО		Основной.ВидРасчета = БазовыеВидыРасчета.Ссылка  
				|		И	БазаИзНачислений.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
				|				 
				|	СГРУППИРОВАТЬ ПО
				|		Основной.Сотрудник,
				|		Основной.НалоговыйПериод,
				|		Основной.ДоходНДФЛ,
				|		Основной.ВидРасчета,
				|		Основной.БазаВзноса,
				|		Основной.Взнос
				|) КАК Основной
				|
				|СГРУППИРОВАТЬ ПО
				|	Основной.Сотрудник,
				|	Основной.НалоговыйПериод,
				|	Основной.ДоходНДФЛ
				|";
			Иначе //Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы
				ТекстЗапросаВТ = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Основной.Сотрудник,
				|	Основной.НалоговыйПериод,
				|	Основной.ДоходНДФЛ,
				|   СУММА(
				|    ВЫБОР КОГДА Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01) И Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.Первичное)
				|     ИЛИ (Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ) ИЛИ (Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42))) И Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПервогоУровня) 
				|    ТОГДА Основной.БазаВзноса
				|    ИНАЧЕ 0
				|    КОНЕЦ) КАК БазаВзносов,
				|   СУММА(
				|    ВЫБОР КОГДА Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01) И Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.Первичное) 
				|     ИЛИ (Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ) ИЛИ (Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42))) И Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПервогоУровня) 
				|    ТОГДА Основной.Взнос
				|    ИНАЧЕ 0
				|    КОНЕЦ) КАК СуммаВзносов,
				|   СУММА(
				|    ВЫБОР КОГДА Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01) И Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВторогоУровня) 
				|    ТОГДА Основной.БазаВзноса
				|    ИНАЧЕ 0
				|    КОНЕЦ) КАК БазаВзносовБЛ,
				|   СУММА(
				|    ВЫБОР КОГДА Основной.ДоходНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01) И Основной.ВидРасчета.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВторогоУровня) 
				|    ТОГДА Основной.Взнос
				|    ИНАЧЕ 0
				|    КОНЕЦ) КАК СуммаВзносовБЛ
				|ПОМЕСТИТЬ ВТВзносы
				|	ИЗ (
				|			  ВЫБРАТЬ
				|				Основной.Сотрудник,
				|				Основной.НалоговыйПериод,
				|				Основной.ДоходНДФЛ,
				|				ВзносыВФонды.ВидРасчета,
				|				СУММА( ВзносыВФонды.БазаВзноса)		КАК БазаВзноса,
				|				СУММА( ВзносыВФонды.Результат)		КАК Взнос
				|			ИЗ	(
				
				|				ВЫБРАТЬ
				|					Основной.Сотрудник, 
				|					Основной.НалоговыйПериод,
				|					Основной.ДоходНДФЛ
				|				ИЗ	РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК Основной
				|				ГДЕ	Основной.Регистратор = &парамРегистратор
				|					И	Основной.Сотрудник в (&парамСотрудники)
				|					И	Основной.ДоходНДФЛ.ЭтоМесячныйДоход
				|					И   (&Используется3609 ИЛИ (Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ) И Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42)))
				|			) КАК Основной
				|
				|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
				|			   ПО		Основной.Сотрудник			= ВзносыВФонды.Сотрудник
				|				   И	Основной.НалоговыйПериод	= НАЧАЛОПЕРИОДА( ВзносыВФонды.БазовыйПериодНачало, МЕСЯЦ )
				|					И	ВзносыВФонды.ПериодРегистрации			<=	&парамПериодРегистрации
				|					И	ВзносыВФонды.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.Взносы)
				|					"+?(ТолькоПоДвижениямТекущегоДокумента,"И ВзносыВФонды.Регистратор=&парамРегистратор","")+"
				|
				|			СГРУППИРОВАТЬ ПО
				|				Основной.Сотрудник,
				|				Основной.НалоговыйПериод,
				|				Основной.ДоходНДФЛ,
				|				ВзносыВФонды.ВидРасчета
				|	) КАК Основной
				|	 
				|СГРУППИРОВАТЬ ПО
				|	Основной.Сотрудник,
				|	Основной.НалоговыйПериод,
				|	Основной.ДоходНДФЛ
				|";
				
			КонецЕсли;	
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			ТекстЗапросаВТВзносы = "ВТВзносы";
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВзносы";
		
		// ВТАктуальныеЛьготыРаботниковПоНалоговымПериодам
		Если Истина Тогда
			// Получает по Сотрудникам в разрезе периодов актуальные льготы
			//
			ТекстЗапроса = "
			|  	ВЫБРАТЬ
			|		ПериодыЛьгот.Сотрудник    			КАК Сотрудник,
			|		ПериодыЛьгот.НалоговыйПериод    	КАК НалоговыйПериод,
			|		ЛьготыРаботниковОрганизаций.Льгота	КАК Льгота
			|ПОМЕСТИТЬ ВТАктуальныеЛьготыРаботниковПоНалоговымПериодам
			|	ИЗ	(
			|  		ВЫБРАТЬ
			|			Основной.Сотрудник    		КАК Сотрудник,
			|			Основной.НалоговыйПериод    КАК НалоговыйПериод,
			|			Льготы.Льгота				КАК Льгота,
			|			МАКСИМУМ( Льготы.Период )	КАК ПериодИзмененияЛьготы
			|		ИЗ	" + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Основной
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛьготыРаботниковОрганизаций КАК Льготы
			|		ПО		Основной.Сотрудник = Льготы.Сотрудник
			|   		И	Льготы.Период <= Основной.НалоговыйПериод		
			|   	СГРУППИРОВАТЬ ПО
			|			Основной.Сотрудник,
			|			Основной.НалоговыйПериод,
			|			Льготы.Льгота
			|   ) КАК ПериодыЛьгот
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛьготыРаботниковОрганизаций КАК ЛьготыРаботниковОрганизаций
			|	ПО		ПериодыЛьгот.Сотрудник = ЛьготыРаботниковОрганизаций.Сотрудник
			|   	И	ПериодыЛьгот.Льгота = ЛьготыРаботниковОрганизаций.Льгота
			|   	И	ПериодыЛьгот.ПериодИзмененияЛьготы <= ЛьготыРаботниковОрганизаций.Период
			|
			|   ГДЕ  ЛьготыРаботниковОрганизаций.Актуальность 
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТАктуальныеЛьготыРаботниковПоНалоговымПериодам = "ВТАктуальныеЛьготыРаботниковПоНалоговымПериодам";
		КонецЕсли;	
		
		// ВТИнвалиды
		Если Истина Тогда
			// Получает по Сотрудникам в разрезе периодов актуальные льготы
			//
			ТекстЗапроса = "
			|  	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		Инвалиды.ФизЛицоИнвалид    			КАК ФизЛицоИнвалид,
			|		Инвалиды.НалоговыйПериод    		КАК НалоговыйПериод
			|ПОМЕСТИТЬ ВТИнвалиды
			|	ИЗ	(
			|  		ВЫБРАТЬ
			|			Основной.НалоговыйПериод    				КАК НалоговыйПериод,
			|			СведенияОбИнвалидности.ФизЛицо    			КАК ФизЛицоИнвалид,
			|			МАКСИМУМ( СведенияОбИнвалидности.Период )	КАК ПериодНачалаИнвалидности
			|		ИЗ	" + ТекстЗапросаВТНалоговыеПериоды + " КАК Основной
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидности
			|		ПО		Основной.НалоговыйПериод >= СведенияОбИнвалидности.Период
			|   	СГРУППИРОВАТЬ ПО
			|			Основной.НалоговыйПериод,
			|			СведенияОбИнвалидности.ФизЛицо
			|   ) КАК Инвалиды
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидности
			|	ПО		Инвалиды.ФизЛицоИнвалид = СведенияОбИнвалидности.ФизЛицо
			|   	И	Инвалиды.ПериодНачалаИнвалидности = СведенияОбИнвалидности.Период
			|
			|   ГДЕ  СведенияОбИнвалидности.Инвалидность 
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТИнвалиды = "ВТИнвалиды";
		КонецЕсли;	
		
		// ВТДетиРаботников
		Если Истина Тогда
			// Получаем Сотрудников с Налоговыми периодами и колличество детей на каждый период в разрезе периодов актуальные льготы
			//
			ТекстЗапроса = "
			|	ВЫБРАТЬ 
			|		СемьяСДетьми.Сотрудник					КАК Сотрудник,
			|		СемьяСДетьми.НалоговыйПериод			КАК НалоговыйПериод,
			|		СУММА(СемьяСДетьми.КвоДетей)			КАК КвоДетей,
			|		СУММА(СемьяСДетьми.КвоДетейИнвалидов)	КАК КвоДетейИнвалидов
			|ПОМЕСТИТЬ ВТДетиРаботников
			|	ИЗ (
			|		ВЫБРАТЬ
			|			Основной.Сотрудник    				КАК Сотрудник,
			|			Основной.НалоговыйПериод    		КАК НалоговыйПериод,
			|			Семья.НомерСтроки      				КАК НомерСтроки,
			|			Семья.ФизЛицо      					КАК Ребенок,       
			|			ВЫРАЗИТЬ (ВЫБОР 
			|					КОГДА Семья.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.СтепениРодстваФизЛиц.Ребенок) 
			|					И	Семья.Иждивенец 
			|					И 	Семья.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|					И	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Семья.ФизЛицо.ДатаРождения, ГОД), ГОД, 18) >= НАЧАЛОПЕРИОДА(Основной.НалоговыйПериод, ГОД)
			|					И	Семья.ФизЛицо.ДатаРождения <= НАЧАЛОПЕРИОДА(Основной.НалоговыйПериод, МЕСЯЦ)
			|					ТОГДА 1
			|                   КОГДА Семья.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.СтепениРодстваФизЛиц.Ребенок) 
			|					И	Семья.Иждивенец 
			|					И 	Семья.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
            |					И	(Семья.ГодРождения+18) >= ГОД(Основной.НалоговыйПериод) 
			|					И	Семья.ГодРождения <= ГОД(Основной.НалоговыйПериод)
			|					ТОГДА 1
			|					ИНАЧЕ 0 
			|			КОНЕЦ КАК ЧИСЛО(5,2)) 								КАК КвоДетей,
			|			ВЫРАЗИТЬ(ВЫБОР 
			|					КОГДА	Семья.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.СтепениРодстваФизЛиц.Ребенок) 
			|						И	Семья.Иждивенец 
			|						И 	Семья.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|						И	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Семья.ФизЛицо.ДатаРождения, ГОД), ГОД, 18) >= НАЧАЛОПЕРИОДА(Основной.НалоговыйПериод, ГОД)
			|						И	Семья.ФизЛицо.ДатаРождения <= НАЧАЛОПЕРИОДА(Основной.НалоговыйПериод, МЕСЯЦ)			
			|						И	Инвалиды.ФизЛицоИнвалид ЕСТЬ НЕ NULL 
			|					ТОГДА 1 
			|           		КОГДА  Семья.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.СтепениРодстваФизЛиц.Ребенок) 
			|						И	Семья.Иждивенец 
			|						И 	Семья.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|						И	(Семья.ГодРождения+18) >= ГОД(Основной.НалоговыйПериод)   
			|						И	Семья.ГодРождения <= ГОД(Основной.НалоговыйПериод)
			|						И	Семья.Иждивенец ЕСТЬ НЕ NULL 
			|					ТОГДА 1 
			|					ИНАЧЕ 0 
			|			КОНЕЦ КАК ЧИСЛО(5,2))								КАК КвоДетейИнвалидов
			|
			|		ИЗ " + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Основной
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.СоставСемьи КАК Семья 
			|       ПО		Основной.Сотрудник.ФизЛицо = Семья.Ссылка
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТИнвалиды + " КАК Инвалиды
			|		ПО		Семья.ФизЛицо = Инвалиды.ФизЛицоИнвалид
			|			И	Основной.НалоговыйПериод = Инвалиды.НалоговыйПериод
			|	) КАК СемьяСДетьми
			|
			|СГРУППИРОВАТЬ ПО
			|	СемьяСДетьми.Сотрудник,
			|	СемьяСДетьми.НалоговыйПериод
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТДетиРаботников = "ВТДетиРаботников";
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДетиРаботников";
		
		// ВТЛьготы - Льготы и их парааметы Количество льгот, Количество порогов
		Если Истина Тогда
			// Получает по Сотрудникам в разрезе периодов, актуальные льготыи их параметры
			//
			Если НЕ ИспользуетсяНК Тогда
				ТекстЗапроса = "
				|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		Льготы.Сотрудник			КАК Сотрудник,
				|		Льготы.НалоговыйПериод		КАК НалоговыйПериод,
				|		Льготы.КвоЛьгот				КАК КвоЛьгот,
				|		Льготы.КвоПороговЛьгот		КАК КвоПороговЛьгот,
				|		МАКСИМУМ (Льготы.Льгота)	КАК Льгота
				|	 
				|ПОМЕСТИТЬ ВТЛьготы
				|	ИЗ (
				|		ВЫБРАТЬ РАЗЛИЧНЫЕ
				|			СведенияОЛьготах.Сотрудник    			КАК Сотрудник,
				|			СведенияОЛьготах.НалоговыйПериод    	КАК НалоговыйПериод,
				|			СведенияОЛьготах.Льгота					КАК Льгота,
				|	 
				|			ВЫРАЗИТЬ( ВЫБОР КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.Основной) 
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ 
				|							КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенка) 
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ * ДетиРаботников.КвоДетей 
				|							КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенкаИнвалида) 
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ * ДетиРаботников.КвоДетейИнвалидов 
				|							КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаТроихДетей)
				|										И ДетиРаботников.КвоДетей >= 3
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ * ДетиРаботников.КвоДетей 
				|		 		       		ИНАЧЕ 0
				|	         		   		КОНЕЦ
				|					КАК ЧИСЛО(5,2) )       		КАК КвоЛьгот,
				|	 
				|			ВЫРАЗИТЬ (ВЫБОР КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.Основной) 
				|							ТОГДА 1 
				|						КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенка) 
				|							ТОГДА ДетиРаботников.КвоДетей 
				|						КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенкаИнвалида) 
				|							ТОГДА ДетиРаботников.КвоДетейИнвалидов 
				|						КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаТроихДетей)
				|										И ДетиРаботников.КвоДетей >= 3
				|							ТОГДА ДетиРаботников.КвоДетей 
				|		        		ИНАЧЕ 1 
				|	            	КОНЕЦ
				|				КАК ЧИСЛО(5,2))    		КАК КвоПороговЛьгот
				|			ИЗ " + ТекстЗапросаВТАктуальныеЛьготыРаботниковПоНалоговымПериодам + " КАК СведенияОЛьготах
				|
				|			ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДетиРаботников + " КАК ДетиРаботников
				|			ПО		СведенияОЛьготах.Сотрудник = ДетиРаботников.Сотрудник
				|				И   СведенияОЛьготах.НалоговыйПериод = ДетиРаботников.НалоговыйПериод
				|	) КАК Льготы
				|	СГРУППИРОВАТЬ ПО
				|		Льготы.Сотрудник,
				|		Льготы.НалоговыйПериод,
				|		Льготы.КвоЛьгот,
				|		Льготы.КвоПороговЛьгот
				|";
			Иначе
				//---------------
				//Для льгот "на каждого ребенка" количество порогов льгот теперь НЕ увеличивается.
				//Исключение - льгота 169.1.2 у одного родителя
				//---------------
				//Указанная выше норма отменена Законом №3609
				
				Если Используется3609 Тогда
					КвоПороговЛьгот = "ВЫРАЗИТЬ (ВЫБОР КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.Основной) 
				|						    ИЛИ СведенияОЛьготах.Льгота = ЗНАЧЕНИЕ(Справочник.ВидыЛьготРаботниковОрганизаций.НДФЛ_16912ВР)	
				|							ТОГДА 1 
				|						КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенка) 
				|							ТОГДА ДетиРаботников.КвоДетей 
				|						КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенкаИнвалида) 
				|							ТОГДА ДетиРаботников.КвоДетейИнвалидов 
				|						КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаТроихДетей)
				|										И ДетиРаботников.КвоДетей >= 3
				|							ТОГДА ДетиРаботников.КвоДетей 
				|		        		ИНАЧЕ 1 
				|	            	КОНЕЦ
				|				КАК ЧИСЛО(5,2))    		КАК КвоПороговЛьгот";
				Иначе
				    КвоПороговЛьгот = "ВЫРАЗИТЬ (ВЫБОР КОГДА СведенияОЛьготах.Льгота = ЗНАЧЕНИЕ(Справочник.ВидыЛьготРаботниковОрганизаций.НДФЛ_16912) 
				|							ТОГДА ДетиРаботников.КвоДетей 
				|		        		ИНАЧЕ 1 
				|	            	КОНЕЦ
				|				КАК ЧИСЛО(5,2))    		КАК КвоПороговЛьгот";

			КонецЕсли;
			
				ТекстЗапроса = "
				|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		Льготы.Сотрудник			КАК Сотрудник,
				|		Льготы.НалоговыйПериод		КАК НалоговыйПериод,
				|		Льготы.КвоЛьгот				КАК КвоЛьгот,
				|		Льготы.КвоПороговЛьгот		КАК КвоПороговЛьгот,
				|		МАКСИМУМ (Льготы.Льгота)	КАК Льгота
				|	 
				|ПОМЕСТИТЬ ВТЛьготы
				|	ИЗ (
				|		ВЫБРАТЬ РАЗЛИЧНЫЕ
				|			СведенияОЛьготах.Сотрудник    			КАК Сотрудник,
				|			СведенияОЛьготах.НалоговыйПериод    	КАК НалоговыйПериод,
				|			СведенияОЛьготах.Льгота					КАК Льгота,
				|	 
				|			ВЫРАЗИТЬ( ВЫБОР КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.Основной) 
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ 
				|							КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенка) 
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ * ДетиРаботников.КвоДетей 
				|							КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаКаждогоРебенкаИнвалида) 
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ * ДетиРаботников.КвоДетейИнвалидов 
				|							КОГДА СведенияОЛьготах.Льгота.СпособПримененияНДФЛ = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЛьготРаботников.НаТроихДетей)
				|										И ДетиРаботников.КвоДетей >= 3
				|								ТОГДА СведенияОЛьготах.Льгота.РазмерНДФЛ * ДетиРаботников.КвоДетей 
				|		 		       		ИНАЧЕ 0
				|	         		   		КОНЕЦ
				|					КАК ЧИСЛО(5,2) )       		КАК КвоЛьгот,
				|	 
				|			"+КвоПороговЛьгот+"
				|			ИЗ " + ТекстЗапросаВТАктуальныеЛьготыРаботниковПоНалоговымПериодам + " КАК СведенияОЛьготах
				|
				|			ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДетиРаботников + " КАК ДетиРаботников
				|			ПО		СведенияОЛьготах.Сотрудник = ДетиРаботников.Сотрудник
				|				И   СведенияОЛьготах.НалоговыйПериод = ДетиРаботников.НалоговыйПериод
				|	) КАК Льготы
				|	СГРУППИРОВАТЬ ПО
				|		Льготы.Сотрудник,
				|		Льготы.НалоговыйПериод,
				|		Льготы.КвоЛьгот,
				|		Льготы.КвоПороговЛьгот
				|";
            КонецЕсли;
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТЛьготы = "ВТЛьготы";
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЛьготы";
		
		// ВТЛьготыРаботников
		Если Истина Тогда
			// 
			//
			ТекстЗапроса = "
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		Льготы.Сотрудник			КАК Сотрудник,
			|		Льготы.НалоговыйПериод		КАК НалоговыйПериод,
			|		Льготы.КвоЛьгот					КАК КвоЛьгот,
			|		ПараметрыЛьгот.КвоПороговЛьгот	КАК КвоПороговЛьгот,
			|		ПараметрыЛьгот.Льгота			КАК Льгота,
			|		БазоваяЛьгота.КвоЛьгот			КАК БазоваяКвоЛьгот,
			|		БазоваяЛьгота.КвоПороговЛьгот	КАК БазоваяКвоПороговЛьгот,
			|		БазоваяЛьгота.Льгота			КАК БазоваяЛьгота
			|	 
			|ПОМЕСТИТЬ ВТЛьготыРаботников
			|	ИЗ (
			|  		ВЫБРАТЬ
			|			Основной.Сотрудник    			КАК Сотрудник,
			|			Основной.НалоговыйПериод    	КАК НалоговыйПериод,
			|			МАКСИМУМ( Основной.КвоЛьгот )	КАК КвоЛьгот
			|		ИЗ	" + ТекстЗапросаВТЛьготы + " КАК Основной
			|   	СГРУППИРОВАТЬ ПО
			|			Основной.Сотрудник,
			|			Основной.НалоговыйПериод
			|   ) КАК Льготы
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТЛьготы + "  КАК ПараметрыЛьгот
			|	ПО		Льготы.Сотрудник = ПараметрыЛьгот.Сотрудник
			|		И	Льготы.НалоговыйПериод = ПараметрыЛьгот.НалоговыйПериод
			|   	И	Льготы.КвоЛьгот = ПараметрыЛьгот.КвоЛьгот
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТЛьготы + "  КАК БазоваяЛьгота
			|	ПО		Льготы.Сотрудник = БазоваяЛьгота.Сотрудник
			|   	И	Льготы.НалоговыйПериод = БазоваяЛьгота.НалоговыйПериод
			|   	И	БазоваяЛьгота.Льгота = &парамБазоваяЛьгота
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТЛьготыРаботников = "ВТЛьготыРаботников";
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТЛьготыРаботников";
		
		// ВТСтавки
		Если Истина Тогда
			// Получает по Сотрудникам в разрезе периодов актуальные льготы
			//
			ТекстЗапроса = "
			|  	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		АктивныеПериоды.НалоговыйПериод    	КАК НалоговыйПериод,
			|		МинимальнаяОплатаТруда.Размер		КАК МинимальнаяОплатаТруда,
			|		ПрожиточныеМинимумы.Размер			КАК ПрожиточныйМинимум,
			|		АктивныеПериоды.ВидСтавки           КАК ВидСтавкиНДФЛ,           
			|		СтавкиНДФЛ.Ставка                   КАК СтавкаНДФЛ,           
			|		СтавкиНДФЛ.Порог                    КАК ПорогСтавкаНДФЛ,
			|		РазмерыЛьготНДФЛ.Ставка 			КАК РазмерыЛьготНДФЛСтавка,
			|		РазмерыЛьготНДФЛ.Порог       		КАК РазмерыЛьготНДФЛПорог
			|ПОМЕСТИТЬ ВТСтавки
			|	ИЗ	(
			|  		ВЫБРАТЬ
			|			Основной.НалоговыйПериод    				КАК НалоговыйПериод,
			|			СтавкиНДФЛ.ВидСтавки    					КАК ВидСтавки,
			|			МАКСИМУМ( МинимальнаяОплатаТруда.Период )	КАК ПериодМинимальнаяОплатаТруда,
			|			МАКСИМУМ( ПрожиточныеМинимумы.Период )		КАК ПериодПрожиточныеМинимумы,
			|			МАКСИМУМ( СтавкиНДФЛ.Период )				КАК ПериодСтавкиНДФЛ,
			|			МАКСИМУМ( РазмерыЛьготНДФЛ.Период )			КАК ПериодРазмерыЛьготНДФЛ
			|		ИЗ	" + ТекстЗапросаВТНалоговыеПериоды + " КАК Основной
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТруда КАК МинимальнаяОплатаТруда
			|		ПО		НАЧАЛОПЕРИОДА(Основной.НалоговыйПериод, ГОД) >= МинимальнаяОплатаТруда.Период
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожиточныеМинимумы
			|		ПО		НАЧАЛОПЕРИОДА(Основной.НалоговыйПериод, ГОД) >= ПрожиточныеМинимумы.Период
			|		        И ПрожиточныеМинимумы.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДФЛ КАК СтавкиНДФЛ
			|		ПО		Основной.НалоговыйПериод >= СтавкиНДФЛ.Период
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыЛьготНДФЛ КАК РазмерыЛьготНДФЛ
			|		ПО		Основной.НалоговыйПериод >= РазмерыЛьготНДФЛ.Период
			|
			|   	СГРУППИРОВАТЬ ПО
			|			Основной.НалоговыйПериод,
			|			СтавкиНДФЛ.ВидСтавки
			|   ) КАК АктивныеПериоды
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТруда КАК МинимальнаяОплатаТруда
			|	ПО		АктивныеПериоды.ПериодМинимальнаяОплатаТруда = МинимальнаяОплатаТруда.Период
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрожиточныеМинимумы КАК ПрожиточныеМинимумы
			|	ПО		АктивныеПериоды.ПериодПрожиточныеМинимумы = ПрожиточныеМинимумы.Период
			|     И ПрожиточныеМинимумы.СоциальнаяГруппа = ЗНАЧЕНИЕ(Перечисление.СоциальныеГруппыНаселения.Трудоспособные)
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДФЛ КАК СтавкиНДФЛ
			|	ПО		АктивныеПериоды.ПериодСтавкиНДФЛ = СтавкиНДФЛ.Период
			|		И	АктивныеПериоды.ВидСтавки = СтавкиНДФЛ.ВидСтавки
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыЛьготНДФЛ КАК РазмерыЛьготНДФЛ
			|	ПО		АктивныеПериоды.ПериодРазмерыЛьготНДФЛ = РазмерыЛьготНДФЛ.Период
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТСтавки = "ВТСтавки";
		КонецЕсли; 
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСтавки";
		
		// ВТНалогДо
		Если НЕ ТолькоПоДвижениямТекущегоДокумента Тогда
			// Получает по Сотрудникам ранее начисленные суммц НДФЛ и дохода
			//
			ТекстЗапроса = "
			|		ВЫБРАТЬ 
			|			НДФЛ.Сотрудник			КАК Сотрудник, 
			|			НДФЛ.НалоговыйПериод	КАК НалоговыйПериод, 
			|			НДФЛ.ДоходНДФЛ			КАК ДоходНДФЛ, 
			|			СУММА(НДФЛ.Доход)	КАК Доход,
			|			СУММА(НДФЛ.Налог)КАК Налог
			|ПОМЕСТИТЬ ВТНалогДо
			|		ИЗ РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК НДФЛ
			|
			|	ГДЕ	(НДФЛ.Период <= &парамПериодРегистрации ИЛИ НДФЛ.Регистратор ССЫЛКА Документ.Сторнирование)
			|		И	НДФЛ.Регистратор <> &парамРегистратор
			|		И	НДФЛ.ВидДвижения = &парамПриход
			|		И	НДФЛ.Организация = &парамОрганизация
			|		И	НДФЛ.Сотрудник В (&парамСотрудники)
			|		И	НДФЛ.НалоговыйПериод В (ВЫБРАТЬ РАЗЛИЧНЫЕ Периоды.НалоговыйПериод ИЗ " + ТекстЗапросаВТСотрудникиПоНалоговымПериодам + " КАК Периоды )
			|
			|		СГРУППИРОВАТЬ ПО
			|			НДФЛ.Сотрудник, 
			|			НДФЛ.НалоговыйПериод, 
			|			НДФЛ.ДоходНДФЛ 
			|";
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
			ТекстЗапросаВТНалогДо = "ВТНалогДо";
		КонецЕсли; 
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНалогДо";
		
	КонецЕсли;
	
	// Конец формирования виртуальных таблиц
	/////////////////////////////////////////////////////////////////////
	
	Если ИспользуетсяНК Тогда
		Если ВариантНДФЛ = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения Тогда
			ЗапросВсего = 	"ЛЕВОЕ СОЕДИНЕНИЕ
					|   (ВЫБРАТЬ
					|      Начисления.Сотрудник КАК Сотрудник,
					|      Начисления.НалоговыйПериод КАК НалоговыйПериод,
					|      СУММА(Начисления.Доход) КАК Доход
					|    ИЗ "+ТекстЗапросаВТДоход+" КАК Начисления
					|    ГДЕ Начисления.ДоходНДФЛ.ВидСтавкиУвеличенная = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.Увеличенная)
					|    СГРУППИРОВАТЬ ПО
					|      Начисления.Сотрудник,
					|      Начисления.НалоговыйПериод
					|   ) КАК НачисленияВсего
					|ПО		Основной.Сотрудник  = НачисленияВсего.Сотрудник
					|	И	Основной.НалоговыйПериод  = НачисленияВсего.НалоговыйПериод
					|ЛЕВОЕ СОЕДИНЕНИЕ
					|   (ВЫБРАТЬ
					|      Взносы.Сотрудник КАК Сотрудник,
					|      Взносы.НалоговыйПериод КАК НалоговыйПериод,
					|      СУММА(Взносы.СуммаВзносов) КАК СуммаВзносов
					|    ИЗ ВТВзносы КАК Взносы
					|    СГРУППИРОВАТЬ ПО
					|      Взносы.Сотрудник,
					|      Взносы.НалоговыйПериод
					|   ) КАК ВзносыВсего
					|ПО		Основной.Сотрудник  = ВзносыВсего.Сотрудник
					|	И	Основной.НалоговыйПериод  = ВзносыВсего.НалоговыйПериод";
					
			РезультатВсего = "	НачисленияВсего.Доход КАК ДоходПолный,
							 |	ВзносыВсего.СуммаВзносов КАК ВзносыВсего,";		
			
			РезультатВидСтавки = "Основной.УвеличеннаяСтавка КАК ОсновнойВидСтавкиУвеличенная,
								|СтавкиУвеличенная.СтавкаНДФЛ  КАК СтавкаНДФЛУвеличенная,
								|СтавкиУвеличенная.ПорогСтавкаНДФЛ  КАК ПорогСтавкаНДФЛУвеличенная,";
								
			ЗапросВидСтавки = 	"ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТСтавки + " КАК СтавкиУвеличенная
								|ПО		Основной.НалоговыйПериод	= СтавкиУвеличенная.НалоговыйПериод
								|И		Основной.УвеличеннаяСтавка	= СтавкиУвеличенная.ВидСтавкиНДФЛ";
		Иначе //Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы
			ТекстЗапроса = "
			    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Основной.НомерСтроки  КАК НомерСтроки,
				|	СУММА(НачисленияВсего.Доход) КАК Доход,
				|	СУММА(
				|	 ВЫБОР КОГДА Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ) И Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42)
				|	 ТОГДА НачисленияВсего.ДоходДляВзносов
				|	 ИНАЧЕ 0 КОНЕЦ) КАК ДоходДляВзносов
				|ПОМЕСТИТЬ ВТДоходПолный
				|ИЗ
				|  РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК Основной
				|  ЛЕВОЕ СОЕДИНЕНИЕ
				|   (ВЫБРАТЬ
				|      Начисления.Сотрудник КАК Сотрудник,
				|      Начисления.ДоходНДФЛ КАК ДоходНДФЛ,
				|      Начисления.НалоговыйПериод КАК НалоговыйПериод,
				|      Начисления.НомерСтроки КАК НомерСтроки,
				|      СУММА(Начисления.Доход) КАК Доход,
				|	   СУММА(ВЫБОР КОГДА Начисления.ДоходНДФЛ.ЭтоМесячныйДоход
				|       ТОГДА Начисления.Доход ИНАЧЕ 0 КОНЕЦ) КАК ДоходДляВзносов 
				|    ИЗ "+ТекстЗапросаВТДоход+" КАК Начисления
				|    ГДЕ Начисления.ДоходНДФЛ.ВидСтавкиУвеличенная = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.Увеличенная)
				|    СГРУППИРОВАТЬ ПО
				|      Начисления.Сотрудник,
				|      Начисления.ДоходНДФЛ,
				|      Начисления.НалоговыйПериод,
				|      Начисления.НомерСтроки
				|   ) КАК НачисленияВсего
				|ПО		Основной.Сотрудник  = НачисленияВсего.Сотрудник
				|	И	Основной.НалоговыйПериод  = НачисленияВсего.НалоговыйПериод
				|	И	Основной.НомерСтроки  > НачисленияВсего.НомерСтроки
				|	И	Основной.ДоходНДФЛ.ВидСтавкиУвеличенная = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДФЛ.Увеличенная)
				|ГДЕ Основной.Регистратор = &парамРегистратор
				|	И	Основной.Сотрудник В (&парамСотрудники)
				|
				|СГРУППИРОВАТЬ ПО
				| Основной.НомерСтроки";
				
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();
				

				
				ЗапросВсего = 	"ЛЕВОЕ СОЕДИНЕНИЕ
				|   ВТДоходПолный КАК НачисленияВсего
				|ПО		Основной.НомерСтроки  = НачисленияВсего.НомерСтроки
				|";
					
			РезультатВсего = "	НачисленияВсего.Доход КАК ДоходПолный,
							 |	НачисленияВсего.ДоходДляВзносов КАК ВзносыВсего,";
							 
			РезультатВидСтавки = "Основной.УвеличеннаяСтавка КАК ОсновнойВидСтавкиУвеличенная,
								|СтавкиУвеличенная.СтавкаНДФЛ  КАК СтавкаНДФЛУвеличенная,
								|СтавкиУвеличенная.ПорогСтавкаНДФЛ  КАК ПорогСтавкаНДФЛУвеличенная,";
								
			ЗапросВидСтавки = 	"ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТСтавки + " КАК СтавкиУвеличенная
								|ПО		Основной.НалоговыйПериод	= СтавкиУвеличенная.НалоговыйПериод
								|И		Основной.УвеличеннаяСтавка	= СтавкиУвеличенная.ВидСтавкиНДФЛ";
			
			
		КонецЕсли;		

		
	Иначе
		ЗапросВсего = 	"";
		РезультатВсего = "	0 КАК ДоходПолный, 0 КАК ВзносыВсего,";
		РезультатВидСтавки = "0 КАК ОсновнойВидСтавкиУвеличенная,
							|0  КАК СтавкаНДФЛУвеличенная,
							|0  КАК ПорогСтавкаНДФЛУвеличенная,";
		ЗапросВидСтавки = 	"";
		
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ИспользуетсяНК				КАК ИспользуетсяНК,
	|	&ВариантНДФЛ				КАК ВариантНДФЛ, 
	|	Основной.Регистратор.ОтражатьВУпрУчете КАК ОтражатьВУпрУчете, 
	|	Основной.НомерСтроки				КАК НомерСтроки, 
	|	Основной.Авторасчет					КАК Авторасчет,
	|	Основной.Сотрудник					КАК Сотрудник,
	|	Основной.Регистратор				КАК Регистратор,
	|ВЫБОР КОГДА Основной.Регистратор ССЫЛКА Документ.ЗарплатаКВыплатеОрганизаций ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ	Как ЗарплатаКВыплатеОрганизаций,
	|	Основной.НалоговыйПериод			КАК НалоговыйПериод,
	|	Основной.ДоходНДФЛ.ЭтоМесячныйДоход КАК ЭтоМесячныйДоход,
	|	Основной.ДоходНДФЛ					КАК ДоходНДФЛ,
	|	ВЫБОР	КОГДА	&парамВалютаУпрУчета = &парамВалютаРегламентУчета 
	|			ТОГДА 1 
	|			ИНАЧЕ ВалютыУпр.Курс/ВалютыУпр.Кратность КОНЕЦ
	|										КАК КурсВалютыУпр,
	|	                              
	|	"+?(ТолькоПоДвижениямТекущегоДокумента,"0","НалогДо.Доход")+"	КАК ДоходДо,
	|	"+?(ТолькоПоДвижениямТекущегоДокумента,"0","НалогДо.Налог")+"	КАК НалогДо,
	|	                              
	|	Начисления.Доход					КАК Доход,
	|"+РезультатВсего+"
	|	НачисленияЛьготы.Доход				КАК ДоходЛьготы,
	|	Взносы.СуммаВзносов					КАК СуммаВзносов,
	|	Взносы.БазаВзносов					КАК БазаВзносов,
	|	Взносы.СуммаВзносовБЛ				КАК СуммаВзносовБЛ,
	|	Взносы.БазаВзносовБЛ				КАК БазаВзносовБЛ,
	|	                              
	|Основной.НалоговыйПериод КАК ОсновнойНалоговыйПериод, 
	|Основной.ВидСтавки       КАК ОсновнойВидСтавки,
	|Ставки.НалоговыйПериод   КАК СтавкиНалоговыйПериод,
	|Ставки.ВидСтавкиНДФЛ     КАК СтавкиВидСтавкиНДФЛ,
	|	Ставки.МинимальнаяОплатаТруда		КАК МинимальнаяОплатаТруда,
	|	Ставки.ПрожиточныйМинимум			КАК ПрожиточныйМинимум,
	|	Ставки.СтавкаНДФЛ                   КАК СтавкаНДФЛ,           
	|	Ставки.РазмерыЛьготНДФЛСтавка 		КАК РазмерыЛьготНДФЛСтавка,
	|	Ставки.РазмерыЛьготНДФЛПорог       	КАК РазмерыЛьготНДФЛПорог,
	|
	|"+РезультатВидСтавки+"
	|	                                                            
	|	ЛьготыРаботников.Льгота				КАК Льгота,
	|	ЛьготыРаботников.КвоПороговЛьгот    КАК КвоПороговЛьгот,                          
	|	// если доход меньше одного порога и есть базовая льгота то количество льгот складывается
	|   ВЫБОР	КОГДА	НачисленияЛьготы.Доход <= Ставки.РазмерыЛьготНДФЛПорог          
	|                И	НЕ ЕстьNULL(ПараметрыОрганизаций.ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской,Ложь)
	|                И	ЛьготыРаботников.Льгота	В (&парамРазрешенныеДублиЛьгот)
	|				ТОГДА ЛьготыРаботников.КвоЛьгот + ЕСТЬNULL(ЛьготыРаботников.БазоваяКвоЛьгот, 0)
	|   		КОГДА	НачисленияЛьготы.Доход <= ЛьготыРаботников.КвоПороговЛьгот*Ставки.РазмерыЛьготНДФЛПорог          
	|                И	ЕстьNULL(ПараметрыОрганизаций.ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской,Ложь)
	|                И	ЛьготыРаботников.Льгота	В (&парамРазрешенныеДублиЛьгот)
	|				ТОГДА ЛьготыРаботников.КвоЛьгот + ЕСТЬNULL(ЛьготыРаботников.БазоваяКвоЛьгот, 0)
	|			КОГДА	НачисленияЛьготы.Доход <= Ставки.РазмерыЛьготНДФЛПорог*ЕСТЬNULL(ЛьготыРаботников.КвоПороговЛьгот, 0)          
	|				ТОГДА ЛьготыРаботников.КвоЛьгот
	|         ИНАЧЕ 0
	|   КОНЕЦ						        КАК КвоЛьгот,
	|   ЕСТЬNULL(ПараметрыОрганизаций.НеПрименятьЛьготуНДФЛДляАвансов,ЛОЖЬ) КАК НеПрименятьЛьготуНДФЛДляАвансов, 
	|   ЕСТЬNULL(ПараметрыОрганизаций.НеПрименятьЛьготуНДФЛДляБудущихПериодов,ЛОЖЬ) КАК НеПрименятьЛьготуНДФЛДляБудущихПериодов
	|
	|
	|ИЗ	РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК Основной
	|
	|"+?(ТолькоПоДвижениямТекущегоДокумента,"","
	|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТНалогДо+" КАК НалогДо 
	| 	ПО		Основной.Сотрудник = НалогДо.Сотрудник
	|		И	Основной.ДоходНДФЛ = НалогДо.ДоходНДФЛ
	|		И	Основной.НалоговыйПериод = НалогДо.НалоговыйПериод
	|")+" 
	| 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыРасчетаЗарплатыОрганизаций КАК ПараметрыОрганизаций
	|ПО		Основной.Организация  = ПараметрыОрганизаций.Организация
	| 
	|	// курсы упр. валюты 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамПериодРегистрации) КАК ВалютыУпр
	|	ПО  ВалютыУпр.Валюта = &парамВалютаУпрУчета 
	| 
	|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТДоход+" КАК Начисления
	|ПО		Основной.Сотрудник  = Начисления.Сотрудник
	|	И	Основной.НалоговыйПериод  = Начисления.НалоговыйПериод
	|	И	Основной.ДоходНДФЛ  = Начисления.ДоходНДФЛ
	|
	|"+ЗапросВсего+"
	| 
	|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТДоходЛьготы+" КАК НачисленияЛьготы
	|ПО		Основной.Сотрудник  = НачисленияЛьготы.Сотрудник
	|	И	Основной.НалоговыйПериод  = НачисленияЛьготы.НалоговыйПериод
	|	И	Основной.ДоходНДФЛ.ЭтоМесячныйДоход
	| 
	|ЛЕВОЕ СОЕДИНЕНИЕ "+ТекстЗапросаВТВзносы+" КАК Взносы
	|ПО		Основной.Сотрудник  = Взносы.Сотрудник
	|	И	Основной.НалоговыйПериод  = Взносы.НалоговыйПериод
	|	И	Основной.ДоходНДФЛ	= Взносы.ДоходНДФЛ
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТСтавки + " КАК Ставки
	|ПО		Основной.НалоговыйПериод	= Ставки.НалоговыйПериод
	|И		Основной.ВидСтавки	= Ставки.ВидСтавкиНДФЛ
	|
	|"+ЗапросВидСтавки+"
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТЛьготыРаботников + " КАК ЛьготыРаботников
	|ПО		Основной.Сотрудник			= ЛьготыРаботников.Сотрудник
	|	И	Основной.НалоговыйПериод	= ЛьготыРаботников.НалоговыйПериод
	|	И	Основной.ДоходНДФЛ.ЭтоМесячныйДоход
	|	И   Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код01ГПХ)
	|	И   Основной.ДоходНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код42)
	|
	|ГДЕ Основной.Регистратор = &парамРегистратор
	|	И	Основной.Сотрудник В (&парамСотрудники)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основной.НомерСтроки
	|";
	
	Запрос.Текст = ТекстЗапроса; 
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьДанныеДляРасчетаНДФЛ()

Процедура РассчитатьЗаписиНабораНДФЛ(ИсходныеДанные,
									НаборЗаписейРегистра,
									ТабличнаяЧастьДокумента,
									МассивИндексыСтрокТабличнойЧасти = Неопределено,
									КомментироватьРасчет = Ложь, ФормаКомментариев = НеОпределено)
	
	СтруктураПоиска = Новый Структура("НомерСтроки");
	
	Для Каждого СтрокаДвижений Из НаборЗаписейРегистра Цикл
		СтруктураПоиска.НомерСтроки = СтрокаДвижений.НомерСтроки;
		
		Если ИсходныеДанные.НайтиСледующий(СтруктураПоиска) Тогда
			СтрокаТабличнойЧасти = Неопределено;
			Если ТабличнаяЧастьДокумента <> Неопределено Тогда
				Если МассивИндексыСтрокТабличнойЧасти = Неопределено Тогда
					//расчет всего документа
					СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений));
				Иначе
					//расчет по сотруднику
					СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(МассивИндексыСтрокТабличнойЧасти.Получить(НаборЗаписейРегистра.Индекс(СтрокаДвижений)));
				КонецЕсли;
			КонецЕсли;
			
			// Окончательный расчет
			РассчитатьЗаписьНДФЛ(СтрокаДвижений, ИсходныеДанные, КомментироватьРасчет, ФормаКомментариев);
			
			Если ТабличнаяЧастьДокумента <> НеОпределено Тогда
				
				СтрокаТабличнойЧасти.Доход		= СтрокаДвижений.Доход;
				СтрокаТабличнойЧасти.Налог		= СтрокаДвижений.Налог;
				СтрокаТабличнойЧасти.НалогУпр	= СтрокаДвижений.НалогУпр;
				СтрокаТабличнойЧасти.Льгота		= СтрокаДвижений.Льгота;
				СтрокаТабличнойЧасти.КоличествоЛьгот	= СтрокаДвижений.КоличествоЛьгот;
				СтрокаТабличнойЧасти.ДоходПолный = СтрокаДвижений.ДоходПолный;
				
				Если ИсходныеДанные.ЗарплатаКВыплатеОрганизаций Тогда
					СтрокаТабличнойЧасти.ПериодВзаиморасчетов	= ИсходныеДанные.Регистратор.ПериодРегистрации;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры // РассчитатьЗаписиНабораНДФЛ

Процедура	РассчитатьЗаписьНДФЛ(СтрокаДвижений, ИсходныеДанные, КомментироватьРасчет, ФормаКомментариев)
	
	Если НЕ СтрокаДвижений.Авторасчет Тогда
		Возврат;
	КонецЕсли;
	


	Если НЕ СтрокаДвижений.Сторно Тогда
	
		// Сначала рассчитаем базу налога
		ДоходДо			= ?( ИсходныеДанные.ДоходДо<> NULL			, ИсходныеДанные.ДоходДо, 0);
		НалогДо			= ?( ИсходныеДанные.НалогДо<> NULL			, ИсходныеДанные.НалогДо, 0);
		Доход			= ?( ИсходныеДанные.Доход<> NULL			, ИсходныеДанные.Доход, 0);
		ДоходЛьготы		= ?( ИсходныеДанные.ДоходЛьготы<> NULL		, ИсходныеДанные.ДоходЛьготы, 0);
		КоэфЛьготы = ?(ИсходныеДанные.ЭтоМесячныйДоход, ?(ДоходЛьготы = 0, 0, Окр(Доход/ДоходЛьготы,5)), 1);
		ДоходПолный		= ?( ИсходныеДанные.ДоходПолный<> NULL			, ИсходныеДанные.ДоходПолный, 0);
		ВзносыВсего		= ?( ИсходныеДанные.ВзносыВсего<> NULL			, ИсходныеДанные.ВзносыВсего, 0);

		СуммаВзносов	= ?( ИсходныеДанные.СуммаВзносов<> NULL	, ИсходныеДанные.СуммаВзносов, 0);
		БазаВзносов		= ?( ИсходныеДанные.БазаВзносов<> NULL	, ИсходныеДанные.БазаВзносов, 0);
		СуммаВзносовБЛ	= ?( ИсходныеДанные.СуммаВзносовБЛ<> NULL	, ИсходныеДанные.СуммаВзносовБЛ, 0);
		БазаВзносовБЛ	= ?( ИсходныеДанные.БазаВзносовБЛ<> NULL	, ИсходныеДанные.БазаВзносовБЛ, 0);
		БазаНалога		= Окр(Доход, 2) - ?(ИсходныеДанные.ЭтоМесячныйДоход, СуммаВзносов+СуммаВзносовБЛ, 0);
		
		МинимальнаяОплатаТруда	= ?( ИсходныеДанные.МинимальнаяОплатаТруда <> NULL	, ИсходныеДанные.МинимальнаяОплатаТруда, 0);
		ПрожиточныйМинимум		= ?( ИсходныеДанные.ПрожиточныйМинимум <> NULL	, ИсходныеДанные.ПрожиточныйМинимум, 0);
		СтавкаНДФЛ				= ?( ИсходныеДанные.СтавкаНДФЛ<> NULL				, ИсходныеДанные.СтавкаНДФЛ, 0);
		СтавкаНДФЛУвеличенная		= ?( ИсходныеДанные.СтавкаНДФЛУвеличенная<> NULL			, ИсходныеДанные.СтавкаНДФЛУвеличенная, 0);
		ПорогСтавкаНДФЛУвеличенная		= ?( ИсходныеДанные.ПорогСтавкаНДФЛУвеличенная<> NULL			, ИсходныеДанные.ПорогСтавкаНДФЛУвеличенная, 0);
		
		КвоПороговЛьгот	= ?( ИсходныеДанные.КвоПороговЛьгот<> NULL		, ИсходныеДанные.КвоПороговЛьгот, 0);
		ПорогЛьготы		= ?( ИсходныеДанные.РазмерыЛьготНДФЛПорог<> NULL	, ИсходныеДанные.РазмерыЛьготНДФЛПорог, 0);
		СтавкаЛьготы	= ?( ИсходныеДанные.РазмерыЛьготНДФЛСтавка<> NULL	, ИсходныеДанные.РазмерыЛьготНДФЛСтавка, 0);
		
		СуммаЛьготы = 0;
		СуммаЛьготыВсего = 0;
		
		Если ИсходныеДанные.ЗарплатаКВыплатеОрганизаций И ИсходныеДанные.НеПрименятьЛьготуНДФЛДляАвансов Тогда
			КвоЛьгот = 0;
			Льгота	= Справочники.ВидыЛьготРаботниковОрганизаций.ПустаяСсылка();
		ИначеЕсли ИсходныеДанные.НеПрименятьЛьготуНДФЛДляБудущихПериодов И (ИсходныеДанные.Регистратор.ПериодРегистрации < ИсходныеДанные.НалоговыйПериод) Тогда	
		    КвоЛьгот = 0;
			Льгота	= Справочники.ВидыЛьготРаботниковОрганизаций.ПустаяСсылка();
		Иначе	
			Если ДоходЛьготы <= КвоПороговЛьгот * ПорогЛьготы Тогда			
				Льгота		= ИсходныеДанные.Льгота;
				
				КвоЛьгот	= ?( ИсходныеДанные.КвоЛьгот <> NULL, ИсходныеДанные.КвоЛьгот, 0);
				Если НЕ ИсходныеДанные.ИспользуетсяНК Тогда
					СуммаЛьготыВсего = МинимальнаяОплатаТруда * СтавкаЛьготы * КоэфЛьготы;
					СуммаЛьготы = Окр(КвоЛьгот * МинимальнаяОплатаТруда * СтавкаЛьготы * КоэфЛьготы,2);
				Иначе
					СуммаЛьготыВсего = ПрожиточныйМинимум * СтавкаЛьготы * КоэфЛьготы;
					СуммаЛьготы = Окр(КвоЛьгот * ПрожиточныйМинимум * СтавкаЛьготы * КоэфЛьготы,2);
				КонецЕсли;
				БазаНалога	= БазаНалога - СуммаЛьготы;
				
			Иначе
				
				КвоЛьгот=0;
				Если Льгота = Неопределено Тогда
					Льгота		= Справочники.ВидыЛьготРаботниковОрганизаций.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		
		Если НЕ ИсходныеДанные.ИспользуетсяНК Тогда
			
			Налог = Окр(Макс(БазаНалога * СтавкаНДФЛ, 0), 2);
		ИначеЕсли ИсходныеДанные.ВариантНДФЛ = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения Тогда 	
		
			Налог = Окр(Макс(БазаНалога * СтавкаНДФЛ, 0), 5);
			
			//ст. 167.1 Налогового кодекса - если общий доход превышает 10-ти кратный размер минимальной зарплаты,
			//то к сумме превышения применяется ставка 17%.
			//Т.е. к налогу по ставке 15% (уже рассчитано) надо доначислить 2% от суммы превышения.
			//Если в месяце есть несколько видов дохода - учтем по каждому пропорционально?
			Если СтавкаНДФЛУвеличенная <> 0 И СтавкаНДФЛУвеличенная <> СтавкаНДФЛ И ДоходПолный <> 0 И (ДоходПолный <> ВзносыВсего) И Доход <> 0 Тогда
				Превышение = Макс(ДоходПолный - ВзносыВсего - ПорогСтавкаНДФЛУвеличенная,0)*БазаНалога/(ДоходПолный - ВзносыВсего);
				СтавкаПревышение = Макс(СтавкаНДФЛУвеличенная - СтавкаНДФЛ,0);
				НалогПревышение = Окр(Превышение*СтавкаПревышение,5);
				Налог = Окр(Налог + НалогПревышение,2);
			Иначе
				Превышение = 0;
				НалогПревышение = 0;
				Налог = Окр(Налог,2);
			КонецЕсли;
			
		Иначе //Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы
			
			Предел = МАКС(ПорогСтавкаНДФЛУвеличенная - ДоходПолный,0);
			Если СтавкаНДФЛУвеличенная = 0 ИЛИ СтавкаНДФЛУвеличенная = СтавкаНДФЛ ИЛИ Доход <= Предел Тогда
			    Налог = Окр(Макс(БазаНалога * СтавкаНДФЛ, 0), 2);
				Доход15 = Доход;
				СуммаВзносов15 =  СуммаВзносов;
				СуммаВзносовБЛ15 =  СуммаВзносовБЛ;
				БазаНалога15 = БазаНалога;
				Налог15 = Налог;
				Доход17 = 0;
				СуммаВзносов17 =  0;
				СуммаВзносовБЛ17 =  0;
				БазаНалога17 = 0;
				Налог17 = 0;				
			Иначе
				//Письмо ГНАУ 03.02.11 р. № 2919/7/17-0717
				//Для расчета НДФЛ отдельно определяется база налога для ставки 15% и ставки 17%
				//Для этого ЕСВ разделяется на сумму до порога и свыше порога
				//Сначала учитывается ЕСВ с зарплаты, затем - с больничных
				Если БазаВзносов = 0 Тогда
					СтавкаВзносов = 0;
				Иначе
					СтавкаВзносов = СуммаВзносов/БазаВзносов;
				КонецЕсли;
				Если БазаВзносовБЛ = 0 Тогда
					СтавкаВзносовБЛ = 0;
				Иначе
					СтавкаВзносовБЛ = СуммаВзносовБЛ/БазаВзносовБЛ;
				КонецЕсли;
				Доход15 = Предел;
				БазаВзносов15 = Мин(Предел,Макс(БазаВзносов-ВзносыВсего,0));
				СуммаВзносов15 =  Окр(БазаВзносов15*СтавкаВзносов,2);
				БазаВзносовБЛ15 = Мин(Макс(Предел-БазаВзносов15,0),БазаВзносовБЛ);
				СуммаВзносовБЛ15 = Окр(БазаВзносовБЛ15*СтавкаВзносовБЛ,2);
				
				БазаНалога15 = Доход15 - СуммаВзносов15 - СуммаВзносовБЛ15;
				Налог15 = Окр(Макс(БазаНалога15 * СтавкаНДФЛ, 0), 2);
				
				Доход17 = Доход-Доход15;
				БазаВзносов17 = Мин(Доход17,Макс(БазаВзносов-ВзносыВсего,0)-БазаВзносов15);
				СуммаВзносов17 =  Окр(БазаВзносов17*СтавкаВзносов,2);
				БазаВзносовБЛ17 = Мин(Макс(Доход17-БазаВзносов17,0),Макс(БазаВзносовБЛ-БазаВзносовБЛ15,0));
				СуммаВзносовБЛ17 =  Окр(БазаВзносовБЛ17*СтавкаВзносовБЛ,2);
				
				БазаНалога17 = Доход17 - СуммаВзносов17 - СуммаВзносовБЛ17;
				Налог17 = Окр(Макс(БазаНалога17 * СтавкаНДФЛУвеличенная, 0), 2);
				
				Налог = Налог15 + Налог17;
			КонецЕсли;	
		КонецЕсли;	
		
		Если КомментироватьРасчет Тогда
			
			Если НЕ ИсходныеДанные.ИспользуетсяНК Тогда
				КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет НДФЛ за ';uk='Розрахунок ПДФО за '") + Формат(СтрокаДвижений.НалоговыйПериод,"ДФ='МММ гггг'") + НСтр("ru=' (Код дохода ';uk=' (Код доходу '") + СтрокаДвижений.ДоходНДФЛ + ")");
				КомментарийРасчета(НСтр("ru='Сумма дохода : ';uk='Сума доходу : '") + Доход, КомментарийВидаРасчета);
				Если ДоходДо <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	доход до: ';uk='    дохід до:'") + ДоходДо, КомментарийВидаРасчета);
				КонецЕсли;	
				КомментарийРасчета(НСтр("ru='Учтено взносов : ';uk='Враховано внесків: '") + СуммаВзносов, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Ставка НДФЛ : ';uk='Ставка ПДФО :'") + СтавкаНДФЛ, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Всего сумма льготы : ';uk='Усього сума пільги :'") + СуммаЛьготыВсего, КомментарийВидаРасчета);
				Если ИсходныеДанные.ЭтоМесячныйДоход И КоэфЛьготы <> 1 Тогда
					КомментарийРасчета(НСтр("ru='	Коєффициент учета вида дохода в месячном доходе : ';uk='	Коефіцієнт обліку виду доходу в місячному доході : '") + КоэфЛьготы, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Учтенная сумма льготы по текущему виду дохода: ';uk='    Врахована сума пільги по поточному виду доходу:'") + СуммаЛьготы, КомментарийВидаРасчета);
				КонецЕсли;
				КомментарийРасчета(НСтр("ru='	Действующая льгота : ';uk='    Діюча пільга :'") + Льгота, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='	Количество льгот : ';uk='    Кількість пільг :'") + ИсходныеДанные.КвоЛьгот, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='	Количество порогов для применения льготы : ';uk='	Кількість порогів для застосування пільги : '") + КвоПороговЛьгот, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='	Порог льготы : ';uk='	Поріг пільги : '") + КвоПороговЛьгот * ПорогЛьготы, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Минимальная оплата труда : ';uk='Мінімальна оплата праці :'") + МинимальнаяОплатаТруда, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='База налога : ';uk='База податку :'") + БазаНалога, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Налог : ';uk='Податок :'") + Налог, КомментарийВидаРасчета);
			ИначеЕсли ИсходныеДанные.ВариантНДФЛ = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения Тогда 	
				КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет НДФЛ за ';uk='Розрахунок ПДФО за '") + Формат(СтрокаДвижений.НалоговыйПериод,"ДФ='МММ гггг'") + НСтр("ru=' (Код дохода ';uk=' (Код доходу '") + СтрокаДвижений.ДоходНДФЛ + ")");
				КомментарийРасчета(НСтр("ru='Доход полный за период : ';uk='Дохід повний за період :'") + ДоходПолный, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Сумма дохода : ';uk='Сума доходу : '") + Доход, КомментарийВидаРасчета);
				Если ДоходДо <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	доход до: ';uk='    дохід до:'") + ДоходДо, КомментарийВидаРасчета);
				КонецЕсли;	
				КомментарийРасчета(НСтр("ru='Учтено ЕСВ : ';uk='Враховане ЄСВ :'") + СуммаВзносов, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Ставка НДФЛ : ';uk='Ставка ПДФО :'") + СтавкаНДФЛ, КомментарийВидаРасчета);
				Если СтавкаНДФЛУвеличенная <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Ставка НДФЛ (увеличенная) : ';uk='Ставка ПДФО (збільшена) :'") + СтавкаНДФЛУвеличенная, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	порог : ';uk='    поріг :'") + ПорогСтавкаНДФЛУвеличенная, КомментарийВидаРасчета);
				КонецЕсли;	
				Если ИсходныеДанные.ЭтоМесячныйДоход И СуммаЛьготыВсего <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Всего сумма льготы : ';uk='Усього сума пільги :'") + СуммаЛьготыВсего, КомментарийВидаРасчета);
					Если ИсходныеДанные.ЭтоМесячныйДоход И КоэфЛьготы <> 1 Тогда
						КомментарийРасчета(НСтр("ru='	Коєффициент учета вида дохода в месячном доходе : ';uk='	Коефіцієнт обліку виду доходу в місячному доході : '") + КоэфЛьготы, КомментарийВидаРасчета);
						КомментарийРасчета(НСтр("ru='	Учтенная сумма льготы по текущему виду дохода: ';uk='    Врахована сума пільги по поточному виду доходу:'") + СуммаЛьготы, КомментарийВидаРасчета);
					КонецЕсли;
					КомментарийРасчета(НСтр("ru='	Действующая льгота : ';uk='    Діюча пільга :'") + Льгота, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Количество льгот : ';uk='    Кількість пільг :'") + ИсходныеДанные.КвоЛьгот, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Количество порогов для применения льготы : ';uk='	Кількість порогів для застосування пільги : '") + КвоПороговЛьгот, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Порог льготы : ';uk='	Поріг пільги : '") + КвоПороговЛьгот * ПорогЛьготы, КомментарийВидаРасчета);
				КонецЕсли;	
				КомментарийРасчета(НСтр("ru='База налога : ';uk='База податку :'") + БазаНалога, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='Налог : ';uk='Податок :'") + Налог, КомментарийВидаРасчета);
				Если Превышение <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	по обычной ставке: ';uk=' за звичайною ставкою: '") + (Налог-НалогПревышение), КомментарийВидаРасчета);					
					КомментарийРасчета(НСтр("ru='	превышение порога: ';uk='    перевищення порогу:'") + Окр(Превышение,2), КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	доначислено налога: ';uk='    донараховано податку:'") + НалогПревышение, КомментарийВидаРасчета);
				КонецЕсли;
				Если НалогДо <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	налог до: ';uk='    податок до:'") + НалогДо, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	начислено налога: ';uk='    нараховано податку:'") + (Налог - НалогДо), КомментарийВидаРасчета);
				КонецЕсли;

			Иначе	
				КомментарийВидаРасчета = КомментарийРасчета(НСтр("ru='Расчет НДФЛ за ';uk='Розрахунок ПДФО за '") + Формат(СтрокаДвижений.НалоговыйПериод,"ДФ='МММ гггг'") + НСтр("ru=' (Код дохода ';uk=' (Код доходу '") + СтрокаДвижений.ДоходНДФЛ + ")");
				КомментарийРасчета(НСтр("ru='Сумма дохода : ';uk='Сума доходу : '") + Доход, КомментарийВидаРасчета);
				Если ДоходДо <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	доход до: ';uk='    дохід до:'") + ДоходДо, КомментарийВидаРасчета);
				КонецЕсли;	
				КомментарийРасчета(НСтр("ru='Учтено ЕСВ : ';uk='Враховане ЄСВ :'") + СуммаВзносов, КомментарийВидаРасчета);
				КомментарийРасчета(НСтр("ru='База ЕСВ : ';uk='База ЄСВ :'") + БазаВзносов, КомментарийВидаРасчета);
				Если СуммаВзносовБЛ <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Учтено ЕСВ с больничных : ';uk='Враховане ЄСВ із лікарняних :'") + СуммаВзносовБЛ, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='База ЕСВ с больничных : ';uk='База ЄСВ із лікарняних :'") + БазаВзносовБЛ, КомментарийВидаРасчета);
				КонецЕсли;	
				КомментарийРасчета(НСтр("ru='Ставка НДФЛ : ';uk='Ставка ПДФО :'") + СтавкаНДФЛ, КомментарийВидаРасчета);
				Если СтавкаНДФЛУвеличенная <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Ставка НДФЛ (увеличенная) : ';uk='Ставка ПДФО (збільшена) :'") + СтавкаНДФЛУвеличенная, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	порог : ';uk='    поріг :'") + ПорогСтавкаНДФЛУвеличенная, КомментарийВидаРасчета);
				КонецЕсли;
				КомментарийРасчета(НСтр("ru='Учтено других видов дохода : ';uk='Враховано інших видів доходу :'") + ДоходПолный, КомментарийВидаРасчета);
				Если ИсходныеДанные.ЭтоМесячныйДоход И СуммаЛьготыВсего <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Всего сумма льготы : ';uk='Усього сума пільги :'") + СуммаЛьготыВсего, КомментарийВидаРасчета);
					Если ИсходныеДанные.ЭтоМесячныйДоход И КоэфЛьготы <> 1 Тогда
						КомментарийРасчета(НСтр("ru='	Коєффициент учета вида дохода в месячном доходе : ';uk='	Коефіцієнт обліку виду доходу в місячному доході : '") + КоэфЛьготы, КомментарийВидаРасчета);
						КомментарийРасчета(НСтр("ru='	Учтенная сумма льготы по текущему виду дохода: ';uk='    Врахована сума пільги по поточному виду доходу:'") + СуммаЛьготы, КомментарийВидаРасчета);
					КонецЕсли;
					КомментарийРасчета(НСтр("ru='	Действующая льгота : ';uk='    Діюча пільга :'") + Льгота, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Количество льгот : ';uk='    Кількість пільг :'") + ИсходныеДанные.КвоЛьгот, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Количество порогов для применения льготы : ';uk='	Кількість порогів для застосування пільги : '") + КвоПороговЛьгот, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	Порог льготы : ';uk='	Поріг пільги : '") + КвоПороговЛьгот * ПорогЛьготы, КомментарийВидаРасчета);
				КонецЕсли;
				Если Доход15 <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Доход (15%) : ';uk='Дохід (15%) :'") + Доход15, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Сумма взносов (15%) : ';uk='Сума внесків (15%) :'") + Строка(СуммаВзносов15 + СуммаВзносовБЛ15), КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='База налога (15%) : ';uk='База податку (15%) :'") + БазаНалога15, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Налог (15%) : ';uk='Податок (15%) :'") + Налог15, КомментарийВидаРасчета);
				КонецЕсли;
				Если Доход17 <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Доход (17%) : ';uk='Дохід (17%) :'") + Доход17, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Сумма взносов (17%) : ';uk='Сума внесків (17%) :'") + Строка(СуммаВзносов17 + СуммаВзносовБЛ17), КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='База налога (17%) : ';uk='База податку (17%) :'") + БазаНалога17, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='Налог (17%) : ';uk='Податок (17%) :'") + Налог17, КомментарийВидаРасчета);
				КонецЕсли;
				Если Доход17 <> 0 И Доход15 <> 0 Тогда
					КомментарийРасчета(НСтр("ru='Налог (15%+17%) : ';uk='Податок (15%+17%) :'") + Налог, КомментарийВидаРасчета);
				КонецЕсли;	
				Если НалогДо <> 0 Тогда
					КомментарийРасчета(НСтр("ru='	налог до: ';uk='    податок до:'") + НалогДо, КомментарийВидаРасчета);
					КомментарийРасчета(НСтр("ru='	начислено налога: ';uk='    нараховано податку:'") + (Налог - НалогДо), КомментарийВидаРасчета);
				КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;
		
		// в таблицу полученные значения
		СтрокаДвижений.Доход = Доход - ДоходДо;
		СтрокаДвижений.Налог = Налог - НалогДо;
		СтрокаДвижений.Льгота = ?(СуммаЛьготы = 0, "", Льгота);
		СтрокаДвижений.КоличествоЛьгот = КвоЛьгот;
		Если ИсходныеДанные.ОтражатьВУпрУчете Тогда
			КурсВалютыУпр = ?(ИсходныеДанные.КурсВалютыУпр=NULL, 0, ИсходныеДанные.КурсВалютыУпр);
			СтрокаДвижений.НалогУпр = ?(КурсВалютыУпр <> 0, ((Налог - НалогДо) /КурсВалютыУпр),  0);
		КонецЕсли;
		СтрокаДвижений.ДоходПолный = ДоходПолный;
	
	Иначе
		СтрокаДвижений.Доход = -СтрокаДвижений.Доход;
		СтрокаДвижений.Налог = -СтрокаДвижений.Налог;
		СтрокаДвижений.НалогУпр = -СтрокаДвижений.НалогУпр;
		СтрокаДвижений.Льгота = СтрокаДвижений.Льгота;
		СтрокаДвижений.КоличествоЛьгот = -СтрокаДвижений.КоличествоЛьгот;
		СтрокаДвижений.ДоходПолный = ДоходПолный;
	КонецЕсли;
	
КонецПроцедуры // РассчитатьЗаписьНДФЛ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКИИ, которые используются в документах расчета средней 

Функция РассчитатьПремияЗаГод(пГодоваяПремияБазовыйПериодНачало, Сотрудник) Экспорт
	
	ГодоваяПремия = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГодоваяПремияБазовыйПериодНачало",пГодоваяПремияБазовыйПериодНачало);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ГодоваяПремия",Перечисления.ВидыПремии.ГодоваяПремия);
	
	мНеУчитыватьСовместителейДляСредних = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Сотрудник.Организация)).НеУчитыватьСовместителейДляСредних;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|  СУММА(Основной.Результат) КАК Сумма
	|
	|ИЗ РегистрРасчета.Начисления КАК Основной
	|ГДЕ НАЧАЛОПЕРИОДА(Основной.БазовыйПериодНачало, ГОД) = &ГодоваяПремияБазовыйПериодНачало
	|    И	Основной.Сотрудник = &Сотрудник
	|	// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
	|	"+ ?(мНеУчитыватьСовместителейДляСредних,"И Основной.Назначение.ОсновноеНазначение <> Основной.Сотрудник","")+"
	|    И	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.Годовая)
	|И НАЧАЛОПЕРИОДА(Основной.БазовыйПериодКОНЕЦ, ГОД) < НАЧАЛОПЕРИОДА(Основной.ПериодРегистрации, ГОД)
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГодоваяПремия = Выборка.Сумма;
	КонецЕсли;
	
	Возврат ГодоваяПремия;
	
КонецФункции

Функция РассчитатьСреднююПорядок100(Регистратор, КомментироватьРасчет = Ложь) Экспорт 
	
	Организация = Регистратор.Организация;
	мЕстьПремии = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьПремии;
	мЕстьГодоваяПремия = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьГодоваяПремия;
	
	// сам расчет ТЧ РасчетСреднего
	Запрос = Новый Запрос;     
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр( "Регистратор", Регистратор );
	Запрос.УстановитьПараметр( "парамОрганизация", Организация );
	Запрос.УстановитьПараметр( "парамСотрудник", Регистратор.Сотрудник );
	Запрос.УстановитьПараметр( "парамПериодРегистрации", Регистратор.ПериодРегистрации );
	Запрос.УстановитьПараметр( "ПериодРасчетаСреднегоНачало", Регистратор.ПериодРасчетаСреднегоНачало );
	Запрос.УстановитьПараметр( "ПериодРасчетаСреднегоКонец", Регистратор.ПериодРасчетаСреднегоКонец );
	Запрос.УстановитьПараметр( "ВидУчетаВремениДляСредней", Регистратор.ВидУчетаВремениДляСредней );
	
	СтруктураКурса = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(Регистратор.ПериодРегистрации, Новый Структура("Валюта", глЗначениеПеременной("ВалютаУправленческогоУчета")));
	Запрос.УстановитьПараметр( "парамКурсВалютыУУ", ?(Регистратор.ОтражатьВУпрУчете И СтруктураКурса.Кратность <> 0,СтруктураКурса.Курс/СтруктураКурса.Кратность,0) );
	
	Если Не Регистратор.Метаданные().ТабличныеЧасти.Найти("Отпуска") = Неопределено Тогда
		Если Регистратор.Отпуска.Количество() > 0  Тогда
			ДатаНачалаСобытия = Регистратор.Отпуска[0].ДатаНачала
		Иначе	
			ДатаНачалаСобытия = Регистратор.ПериодРегистрации
		КонецЕсли	
	Иначе
		ДатаНачалаСобытия = Регистратор.ДатаНачала
	КонецЕсли;	
	Если ДатаНачалаСобытия < ПроведениеРасчетов.ДатаИзмененияПорядка100() Тогда
		// Формула такая: Результат * Мин(ДнейВСреднего, ДнейВсегоПоНачислениям) / ДнейВсегоПоНачислениям
		// Если Коэффициент не повышался в середине месяца, то Коэф=1 и КоэфГодПремии=1
		Коэф = "
		|		(1 + РАЗНОСТЬДАТ(	ВЫБОР КОГДА Средняя.БазовыйПериодНачало > Начисления.ПериодДействияНачало ТОГДА Средняя.БазовыйПериодНачало ИНАЧЕ Начисления.ПериодДействияНачало КОНЕЦ
		|                        ,	ВЫБОР КОГДА Средняя.БазовыйПериодКонец < Начисления.ПериодДействияКонец ТОГДА Средняя.БазовыйПериодКонец ИНАЧЕ Начисления.ПериодДействияКонец КОНЕЦ
		|					, ДЕНЬ))
		|		/ (1 + РАЗНОСТЬДАТ(Начисления.ПериодДействияНачало, Начисления.ПериодДействияКонец, ДЕНЬ))";       
		КоэфПремии = "
		|		(1 + РАЗНОСТЬДАТ(	Средняя.БазовыйПериодНачало, Средняя.БазовыйПериодКонец, ДЕНЬ))
		|		/ (1 + РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ), КОНЕЦПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ) , ДЕНЬ))";       
		
		мНеУчитыватьСовместителейДляСредних = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).НеУчитыватьСовместителейДляСредних;
		//	ВТПоВремени
		Если Истина Тогда
			//	Описание:
			// 		таблица с расчетами по зарплате
			//		если в строке нет авторасчета, то берм значения проставленные пользователем. Они потом понадобятся для премии пропорционально
			//		
			ТекстЗапросаВТ = " 
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|   
			|	СУММА(Средняя.ОтработаноДнейБаза)	КАК ОтработаноДнейБаза,
			|	СУММА(Средняя.ОтработаноЧасовБаза)	КАК ОтработаноЧасовБаза,
			|	СУММА(Средняя.НормаДнейБаза)		КАК НормаДнейБаза,
			|	СУММА(Средняя.НормаЧасовБаза)		КАК НормаЧасовБаза,
			|	СУММА(Средняя.КалендарныеДниБаза)	КАК КалендарныеДниБаза
			|   
			|ПОМЕСТИТЬ ВТПоВремени	
			|ИЗ (
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|		СУММА(Начисления.ОтработаноДней*"+Коэф+")	КАК ОтработаноДнейБаза,
			|		СУММА(Начисления.ОтработаноЧасов*"+Коэф+")	КАК ОтработаноЧасовБаза,
			|		СУММА(Начисления.НормаДней*"+Коэф+")		КАК НормаДнейБаза,
			|		СУММА(Начисления.НормаЧасов*"+Коэф+")		КАК НормаЧасовБаза,
			|		0	КАК КалендарныеДниБаза
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|	
			|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|	ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|        И  (Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|        ИЛИ  Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления  
			|	ПО		Начисления.Сотрудник = &парамСотрудник
			|		И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ) = Начисления.ПериодДействия
			|		И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
			|		И	Начисления.Организация = &парамОрганизация
			|		"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|		И	(Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|				ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|		И Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета 
			|		И НЕ (Средняя.БазовыйПериодКонец < Начисления.ПериодДействияНачало ИЛИ Средняя.БазовыйПериодНачало > Начисления.ПериодДействияКонец) 
			| 		
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|								, ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 		
			| 	СГРУППИРОВАТЬ ПО
			|   	Средняя.БазовыйПериодНачало,
			|   	Средняя.БазовыйПериодКонец
			| 		
			| 		
			|   // Данные календарным с вычетом праздников и невыходов
			|	ОбЪЕДИНИТЬ ВСЕ   
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|	
			|		0	КАК ОтработаноДнейБаза,
			|		0	КАК ОтработаноЧасовБаза,
			|		0	КАК НормаДнейБаза,
			|		0	КАК НормаЧасовБаза,
			|    	СУММА(ВЫБОР КОГДА НЕ Начисления.Сторно ТОГДА       
	       	|        Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия * "+Коэф+" 
	      	|  		ИНАЧЕ
	       	|        -Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия * "+Коэф+"
	      	|   	КОНЕЦ)  КАК КалендарныеДниБаза
			|	
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(
			|		Назначение = &парамСотрудник И ПериодДействияНачало <= &ПериодРасчетаСреднегоКонец И ПериодДействияКонец >= &ПериодРасчетаСреднегоНачало
			|		И ВидРасчета.ЗачетНормыВремени И ВидРасчета.ЗачетКалендарных
			|		И ВидРасчета В (ВЫБРАТЬ База.ВидРасчета ИЗ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК База ГДЕ База.Ссылка В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)))
			|		) КАК Начисления
			|	ПО		Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец  
			|		И	Начисления.ПериодДействияКонец >= Средняя.БазовыйПериодНачало  
			|
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 
			|	СГРУППИРОВАТЬ ПО
			|		Средняя.БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец
			| 
			|) КАК Средняя
			|СГРУППИРОВАТЬ ПО
			|	Средняя.БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец
			|   
			|			
			|// записиси отредактированные пользователем			
			|ОБЪЕДИНИТЬ ВСЕ			
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|
			|		Средняя.ОтработаноДней				КАК ОтработаноДней,
			|		Средняя.ОтработаноЧасов				КАК ОтработаноЧасов,
			|		Средняя.НормаДней					КАК НормаДней,
			|		Средняя.НормаЧасов					КАК НормаЧасов,
			|		Средняя.КалендарныеДни				КАК КалендарныеДни
			|
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|			
			|	ГДЕ		НЕ Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			
			Запрос.Выполнить();
			ТекстЗапросаВТПоВремени = "ВТПоВремени";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоВремени";
		
		
		ТекстЗапроса = " 
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.НомерСтроки					КАК НомерСтроки,
		|		Основной.Авторасчет						КАК Авторасчет,
		|		Основной.ВидРасчета						КАК ВидРасчета,
		|		Основной.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|		Основной.БазовыйПериодКонец				КАК БазовыйПериодКонец,
		|		Основной.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза ИНАЧЕ 0 КОНЕЦ КАК Коэф,			
		|		ВЫБОР КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеПремия,			
		|		ВЫБОР КОГДА Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеМеньшеНормы, 
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеБольшеНуля, 
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	&ВидУчетаВремениДляСредней  = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням) 
		|						И	Время.ОтработаноДнейБаза < Время.НормаДнейБаза И Время.НормаДнейБаза > 0  
		|					ТОГДА	Основной.Результат * Время.ОтработаноДнейБаза / Время.НормаДнейБаза
		|				КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		|					ТОГДА	Основной.Результат * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		|				ИНАЧЕ		Основной.Результат КОНЕЦ    
		|												КАК Результат,
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	&ВидУчетаВремениДляСредней  = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням) 
		|						И	Время.ОтработаноДнейБаза < Время.НормаДнейБаза И Время.НормаДнейБаза > 0  
		|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноДнейБаза / Время.НормаДнейБаза
		|				КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ    
		|												КАК РезультатУпр,
		|           
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	&ВидУчетаВремениДляСредней  = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням) 
		|						И	Время.ОтработаноЧасовБаза < Время.НормаДнейБаза И Время.НормаДнейБаза > 0  
		|					ТОГДА	1
		|				КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		|					ТОГДА	2
		|				ИНАЧЕ		3 КОНЕЦ    
		|												КАК Результат1,
		////|		ВЫБОР	КОГДА	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)			
		////|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		////|					ТОГДА	Основной.Результат * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		////|				ИНАЧЕ		Основной.Результат КОНЕЦ    
		////|												КАК Результат,
		////|		ВЫБОР	КОГДА	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)			
		////|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		////|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		////|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ    
		////|												КАК РезультатУпр,
		|		Основной.РезультатПолный				КАК РезультатПолный,
		|           
		|		ВремяДляСредней.ОтработаноДнейБаза				КАК ОтработаноДней,
		|		ВремяДляСредней.ОтработаноЧасовБаза				КАК ОтработаноЧасов,
		|		ВремяДляСредней.НормаДнейБаза					КАК НормаДней,
		|		ВремяДляСредней.НормаЧасовБаза					КАК НормаЧасов,
		|		ВремяДляСредней.КалендарныеДниБаза				КАК КалендарныеДни";
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			| Время.НормаЧасовБаза КАК НормаЧасовБаза,
		    | Время.ОтработаноЧасовБаза КАК  ОтработаноЧасовБаза,
			| Время.НормаДнейБаза КАК НормаДнейБаза,
		    | Время.ОтработаноДнейБаза КАК  ОтработаноДнейБаза,
			| Основной.ВидРасчетаРазрез КАК ВидРасчетаРазрез";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
	    |
		|	ИЗ (
		|	ВЫБРАТЬ 
		|		Основной1.НомерСтроки				КАК НомерСтроки,
		|		Основной1.Авторасчет				КАК Авторасчет,
		|		Основной1.ВидРасчета				КАК ВидРасчета,
		|		Основной1.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
		|		Основной1.КоэффициентПовышенияОкладов		КАК КоэффициентПовышенияОкладов, 
		|		СУММА(Основной1.Результат)			КАК Результат,
		|		СУММА(Основной1.РезультатУпр)		КАК РезультатУпр,
		|		СУММА(Основной1.РезультатПолный)	КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
		|		ИЗ (
		|		ВЫБРАТЬ 
		|			Средняя.НомерСтроки				КАК НомерСтроки,
		|			Средняя.Авторасчет				КАК Авторасчет,
		|			Средняя.ВидРасчета				КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			ВЫБОР	КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)   
		|							ТОГДА	ВЫБОР	КОГДА Начисления.ВидРасчета.ЧислоМесяцев <= 1
		|											ТОГДА Начисления.Результат
		|											ИНАЧЕ 0 КОНЕЦ
		|						ИНАЧЕ Начисления.Результат КОНЕЦ
		|				*"+Коэф+"					КАК Результат,
		|			ВЫБОР	КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)   
		|							ТОГДА	ВЫБОР	КОГДА Начисления.ВидРасчета.ЧислоМесяцев <= 1
		|											ТОГДА Начисления.РезультатУпр
		|											ИНАЧЕ 0 КОНЕЦ
		|						ИНАЧЕ Начисления.РезультатУпр КОНЕЦ
		|				*"+Коэф+"					КАК РезультатУпр,
		|			ВЫБОР	КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)   
		|							ТОГДА	ВЫБОР	КОГДА Начисления.ВидРасчета.ЧислоМесяцев <= 1
		|											ТОГДА Начисления.Результат
		|											ИНАЧЕ 0 КОНЕЦ
		|						ИНАЧЕ Начисления.Результат КОНЕЦ
		|				*"+Коэф+"					КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 		Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя     
		|  	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		(Начисления.Сотрудник = &парамСотрудник ИЛИ Начисления.Сотрудник.ОсновноеНазначение = &парамСотрудник) 
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	Начисления.Организация = &парамОрганизация  
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец
		|			И	Средняя.БазовыйПериодНачало <= Начисления.ПериодДействияКонец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|  	
		|		ГДЕ		Средняя.Регистратор = &Регистратор  
		|			И	Средняя.Авторасчет И Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)		
		|			
		|			
		|			
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются полной суммой ОТПУСК			
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат * "+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр * "+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат * "+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало, МЕСЯЦ) = Начисления.ПериодДействия	
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ	Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)			
		|			
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются полной суммой СРЕДНЯЯ			
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
	    |		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	Средняя.БазовыйПериодКонец		>=	Начисления.БазовыйПериодНачало	
		|			И	Начисления.БазовыйПериодКонец	>=	Средняя.БазовыйПериодНачало		
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ	Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|			
		|
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются пропорционально отработанному времени ОТПУСК	
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев * "+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр/Начисления.ВидРасчета.ЧислоМесяцев * "+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев * "+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
	    |		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало, МЕСЯЦ) = Начисления.ПериодДействия	
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ		Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)			
		|			
		|			
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются пропорционально отработанному времени СРЕДНЯЯ		
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	Начисления.ПериодДействия МЕЖДУ &ПериодРасчетаСреднегоНачало И &ПериодРасчетаСреднегоКонец	
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ		Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)			
		|			
		|			
		|		//------------------------------------------------------------	
		|		// записиси отредактированные пользователем	или годовая премия		
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки				КАК НомерСтроки,
		|			Средняя.Авторасчет				КАК Авторасчет,
		|			Средняя.ВидРасчета				КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
		|							ТОГДА	Средняя.Результат
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) 
		|							ТОГДА (Средняя.Регистратор.ГодоваяПремия/12)*("+КоэфПремии+")
		|						ИНАЧЕ 0 КОНЕЦ
		|				КАК Результат,
		|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
		|							ТОГДА	Средняя.РезультатУпр
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) 
		|			                И	&парамКурсВалютыУУ <> 0
		|							ТОГДА (Средняя.Регистратор.ГодоваяПремия/(&парамКурсВалютыУУ*12))*("+КоэфПремии+")
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)			
		|			                И	&парамКурсВалютыУУ <> 0
		|							ТОГДА (Средняя.Регистратор.ГодоваяПремия/12)*("+КоэфПремии+")
		|						ИНАЧЕ 0 КОНЕЦ
		|				КАК РезультатУпр,
		|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
		|							ТОГДА	Средняя.РезультатПолный
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) 
		|							ТОГДА Средняя.Регистратор.ГодоваяПремия*("+КоэфПремии+")
		|						ИНАЧЕ 0 КОНЕЦ
		|				КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Средняя.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		|		ГДЕ		Средняя.Регистратор = &Регистратор			
		|			И	(НЕ Средняя.Авторасчет		
		|			ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) )		
		|	) КАК Основной1		
		|	СГРУППИРОВАТЬ ПО 
		|		Основной1.НомерСтроки,
		|		Основной1.Авторасчет,
		|		Основной1.ВидРасчета,
		|		Основной1.БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец,	 
		|		Основной1.КоэффициентПовышенияОкладов
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез","") + "
		|	) КАК Основной		
		|			
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК Время			
		|	ПО	Время.БазовыйПериодНачало = Основной.БазовыйПериодНачало		
		|			
		|	// Чтобы не писать в каждой строке условие, сделаем левое соединение по этому условию		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК ВремяДляСредней			
		|	ПО	ВремяДляСредней.БазовыйПериодНачало = Основной.БазовыйПериодНачало		
		|		И	(Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
		|		ИЛИ	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
		|			
		|УПОРЯДОЧИТЬ ПО           
		|  Основной.НомерСтроки УБЫВ         
		|";
	Иначе
		мНеУчитыватьСовместителейДляСредних = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).НеУчитыватьСовместителейДляСредних;
		
		//	ВТПоВремени
		Если Истина Тогда
			//	Описание:
			// 		таблица с расчетами по зарплате
			//		если в строке нет авторасчета, то берем значения, проставленные пользователем. Они потом понадобятся для премии пропорционально
			//		
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	РаботникиОрганизаций.Период КАК ДатаПриема
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПервых(
			|			,
			|			Организация = &парамОрганизация
			|				И Сотрудник = &парамСотрудник) КАК РаботникиОрганизаций
			|";
			Выборка = Запрос.Выполнить().Выбрать();
			ДатаПриема = Дата(1,1,1);
			Если Выборка.Следующий() Тогда
				ДатаПриема = Выборка.ДатаПриема
			КонецЕсли;	
			Запрос.УстановитьПараметр("ДатаПриема", ДатаПриема);
			ТекстЗапросаВТ = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|   
			|	СУММА(Средняя.ОтработаноДнейБаза)	КАК ОтработаноДнейБаза,
			|	СУММА(Средняя.ОтработаноЧасовБаза)	КАК ОтработаноЧасовБаза,
			|	СУММА(Средняя.НормаДнейБаза)		КАК НормаДнейБаза,
			|	СУММА(Средняя.НормаЧасовБаза)		КАК НормаЧасовБаза,
			|	СУММА(Средняя.КалендарныеДниБаза)	КАК КалендарныеДниБаза
			|   
			|ПОМЕСТИТЬ ВТПоВремени	
			|ИЗ (
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|		СУММА(Начисления.ОтработаноДней)	КАК ОтработаноДнейБаза,
			|		СУММА(Начисления.ОтработаноЧасов)	КАК ОтработаноЧасовБаза,
			|		СУММА(Начисления.НормаДней)			КАК НормаДнейБаза,
			|		СУММА(Начисления.НормаЧасов)		КАК НормаЧасовБаза,
			|		0	КАК КалендарныеДниБаза
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|	ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|        И  (Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|        ИЛИ  Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления  
			|	ПО		Начисления.Сотрудник = &парамСотрудник
			|		И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ) = Начисления.ПериодДействия
			|		И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
			|		И	Начисления.Организация = &парамОрганизация
			|		"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|		И	(Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|				ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|		И Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|		И НЕ (Средняя.БазовыйПериодКонец < Начисления.ПериодДействияНачало ИЛИ Средняя.БазовыйПериодНачало > Начисления.ПериодДействияКонец) 
			| 		
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|								, ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 		
			| 	СГРУППИРОВАТЬ ПО
			|   	Средняя.БазовыйПериодНачало,
			|   	Средняя.БазовыйПериодКонец
			| 		
			| 		
			|   // Данные календарным с вычетом праздников и невыходов
			|	ОбЪЕДИНИТЬ ВСЕ   
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|	
			|		0	КАК ОтработаноДнейБаза,
			|		0	КАК ОтработаноЧасовБаза,
			|		0	КАК НормаДнейБаза,
			|		0	КАК НормаЧасовБаза,
			|    	СУММА(ВЫБОР КОГДА НЕ Начисления.Сторно ТОГДА       
	       	|        Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия  
	      	|  		ИНАЧЕ
	       	|        -Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия 
			|	    КОНЕЦ) + СУММА(ЕСТЬNULL(ЗапросМесяцПриема.КалендарныхДнейБезПраздников, 0)) КАК КалендарныеДниБаза 
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(
			|		Назначение = &парамСотрудник И ПериодДействияНачало <= &ПериодРасчетаСреднегоКонец И ПериодДействияКонец >= &ПериодРасчетаСреднегоНачало
			|		И ВидРасчета.ЗачетНормыВремени И ВидРасчета.ЗачетКалендарных
			|		И ВидРасчета В (ВЫБРАТЬ База.ВидРасчета ИЗ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК База ГДЕ База.Ссылка В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)))
			|		) КАК Начисления
			|	ПО		Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец  
			|		И	Начисления.ПериодДействияКонец >= Средняя.БазовыйПериодНачало  
			| 
			|   // Данные по календарным дням без праздников для средней за 12 месяцев в месяце приема до даты приема для принятых не 1-м числом, но в 1-й рабочий день
			|  ЛЕВОЕ СОЕДИНЕНИЕ
			|  (ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|		ДЕНЬ(&ДатаПриема) - КОЛИЧЕСТВО(ЕСТЬNULL(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, 0)) КАК КалендарныхДнейБезПраздников
			|	ИЗ
			|		РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|		ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаПриема, МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаПриема, ДЕНЬ, -1), ДЕНЬ))
			|				И (РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|				ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье))
			|	ГДЕ
			|		ДЕНЬ(&ДатаПриема) > 1
			|		И Средняя.Авторасчет
			|		И Средняя.Регистратор = &Регистратор
			|		И НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаПриема, МЕСЯЦ)
			|		И Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)
			|
			|	СГРУППИРОВАТЬ ПО
			|		Средняя.БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец
			|	
			|  ) КАК ЗапросМесяцПриема
			|		ПО Средняя.БазовыйПериодНачало = ЗапросМесяцПриема.БазовыйПериодНачало
			|		И Средняя.БазовыйПериодКонец = ЗапросМесяцПриема.БазовыйПериодКонец
			|
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 
			|	СГРУППИРОВАТЬ ПО
			|		Средняя.БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец
			| 
			|) КАК Средняя
			|СГРУППИРОВАТЬ ПО
			|	Средняя.БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец
			|   
			|			
			|// записиси отредактированные пользователем			
			|ОБЪЕДИНИТЬ ВСЕ			
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|
			|		Средняя.ОтработаноДней				КАК ОтработаноДней,
			|		Средняя.ОтработаноЧасов				КАК ОтработаноЧасов,
			|		Средняя.НормаДней					КАК НормаДней,
			|		Средняя.НормаЧасов					КАК НормаЧасов,
			|		Средняя.КалендарныеДни				КАК КалендарныеДни
			|
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|			
			|	ГДЕ		НЕ Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			
			Запрос.Выполнить();
			ТекстЗапросаВТПоВремени = "ВТПоВремени";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоВремени";
		

		Если Истина Тогда
			// Запрос по начислениям кроме премий и записям, отредактированные пользователем 
			ТекстЗапросаВТ = "
			|		ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|			Средняя.НомерСтроки				КАК НомерСтроки,
			|			Средняя.Авторасчет				КАК Авторасчет,
			|			Средняя.ВидРасчета				КАК ВидРасчета,
			|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
			|			Начисления.Результат			КАК Результат,
			|			Начисления.РезультатУпр			КАК РезультатУпр,
			|			Начисления.Результат 			КАК РезультатПолный
			| " + ?(КомментироватьРасчет,",	
			| 		Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
			|	    ПОМЕСТИТЬ ВТНачисленияБезПремий
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя     
			|  	
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
			|		ПО		(Начисления.Сотрудник = &парамСотрудник ИЛИ Начисления.Сотрудник.ОсновноеНазначение = &парамСотрудник) 
			|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
			|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|			И	Начисления.Организация = &парамОрганизация  
			|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
			|			И	Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец
			|			И	Средняя.БазовыйПериодНачало <= Начисления.ПериодДействияКонец
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|  	
			|		ГДЕ		Средняя.Регистратор = &Регистратор И Средняя.Авторасчет
			|				И 	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
			|				И	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
			|				И	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
			|				И	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)
			|               И   Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)
			|		// записи, отредактированные пользователем			
			|		ОБЪЕДИНИТЬ ВСЕ	
			|		ВЫБРАТЬ
			|			Средняя.НомерСтроки				КАК НомерСтроки,
			|			Средняя.Авторасчет				КАК Авторасчет,
			|			Средняя.ВидРасчета				КАК ВидРасчета,
			|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец,
			|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
			|							ТОГДА	Средняя.Результат
			|						ИНАЧЕ 0 КОНЕЦ
			|				КАК Результат,
			|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
			|							ТОГДА	Средняя.РезультатУпр
			|						ИНАЧЕ 0 КОНЕЦ
			|				КАК РезультатУпр,
			|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
			|							ТОГДА	Средняя.РезультатПолный
			|						ИНАЧЕ 0 КОНЕЦ
			|				КАК РезультатПолный
			| " + ?(КомментироватьРасчет,",	
			| 			Средняя.ВидРасчета КАК ВидРасчетаРазрез","") + "
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|		ГДЕ		Средняя.Регистратор = &Регистратор			
			|			И	(НЕ Средняя.Авторасчет)		
			|
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНачисленияБезПремий";
		
		ИспользуемыеВидыРасчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
		Если НЕ ИспользуемыеВидыРасчета.Найти(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку) = Неопределено Тогда
			Запрос.УстановитьПараметр("ЗаДваМесяца", Истина)
		Иначе
			Запрос.УстановитьПараметр("ЗаДваМесяца", Ложь)
		КонецЕсли;	
		
		Если Истина Тогда
			// Запрос по полным суммам премий
			ТекстЗапросаВТ = "
			|		ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|			Средняя.НомерСтроки					КАК НомерСтроки,
			|			Средняя.Авторасчет					КАК Авторасчет,
			|			Средняя.ВидРасчета               	КАК ВидРасчета,
			|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|			СУММА(Начисления.Результат) 		КАК Результат,
			|			СУММА(Начисления.РезультатУпр)		КАК РезультатУпр,
			|			СУММА(Начисления.Результат) 		КАК РезультатПолный,
			|           Начисления.ВидРасчета.ЧислоМесяцев  КАК КоличествоМесяцев,
			|			Начисления.БазовыйПериодНачало КАК БазовыйПериодПремииНачало,
			|			Начисления.БазовыйПериодКонец КАК БазовыйПериодПремииКонец
			| " + ?(КомментироватьРасчет,",	
			| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
			|       ПОМЕСТИТЬ ВТПолныеСуммыПремий
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			| 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
			|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
			|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
			|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|//УсловиеПремии
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|			
			|		ГДЕ	Средняя.Авторасчет		
			|			И	Средняя.Регистратор = &Регистратор			
			|			И	(Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))
			|		СГРУППИРОВАТЬ ПО
			|			Средняя.НомерСтроки,
			|			Средняя.Авторасчет,
			|			Средняя.ВидРасчета,
			|			Средняя.БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец,
			|			Начисления.ВидРасчета.ЧислоМесяцев,
			|			Начисления.БазовыйПериодНачало,
			|			Начисления.БазовыйПериодКонец
			| " + ?(КомментироватьРасчет,",	
			| 			Начисления.ВидРасчета","") + "
			|";
			Если ДатаНачалаСобытия < ДатаИзмененияПорядка100_917() Тогда 
				ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "//УсловиеПремии",	"	
				|			И (Начисления.БазовыйПериодНачало <= Средняя.БазовыйПериодКонец)
				|			И (Начисления.БазовыйПериодКонец >= Средняя.БазовыйПериодНачало)");
			Иначе
				ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "//УсловиеПремии",	"	
				|			И (Начисления.ПериодДействия >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Средняя.БазовыйПериодНачало, МЕСЯЦ, -Начисления.ВидРасчета.ЧислоМесяцев + 1), МЕСЯЦ)
				|			И Начисления.ПериодДействия <= Средняя.БазовыйПериодКонец)");
			КонецЕсли;
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПолныеСуммыПремий";	
		
		Если Истина Тогда
			// Запрос по всем возможным базовым периодам премий
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ
			|		МИНИМУМ(Премии.БазовыйПериодПремииНачало) КАК БазовыйПериодПремииНачалоМин,
			|		МАКСИМУМ(Премии.БазовыйПериодПремииКонец) КАК БазовыйПериодПремииКонецМакс
			|	ПОМЕСТИТЬ ВТИнтервалБазовогоПериодаПремий
			|	ИЗ
			|		ВТПолныеСуммыПремий КАК Премии
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТИнтервалБазовогоПериодаПремий";	
		
		Если Истина Тогда
			// Запрос по отработанным дням в базовых периодах премий
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|		СУММА(Начисления.ОтработаноДней) КАК ОтработаноДней,
			|		СУММА(Начисления.НормаДней) КАК НормаДней,
			|		Начисления.ПериодДействия КАК ПериодДействия
			|	ПОМЕСТИТЬ ВТОтработаноДнейВБазовыхПериодахПремий
			|	ИЗ
			|		РегистрРасчета.Начисления КАК Начисления
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалБазовогоПериодаПремий КАК БазовыеПериодыПремий
			|			ПО (НАЧАЛОПЕРИОДА(Начисления.ПериодДействия, МЕСЯЦ) МЕЖДУ НАЧАЛОПЕРИОДА(БазовыеПериодыПремий.БазовыйПериодПремииНачалоМин, МЕСЯЦ) 
			|			И КОНЕЦПЕРИОДА(БазовыеПериодыПремий.БазовыйПериодПремииКонецМакс,МЕСЯЦ))
			|	ГДЕ
			|		(Начисления.Сотрудник = &парамСотрудник
			|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|			И Начисления.Организация = &парамОрганизация)
			|	СГРУППИРОВАТЬ ПО
			|		Начисления.ПериодДействия,
			|		Начисления.Сотрудник
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОтработаноДнейВБазовыхПериодахПремий";	
		
		Если Истина Тогда
			// Запрос для определения учитываемой части премий
			ТекстЗапросаВТ = "
			|ВЫБРАТЬ
			|	Премии.НомерСтроки КАК НомерСтроки,
			|	Премии.Авторасчет КАК Авторасчет,
			|	Премии.ВидРасчета КАК ВидРасчета,
			|	Премии.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	Премии.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	Премии.БазовыйПериодПремииНачало КАК БазовыйПериодПремииНачало,
			|	Премии.БазовыйПериодПремииКонец КАК БазовыйПериодПремииКонец,
			|	Премии.КоличествоМесяцев КАК КоличествоМесяцев,
			|	Премии.РезультатПолный КАК РезультатПолный,
			|	Премии.РезультатУпр КАК РезультатУпр,
			|	Премии.Результат КАК Результат,
			|	СУММА(ВЫБОР
			|			КОГДА Премии.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|					ИЛИ Премии.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)
			|				ТОГДА 0
			|			ИНАЧЕ ВТОтработаноДней.НормаДней
			|		КОНЕЦ) КАК НормаДней,
			|	СУММА(ВЫБОР
			|			КОГДА Премии.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|					ИЛИ Премии.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)
			|				ТОГДА 0
			|			ИНАЧЕ ВТОтработаноДней.ОтработаноДней
			|		КОНЕЦ) КАК ОтработаноДней
			| " + ?(КомментироватьРасчет,",	
			| 			Премии.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
			|ПОМЕСТИТЬ ВТУчитываемыеПремии
			|ИЗ
			|	ВТПолныеСуммыПремий КАК Премии
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработаноДнейВБазовыхПериодахПремий КАК ВТОтработаноДней
			|		ПО (НАЧАЛОПЕРИОДА(ВТОтработаноДней.ПериодДействия, МЕСЯЦ) МЕЖДУ НАЧАЛОПЕРИОДА(Премии.БазовыйПериодПремииНачало, МЕСЯЦ)
			|		И НАЧАЛОПЕРИОДА(Премии.БазовыйПериодПремииКонец, МЕСЯЦ))
			|
			|СГРУППИРОВАТЬ ПО
			|	Премии.НомерСтроки,
			|	Премии.Авторасчет,
			|	Премии.ВидРасчета,
			|	Премии.БазовыйПериодНачало,
			|	Премии.БазовыйПериодКонец,
			|	Премии.БазовыйПериодПремииНачало,
			|	Премии.БазовыйПериодПремииКонец,
			|	Премии.КоличествоМесяцев,
			|	Премии.Результат,
			|	Премии.РезультатУпр,
			|	Премии.РезультатПолный
			| " + ?(КомментироватьРасчет,",	
			| 	Премии.ВидРасчетаРазрез","") + "";
			
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТУчитываемыеПремии";	
		
		Если Истина Тогда
			ТекстЗапросаВТ = "ВЫБРАТЬ
			|	Премии.ВидРасчета,
			|	Премии.БазовыйПериодПремииНачало,
			|	Премии.БазовыйПериодПремииКонец,
			|	Премии.КоличествоМесяцев,
			|	Премии.НормаДней,
			|	Премии.ОтработаноДней,
			|	ВЫРАЗИТЬ(СУММА(Время.ОтработаноДнейБаза * ВЫБОР
			|				КОГДА Премии.ОтработаноДней > 0
			|					ТОГДА Премии.РезультатПолный / Премии.ОтработаноДней
			|				ИНАЧЕ 0
			|			КОНЕЦ) КАК ЧИСЛО(16, 2)) КАК Результат,
			|	ВЫРАЗИТЬ(СУММА(Время.ОтработаноДнейБаза * ВЫБОР
			|				КОГДА Премии.ОтработаноДней > 0
			|					ТОГДА Премии.РезультатУпр / Премии.ОтработаноДней
			|				ИНАЧЕ 0
			|			КОНЕЦ) КАК ЧИСЛО(16, 2)) КАК РезультатУпр,
			|	Премии.Результат КАК РезультатПолный
			|ПОМЕСТИТЬ ВТРаспределенныеПремии
			|ИЗ
			|	ВТУчитываемыеПремии КАК Премии
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК Время
			|		ПО Премии.БазовыйПериодНачало = Время.БазовыйПериодНачало
			|
			|СГРУППИРОВАТЬ ПО
			|	Премии.ВидРасчета,
			|	Премии.БазовыйПериодПремииНачало,
			|	Премии.БазовыйПериодПремииКонец,
			|	Премии.КоличествоМесяцев,
			|	Премии.ОтработаноДней,
			|	Премии.НормаДней,
			|	Премии.Результат";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТРаспределенныеПремии";
		
		ТаблицаПревышений = Новый ТаблицаЗначений;
		Если ДатаНачалаСобытия >= ПроведениеРасчетов.ДатаИзмененияПорядка100_486() Тогда
			Если Истина Тогда
				Запрос.Текст = "ВЫБРАТЬ
				|	Премии.ВидРасчета,
				|	Премии.БазовыйПериодПремииНачало,
				|	Премии.БазовыйПериодПремииКонец,
				|	Премии.КоличествоМесяцев,
				|	Премии.Результат КАК Результат,
				|	Премии.РезультатУпр КАК РезультатУпр,
				|	Премии.РезультатПолный КАК РезультатПолный
				|ИЗ
				|	ВТРаспределенныеПремии КАК Премии
				|ГДЕ
				|   Премии.НормаДней > Премии.ОтработаноДней 
				|	И Премии.Результат > Премии.РезультатПолный";
				ТаблицаПревышений = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
		КонецЕсли;
		
		ТекстЗапроса = " 
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.НомерСтроки					КАК НомерСтроки,
		|		Основной.Авторасчет						КАК Авторасчет,
		|		Основной.ВидРасчета						КАК ВидРасчета,
		|		Основной.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|		Основной.БазовыйПериодКонец				КАК БазовыйПериодКонец,
		|		1										КАК КоэффициентПовышенияОкладов,
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеПремия,			
		|		ВЫБОР КОГДА Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеМеньшеНормы, 
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеБольшеНуля, 
		|
		|//УсловиеПремии
		|												КАК Результат,
		|
		|//_УсловиеПремииУпр
		|												КАК РезультатУпр,
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|					ТОГДА	1
		|				ИНАЧЕ		3 КОНЕЦ    
		|												КАК Результат1,
		|		СУММА(Основной.РезультатПолный)				КАК РезультатПолный,
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноДнейБаза КОНЕЦ КАК ОтработаноДней,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноЧасовБаза КОНЕЦ КАК ОтработаноЧасов,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаДнейБаза КОНЕЦ КАК НормаДней,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаЧасовБаза КОНЕЦ КАК НормаЧасов,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.КалендарныеДниБаза КОНЕЦ КАК КалендарныеДни";
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			| Время.НормаЧасовБаза КАК НормаЧасовБаза,
		    | Время.ОтработаноЧасовБаза КАК  ОтработаноЧасовБаза,
			| Время.НормаДнейБаза КАК НормаДнейБаза,
	   		| Время.ОтработаноДнейБаза КАК  ОтработаноДнейБаза,
			| Основной.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
			| Основной.ОтработаноВБазовомПериодеПремии КАК ОтработаноВБазовомПериодеПремии";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ИЗ (
		|	ВЫБРАТЬ 
		|		Основной1.НомерСтроки				КАК НомерСтроки,
		|		Основной1.Авторасчет				КАК Авторасчет,
		|		Основной1.ВидРасчета				КАК ВидРасчета,
		|		Основной1.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец		КАК БазовыйПериодКонец,
		|       Основной1.КоличествоМесяцев         КАК КоличествоМесяцев,
		|		СУММА(Основной1.Результат)			КАК Результат,
		|		СУММА(Основной1.РезультатУпр)		КАК РезультатУпр,
		|		СУММА(Основной1.РезультатПолный)	КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ОтработаноВБазовомПериодеПремии КАК ОтработаноВБазовомПериодеПремии","") + "
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
		|		ИЗ (
		|		ВЫБРАТЬ  
		|			НачисленияБезПремий.НомерСтроки				КАК НомерСтроки,
		|			НачисленияБезПремий.Авторасчет				КАК Авторасчет,
		|			НачисленияБезПремий.ВидРасчета				КАК ВидРасчета,
		|			НачисленияБезПремий.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|			НачисленияБезПремий.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
		|           0                                           КАК КоличествоМесяцев,
		|			НачисленияБезПремий.Результат				КАК Результат,
		|			НачисленияБезПремий.РезультатУпр			КАК РезультатУпр,
		|			НачисленияБезПремий.Результат 				КАК РезультатПолный
		| 		" + ?(КомментироватьРасчет,",	
		| 			0  КАК ОтработаноВБазовомПериодеПремии","") + "                                
		| 		" + ?(КомментироватьРасчет,",	
		| 			НачисленияБезПремий.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
		|	    ИЗ ВТНачисленияБезПремий КАК НачисленияБезПремий
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Премии.НомерСтроки,
		|		Премии.Авторасчет,
		|		Премии.ВидРасчета,
		|		Премии.БазовыйПериодНачало,
		|		Премии.БазовыйПериодКонец,
		|		Премии.КоличествоМесяцев,
		|//УсловиеПремииЗаМесяц
		|//_УсловиеПремииЗаМесяцУпр
		|       Премии.Результат
		| 		" + ?(КомментироватьРасчет,",	
		| 			Премии.ОтработаноДней","") + "
		| 		" + ?(КомментироватьРасчет,",	
		| 			Премии.ВидРасчетаРазрез","") + "
		|	ИЗ
		|	ВТУчитываемыеПремии КАК Премии
		|	) КАК Основной1		
		|	СГРУППИРОВАТЬ ПО 
		|		Основной1.НомерСтроки,
		|		Основной1.Авторасчет,
		|		Основной1.ВидРасчета,
		|		Основной1.БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец,
		|		Основной1.КоличествоМесяцев
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ОтработаноВБазовомПериодеПремии","") + "
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез","") + "
		|	) КАК Основной		
		|			
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК Время			
		|	ПО	Время.БазовыйПериодНачало = Основной.БазовыйПериодНачало		
		|			
		|	// Чтобы не писать в каждой строке условие, сделаем левое соединение по этому условию		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК ВремяДляСредней			
		|	ПО	ВремяДляСредней.БазовыйПериодНачало = Основной.БазовыйПериодНачало
		|   СГРУППИРОВАТЬ ПО
		|		Основной.НомерСтроки,
		|		Основной.Авторасчет,
		|		Основной.ВидРасчета,
		|		Основной.БазовыйПериодНачало,
		|		Основной.БазовыйПериодКонец,
		|		1,
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,			
		|		ВЫБОР КОГДА Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
		|
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|					ТОГДА	1
		|				ИНАЧЕ		3 КОНЕЦ,    
		|												
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноДнейБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноЧасовБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаДнейБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаЧасовБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.КалендарныеДниБаза КОНЕЦ";
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			| Время.НормаЧасовБаза,
		    | Время.ОтработаноЧасовБаза,
			| Время.НормаДнейБаза,
	   		| Время.ОтработаноДнейБаза,
			| Основной.ВидРасчетаРазрез,
			| Основной.ОтработаноВБазовомПериодеПремии";
		КонецЕсли;	
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО           
		|  Основной.НомерСтроки УБЫВ         
		|";
		Если ДатаНачалаСобытия < ДатаИзмененияПорядка100_917() Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремииЗаМесяц",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 И  Премии.КоличествоМесяцев > 1
			|       	ТОГДА Премии.РезультатПолный / Премии.ОтработаноДней
			|           КОГДА Премии.ОтработаноДней > 0 И Премии.КоличествоМесяцев = 1
			|           ТОГДА Премии.РезультатПолный
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииЗаМесяцУпр",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 И  Премии.КоличествоМесяцев > 1
			|       	ТОГДА Премии.РезультатУпр / Премии.ОтработаноДней
			|           КОГДА Премии.ОтработаноДней > 0 И Премии.КоличествоМесяцев = 1
			|           ТОГДА Премии.РезультатУпр
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремии",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) И Основной.КоличествоМесяцев > 1			
			|					ТОГДА	Основной.Результат * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.Результат КОНЕЦ)");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииУпр",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) И Основной.КоличествоМесяцев > 1			
			|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ)")    

		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремииЗаМесяц",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 
			|       	ТОГДА Премии.РезультатПолный / Премии.ОтработаноДней
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииЗаМесяцУпр",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 
			|       	ТОГДА Премии.РезультатУпр / Премии.ОтработаноДней
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремии",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) 			
			|					ТОГДА	Основной.Результат * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.Результат КОНЕЦ)"); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииУпр",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) 			
			|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ)");    
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ДанныеЗапросов = Новый Структура;
	ДанныеЗапросов.Вставить("ТаблицаПревышений", ТаблицаПревышений);
	ДанныеЗапросов.Вставить("Выборка", Запрос.Выполнить());
	Возврат ДанныеЗапросов;
	
КонецФункции


// Получает Сумму оклада за месяц и нормы времени и календарные дни
// 		в случае необходимости оклад перерасчитывается в месячный
//
////Функция ПолучитьПараметыОклада( мДатаНачала, Сотрудник, ПериодРасчетаСреднегоНачало= Неопределено, ПериодРасчетаСреднегоКонец = Неопределено ) Экспорт
Функция ПолучитьПараметыОклада( мДатаНачала, Сотрудник, ОтражатьВРеглУчете, ОтражатьВУпрУчете , ПериодРасчетаСреднегоНачало= Неопределено, ПериодРасчетаСреднегоКонец = Неопределено, ДляДекретных = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамСотрудник",	Сотрудник);
	Запрос.УстановитьПараметр("парамДата",	КонецДня(мДатаНачала));
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета",				Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("парамВалютаУпрУчета",					Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты",	ПроведениеРасчетов.ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
	Запрос.УстановитьПараметр("парамПериод",	мДатаНачала);
	
	Если ПериодРасчетаСреднегоНачало= Неопределено Тогда
		АнализируемМесяцы = Ложь;
		Запрос.УстановитьПараметр("КвоМесяцев",	12);
		
	Иначе
		Начало = ПериодРасчетаСреднегоНачало;
		Конец = ПериодРасчетаСреднегоКонец;
		Если НачалоМесяца(Начало) = Начало И НачалоДня(КонецМесяца(Конец)) = Конец Тогда
			АнализируемМесяцы = Истина;
			Начало = НачалоМесяца(ПериодРасчетаСреднегоНачало);
			Конец = КонецМесяца(ПериодРасчетаСреднегоКонец);
			КвоМесяцев = (Год(Конец)-Год(Начало))*12+ Месяц(Конец)-Месяц(Начало)+1;
			Запрос.УстановитьПараметр("КвоМесяцев",	КвоМесяцев);
			Запрос.УстановитьПараметр("парамНачало",	Начало);
			Запрос.УстановитьПараметр("парамКонец",	Конец);
		ИначеЕсли Начало = Конец Тогда
			// заболел в первый день работы, анализируем график за предыдущие 6 месяцев
			АнализируемМесяцы = Истина;
			КвоМесяцев = 6;
			Конец = КонецМесяца(ДобавитьМесяц(ПериодРасчетаСреднегоКонец,-1));
			Начало = НачалоМесяца(ДобавитьМесяц(Конец, - КвоМесяцев + 1));
			Запрос.УстановитьПараметр("КвоМесяцев",	КвоМесяцев);
			Запрос.УстановитьПараметр("парамНачало",Начало);
			Запрос.УстановитьПараметр("парамКонец",	Конец);
		Иначе	
			// если не целый период (не целые месяцы) то анализируем год
			АнализируемМесяцы = Ложь;
			Запрос.УстановитьПараметр("КвоМесяцев",	12);
		КонецЕсли;
		
	КонецЕсли;
	
	//	ВТДанныеГрафика
	Если Истина Тогда
		//	Описание:
		// 		График и норма за месяц дней, часов и календарных дней
		//		
		ТекстЗапросаВТ = "
	  	|	ВЫБРАТЬ 
	  	|		Работники.ГрафикРаботы    	КАК ГрафикРаботы,
	  	|		СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение)			КАК НормаДней,
	  	|		СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение)	КАК НормаЧасов,
	  	|		СУММА(ГрафикиРаботыПоВидамВремени.ПроизводственныйКалендарьКалендарныеДни)	КАК КалендарныеДни
		|ПОМЕСТИТЬ ВТДанныеГрафика	
	  	|	ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамПериод, Сотрудник = &парамСотрудник) КАК Работники 
	  	|		   
	  	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	  	|	ПО	" + ?(АнализируемМесяцы,"	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец"
	  			,"	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&парамПериод, ГОД) И КОНЕЦПЕРИОДА(&парамПериод, ГОД)") + "
	  	|		И	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = Работники.ГрафикРаботы
	  	|		И	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	  	|	СГРУППИРОВАТЬ ПО 
	  	|		Работники.ГрафикРаботы
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТДанныеГрафика = "ВТДанныеГрафика";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДанныеГрафика";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Начисления.ВидРасчета	КАК ВидРасчета,
	|   
	|	ВЫБОР КОГДА Начисления.Валюта1 = &парамВалютаРегламентУчета
	|				ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Валюты1.Курс
	|	КОНЕЦ	КАК КурсВалюты,		
	|   
	|	ВЫБОР	КОГДА	&парамВалютаУпрУчета = &парамВалютаРегламентУчета 
	|			ТОГДА 1 
	|			ИНАЧЕ ВалютыУпр.Курс/ВалютыУпр.Кратность 
	|	КОНЕЦ	КАК КурсВалютыУпр,
	|   
	|	ВЫБОР	КОГДА Начисления.Показатель1 ЕСТЬ NULL 
	|				ТОГДА 0
	|			КОГДА	Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
	|					ИЛИ	Начисления.Валюта1 = &парамВалютаРегламентУчета
	|					ИЛИ	Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ТОГДА  Начисления.Показатель1
	|			ИНАЧЕ Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
	|	КОНЕЦ
	|								КАК ОкладТариф,
	|   
	|	Графики.ГрафикРаботы		КАК ГрафикРаботы,
	|	Графики.НормаДней/&КвоМесяцев		КАК НормаДней,
	|	Графики.НормаЧасов/&КвоМесяцев		КАК НормаЧасов,
	|	Графики.КалендарныеДни/&КвоМесяцев	КАК КалендарныеДни
	|	
	|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамДата, 
	|						Сотрудник = &парамСотрудник 
	|						И ВидРасчетаИзмерение <> ВидРасчета  
	|	) КАК Начисления
	| 
	|// даные графика за год 
	|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДанныеГрафика + " КАК Графики
	|ПО	ИСТИНА
	|
	|// курсы валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДата) Как Валюты1
	|ПО Валюты1.Валюта = Начисления.Валюта1 
	|
	|// курсы упр. валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамДата) КАК ВалютыУпр
	|ПО  ВалютыУпр.Валюта = &парамВалютаУпрУчета 
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	ПараметрыОклада = Новый Соответствие;
	ПараметрыОклада.Вставить("Оклад",		0);
	ПараметрыОклада.Вставить("ОкладУпр",	0);
	ПараметрыОклада.Вставить("НормаДней",	0);
	ПараметрыОклада.Вставить("НормаЧасов",	0);
	ПараметрыОклада.Вставить("КалендарныеДни",	0);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КурсВалютыУпр = ?(ОтражатьВУпрУчете И Выборка.КурсВалютыУпр<>NULL, Выборка.КурсВалютыУпр, 0);
		ОкладЗаМесяц = Выборка.ОкладТариф;
		// если оклад ввиде тарифа за день или за час приведем его к сумме за месяц
		Если Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке
			ИЛИ Выборка.ВидРасчета.Показатели.Найти(Справочники.ПоказателиСхемМотивации.ВремяВДнях) <> Неопределено
				Тогда
			ОкладЗаМесяц = ОкладЗаМесяц*Окр(Выборка.НормаДней,2);
		ИначеЕсли Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке 
			ИЛИ Выборка.ВидРасчета.Показатели.Найти(Справочники.ПоказателиСхемМотивации.ВремяВЧасах) <> Неопределено
				Тогда
			ОкладЗаМесяц = ОкладЗаМесяц*Окр(Выборка.НормаЧасов);
		КонецЕсли;
		
		Если ОтражатьВУпрУчете И ОтражатьВРеглУчете Тогда
			ОкладЗаМесяцУпр = ?(КурсВалютыУпр <> 0, (ОкладЗаМесяц /КурсВалютыУпр),  0);
			
		ИначеЕсли ОтражатьВРеглУчете Тогда
			ОкладЗаМесяцУпр = 0;
			
		Иначе  // чистый упр учет
			ОкладЗаМесяцУпр = ОкладЗаМесяц;
			ОкладЗаМесяц = 0;
		КонецЕсли;
		
		ПараметрыОклада["Оклад"] = ОкладЗаМесяц;
		ПараметрыОклада["ОкладУпр"] = ОкладЗаМесяцУпр;
		ПараметрыОклада["НормаДней"] = Выборка.НормаДней;
		ПараметрыОклада["НормаЧасов"] = Выборка.НормаЧасов;
		ПараметрыОклада["КалендарныеДни"] = ?(ДляДекретных, 30.44, Выборка.КалендарныеДни);
	КонецЕсли;
	
	Возврат ПараметрыОклада;
КонецФункции

Функция ПолучитьПараметыОклада1213(мДатаНачала, Сотрудник, ОтражатьВРеглУчете, ОтражатьВУпрУчете, ПериодРасчетаСреднегоНачало = Неопределено, ПериодРасчетаСреднегоКонец = Неопределено, За12Месяцев = Ложь) Экспорт

	КвоМесяцев = ?(За12Месяцев,12,2);
	
	НормаДнейЗаРабочийМесяцПолная = 0;
	НормаЧасовЗаРабочийМесяцПолная = 0;

	НормаДнейЗаРабочийМесяц = 0;
	НормаЧасовЗаРабочийМесяц = 0;
	
	ОкладЗаМесяц = 0; Оклад = 0;
	СуммаРегл = 0;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамСотрудник",	Сотрудник);
	Запрос.УстановитьПараметр("парамПериод",	КонецДня(мДатаНачала));
	Запрос.УстановитьПараметр("парамНеопределено",	Неопределено);
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета",				Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("парамВалютаУпрУчета",					Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты",	ПроведениеРасчетов.ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
	Начало = ДобавитьМесяц(НачалоМесяца(мДатаНачала),-КвоМесяцев);
	Конец =  КонецМесяца(ДобавитьМесяц(мДатаНачала,-1));
		
	Запрос.УстановитьПараметр("парамНачало",Начало);
	Запрос.УстановитьПараметр("парамКонец",	Конец);
	Запрос.УстановитьПараметр("КвоМесяцев", КвоМесяцев);
		
	Если Истина Тогда
		//	Описание:
		// 		График и норма за месяц дней, часов и календарных дней
		//
		ТекстЗапросаВТ = "
	  	|ВЫБРАТЬ 
	  	|	ВсеГрафики.ГрафикРаботы    	КАК ГрафикРаботы,
	  	|	СУММА(ВсеГрафики.НормаДнейЗаРабочийМесяц)	КАК НормаДнейЗаРабочийМесяц,
	  	|	СУММА(ВсеГрафики.НормаЧасовЗаРабочийМесяц)	КАК НормаЧасовЗаРабочийМесяц,
	  	|	СУММА(ВсеГрафики.НормаДней)					КАК НормаДней,
	  	|	СУММА(ВсеГрафики.НормаЧасов)				КАК НормаЧасов,
	  	|	СУММА(ВсеГрафики.КалендарныеДни)			КАК КалендарныеДни
		|ПОМЕСТИТЬ ВТДанныеГрафика	
	  	|	ИЗ ( 
	  	|	ВЫБРАТЬ 
	  	|		Работники.ГрафикРаботы    	КАК ГрафикРаботы,
	  	|		0			КАК НормаДнейЗаРабочийМесяц,
	  	|		0			КАК НормаЧасовЗаРабочийМесяц,
	  	|		СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение)			КАК НормаДней,
	  	|		СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение)	КАК НормаЧасов,
	  	|		СУММА(ГрафикиРаботыПоВидамВремени.ПроизводственныйКалендарьКалендарныеДни)	КАК КалендарныеДни
	  	|	ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамПериод, Сотрудник = &парамСотрудник) КАК Работники 
	  	|		   
	  	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	  	|	ПО	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
		|		И	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = Работники.ГрафикРаботы
	  	|		И	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	  	|	СГРУППИРОВАТЬ ПО 
	  	|		Работники.ГрафикРаботы
	  	|		   
	  	|		   
	  	|	ОБЪЕДИНИТЬ ВСЕ	   
	  	|	ВЫБРАТЬ 
	  	|		Работники.ГрафикРаботы    	КАК ГрафикРаботы,
	  	|		СУММА(ГрафикиРаботыЗаРабочийМесяц.ОсновноеЗначение)			КАК НормаДнейЗаРабочийМесяц,
	  	|		СУММА(ГрафикиРаботыЗаРабочийМесяц.ДополнительноеЗначение)	КАК НормаЧасовЗаРабочийМесяц,
	  	|		0	КАК НормаДней,
	  	|		0	КАК НормаЧасов,
	  	|		0	КАК КалендарныеДни
	  	|	ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамПериод, Сотрудник = &парамСотрудник) КАК Работники 
	  	|		   
	  	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыЗаРабочийМесяц
	  	|	ПО		ГрафикиРаботыЗаРабочийМесяц.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&парамПериод, МЕСЯЦ) И КОНЕЦПЕРИОДА(&парамПериод, МЕСЯЦ)
	  	|		И	ГрафикиРаботыЗаРабочийМесяц.ГрафикРаботы = Работники.ГрафикРаботы
	  	|		И	ГрафикиРаботыЗаРабочийМесяц.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	  	|	СГРУППИРОВАТЬ ПО 
	  	|		Работники.ГрафикРаботы
	  	|) КАК ВсеГрафики		   
	  	|СГРУППИРОВАТЬ ПО 
	  	|	ВсеГрафики.ГрафикРаботы
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТДанныеГрафика = "ВТДанныеГрафика";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДанныеГрафика";
			
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Начисления.ВидРасчета	КАК ВидРасчета,
	|	ВЫБОР КОГДА Начисления.Валюта1 = &парамВалютаРегламентУчета
	|				ИЛИ Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Валюты1.Курс
	|	КОНЕЦ	КАК КурсВалюты,		
	|   
	|	ВЫБОР	КОГДА	&парамВалютаУпрУчета = &парамВалютаРегламентУчета 
	|			ТОГДА 1 
	|			ИНАЧЕ ВалютыУпр.Курс/ВалютыУпр.Кратность 
	|	КОНЕЦ	КАК КурсВалютыУпр,
	|   
	|	ВЫБОР	КОГДА Начисления.Показатель1 ЕСТЬ NULL 
	|				ТОГДА 0
	|			КОГДА	Начисления.ВидРасчета.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
	|					ИЛИ	Начисления.Валюта1 = &парамВалютаРегламентУчета
	|					ИЛИ	Начисления.Валюта1 = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ТОГДА  Начисления.Показатель1
	|			ИНАЧЕ Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
	|	КОНЕЦ
	|								КАК ОкладТариф,
	|	Графики.ГрафикРаботы	КАК ГрафикРаботы,
	|	Графики.НормаДнейЗаРабочийМесяц		КАК НормаДнейЗаРабочийМесяц,
	|	Графики.НормаЧасовЗаРабочийМесяц	КАК НормаЧасовЗаРабочийМесяц,
	|	Графики.НормаДней		КАК НормаДней,
	|	Графики.НормаЧасов		КАК НормаЧасов,
	|	Графики.КалендарныеДни	КАК КалендарныеДни
	|	
	|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамПериод, 
	|						Сотрудник = &парамСотрудник 
	|						И ВидРасчетаИзмерение <> ВидРасчета  
	|	) КАК Начисления
	| 
	|// даные графика за год 
	|ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстЗапросаВТДанныеГрафика + " КАК Графики
	|ПО	ИСТИНА
	|
	|// курсы валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамПериод) Как Валюты1
	|ПО Валюты1.Валюта = Начисления.Валюта1 
	|
	|// курсы упр. валюты 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних(&парамПериод) КАК ВалютыУпр
	|ПО  ВалютыУпр.Валюта = &парамВалютаУпрУчета 
    | 
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	ПараметрыОклада = Новый Соответствие;
	ПараметрыОклада.Вставить("Оклад",		0);
	ПараметрыОклада.Вставить("НормаДней",	0);
	ПараметрыОклада.Вставить("НормаЧасов",	0);
	ПараметрыОклада.Вставить("КалендарныеДни", 0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		КурсВалютыУпр = ?(ОтражатьВУпрУчете И Выборка.КурсВалютыУпр<>NULL, Выборка.КурсВалютыУпр, 0);
		ОкладЗаМесяц = Выборка.ОкладТариф;
		// если оклад ввиде тарифа за день или за час приведем его к сумме за месяц
		Если Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке
			ИЛИ Выборка.ВидРасчета.Показатели.Найти(Справочники.ПоказателиСхемМотивации.ВремяВДнях) <> Неопределено
				Тогда
			ОкладЗаМесяц = ОкладЗаМесяц*Окр(Выборка.НормаДнейЗаРабочийМесяц,2);
		ИначеЕсли Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке 
			ИЛИ Выборка.ВидРасчета.Показатели.Найти(Справочники.ПоказателиСхемМотивации.ВремяВЧасах) <> Неопределено
				Тогда
			ОкладЗаМесяц = ОкладЗаМесяц*Окр(Выборка.НормаЧасовЗаРабочийМесяц);
		КонецЕсли;
				
		МинимальнаяОплатаТруда = РегистрыСведений.МинимальнаяОплатаТруда.СрезПоследних(НачалоМесяца(мДатаНачала));
		Если МинимальнаяОплатаТруда.Количество() > 0 Тогда 
			МинимальныйРазмерОплатыТруда = МинимальнаяОплатаТруда[0].Размер;
		Иначе	
			МинимальныйРазмерОплатыТруда = 0;
		КонецЕсли;	
		
		ПараметрыОклада["НормаДней"] = Выборка.НормаДней;
		ПараметрыОклада["НормаЧасов"] = Выборка.НормаЧасов;
		 
		ПараметрыОклада["КалендарныеДни"] = ?(За12Месяцев,Выборка.КалендарныеДни, 0);
		
		НормаДнейЗаРабочийМесяц = Выборка.НормаДнейЗаРабочийМесяц;
		НормаЧасовЗаРабочийМесяц = Выборка.НормаЧасовЗаРабочийМесяц;
		НормаДнейЗаРабочийМесяцПолная = Выборка.НормаДнейЗаРабочийМесяц; 
		НормаЧасовЗаРабочийМесяцПолная = Выборка.НормаЧасовЗаРабочийМесяц; 
		Если Истина Тогда
			//	Описание:
			// 		График полного рабочего времени и норма за месяц дней, часов
			//
			ТекстЗапросаГрафикПРВ = "
			|ВЫБРАТЬ 
			|	ДанныеГрафика.ГрафикРаботы.ГрафикРаботыНормыВремени КАК ГрафикПолногоРабочегоВремени
			|ИЗ ВТДанныеГрафика КАК ДанныеГрафика
			|";
			Запрос.Текст = ТекстЗапросаГрафикПРВ;
			ВыборкаГрафикПРВ = Запрос.Выполнить().Выбрать();
			Если ВыборкаГрафикПРВ.Следующий() Тогда
				ГрафикПолногоРабочегоВремени = ВыборкаГрафикПРВ.ГрафикПолногоРабочегоВремени;
				Если НЕ ГрафикПолногоРабочегоВремени = Неопределено И НЕ ГрафикПолногоРабочегоВремени = Справочники.ГрафикиРаботы.ПустаяСсылка() Тогда
					Запрос.УстановитьПараметр("ГрафикПолногоРабочегоВремени",ГрафикПолногоРабочегоВремени);
					
					ТекстЗапросаГрафикПРВ = "
					|ВЫБРАТЬ 
					|	СУММА(ГрафикиРаботыЗаРабочийМесяц.ОсновноеЗначение)	КАК НормаДнейЗаРабочийМесяцПолная,
					|	СУММА(ГрафикиРаботыЗаРабочийМесяц.ДополнительноеЗначение) КАК НормаЧасовЗаРабочийМесяцПолная
					|ИЗ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыЗаРабочийМесяц
					|	ГДЕ		ГрафикиРаботыЗаРабочийМесяц.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&парамПериод, МЕСЯЦ) И КОНЕЦПЕРИОДА(&парамПериод, МЕСЯЦ)
					|		И	ГрафикиРаботыЗаРабочийМесяц.ГрафикРаботы = &ГрафикПолногоРабочегоВремени
					|		И	ГрафикиРаботыЗаРабочийМесяц.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
					|"; 
					Запрос.Текст = ТекстЗапросаГрафикПРВ;
					РезультатЗапроса = Запрос.Выполнить();
					ВыборкаГрафикПРВ = Запрос.Выполнить().Выбрать();
					Если ВыборкаГрафикПРВ.Следующий() Тогда
						НормаДнейЗаРабочийМесяцПолная = ВыборкаГрафикПРВ.НормаДнейЗаРабочийМесяцПолная;
						НормаЧасовЗаРабочийМесяцПолная = ВыборкаГрафикПРВ.НормаЧасовЗаРабочийМесяцПолная;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке И НормаДнейЗаРабочийМесяцПолная > 0 Тогда
			ОкладЗаМесяц = Окр(ОкладЗаМесяц/НормаДнейЗаРабочийМесяцПолная*НормаДнейЗаРабочийМесяц,2);
			МинимальныйРазмерОплатыТруда = Окр(МинимальныйРазмерОплатыТруда/НормаДнейЗаРабочийМесяцПолная*НормаДнейЗаРабочийМесяц,2);
		ИначеЕсли Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке И НормаЧасовЗаРабочийМесяцПолная > 0 Тогда
			ОкладЗаМесяц = Окр(ОкладЗаМесяц/НормаЧасовЗаРабочийМесяцПолная*НормаЧасовЗаРабочийМесяц,2);
			МинимальныйРазмерОплатыТруда = Окр(МинимальныйРазмерОплатыТруда/НормаЧасовЗаРабочийМесяцПолная*НормаЧасовЗаРабочийМесяц,2);
		КонецЕсли;
		
		Оклад = Макс(ОкладЗаМесяц, МинимальныйРазмерОплатыТруда);
		
		Если ОтражатьВУпрУчете И ОтражатьВРеглУчете Тогда
			ОкладУпр = Окр(?(КурсВалютыУпр <> 0, (Оклад /КурсВалютыУпр),  0)*КвоМесяцев,2);
			
		ИначеЕсли ОтражатьВРеглУчете Тогда
			ОкладУпр = 0;
			
		Иначе  // чистый упр учет
			ОкладУпр = Оклад;
			Оклад = 0;
		КонецЕсли;
		ПараметрыОклада["Оклад"] = Окр(Оклад*КвоМесяцев,2);
		ПараметрыОклада["ОкладУпр"] = Окр(ОкладУпр*КвоМесяцев,2);
		
	КонецЕсли;
	
	Возврат ПараметрыОклада;
КонецФункции

Функция РасчетСтраховогоСтажа(ДатаНачала, Организация, Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",	ДатаНачала );
	Запрос.УстановитьПараметр("ГодНачалаСобытия",	Год(ДатаНачала) );
	Запрос.УстановитьПараметр("парамСотрудник",		Сотрудник );
	Запрос.УстановитьПараметр("парамФизЛицо",		Сотрудник.Физлицо );
	Запрос.УстановитьПараметр("парамОрганизация",	Организация );
	ДатаПриема = Дата(1,1,1);
	ТекстЗапросаВТ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(Работники.Период) КАК ДатаПриема
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК Работники
	|ГДЕ
	|	Работники.Сотрудник = &парамСотрудник";
	Запрос.Текст = ТекстЗапросаВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаПриема = Выборка.ДатаПриема;	
	КонецЕсли;	
	// ВТСтраховойСтажПоДаннымПФУ - таблица данных о страховом стаже на основании справки ПФУ  
	ТекстЗапросаВТ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтраховойСтажПоДаннымПФУСрезПоследних.Год,
	|	СтраховойСтажПоДаннымПФУСрезПоследних.Месяц КАК Месяц,
	|	СтраховойСтажПоДаннымПФУСрезПоследних.МесяцыСтажа КАК МесяцыСтажа,
	|	СтраховойСтажПоДаннымПФУСрезПоследних.ДниСтажа КАК ДниСтажа
	|ПОМЕСТИТЬ ВТСтраховойСтажПоДаннымПФУ
	|ИЗ
	|	РегистрСведений.СтраховойСтажПоДаннымПФУ.СрезПоследних(
	|			&ДатаНачалаСобытия,
	|			Организация = &парамОрганизация
	|				И ФизЛицо = &парамФизЛицо) КАК СтраховойСтажПоДаннымПФУСрезПоследних
	|ГДЕ
	|	ЕСТЬNULL(СтраховойСтажПоДаннымПФУСрезПоследних.Месяц, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаНачалаСобытия";
	Запрос.Текст = ТекстЗапросаВТ;
	Результат = Запрос.Выполнить();
	
	// Период окончания справки	
	ТекстЗапросаВТ = "ВЫБРАТЬ 
	|	ЕСТЬNULL(МИНИМУМ(СтраховойСтажПоДаннымПФУ.Месяц), ДАТАВРЕМЯ(1, 1, 1)) КАК МинимальныйПериод,
	|	ЕСТЬNULL(МАКСИМУМ(СтраховойСтажПоДаннымПФУ.Месяц), ДАТАВРЕМЯ(1, 1, 1)) КАК МаксимальныйПериод
	|ИЗ ВТСтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
	|ГДЕ
	|	ЕСТЬNULL(СтраховойСтажПоДаннымПФУ.Месяц, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.Текст = ТекстЗапросаВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	МинимальныйПериодСправки = Дата(1, 1, 1);
	МаксимальныйПериодСправки = Дата(1, 1, 1);
	Если Выборка.Следующий() Тогда
		МинимальныйПериодСправки = Выборка.МинимальныйПериод;
		МаксимальныйПериодСправки = ?(Выборка.МаксимальныйПериод = Дата(1, 1, 1), Дата(1, 1, 1),КонецМесяца(Выборка.МаксимальныйПериод));
		Если МаксимальныйПериодСправки > ДатаНачала Тогда МаксимальныйПериодСправки = КонецМесяца(ДобавитьМесяц(ДатаНачала,-1)) КонецЕсли;
	КонецЕсли;
	
	СтруктураСтажа = Новый Структура;
	ТекстЗапросаВТ = "ВЫБРАТЬ 
	|	СтраховойСтажПоДаннымПФУ.Год КАК Год,
	|	СтраховойСтажПоДаннымПФУ.Месяц КАК Месяц,
	|	СтраховойСтажПоДаннымПФУ.МесяцыСтажа КАК МесяцыСтажа,
	|	СтраховойСтажПоДаннымПФУ.ДниСтажа КАК ДниСтажа
	|ИЗ ВТСтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
	|";
	Запрос.Текст = ТекстЗапросаВТ;
	ТаблицаСтажаПоСправкеПодробная = Запрос.Выполнить().Выгрузить();
	СтруктураСтажа.Вставить("ТаблицаСтажаПоСправкеПодробная", ТаблицаСтажаПоСправкеПодробная);
	
	ЛетОбщегоСтажа = 0; МесяцевОбщегоСтажа = 0; ДнейОбщегоСтажа = 0;
	// ВТИтогиПоГодам - таблица итоговых данных по годам из РС СтраховойСтажПоДаннымПФУ
	ТекстЗапросаВТ = "ВЫБРАТЬ
	|	СтраховойСтажПоДаннымПФУ.ДниСтажа КАК ДниСтажа,
	|	СтраховойСтажПоДаннымПФУ.МесяцыСтажа КАК МесяцыСтажа,
	|	СтраховойСтажПоДаннымПФУ.Год
	|ПОМЕСТИТЬ ВТИтогиПоГодам
	|ИЗ
	|	ВТСтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
	|ГДЕ
	|	СтраховойСтажПоДаннымПФУ.Месяц = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ(ЕСТЬNULL(СтраховойСтажПоДаннымПФУ.ДниСтажа, 0) = 0
	|				И ЕСТЬNULL(СтраховойСтажПоДаннымПФУ.МесяцыСтажа, 0) = 0)
	|	И СтраховойСтажПоДаннымПФУ.Год < &ГодНачалаСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ИтогиМесяцы.МесяцыСтажа), 0) КАК МесяцыСтажа
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтраховойСтажПоДаннымПФУ.Месяц КАК Месяц,
	|		СУММА(СтраховойСтажПоДаннымПФУ.МесяцыСтажа) КАК МесяцыСтажа
	|	ИЗ
	|		ВТСтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
	|	ГДЕ
	|		СтраховойСтажПоДаннымПФУ.Месяц <> ДАТАВРЕМЯ(1, 1, 1)
	|		И НЕ СтраховойСтажПоДаннымПФУ.Год В
	|					(ВЫБРАТЬ
	|						ВТИтогиПоГодам.Год КАК Год
	|					ИЗ
	|						ВТИтогиПоГодам КАК ВТИтогиПоГодам)
	|		И СтраховойСтажПоДаннымПФУ.Месяц < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтраховойСтажПоДаннымПФУ.Месяц
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		СУММА(ВТИтогиПоГодам.МесяцыСтажа)
	|	ИЗ
	|		ВТИтогиПоГодам КАК ВТИтогиПоГодам) КАК ИтогиМесяцы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ИтогиДни.ДниСтажа), 0) КАК ДниСтажа
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(СтраховойСтажПоДаннымПФУ.ДниСтажа) КАК ДниСтажа
	|	ИЗ
	|		ВТСтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
	|	ГДЕ
	|		НЕ СтраховойСтажПоДаннымПФУ.Год В
	|					(ВЫБРАТЬ
	|						ВТИтогиПоГодам.Год КАК Год
	|					ИЗ
	|						ВТИтогиПоГодам КАК ВТИтогиПоГодам)
	|		И СтраховойСтажПоДаннымПФУ.МесяцыСтажа = 0
	|		И СтраховойСтажПоДаннымПФУ.Месяц < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВТИтогиПоГодам.ДниСтажа)
	|	ИЗ
	|		ВТИтогиПоГодам КАК ВТИтогиПоГодам) КАК ИтогиДни";
	
	Запрос.Текст = ТекстЗапросаВТ;
	Выборка = Запрос.ВыполнитьПакет();
	
	МесяцыСтажаИтог = 0; ДниСтажаИтог = 0;
	
	ВыборкаМесяцы = Выборка[1].Выбрать();
	Если ВыборкаМесяцы.Следующий() Тогда
		МесяцыСтажаИтог = ВыборкаМесяцы.МесяцыСтажа;
	КонецЕсли;	

	ВыборкаДни = Выборка[2].Выбрать();
	Если ВыборкаДни.Следующий() Тогда
		ДниСтажаИтог = ВыборкаДни.ДниСтажа;
	КонецЕсли;	
	
	
	МесяцевСтажаПоДаннымПФУ = МесяцыСтажаИтог + Цел(ДниСтажаИтог/30);
	ЛетСтажаПоДаннымПФУ = Цел(МесяцевСтажаПоДаннымПФУ/12);
	МесяцевСтажаПоДаннымПФУ = МесяцевСтажаПоДаннымПФУ - Цел(МесяцевСтажаПоДаннымПФУ/12)*12; 
	ДнейСтажаПоДаннымПФУ = ДниСтажаИтог -  Цел(ДниСтажаИтог/30)*30;

	СтруктураСтажа.Вставить("ЛетСтажаПоДаннымПФУ", 	ЛетСтажаПоДаннымПФУ);
	СтруктураСтажа.Вставить("МесяцевСтажаПоДаннымПФУ", МесяцевСтажаПоДаннымПФУ);
	СтруктураСтажа.Вставить("ДнейСтажаПоДаннымПФУ", ДнейСтажаПоДаннымПФУ);

	ДнейНачальногоСтажа = 0; МесяцевНачальногоСтажа = 0; ЛетНачальногоСтажа = 0;
	// Получение начального стажа
	Если МинимальныйПериодСправки = Дата(1,1,1) Тогда
		Запрос.УстановитьПараметр("МинимальныйПериодСправки", ДатаНачала);
	Иначе 
		Запрос.УстановитьПараметр("МинимальныйПериодСправки", МинимальныйПериодСправки);
	КонецЕсли;
	
	ТекстЗапросаВТ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачальныеСведенияОСтажеРаботниковОрганизации.ДнейСтажа,
	|	НачальныеСведенияОСтажеРаботниковОрганизации.Период,
	|	НачальныеСведенияОСтажеРаботниковОрганизации.ДатаСтажа
	|ИЗ
	|	РегистрСведений.НачальныеСведенияОСтажеРаботниковОрганизации.СрезПоследних(
	|			&МинимальныйПериодСправки,
	|			Организация = &парамОрганизация
	|				И ФизЛицо = &парамФизЛицо
	|				И ВидСтажа = ЗНАЧЕНИЕ(Справочник.ВидыСтажа.СтраховойСтажДляБольничного)) КАК НачальныеСведенияОСтажеРаботниковОрганизации";
	
	Запрос.Текст = ТекстЗапросаВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПересчитатьСтажИзДаты(Выборка.Период, Выборка.ДатаСтажа, ДнейНачальногоСтажа, МесяцевНачальногоСтажа, ЛетНачальногоСтажа);
	КонецЕсли;
	
	СтруктураСтажа.Вставить("МинимальныйПериодСправки",   МинимальныйПериодСправки);

	СтруктураСтажа.Вставить("ЛетНачальногоСтажа", 	ЛетНачальногоСтажа);
	СтруктураСтажа.Вставить("МесяцевНачальногоСтажа", МесяцевНачальногоСтажа);
	СтруктураСтажа.Вставить("ДнейНачальногоСтажа", ДнейНачальногоСтажа);

	ДнейСтажаДоНачалаСобытия = 0; МесяцевСтажаДоНачалаСобытия = 0; ЛетСтажаДоНачалаСобытия = 0;
	// Стаж до начала события от даты приема или периода окончания справки ПФУ 
	СтруктураСтажа.Вставить("МаксимальныйПериодСправки",   МаксимальныйПериодСправки);
	Если (ДатаПриема = Дата(1,1,1) И МаксимальныйПериодСправки = Дата(1,1,1)) Тогда
		ДатаОтсчетаДоНачалаСобытия = ДатаНачала
	ИначеЕсли (ДатаПриема <> Дата(1,1,1)) И (ДатаПриема >= МаксимальныйПериодСправки) Тогда
		ДатаОтсчетаДоНачалаСобытия = ДатаПриема
	Иначе 
		ДатаОтсчетаДоНачалаСобытия = НачалоДня(КонецДня(МаксимальныйПериодСправки)+ 1)
	КонецЕсли;
	ПересчитатьСтажИзДаты(ДатаНачала, ДатаОтсчетаДоНачалаСобытия, ДнейСтажаДоНачалаСобытия, МесяцевСтажаДоНачалаСобытия, ЛетСтажаДоНачалаСобытия);

	СтруктураСтажа.Вставить("ДатаОтсчетаДоНачалаСобытия", ДатаОтсчетаДоНачалаСобытия);
	СтруктураСтажа.Вставить("ЛетСтажаДоНачалаСобытия", 	ЛетСтажаДоНачалаСобытия);
	СтруктураСтажа.Вставить("МесяцевСтажаДоНачалаСобытия", МесяцевСтажаДоНачалаСобытия);
	СтруктураСтажа.Вставить("ДнейСтажаДоНачалаСобытия", ДнейСтажаДоНачалаСобытия);
	
	ЛетСтажа = ЛетСтажаПоДаннымПФУ + ЛетНачальногоСтажа + ЛетСтажаДоНачалаСобытия; 
	МесяцевСтажа = МесяцевСтажаПоДаннымПФУ + МесяцевНачальногоСтажа + МесяцевСтажаДоНачалаСобытия; 
	ДнейСтажа = ДнейСтажаПоДаннымПФУ + ДнейНачальногоСтажа + ДнейСтажаДоНачалаСобытия; 

	МесяцевОбщегоСтажа = МесяцевСтажа + Цел(ДнейСтажа/30);
	ЛетОбщегоСтажа = ЛетСтажа + Цел(МесяцевОбщегоСтажа/12);
	МесяцевОбщегоСтажа = МесяцевОбщегоСтажа - Цел(МесяцевОбщегоСтажа/12)*12;
	ДнейОбщегоСтажа = ДнейСтажа -  Цел(ДнейСтажа/30)*30;
	
	СтруктураСтажа.Вставить("ЛетОбщегоСтажа", 	ЛетОбщегоСтажа);
	СтруктураСтажа.Вставить("МесяцевОбщегоСтажа", МесяцевОбщегоСтажа);
	СтруктураСтажа.Вставить("ДнейОбщегоСтажа", 	ДнейОбщегоСтажа);
	//Стаж за 12 месяцев, предшествующих началу события:
	ДатаСтажа12МесяцевДоСобытия = ДобавитьМесяц(ДатаНачала,-12);
	
	Запрос.УстановитьПараметр("ДатаСтажа12МесяцевДоСобытия", ДатаСтажа12МесяцевДоСобытия);
	ТекстЗапросаВТ = "ВЫБРАТЬ
	|	СтраховойСтажПоДаннымПФУ.Год,
	|	СтраховойСтажПоДаннымПФУ.Месяц,
	|	СтраховойСтажПоДаннымПФУ.МесяцыСтажа,
	|	СтраховойСтажПоДаннымПФУ.ДниСтажа
	|ПОМЕСТИТЬ ВТСтраховойСтажПоДаннымПФУ12Месяцев
	|ИЗ
	|	ВТСтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
	|ГДЕ
	|	СтраховойСтажПоДаннымПФУ.Месяц >= НАЧАЛОПЕРИОДА(&ДатаСтажа12МесяцевДоСобытия, МЕСЯЦ)
	|   И СтраховойСтажПоДаннымПФУ.Месяц < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
	|";
	
	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();
	ЛетОбщегоСтажа12Месяцев = 0; МесяцевОбщегоСтажа12Месяцев = 0; ДнейОбщегоСтажа12Месяцев = 0;
	
	ТекстЗапросаВТ = "ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ИтогиМесяцы.МесяцыСтажа), 0) КАК МесяцыСтажа
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтраховойСтажПоДаннымПФУ.Месяц КАК Месяц,
	|		СУММА(СтраховойСтажПоДаннымПФУ.МесяцыСтажа) КАК МесяцыСтажа
	|	ИЗ
	|		ВТСтраховойСтажПоДаннымПФУ12Месяцев КАК СтраховойСтажПоДаннымПФУ
	|	ГДЕ
	|		СтраховойСтажПоДаннымПФУ.Месяц <> ДАТАВРЕМЯ(1, 1, 1)
	|		И СтраховойСтажПоДаннымПФУ.Месяц < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтраховойСтажПоДаннымПФУ.Месяц) КАК ИтогиМесяцы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ИтогиДни.ДниСтажа), 0) КАК ДниСтажа
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(СтраховойСтажПоДаннымПФУ.ДниСтажа) КАК ДниСтажа
	|	ИЗ
	|		ВТСтраховойСтажПоДаннымПФУ12Месяцев КАК СтраховойСтажПоДаннымПФУ
	|	ГДЕ
	|		СтраховойСтажПоДаннымПФУ.МесяцыСтажа = 0
	|		И СтраховойСтажПоДаннымПФУ.Месяц < НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ)) КАК ИтогиДни";
	Запрос.Текст = ТекстЗапросаВТ;
	//
	Выборка = Запрос.ВыполнитьПакет();
	
	МесяцыСтажаИтог = 0; ДниСтажаИтог = 0;
	
	ВыборкаМесяцы = Выборка[0].Выбрать();
	Если ВыборкаМесяцы.Следующий() Тогда
		МесяцыСтажаИтог = ВыборкаМесяцы.МесяцыСтажа;
	КонецЕсли;	

	ВыборкаДни = Выборка[1].Выбрать();
	Если ВыборкаДни.Следующий() Тогда
		ДниСтажаИтог = ВыборкаДни.ДниСтажа;
	КонецЕсли;	
	
	ЛетСтажаПоДаннымПФУ12Месяцев = Цел(МесяцыСтажаИтог/12);
	МесяцевСтажаПоДаннымПФУ12Месяцев = МесяцыСтажаИтог - ЛетСтажаПоДаннымПФУ12Месяцев*12;
	Если ЛетСтажаПоДаннымПФУ12Месяцев = 0 Тогда
		МесяцевСтажаПоДаннымПФУ12Месяцев =  МесяцевСтажаПоДаннымПФУ12Месяцев + Цел(ДниСтажаИтог/30); 
	КонецЕсли;	
	ДнейСтажаПоДаннымПФУ12Месяцев = ДниСтажаИтог -  Цел(ДниСтажаИтог/30)*30;
	
	ДнейСтажаДоНачалаСобытия12Месяцев = 0; МесяцевСтажаДоНачалаСобытия12Месяцев = 0; ЛетСтажаДоНачалаСобытия12Месяцев = 0;
	Если МаксимальныйПериодСправки = Дата(1,1,1) Тогда
		МаксимальныйПериодСправки = ДатаСтажа12МесяцевДоСобытия
	Иначе
		МаксимальныйПериодСправки = НачалоДня(КонецДня(МаксимальныйПериодСправки)+ 1)
	КонецЕсли;	
	Если ДатаПриема >= МаксимальныйПериодСправки Тогда
		ДатаОтсчетаДоНачалаСобытия12 = ДатаПриема
	Иначе
		ДатаОтсчетаДоНачалаСобытия12 = МаксимальныйПериодСправки
	КонецЕсли;
	ПересчитатьСтажИзДаты(ДатаНачала, ДатаОтсчетаДоНачалаСобытия12, ДнейСтажаДоНачалаСобытия12Месяцев, МесяцевСтажаДоНачалаСобытия12Месяцев, ЛетСтажаДоНачалаСобытия12Месяцев);
	ЛетСтажа12Месяцев = ЛетСтажаПоДаннымПФУ12Месяцев + ЛетСтажаДоНачалаСобытия12Месяцев; 
	МесяцевСтажа12Месяцев = МесяцевСтажаПоДаннымПФУ12Месяцев + МесяцевСтажаДоНачалаСобытия12Месяцев; 
	ДнейСтажа12Месяцев = ДнейСтажаПоДаннымПФУ12Месяцев + ДнейСтажаДоНачалаСобытия12Месяцев; 
	
	МесяцевОбщегоСтажа12Месяцев = МесяцевСтажа12Месяцев + Цел(ДнейСтажа12Месяцев/30) - Цел(МесяцевСтажа12Месяцев/12)*12;
	ЛетОбщегоСтажа12Месяцев = ЛетСтажа12Месяцев + Цел(МесяцевСтажа12Месяцев/12);
	ДнейОбщегоСтажа12Месяцев = ДнейСтажа12Месяцев -  Цел(ДнейСтажа12Месяцев/30)*30;
	
	СтруктураСтажа.Вставить("МесяцевСтажаЗа12Месяцев",МесяцевОбщегоСтажа12Месяцев);
	СтруктураСтажа.Вставить("ЛетСтажаЗа12Месяцев",ЛетОбщегоСтажа12Месяцев);
	СтруктураСтажа.Вставить("ДнейСтажаЗа12Месяцев", ДнейОбщегоСтажа12Месяцев);
	
	Возврат СтруктураСтажа;

КонецФункции  // РасчетСтраховогоСтажа

Функция ПересчитатьСтажВДату(ДатаНачала, Начало = Истина, Дней, Месяцев, Лет ) Экспорт
	
	Если Начало Тогда
		ДатаКонца = ДобавитьМесяц( ДатаНачала - 86400*Дней, -(Месяцев + Лет*12 ) );
	Иначе
		ДатаКонца = ДобавитьМесяц( ДатаНачала + 86400*Дней,  (Месяцев + Лет*12 ) );
	КонецЕсли;
	
	Возврат ДатаКонца;
	
КонецФункции // ПересчитатьСтажВДату()

Функция ПересчитатьСтажИзДаты(ДатаНачала, ДатаТекущая, Дней, Месяцев, Лет) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаТекущая) Тогда
		Возврат НСтр("ru='Нет стажа';uk='Немає стажу'");
	КонецЕсли;
	
	Годы = Год(ДатаНачала)-Год(ДатаТекущая);
	Если Годы < 0 Тогда
		Годы = Годы + 100;
	КонецЕсли;
	
	Разн = Месяц(ДатаНачала) - Месяц(ДатаТекущая) + Годы*12;
	Если День(ДатаНачала) < День(ДатаТекущая) Тогда
		Разн = Разн-1;
	КонецЕсли;
	
	Месяцев = Разн%12;
	Лет = (Разн-Месяцев)/12;
	Дней = (ДатаНачала-ДобавитьМесяц(ДатаТекущая,Разн))/86400;
	
	Если Лет>20 Тогда
		ОстатокЛет=Лет%10;
	Иначе 
		ОстатокЛет = Лет;	
	КонецЕсли;
	
	Если Дней>20 Тогда
		ОстатокДней=Дней%10;
	Иначе 
		ОстатокДней = Дней;	
	КонецЕсли;
	СтрокаВозврата="";
	
	Если Лет=0 Тогда
		//пропускаем	
	ИначеЕсли ОстатокЛет=1 Тогда
		СтрокаВозврата =Строка(Лет)+НСтр("ru=' год ';uk=' рік '");
	ИначеЕсли ОстатокЛет < 5 Тогда	
		СтрокаВозврата = Строка(Лет)+НСтр("ru=' года ';uk=' року '");
	Иначе
		СтрокаВозврата = Строка(Лет)+НСтр("ru=' лет ';uk=' років '");
	КонецЕсли;
	
	Если Месяцев=0 Тогда
		//пропускаем	
	ИначеЕсли Месяцев=1 Тогда
		СтрокаВозврата = СтрокаВозврата+НСтр("ru='1 месяц ';uk='1 місяць '");
	ИначеЕсли Месяцев < 5 Тогда	
		СтрокаВозврата = СтрокаВозврата+Строка(Месяцев)+НСтр("ru=' месяца ';uk=' місяці '");
	Иначе
		СтрокаВозврата = СтрокаВозврата+Строка(Месяцев)+НСтр("ru=' месяцев ';uk=' місяців '");
	КонецЕсли;
	
	Если Дней=0 Тогда
		//пропускаем	
	ИначеЕсли ОстатокДней=1 Тогда
		СтрокаВозврата = СтрокаВозврата+Строка(Дней)+НСтр("ru=' день';uk=' день'");
	ИначеЕсли ОстатокДней < 5 Тогда	
		СтрокаВозврата = СтрокаВозврата+Строка(Дней)+НСтр("ru=' дня';uk=' дня'");
	Иначе
		СтрокаВозврата = СтрокаВозврата+Строка(Дней)+НСтр("ru=' дней';uk=' днів'");
	КонецЕсли;
	
	Если СтрокаВозврата = "" Тогда
		СтрокаВозврата =НСтр("ru='Нет стажа';uk='Немає стажу'");
	КонецЕсли;	
	
	Возврат СтрокаВозврата;
	
КонецФункции // ПересчитатьСтажИзДаты()

Функция ПолучитьКвоМесяцевВпериоде( ТекстДатаНачало, ТекстДатаКонец ) Экспорт
	
	ТекстЗапроса = "(  (ГОД("+ТекстДатаКонец+") - ГОД("+ТекстДатаНачало+"))*12 + МЕСЯЦ("+ТекстДатаКонец+") - МЕСЯЦ("+ТекстДатаНачало+") + 1 )
	|
	|"; 
	
	Возврат ТекстЗапроса;
КонецФункции

// Разбивает строку таблицы начислений на помесячные записи (длиной не более месяца)
// Параметры:
//		СтрокаНачислений - строка таблицы начислений, которую следует разбить
//		ТаблицаНачислений - таблица начислений, имеющая 2 обязательные колонки: ДатаНачала и  ДатаОкончания
Процедура РазбитьСтрокуНачисленийНаПомесячныеЗаписи(СтрокаНачислений, ТаблицаНачислений) Экспорт
	
	НачалоПериода = СтрокаНачислений["ДатаНачала"];
	КонецПериода = СтрокаНачислений["ДатаОкончания"];
	
	Если НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода) ИЛИ КонецПериода < НачалоПериода Тогда
		Возврат;// разбивать не надо
	КонецЕсли; 
	
	РазницаВМесяцах = (Год(КонецПериода)*12 + Месяц(КонецПериода)) - (Год(НачалоПериода)*12 + Месяц(НачалоПериода));
	
	// У первоначальной строки дату конца установим в конец первого месяца
	СтрокаНачислений["ДатаОкончания"] = КонецМесяца(НачалоПериода);	
	
	ОчередноеНачалоМесяца = НачалоМесяца(НачалоПериода);
	Для Счетчик = 1 По РазницаВМесяцах Цикл
		
		НоваяСтрока = ТаблицаНачислений.Добавить();
		НоваяСтрока["Авторасчет"] =  СтрокаНачислений["Авторасчет"];
		НоваяСтрока["ПроизошедшееСобытие"] = СтрокаНачислений["ПроизошедшееСобытие"];
		
		// Скопируем строку
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНачислений,,"НомерСтроки");
		
		// Установим период
		ОчередноеНачалоМесяца = ДобавитьМесяц(ОчередноеНачалоМесяца, 1);
		НоваяСтрока["ДатаНачала"] = ОчередноеНачалоМесяца;	
		НоваяСтрока["ДатаОкончания"] = КонецМесяца(ОчередноеНачалоМесяца);	
		НоваяСтрока.БазовыйПериодНачало = НоваяСтрока["ДатаНачала"];	
		НоваяСтрока.БазовыйПериодКонец = НоваяСтрока["ДатаОкончания"];	
		
	КонецЦикла;
	
	// Для  последней строки установим конец периода в конец разбиваемого периода
	НоваяСтрока["ДатаОкончания"]	 = КонецПериода;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПОЛУЧЕНИЕ СПИСКОВ СПОСОБОВ РАСЧЕТА

// Возвращает список регламентированных алгоритмов начислений
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокОсновныхВариантовНачисленийОрганизации() Экспорт

	 СписокСпособов = Новый СписокЗначений;
	 
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы);
	 СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоМЗП);
	 
	 Возврат СписокСпособов

КонецФункции // ПолучитьСписокОсновныхВариантовНачисленийОрганизации()

// Возвращает список регламентированных алгоритмов удержаний
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокОсновныхВариантовУдержанийОрганизации() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеФиксированнойСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
	Возврат СписокСпособов;
	
КонецФункции // ПолучитьСписокВариантовУдержанийОрганизации()

Процедура УстановитьПараметрыВидаРасчета(Параметр, Объект, Элементыформы) Экспорт
	
	Объект.ФормулаРасчета				= Параметр[0];
	Объект.СпособРасчета 				= Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	Объект.ПроизвольнаяФормулаРасчета	= Истина;
	
	ПарамПоказатели = Параметр[1];
	
	ОбъектПоказатели = Объект.Показатели;
	ОбъектПоказатели.Очистить();
	Для Каждого ОбъектПоказатель Из ОбъектПоказатели Цикл
		Если ПарамПоказатели.Найти(ОбъектПоказатель.Показатель) = Неопределено Тогда
			ОбъектПоказатель.Показатель = Справочники.ПоказателиСхемМотивации.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	Для Каждого Показатель Из ПарамПоказатели Цикл
		Если ОбъектПоказатели.Найти(Показатель,"Показатель") = Неопределено Тогда
			НовыйПоказатель				= Объект.Показатели.Добавить();
			
			Если	Показатель.ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная 
				И	Показатель.ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая 
				И	Показатель.ВозможностьИзменения <> Перечисления.ИзменениеПоказателейСхемМотивации.ВводитсяПриРасчете 
				И	Показатель.ВозможностьИзменения <> Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете Тогда
				
				Если (Показатель = Справочники.ПоказателиСхемМотивации.ОкладТариф) Тогда
					Если Объект.Метаданные().Реквизиты.Найти("ЗачетОтработанногоВремени") = Неопределено Тогда
						НовыйПоказатель.ЗапрашиватьПриКадровыхПеремещениях = Ложь;
					ИначеЕсли Объект.ЗачетОтработанногоВремени Тогда
						НовыйПоказатель.ЗапрашиватьПриКадровыхПеремещениях = Истина;
					Иначе
						НовыйПоказатель.ЗапрашиватьПриКадровыхПеремещениях = Ложь;
					КонецЕсли;
				ИначеЕсли Показатель = Справочники.ПоказателиСхемМотивации.ОкладТарифНазначения Тогда
					НовыйПоказатель.ЗапрашиватьПриКадровыхПеремещениях = Ложь;
				Иначе
					НовыйПоказатель.ЗапрашиватьПриКадровыхПеремещениях = Истина;
				КонецЕсли;
			КонецЕсли;
			НовыйПоказатель.Показатель	= Показатель;
		КонецЕсли;
	КонецЦикла;
				
	Элементыформы.СпособРасчетаПредставление.УстановитьТекст(ВизуализироватьФормулуРасчета(Объект, "HTML"));
	
КонецПроцедуры

// Эта функция возвращает информацию о виде расчета из переданного соответствия
// Если в соответствии не найдена информация о виде расчета - она подготавливается и 
// помещается в соответствие
// Применяется для работы с формами, в которых активно требуется получать 
// информащцию о видах расчета, например, при выводе строки табличного поля
//
// Параметры:      
//	СведенияОВидахРасчета - соответствие, у котрого в качестве ключа - ПланВидовРасчетаСсылка, а 
//  				  в качестве значения - структура из элементов
//					  РазмерТребуется - булево - если да, то при вводе такого 
//										вида расчета требуется проставлять значение "размер" 
//										(суммы, проценты и проч. показатели, используемые при расчете)
//
//	ВидРасчета - ПланВидовРасчетаСсылка
//
// Возвращаемое значение:
//  Описанная выше структура
//
Функция ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ВидРасчета, Режим = "ПлановыеНачисления") Экспорт
	
	СведенияОВидеРасчета = СведенияОВидахРасчета[ВидРасчета];
	
	Если СведенияОВидеРасчета = Неопределено Тогда
		ТипВидРасчета = ТипЗнч(ВидРасчета);
		ИзменениеПоказателяНеУказано = Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка();
				
		СведенияОВидеРасчета = Новый Структура("КоличествоПоказателей,РазмерТребуется,НеТребуетВалюты,ФактКоличествоПоказателей",1, Ложь, Ложь, Ложь,0);
																					
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.Показатель,
		|	ВЫБОР
		|		КОГДА  НЕ Показатели.ЗапрашиватьПриКадровыхПеремещениях
		|			ТОГДА ИСТИНА";
		Если ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
			Запрос.Текст = Запрос.Текст + "
		|       ИНАЧЕ
		|			ВЫБОР 
		|				КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ОкладТариф)
		|					ТОГДА НЕ Показатели.Ссылка.ЗачетОтработанногоВремени
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
        |	КОНЕЦ КАК НЕЗапрашиватьПриКадровыхПеремещениях,
		|	ВЫБОР
		|		КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ПустаяСсылка) 
		|			ТОГДА ИСТИНА";
		Если ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
			Запрос.Текст = Запрос.Текст + "
		|	    ИНАЧЕ
		|			ВЫБОР 
		|				КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ОкладТариф)
		|						ТОГДА НЕ Показатели.Ссылка.ЗачетОтработанногоВремени
		|				КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.Процент)
		|					ТОГДА ЛОЖЬ
		|					ИНАЧЕ Показатели.Показатель.Предопределенный
		|			КОНЕЦ";
		Иначе
				Запрос.Текст = Запрос.Текст + "
		|		ИНАЧЕ Показатели.Показатель.Предопределенный";
		КонецЕсли;
				Запрос.Текст = Запрос.Текст + "		
		|			
		|	КОНЕЦ КАК Предопределенный,
		|	ВЫБОР КОГДА Показатели.Показатель.Предопределенный 
		|			И Показатели.Показатель <> Значение(Справочник.ПоказателиСхемМотивации.ОкладТариф)
		|			И Показатели.Показатель <> Значение(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
		|			И Показатели.Показатель <> Значение(Справочник.ПоказателиСхемМотивации.Процент)
		|			ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПредопределенный,
		|	Показатели.Показатель.Наименование КАК ПоказательНаименование,
		|	Показатели.Показатель.ТипПоказателя,
		|	ЕСТЬNULL(Показатели.Показатель.ВозможностьИзменения, ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)) КАК ПоказательВозможностьИзменения,
		|	Показатели.НомерСтроки,
		|	Максимум(Показатели.НомерСтроки) КАК КоличествоПоказателей
		|ИЗ";
		Если ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ПланВидовРасчета.Начисления.Показатели КАК Показатели";
		ИначеЕсли ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ПланВидовРасчета.Удержания.Показатели КАК Показатели";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	Показатели.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Показатели.Показатель,
		|	ВЫБОР
		|		КОГДА  НЕ Показатели.ЗапрашиватьПриКадровыхПеремещениях
		|			ТОГДА ИСТИНА";
		Если ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления")Тогда
			Запрос.Текст = Запрос.Текст + "
		|       ИНАЧЕ
		|			ВЫБОР 
		|				КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ОкладТариф)
		|					ТОГДА НЕ Показатели.Ссылка.ЗачетОтработанногоВремени
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
        |	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ПустаяСсылка) 
		|			ТОГДА ИСТИНА";
		Если ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
			Запрос.Текст = Запрос.Текст + "
		|	    ИНАЧЕ
		|			ВЫБОР 
		|				КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ОкладТариф)
		|					ТОГДА НЕ Показатели.Ссылка.ЗачетОтработанногоВремени
		|				КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.Процент)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ Показатели.Показатель.Предопределенный
		|			КОНЕЦ";
		Иначе
					Запрос.Текст = Запрос.Текст + "
		|		ИНАЧЕ Показатели.Показатель.Предопределенный";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
        |	КОНЕЦ,
		|	ВЫБОР КОГДА Показатели.Показатель.Предопределенный 
		|			И Показатели.Показатель <> Значение(Справочник.ПоказателиСхемМотивации.ОкладТариф)
		|			И Показатели.Показатель <> Значение(Справочник.ПоказателиСхемМотивации.ОкладТарифНазначения)
		|			И Показатели.Показатель <> Значение(Справочник.ПоказателиСхемМотивации.Процент)
		|			ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	Показатели.Показатель.Наименование,
		|	Показатели.Показатель.ТипПоказателя,
		|	ЕСТЬNULL(Показатели.Показатель.ВозможностьИзменения, ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)),
		|	Показатели.НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка",ВидРасчета);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			СтрокаТаблицыСведений = РезультатЗапроса.Выбрать();
			Пока СтрокаТаблицыСведений.Следующий() Цикл
				
				СведенияОВидеРасчета["КоличествоПоказателей"] = Макс(СведенияОВидеРасчета["КоличествоПоказателей"], СтрокаТаблицыСведений["КоличествоПоказателей"]);
				СведенияОВидеРасчета["ФактКоличествоПоказателей"] = Макс(СтрокаТаблицыСведений["КоличествоПоказателей"],СведенияОВидеРасчета["ФактКоличествоПоказателей"]);
				
				СчПоказателей 			= СтрокаТаблицыСведений.НомерСтроки;
				
				ВозможностьИзменения	= СтрокаТаблицыСведений["ПоказательВозможностьИзменения"];
				ТипПоказателя			= СтрокаТаблицыСведений["ПоказательТипПоказателя"];
				
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Точность",3);
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "ВозможностьИзменения",СтрокаТаблицыСведений["ПоказательВозможностьИзменения"]);
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Наименование",СтрокаТаблицыСведений["ПоказательНаименование"]);
				
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей ,СтрокаТаблицыСведений["Показатель"]);
				

				Если СтрокаТаблицыСведений["НЕЗапрашиватьПриКадровыхПеремещениях"] <> Null И СтрокаТаблицыСведений["НЕЗапрашиватьПриКадровыхПеремещениях"] И Не СтрокаТаблицыСведений["ЭтоПредопределенный"] Тогда
					Если Режим = "ПлановыеНачисления" Тогда
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
					Иначе
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость" ,Истина);
						Если ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Числовой Тогда
							
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
							
						ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Денежный Тогда
							
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Точность",2);
							
							
						ИначеЕсли (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
							Или (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная) Тогда
							
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
							
						Иначе
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
							
						КонецЕсли;
						
					КонецЕсли;
				ИначеЕсли СтрокаТаблицыСведений["Предопределенный"] <> Null И СтрокаТаблицыСведений["Предопределенный"] Тогда
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
					СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
					
				ИначеЕсли Режим = "ПлановыеНачисления" и (СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВводитсяПриРасчете
					Или СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете) Тогда
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость" , Ложь);
					СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость" , Ложь);
					
				Иначе
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость" ,Истина);
					Если ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Числовой Тогда
						
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						
					ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Денежный Тогда
						
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Точность",2);
						
						
					ИначеЕсли (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
						Или (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная) Тогда
						
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						
					Иначе
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СведенияОВидеРасчета.Вставить("Показатель1Наименование", "");
			СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель1Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель1Точность", 2);
			СведенияОВидеРасчета.Вставить("Показатель1ВозможностьИзменения", Ложь);
			
			СведенияОВидеРасчета.Вставить("Показатель2Наименование", "");
			СведенияОВидеРасчета.Вставить("Показатель2НаименованиеВидимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель2Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Валюта2Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель2Точность", 2);
			СведенияОВидеРасчета.Вставить("Показатель2ВозможностьИзменения", Ложь);
		КонецЕсли;
		
        // заполним для регламентированных способов оплаты труда
		Если ЗначениеЗаполнено(ВидРасчета) И (ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления")
				Или ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Удержания")) Тогда
			СтруктураВидаРасчета = Новый Структура("СпособРасчета");
			ЗаполнитьЗначенияСвойств(СтруктураВидаРасчета,ВидРасчета);
			Если СтруктураВидаРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
				СведенияОВидеРасчета.Вставить("ФактКоличествоПоказателей",0);
				СведенияОВидеРасчета["Показатель1Точность"] = 3;
				Если СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням 
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
					СведенияОВидеРасчета.Вставить("РазмерТребуется", Истина);
					Если СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням Тогда
						НаименованиеТарифнойСтавки = Справочники.ПоказателиСхемМотивации.ОкладТариф; 
					Иначе
						НаименованиеТарифнойСтавки = Справочники.ПоказателиСхемМотивации.ОкладТариф;
					КонецЕсли;
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", НаименованиеТарифнойСтавки);
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1Точность", 2);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке 
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
					СведенияОВидеРасчета.Вставить("РазмерТребуется", Истина);
					
					Если СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке Тогда
						НаименованиеТарифнойСтавки = Справочники.ПоказателиСхемМотивации.ОкладТариф;
					Иначе
						НаименованиеТарифнойСтавки = Справочники.ПоказателиСхемМотивации.ОкладТариф;
					КонецЕсли;
					
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", НаименованиеТарифнойСтавки);
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", НСтр("ru='Процент оплаты';uk='Відсоток оплати'"));
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					Если Режим = "ПлановыеНачисления" Тогда
						СведенияОВидеРасчета.Вставить("КоличествоПоказателей",2);
						СведенияОВидеРасчета.Вставить("ФактКоличествоПоказателей",2);
						
						СведенияОВидеРасчета["Показатель1Наименование"] = НСтр("ru='Часовой тариф';uk='Годинний тариф'");
						СведенияОВидеРасчета["Показатель1Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Ложь;				
						СведенияОВидеРасчета["Валюта1Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель2Наименование"] = НСтр("ru='Процент доплаты';uk='Відсоток доплати'");
						СведенияОВидеРасчета["Показатель2Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;
					Иначе
						СведенияОВидеРасчета.Вставить("КоличествоПоказателей",2);
						СведенияОВидеРасчета.Вставить("ФактКоличествоПоказателей",2);
						
						СведенияОВидеРасчета["Показатель1Наименование"] = НСтр("ru='Часовой тариф';uk='Годинний тариф'");
						СведенияОВидеРасчета["Показатель1Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта1Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2Наименование"] = НСтр("ru='Процент доплаты';uk='Відсоток доплати'");
						СведенияОВидеРасчета["Показатель2Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;
					КонецЕсли;
				
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Средняя");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска Тогда
					СведенияОВидеРасчета.Вставить("КоличествоПоказателей",2);
					СведенияОВидеРасчета.Вставить("ФактКоличествоПоказателей",2);
					
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Средняя");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
					
					СведенияОВидеРасчета.Вставить("Показатель2Точность", 2);
					СведенияОВидеРасчета.Вставить("Показатель2ВозможностьИзменения", Истина);
					СведенияОВидеРасчета.Вставить("Показатель2Наименование", "Время");
					СведенияОВидеРасчета.Вставить("Показатель2Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель2НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта2Видимость", Ложь);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС Тогда
					СведенияОВидеРасчета.Вставить("КоличествоПоказателей",2);
					СведенияОВидеРасчета.Вставить("ФактКоличествоПоказателей",2);
					
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Средняя");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
					
					СведенияОВидеРасчета.Вставить("Показатель2Точность", 2);
					СведенияОВидеРасчета.Вставить("Показатель2ВозможностьИзменения", Истина);
					СведенияОВидеРасчета.Вставить("Показатель2Наименование", "%");
					СведенияОВидеРасчета.Вставить("Показатель2Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель2НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта2Видимость", Ложь);
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой Или
					СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.УдержаниеФиксированнойСуммой Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
					
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом 
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", НСтр("ru='Процент удержаний';uk='Відсоток утримань'"));
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", НСтр("ru='Фиксированная сумма';uk='Фіксована сума'"));
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", НСтр("ru='Процент сбора';uk='Відсоток збору'"));
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);

				ИначеЕсли ПроведениеРасчетов.СпособРасчетаТребуетРазмер(СтруктураВидаРасчета.СпособРасчета) Тогда
					СведенияОВидеРасчета.Вставить(СведенияОВидеРасчета.РазмерТребуется, Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					Если НЕ ПроведениеРасчетов.СпособРасчетаНеТребуетВалюты(СтруктураВидаРасчета.СпособРасчета) И Найти(Строка(СтруктураВидаРасчета.СпособРасчета), "П1") = 0 Тогда
						СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СведенияОВидахРасчета[ВидРасчета] = СведенияОВидеРасчета;
	КонецЕсли;

	Возврат СведенияОВидеРасчета;
	
КонецФункции  // ПолучитьСведенияОВидеРасчетаСхемыМотивации

Функция СпособРасчетаТребуетРазмер(СпособРасчета) Экспорт
	Возврат НЕ (
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма 
		или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула
  );
КонецФункции

Функция СпособРасчетаНеТребуетВалюты(СпособРасчета) Экспорт
	
	Возврат (
	
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела Или
	СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела
	
    );
	
КонецФункции

Процедура ПриВыводеСтрокиНачислений(Элемент, ОформлениеСтроки, ДанныеСтроки, СведенияОВидахРасчета) Экспорт
	
	ДанныеСтрокиВидРасчета = ДанныеСтроки.ВидРасчета;
	СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтрокиВидРасчета, "ПриРасчете");
	ТолькоПросмотрЯчеек = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеСтрокиВидРасчета) Тогда
		
		ЕстьПоказатели = Ложь; 
		СчПоказателей = 0;
		Для СчПоказателей = 1 По 6 Цикл
			
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				
				ЕстьПоказатели = Истина;
				
				ВидимостьПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
				ВидимостьНаименованияПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"];
				
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = ВидимостьПоказателя;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = ВидимостьНаименованияПоказателя;
				
				// размеры показателя будут доступны только для видимых и изменяемых показателей
				Если ВидимостьПоказателя Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется
					Или СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете;
				КонецЕсли;
				
				// если отображается наименование - пропишем текст
				Если ВидимостьНаименованияПоказателя Тогда
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				КонецЕсли;
				
				Если ВидимостьПоказателя Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
				КонецЕсли;
				
			Иначе
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеСтрокиВидРасчета) Тогда
			Если не ЕстьПоказатели Тогда
				ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст(НСтр("ru='<рассчитываются автоматически>';uk='<розраховуються автоматично>'"));
				ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость			= Истина;
				ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр				= Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Для СчПоказателей = 1 По 6 Цикл
			// настроим видимость ячеек
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			
		КонецЦикла;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Подразделение.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Период.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Отработано.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Норма.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.НормаЗаМесяц.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.СпособыОтражения.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.БазовыйПериод.Видимость = Ложь;
	
	ЯчейкаСКартинкой = ОформлениеСтроки.Ячейки.Картинка;
	ЯчейкаСКартинкой.ОтображатьКартинку = Истина;
	ЯчейкаСКартинкой.ИндексКартинки = Число(ДанныеСтроки.Авторасчет);
	
КонецПроцедуры

Процедура ПриВыводеСтрокиУдержаний(Элемент, ОформлениеСтроки, ДанныеСтроки, СведенияОВидахРасчета) Экспорт
	
	ДанныеСтрокиВидРасчета = ДанныеСтроки.ВидРасчета;
	СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтрокиВидРасчета, "ПриРасчете");
	ТолькоПросмотрЯчеек = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеСтрокиВидРасчета) Тогда
		
		ЕстьПоказатели = Ложь; 
		СчПоказателей = 0;
		Для СчПоказателей = 1 По 6 Цикл
			
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				
				ЕстьПоказатели = Истина;
				
				ВидимостьПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
				ВидимостьНаименованияПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"];
				
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = ВидимостьПоказателя;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = ВидимостьНаименованияПоказателя;
				
				// размеры показателя будут доступны только для видимых и изменяемых показателей
				Если ВидимостьПоказателя Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется
					Или СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете;
				КонецЕсли;
				
				// если отображается наименование - пропишем текст
				Если ВидимостьНаименованияПоказателя Тогда
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				КонецЕсли;
				
				Если ВидимостьПоказателя Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
				КонецЕсли;
				
			Иначе
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеСтрокиВидРасчета) Тогда
			Если не ЕстьПоказатели Тогда
				ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст(НСтр("ru='<рассчитываются автоматически>';uk='<розраховуються автоматично>'"));
				ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость			= Истина;
				ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр				= Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Для СчПоказателей = 1 По 6 Цикл
			// настроим видимость ячеек
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			
		КонецЦикла;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Период.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.СпособыОтражения.Видимость = Ложь;
	
	ЯчейкаСКартинкой = ОформлениеСтроки.Ячейки.Картинка;
	ЯчейкаСКартинкой.ОтображатьКартинку = Истина;
	ЯчейкаСКартинкой.ИндексКартинки = Число(ДанныеСтроки.Авторасчет);
	
КонецПроцедуры

Функция ПолучитьВидУчетаВремени(ВидРасчета, СуммированныйУчетРабочегоВремени, ВидУчетаВремениДляСредней = Неопределено) Экспорт
	
	// вид учета времени определяется по способу расчета
	Если	ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы
		Тогда
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
		
	ИначеЕсли	ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы
		Тогда	
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
		
	ИначеЕсли	ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
		ИЛИ ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке
		Тогда	
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
		
	ИначеЕсли	ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам
		ИЛИ ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке
		Тогда	
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
		
	ИначеЕсли ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку 
		или ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска
		или ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска 
		Тогда
		
		Если ЗначениеЗаполнено(СуммированныйУчетРабочегоВремени) И СуммированныйУчетРабочегоВремени Тогда
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
		Иначе	
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням
		КонецЕсли; 
		
		Если ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам и (ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку 
		или ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС) Тогда 
		
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
		КонецЕсли;	

		
	Иначе
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
	КонецЕсли;
	
	Возврат ВидУчетаВремени;
КонецФункции // ПолучитьВидУчетаВремени

Функция ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗарплаты);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияСоциальныхНачислений);
	
	Возврат СписокСпособов;
	
КонецФункции // ПолучитьСписокВидовРасчетаНеТребующихУказанияВалюты()

// Проверяет правильность заполнения реквизитов вида расчета 
// для некоторых случаев выдает сообщение об ошибке
// для некоторых - возвращает текст сообщения
// 	Параметры:
//		ВидРасчета - объект Вид расчета
//		Отказ - признак отказа (проверка не прошла)
//	Возвращаемое значение:
//		ТекстСообщения - текст сообщения о результате проверки
Функция ПроверитьНастройкуВидаРасчета(ВидРасчета, Отказ, ПроверятьСоответствиеБазовыхИВедущихРасчетов = Истина) Экспорт
	
	МетаданныеВидаРасчета = ВидРасчета.Метаданные();
	
	Если НЕ ЗначениеЗаполнено(ВидРасчета.Наименование) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Необходимо задать имя расчета!';uk=""Необхідно задати ім'я розрахунку!"""), Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВидРасчета.Код) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Необходимо задать код расчета!';uk='Необхідно задати код розрахунку!'"), Отказ);
	КонецЕсли; 
	
	СпособРасчета = ВидРасчета.СпособРасчета;
	Если НЕ ЗначениеЗаполнено(СпособРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Необходимо задать способ расчета!';uk='Необхідно задати спосіб розрахунку!'"), Отказ);
	КонецЕсли; 
	
	ЕстьРеквизитКатегорияРасчета = МетаданныеВидаРасчета.Реквизиты.Найти("КатегорияРасчета") <> НеОпределено;
	Если ЕстьРеквизитКатегорияРасчета и НЕ ЗначениеЗаполнено(ВидРасчета.КатегорияРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Необходимо задать категорию начислений!';uk='Необхідно задати категорію нарахувань!'"), Отказ);
	КонецЕсли; 
	
	ЕстьРеквизитСчетУчета = МетаданныеВидаРасчета.Реквизиты.Найти("СчетУчета") <> НеОпределено;
	Если ЕстьРеквизитСчетУчета Тогда
		Если НЕ ЗначениеЗаполнено(ВидРасчета.СчетУчета) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Необходимо задать счет учета!';uk='Необхідно задати рахунок обліку!'"), Отказ);
		КонецЕсли; 
	КонецЕсли; 
	Если ЕстьРеквизитСчетУчета И ЗначениеЗаполнено(ВидРасчета.СпособОтраженияВБухучете.СчетКт) Тогда
		Если ВидРасчета.СчетУчета <> ВидРасчета.СпособОтраженияВБухучете.СчетКт Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Счет учета не соответствует счету дебета для способа отражения в бух учете!';uk='Рахунок обліку не відповідає рахунку дебету для способу відображення в бух обліку!'"), Отказ);
		КонецЕсли;
	КонецЕсли;
	// Вид расчета не может входить в собственную базу
	ВидРасчетаСсылка = ВидРасчета.Ссылка;
	
	// рассчитываем на то, что данная функция вызывается для видов расчета с поддержкой базового периода
	Если ВидРасчета.БазовыеВидыРасчета.Найти(ВидРасчетаСсылка, "ВидРасчета") <>  НеОпределено 
		И НЕ ВидРасчета.Предопределенный
		Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Вид расчета не может быть включен в состав собственной расчетной базы!';uk='Вид розрахунку не може бути включений до складу власної розрахункової бази!'"), Отказ);
	КонецЕсли;
	
	Если ВидРасчета.ВедущиеВидыРасчета.Найти(ВидРасчетаСсылка, "ВидРасчета") <>  НеОпределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Вид расчета не может быть включен в состав собственной таблицы ведущих видов расчета!';uk='Вид розрахунку не може бути включений до складу власної таблиці ведучих видів розрахунку!'"), Отказ);
	КонецЕсли;
	
	// если поддерживается период действия
	Если МетаданныеВидаРасчета.ИспользованиеПериодаДействия Тогда
		Если ВидРасчета.ВытесняющиеВидыРасчета.Найти(ВидРасчетаСсылка, "ВидРасчета") <>  НеОпределено Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Вид расчета не может быть включен в состав собственной таблицы вытесняющих видов расчета!';uk='Вид розрахунку не може бути включений до складу власної таблиці  видів, що витісняють, розрахунку!'"), Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстСообщения = "";
	// Проверим значение реквизита "Категория начисления"
	Если ЕстьРеквизитКатегорияРасчета 
		И МетаданныеВидаРасчета.Имя="Начисления"
		И ((ВидРасчетаСсылка.ВидПремии <> Перечисления.ВидыПремии.НеПремия
		И  ВидРасчетаСсылка.ВидПремии <> Перечисления.ВидыПремии.ПремияЗаТекущийМесяц
		И  ВидРасчетаСсылка.ВидПремии <> Перечисления.ВидыПремии.ПремияПропорциональноЗаТекущийМесяц)
		ИЛИ НЕ ЗначениеЗаполнено(ВидРасчетаСсылка.ВидПремии))
		Тогда
		ИндексВыбраннойКатегории = Перечисления.КатегорииРасчетов.Индекс(ВидРасчетаСсылка.КатегорияРасчета);
		ОжидаемаяКатегория = Перечисления.КатегорииРасчетов.Получить(0);
		МаксимальныйИндексКатегории = 0;
		МаксимальнаяКатегорияБазы = Перечисления.КатегорииРасчетов.Получить(МаксимальныйИндексКатегории);
		
		Если ИндексВыбраннойКатегории > МаксимальныйИндексКатегории тогда
			// Категория слишком большая - предупредим
			ТекстСообщения = НСтр("ru='Рекомендуется установить категорию начислений ""';uk='Рекомендується встановити категорію нарахувань ""'") + ОжидаемаяКатегория + НСтр("ru='"", т.к. для вида расчета типа премий в качестве базы выступают начисления прошлых периодов!';uk='"", т. я. для виду розрахунку типу премій в якості бази виступають нарахування минулих періодів!'");
		КонецЕсли;
		
	ИначеЕсли ЕстьРеквизитКатегорияРасчета Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРасчета.ВидРасчета.КатегорияРасчета,
		|	ВидыРасчета.ВидРасчета.Наименование
		|ИЗ
		|	ПланВидовРасчета."+МетаданныеВидаРасчета.Имя+".БазовыеВидыРасчета КАК ВидыРасчета
		|
		|ГДЕ
		|	ВидыРасчета.Ссылка = &парамТекущийВидРасчета
		|	И ВидыРасчета.ВидРасчета Ссылка ПланВидовРасчета."+МетаданныеВидаРасчета.Имя+"
		|	");
		
		Запрос.УстановитьПараметр("парамТекущийВидРасчета", ВидРасчетаСсылка);
		Категории = Запрос.Выполнить().Выгрузить();
		
		// Определение максимальной категории среди видов расчета, входящих в базу
		МаксимальныйИндексКатегории = -1;
		Для Каждого БазовыйРасчет Из Категории Цикл
			Если БазовыйРасчет.Наименование = Null Тогда
				Продолжить;
			КонецЕсли; 
			Если БазовыйРасчет.КатегорияРасчета = Перечисления.КатегорииРасчетов.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			ИндексКатегории = Перечисления.КатегорииРасчетов.Индекс(БазовыйРасчет.КатегорияРасчета);
			МаксимальныйИндексКатегории = Макс(МаксимальныйИндексКатегории, ИндексКатегории);
			
		КонецЦикла;  
		
		Если МаксимальныйИндексКатегории = Перечисления.КатегорииРасчетов.Количество()-1 Тогда
			
			// В базе расчетов есть расчеты с максимальной категорией
			ТекстСообщения = НСтр("ru='Откорректируйте состав базовых видов расчетов. В базу расчетов не должны входить расчеты с категорией начислений ""Зависимое третьего уровня""!.';uk='Відкоригуйте склад базових видів розрахунків. У базу розрахунків не повинні входити розрахунки з категорією нарахувань ""Залежне третього рівня""!'");
			
		Иначе
			// Категория начислений вида расчета должна быть на уровень выше любого из видов расчетов, составляющих базу расчета
			Если МаксимальныйИндексКатегории = -1 Тогда
				МаксимальнаяКатегорияБазы = Перечисления.КатегорииРасчетов.ПустаяСсылка();
			Иначе
				МаксимальнаяКатегорияБазы = Перечисления.КатегорииРасчетов.Получить(МаксимальныйИндексКатегории);
			КонецЕсли;
			ИндексВыбраннойКатегории = Перечисления.КатегорииРасчетов.Индекс(ВидРасчета.КатегорияРасчета);
			ОжидаемаяКатегория = Перечисления.КатегорииРасчетов.Получить(МаксимальныйИндексКатегории +1);
			
			Если ИндексВыбраннойКатегории <= МаксимальныйИндексКатегории Тогда
				// Пользователь установил категорию меньше чем самая максимальная категория базы расчетов
				ТекстСообщения = НСтр("ru='Неверно установлена категория начислений. В базу расчетов входят расчеты с категорией ""';uk='Невірно встановлена категорія нарахувань. У базу розрахунків входять розрахунки з категорією ""'") + МаксимальнаяКатегорияБазы + НСтр("ru='"". Рекомендуется установить категорию начислений ""';uk='"". Рекомендується встановити категорію нарахувань ""'") + ОжидаемаяКатегория + """!";
			ИначеЕсли ИндексВыбраннойКатегории > МаксимальныйИндексКатегории +1 тогда
				// Категория слишком большая - предупредим
				Если МаксимальныйИндексКатегории = -1 Тогда  // нет в базе ничего
					ТекстСообщения = НСтр("ru='Рекомендуется установить категорию начислений ""';uk='Рекомендується встановити категорію нарахувань ""'") + ОжидаемаяКатегория + НСтр("ru='"", т.к. для вида расчета не заданы базовые начисления или для базовых начислений не заданы категории начисления!';uk='"", тому що для виду розрахунку не задані базові нарахування або для базових нарахувань не задані категорії нарахування!'");
				Иначе
					ТекстСообщения = НСтр("ru='Рекомендуется установить категорию начислений ""';uk='Рекомендується встановити категорію нарахувань ""'") + ОжидаемаяКатегория + НСтр("ru='"", т.к. максимальной категорией среди базовых расчетов является категория ""';uk='"", тому що максимальною категорією серед базових розрахунків є категорія ""'") + МаксимальнаяКатегорияБазы + """!";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// Проверим соответствие списков базовых и ведущих расчетов
	Если ПроверятьСоответствиеБазовыхИВедущихРасчетов Тогда
		Для Каждого СтрокаБазовыйРасчет из ВидРасчета.БазовыеВидыРасчета Цикл
			
			Если СтрокаБазовыйРасчет.ВидРасчета = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + ?(НЕ ЗначениеЗаполнено(ТекстСообщения),"",Символы.ПС) + НСтр("ru='В строке ';uk='У рядку '") + СтрокаБазовыйРасчет.НомерСтроки + НСтр("ru=' базовых видов расчета не указан вид расчета!';uk=' базових видів розрахунку не зазначений вид розрахунку!'");
				Продолжить
			КонецЕсли;
			
			Если СтрокаБазовыйРасчет.ВидРасчета.Ссылка = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + ?(НЕ ЗначениеЗаполнено(ТекстСообщения),"",Символы.ПС) + НСтр("ru='В строке ';uk='У рядку '") + СтрокаБазовыйРасчет.НомерСтроки + НСтр("ru=' базовых видов расчета не указан вид расчета!';uk=' базових видів розрахунку не зазначений вид розрахунку!'")
			Иначе
				
				Если ВидРасчета.ВедущиеВидыРасчета.Найти(СтрокаБазовыйРасчет.ВидРасчета,"ВидРасчета") = Неопределено Тогда
					ТекстСообщения = ТекстСообщения + ?(НЕ ЗначениеЗаполнено(ТекстСообщения),"",Символы.ПС) + НСтр("ru='Список ведущих видов расчета отличается от списка базовых расчетов. Рекомендуется синхронизировать указанные списки!';uk='Список ведучих видів розрахунку відрізняється від списку базових розрахунків. Рекомендується синхронізувати зазначені списки!'");
					Прервать;
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат ТекстСообщения;
	
КонецФункции // ПроверитьНастройкуВидаРасчета

// Возвращает список алгоритмов начислений надбавок
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокВариантовНадбавок() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
    СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоМЗП);
		
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокВариантовНадбавок()

// Возвращает список предопределенных начислений
Функция ПредопределенныеНачисленияОрганизации() Экспорт

	СписокПредопределенныхВР = Новый СписокЗначений;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОсновныеНачисленияОрганизаций.Ссылка,
	                      |	ОсновныеНачисленияОрганизаций.Наименование
	                      |ИЗ
	                      |	ПланВидовРасчета.Начисления КАК ОсновныеНачисленияОрганизаций
	                      |
	                      |ГДЕ
	                      |	(ОсновныеНачисленияОрганизаций.Предопределенный)");

	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
	    СписокПредопределенныхВР.Добавить(Результат.Ссылка,Результат.Наименование);
	КонецЦикла;
	
    Возврат СписокПредопределенныхВР
	
КонецФункции



Функция ЗапросСпособОтражения(Начало, ВидРасчета, Сотрудник, Приказ, Организация ) Экспорт
	
	// Создать запрос и установить параметры
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамФизЛицо"			, Сотрудник.ФизЛицо);
	Запрос.УстановитьПараметр("парамСотрудник"			, Сотрудник);
	Запрос.УстановитьПараметр("парамПриказ"				, Приказ);
	Запрос.УстановитьПараметр("парамОрганизация"		, Организация);
	Запрос.УстановитьПараметр("парамНачало"				, Начало);
	Запрос.УстановитьПараметр("парамВидРасчета"			, ВидРасчета);
	
	Запрос.УстановитьПараметр("парамПустойСпособОтраженияВБухучете"        , Справочники.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПустойСпособОтраженияВУпручете"        , Справочники.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПоУмолчаниюСпособОтраженияВБухучете"        , Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию);
	Запрос.УстановитьПараметр("парамПоУмолчаниюСпособОтраженияВУпручете"        , Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию);
	
	//Основной текст запроса
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РаботникиОрганизации.ГрафикРаботы									КАК ГрафикРаботы,
	|
	|   ВЫБОР	КОГДА Начисления.СпособОтраженияВБухучете <> &парамПустойСпособОтраженияВБухучете
	|				ТОГДА Начисления.СпособОтраженияВБухучете
	|   		КОГДА СписокПлановыхНачислений.СпособОтраженияВБухучете <> &парамПустойСпособОтраженияВБухучете
	|				ТОГДА СписокПлановыхНачислений.СпособОтраженияВБухучете
	|   		КОГДА РаботникиОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособОтраженияВБухучете
	|				ТОГДА РаботникиОрганизации.СпособОтраженияВБухучете
	|			ИНАЧЕ &парамПоУмолчаниюСпособОтраженияВБухучете
	|	КОНЕЦ													КАК СпособОтраженияВБухучете,
	|
	|   ВЫБОР	КОГДА Начисления.СпособОтраженияВУпручете <> &парамПустойСпособОтраженияВУпручете
	|				ТОГДА Начисления.СпособОтраженияВУпручете
	|   		КОГДА СписокПлановыхНачислений.СпособОтраженияВУпручете <> &парамПустойСпособОтраженияВУпручете
	|				ТОГДА СписокПлановыхНачислений.СпособОтраженияВУпручете
	|   		КОГДА Работники.СпособОтраженияВУпручете <> &парамПустойСпособОтраженияВУпручете
	|				ТОГДА Работники.СпособОтраженияВУпручете
	|			ИНАЧЕ &парамПоУмолчаниюСпособОтраженияВУпручете
	|	КОНЕЦ													КАК СпособОтраженияВУпручете
	|
	|	ИЗ ПланВидовРасчета.Начисления КАК Начисления
	|
	|   //-----------------------
	|	// Способ отражения из регистра сведений плановые начисления с ВР		
	|	// берем последнюю актуальную на период проводку		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних( &парамНачало
	|		, Организация = &парамОрганизация И Сотрудник = &парамСотрудник И ВидРасчета = &парамВидРасчета) КАК СписокПлановыхНачислений
	|	ПО	ИСТИНА // все параметры заданы в условии отбора 
	|
	|   //-----------------------
	|	// Способ отражения из регистра сведений плановые начисления с пустым ВР		
	|	// берем последнюю актуальную на период проводку		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних( &парамНачало
	|		, Организация = &парамОрганизация И Сотрудник = &парамСотрудник ) КАК РаботникиОрганизации
	|	ПО	ИСТИНА // все параметры заданы в условии отбора 
	|
	|   //-----------------------
	|	// Способ отражения из регистра сведений плановые начисления с пустым ВР		
	|	// берем последнюю актуальную на период проводку		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних( &парамНачало
	|		, ФизЛицо = &парамФизЛицо ) КАК Работники
	|	ПО	ИСТИНА // все параметры заданы в условии отбора 
	|
	|ГДЕ Начисления.Ссылка = &парамВидРасчета
	|		
	|";        
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ЗапросСпособОтражения()

Функция ПолучитьСписокВидовРасчетаНеТребующихУказанияВалюты(ИмяПланаВидовРасчета) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Расчеты.Ссылка
	|ИЗ ПланВидовРасчета." + ИмяПланаВидовРасчета + " КАК Расчеты
	|ГДЕ Расчеты.СпособРасчета В (&парамВалютныеСпособы)
	|";
	Запрос.УстановитьПараметр("парамВалютныеСпособы", ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
	Запрос.Текст = ТекстЗапроса;
	
	СписокРасчетов = Новый СписокЗначений; 
	СписокРасчетов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокРасчетов;
	
КонецФункции // ПолучитьСписокВидовРасчетаНеТребующихУказанияВалюты()

Функция ПолучитьСоответствиеСпособовРасчетаТребующихВалюту(ИмяПланаВидовРасчета) Экспорт
	
	Список = ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты();
	СоответствиеСпособов = Новый Соответствие;
	Для Сч = 0 По Перечисления.СпособыРасчетаОплатыТруда.Количество() - 1 Цикл
		Значение = Перечисления.СпособыРасчетаОплатыТруда.Получить(Сч);
		СоответствиеСпособов.Вставить(Значение, Список.НайтиПоЗначению(Значение) = Неопределено);
	КонецЦикла;  
	
    Возврат СоответствиеСпособов
	
КонецФункции // ПолучитьСоответствиеСпособовРасчетаТребующихВалюту()

Функция ПолучитьСписокВариантовВзносовВФондыОрганизации() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Взносы);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокВариантовВзносовВФондыОрганизации()

// Процедура заполняет вычисляемую колонку ТЧ документа "ТабельныйНомерСтрока"
//
// Параметры
//  ТЧДокумента  – Табличное поле
//  ОформленияСтрок – Коллекция значений типа ОформлениеСтроки табличного поля ТЧДокумента
//
Процедура УстановитьЗначенияКолонкиТабельныйНомерСтрока(ТЧДокумента, ОформленияСтрок, ПериодРегистрации, Организация) Экспорт
	
	Для Каждого СтрокаТабличнойЧасти Из ОформленияСтрок Цикл
		СтрокаТабличнойЧасти.Ячейки.ТабельныйНомерСтрока.УстановитьТекст(СтрокаТабличнойЧасти.Ячейки.Назначение.Значение.Код);
	КонецЦикла;

КонецПроцедуры // УстановитьЗначенияКолонкиТабельныйНомерСтрока()

// По плану видов расчета выполняет поиск элементов по первым символам имени с применением шаблона
// Параметры:
//     	СтрокаПервыеСимволы - Строка - первые символы имени расчета
// 	   	ИмяПланаВидовРасчета - Строка - имя плана видов расчета
//	   	СтрокаДопУсловие - Строка - дополнительное условие для отбора видов расчетов
//		СписокДопПараметры - Структура - параметры запроса, необходимые для вычисления доп. условия
// Возвращает:
//		Удовлетворяющий шаблону имени и условиям отбора вид расчета, если таких несколько - то список значений
Функция ПолучитьСписокВидовРасчетаПоПервымСимволамИмениРасчета(СтрокаПервыеСимволы, ИмяПланаВидовРасчета, СтрокаДопУсловие, СтруктураДопПараметры) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 51
	|	Начисления.Ссылка КАК Ссылка,
	|	Начисления.Наименование + "" ("" + Начисления.Код + "")"" КАК СтрокаПредставления
	|ИЗ
	|	ПланВидовРасчета." + ИмяПланаВидовРасчета + " КАК Начисления
	|
	|ГДЕ
	|	(Начисления.Наименование ПОДОБНО &парамШаблонИмени
	|	ИЛИ Начисления.Код ПОДОБНО &парамШаблонИмени)
	| " + ?(СтрокаДопУсловие = "" , "", " И " + СтрокаДопУсловие);
	
	// Параметры, требуемые для вычисления дополнительного условия
	Для Каждого Элемент ИЗ СтруктураДопПараметры  Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ , Элемент.Значение);
	КонецЦикла; 
	
	// заменим спецсимволы
	СтрокаПервыеСимволы = СтрЗаменить(СтрокаПервыеСимволы, "~", "~~");
	СтрокаПервыеСимволы = СтрЗаменить(СтрокаПервыеСимволы, "%", "~%");
	СтрокаПервыеСимволы = СтрЗаменить(СтрокаПервыеСимволы, "_", "~_");
	СтрокаПервыеСимволы = СтрЗаменить(СтрокаПервыеСимволы, "[", "~[");
	СтрокаПервыеСимволы = СтрЗаменить(СтрокаПервыеСимволы, "-", "~-");
	
	Запрос.УстановитьПараметр("парамШаблонИмени", СтрокаПервыеСимволы + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Значение = Неопределено;
	
	Если Выборка.Количество() = 51 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Найдено более 50-ти значений, удовлетворяющих условиям выбора. Задайте более длинную строку или воспользуйтесь командой выбора (F4).");
	ИначеЕсли Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Значение = Выборка.Ссылка;
	ИначеЕсли Выборка.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В элемент управления введены данные не удовлетворяющие условиям выбора.';uk='У елемент керування введені дані, що не задовольняють умовам вибору.'"));
	Иначе
		Значение = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			Значение.Добавить(Выборка.Ссылка, Выборка.СтрокаПредставления);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ПолучитьСписокВидовРасчетаПоПервымСимволамИмениРасчета()

// проверка того, что показатель схемы мотивации является предопределенным показателем 
// не требующим ввода (т.е. рассчитываемым автоматически)
Функция ЭтоПоказательСАвторасчетом(Показатель) Экспорт
    Возврат     Показатель = Справочники.ПоказателиСхемМотивации.ВремяВДнях 
            или Показатель = Справочники.ПоказателиСхемМотивации.ВремяВЧасах
            или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениВДнях
            или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениВЧасах
            или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениЗаМесяцВДнях
            или Показатель = Справочники.ПоказателиСхемМотивации.НормаВремениЗаМесяцВЧасах
            или Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБаза;
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫПЛАТЫ ЗАРАБОТНОЙ ПЛАТЫ

// Процедура выполняет движение по регистру ВзаиморасчетыСРаботникамиОрганизаций  и проводки по Бухгалтерскому учету
//
Процедура ВыполнитьДвиженияПоЗарплате( ДокументВыплаты, Движения, ПроводкиБУ="", СчетКт, СпособОплаты, ВыплаченностьЗарплаты, 
	СчетОрганизации = Неопределено, Сотрудник = Неопределено, Контрагент = Неопределено, ОбособленноеПодразделениеОрганизации = Неопределено ) Экспорт
	
	Перем ВалютаУпрУчета;
	Перем КурсВалютыУпрУчета;

	ПолучитьКурсВалютыУпрУчета(ДокументВыплаты.Дата, ВалютаУпрУчета, КурсВалютыУпрУчета, Константы.ВалютаРегламентированногоУчета.Получить());
	
	ЭтоДепонирование = ДокументВыплаты.Метаданные().Имя = "ЗарплатаКВыплатеОрганизаций";
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументВыплаты.Ссылка); 
	Если ДокументВыплаты.Метаданные().Имя = "ПлатежныйОрдерСписаниеДенежныхСредств" Тогда
		Запрос.УстановитьПараметр("парамВедомости",	ДокументВыплаты.ВыплатаЗаработнойПлаты.Выгрузить().ВыгрузитьКолонку("Ведомость") ); 
		ОтражатьВБухгалтерскомУчете = ДокументВыплаты.ОтражатьВБухгалтерскомУчете;
		
	ИначеЕсли ДокументВыплаты.Метаданные().Имя = "ЗарплатаКВыплатеОрганизаций" тогда
		Запрос.УстановитьПараметр("парамВедомости",	ДокументВыплаты ); 
		ОтражатьВБухгалтерскомУчете = Истина;
		
	ИначеЕсли ДокументВыплаты.Метаданные().Имя = "РасходныйКассовыйОрдер" И ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику Тогда
		Запрос.УстановитьПараметр("парамВедомости", ДокументВыплаты.РасчетныйДокумент);
		ОтражатьВБухгалтерскомУчете = ДокументВыплаты.ОтражатьВБухгалтерскомУчете;
		
	Иначе
		Запрос.УстановитьПараметр("парамВедомости",	ДокументВыплаты.ВыплатаЗаработнойПлаты.Выгрузить().ВыгрузитьКолонку("Ведомость") ); 
		ОтражатьВБухгалтерскомУчете = ДокументВыплаты.ОтражатьВБухгалтерскомУчете;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Выплачено", ВыплаченностьЗарплаты);
	Запрос.УстановитьПараметр("парамДата", ДокументВыплаты.Дата);
	Запрос.УстановитьПараметр("СпособОплаты", СпособОплаты);
	Запрос.УстановитьПараметр("парамСотрудники", Сотрудник);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("КурсВалютыУпрУчета", КурсВалютыУпрУчета);
	
	
	//	ВТРасшифровкаВедомостиСКопейками - по Зарплате к выплате для депонентов
	Если ДокументВыплаты.Метаданные().Имя = "ЗарплатаКВыплатеОрганизаций" Тогда
		//	Описание:
		//      осноная часть запроса, тут получим даные для проведения
		// 
		ТекстЗапросаВТ = "
		|ВЫБРАТЬ
		|	ПараметрыОплаты.Ссылка								КАК Ведомость,
		|	ПараметрыОплаты.Ссылка.Дата							КАК Период,
		|	ПараметрыОплаты.Ссылка.Организация					КАК Организация,
		|	ПараметрыОплаты.Ссылка.ОтражатьВРеглУчете			КАК ОтражатьВБухгалтерскомУчете,
		|	ПараметрыОплаты.Ссылка.ОтражатьВУпрУчете			КАК ОтражатьВУправленческомУчете,
		|	ПараметрыОплаты.Ссылка.ОтражатьВРеглУчете			КАК ОтражатьВБухгалтерскомУчетеВедомость,
		|	ПараметрыОплаты.Ссылка.ОтражатьВУпрУчете			КАК ОтражатьВУправленческомУчетеВедомость,
		|	ПараметрыОплаты.Сотрудник							КАК Сотрудник,
		|	ПараметрыОплаты.ПериодВзаиморасчетов				КАК ПериодВзаиморасчетов,
		|	ПараметрыОплаты.СчетУчета							КАК СчетУчета,
		|	ПараметрыОплаты.Ведомость					КАК ВедомостьДепонента,
		|	NULL		КАК СтатьяДвиженияДенежныхСредств,
		|	ПараметрыОплаты.Ссылка 								КАК ДокументРегистратор, 
		|
		|	ПараметрыОплаты.Сумма				КАК СуммаВзаиморасчетов,
		|	ПараметрыОплаты.СуммаУпр			КАК СуммаВзаиморасчетовУпр,
		|	ПараметрыОплаты.СуммаОкругления		КАК СуммаОкругления
		|        
		|ПОМЕСТИТЬ ВТРасшифровкаВедомостиСКопейками	
		|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ПараметрыОплаты КАК ПараметрыОплаты
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
		|ПО	РаботникиОрганизации.Ссылка = &Ссылка
		|И	РаботникиОрганизации.Сотрудник = ПараметрыОплаты.Сотрудник       
		|И	РаботникиОрганизации.ВыплаченностьЗарплаты = &Выплачено       
		|И	РаботникиОрганизации.СпособВыплаты = &СпособОплаты       
		| " + ?(Контрагент = Неопределено, "", "И РаботникиОрганизации.Банк = &Контрагент") + "        
		|
		|ГДЕ	ПараметрыОплаты.Ссылка = &Ссылка 
		|" + ?(Сотрудник = Неопределено, "", "	И	ПараметрыОплаты.Сотрудник в (&парамСотрудники)") + "        
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТРасшифровкаВедомостиСКопейками = "ВТРасшифровкаВедомостиСКопейками";
	КонецЕсли;
	
	//	ВТРасшифровкаВедомостиСКопейками
	Если ДокументВыплаты.Метаданные().Имя = "РасходныйКассовыйОрдер" И ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям
		ИЛИ ДокументВыплаты.Метаданные().Имя <> "РасходныйКассовыйОрдер" И ДокументВыплаты.Метаданные().Имя <> "ЗарплатаКВыплатеОрганизаций"
		Тогда
		//	Описание:
		//      осноная часть запроса, тут получим даные для проведения
		// 
		ТекстЗапросаВТ = "
		|ВЫБРАТЬ
		|	ПараметрыОплаты.Ссылка						КАК Ведомость,
		|	Выплаты.Ссылка.Дата							КАК Период,
		|	Выплаты.Ссылка.ОтражатьВБухгалтерскомУчете,
		|	Выплаты.Ссылка.ОтражатьВУправленческомУчете,
		|	ПараметрыОплаты.Ссылка.ОтражатьВРеглУчете	КАК ОтражатьВБухгалтерскомУчетеВедомость,
		|	ПараметрыОплаты.Ссылка.ОтражатьВУпрУчете 	КАК ОтражатьВУправленческомУчетеВедомость,
		|	Выплаты.Ссылка.Организация					КАК Организация,
		|	ПараметрыОплаты.Сотрудник					КАК Сотрудник,
		|	ПараметрыОплаты.ПериодВзаиморасчетов		КАК ПериодВзаиморасчетов,
		|	ПараметрыОплаты.СчетУчета					КАК СчетУчета,
		|	ПараметрыОплаты.Ведомость					КАК ВедомостьДепонента,
		|	Выплаты.Ссылка.СтатьяДвиженияДенежныхСредств		КАК СтатьяДвиженияДенежныхСредств,
		|	Выплаты.Ссылка								КАК ДокументРегистратор,
		|
		|	ПараметрыОплаты.Сумма				КАК СуммаВзаиморасчетов,
		|	ПараметрыОплаты.СуммаУпр			КАК СуммаВзаиморасчетовУпр,
		|	ПараметрыОплаты.СуммаОкругления		КАК СуммаОкругления
		|        
		|ПОМЕСТИТЬ ВТРасшифровкаВедомостиСКопейками	
		|ИЗ	Документ."+ ДокументВыплаты.Метаданные().Имя +".ВыплатаЗаработнойПлаты КАК Выплаты
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	Документ.ЗарплатаКВыплатеОрганизаций.ПараметрыОплаты КАК ПараметрыОплаты
		|ПО Выплаты.Ведомость = ПараметрыОплаты.Ссылка
		|И	Выплаты.СчетУчета = ПараметрыОплаты.СчетУчета
		|" + ?(Сотрудник = Неопределено, "", "	И	ПараметрыОплаты.Сотрудник в (&парамСотрудники)") + "        
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
		|ПО	Выплаты.Ведомость = РаботникиОрганизации.Ссылка
		|И	РаботникиОрганизации.Сотрудник = ПараметрыОплаты.Сотрудник       
		|И	РаботникиОрганизации.ВыплаченностьЗарплаты = &Выплачено       
		|И	РаботникиОрганизации.СпособВыплаты = &СпособОплаты       
		| " + ?(Контрагент = Неопределено, "", "И РаботникиОрганизации.Банк = &Контрагент") + "        
		|
		|ГДЕ	Выплаты.Ссылка = &Ссылка 
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТРасшифровкаВедомостиСКопейками = "ВТРасшифровкаВедомостиСКопейками";
	КонецЕсли;
	
	//	ВТРасшифровкаВедомостиСКопейками для РКО по одному работнику
	Если ДокументВыплаты.Метаданные().Имя = "РасходныйКассовыйОрдер" И ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику Тогда
		//	Описание:
		//      осноная часть запроса, тут получим даные для проведения
		// 
		ТекстЗапросаВТ = "
		|ВЫБРАТЬ
		|	ПараметрыОплаты.Ссылка						КАК Ведомость,
		|	Выплаты.Ссылка.Дата							КАК Период,
		|	Выплаты.Ссылка.ОтражатьВБухгалтерскомУчете	КАК ОтражатьВБухгалтерскомУчете,
		|	Выплаты.Ссылка.ОтражатьВУправленческомУчете КАК ОтражатьВУправленческомУчете,
		|	Выплаты.Ссылка.Организация					КАК Организация,
		|	ПараметрыОплаты.Ссылка.ОтражатьВРеглУчете	КАК ОтражатьВБухгалтерскомУчетеВедомость,
		|	ПараметрыОплаты.Ссылка.ОтражатьВУпрУчете 	КАК ОтражатьВУправленческомУчетеВедомость,
		|	ПараметрыОплаты.Сотрудник					КАК Сотрудник,
		|	ПараметрыОплаты.ПериодВзаиморасчетов		КАК ПериодВзаиморасчетов,
		|	ПараметрыОплаты.СчетУчета					КАК СчетУчета,
		|	ПараметрыОплаты.Ведомость					КАК ВедомостьДепонента,
		|	Выплаты.СтатьяДвиженияДенежныхСредств		КАК СтатьяДвиженияДенежныхСредств,
		|	Выплаты.Ссылка 								КАК ДокументРегистратор,
		|
		|	ПараметрыОплаты.Сумма				КАК СуммаВзаиморасчетов,
		|	ПараметрыОплаты.СуммаУпр			КАК СуммаВзаиморасчетовУпр,
		|	ПараметрыОплаты.СуммаОкругления		КАК СуммаОкругления
		|        
		|ПОМЕСТИТЬ ВТРасшифровкаВедомостиСКопейками	
		|ИЗ	Документ."+ ДокументВыплаты.Метаданные().Имя +".РасшифровкаПлатежа КАК Выплаты
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	Документ.ЗарплатаКВыплатеОрганизаций.ПараметрыОплаты КАК ПараметрыОплаты
		|ПО Выплаты.Ссылка.ПлатежнаяВедомость = ПараметрыОплаты.Ссылка
		|И  Выплаты.Ссылка.СчетУчетаРасчетовпоЗП = ПараметрыОплаты.СчетУчета
		|И	ПараметрыОплаты.Сотрудник в (&парамСотрудники)        
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК РаботникиОрганизации
		|ПО	Выплаты.Ссылка.ПлатежнаяВедомость = РаботникиОрганизации.Ссылка
		|И	РаботникиОрганизации.Сотрудник = ПараметрыОплаты.Сотрудник       
		|И	РаботникиОрганизации.ВыплаченностьЗарплаты = &Выплачено       
		|И	РаботникиОрганизации.СпособВыплаты = &СпособОплаты       
		|
		|ГДЕ	Выплаты.Ссылка = &Ссылка 
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.Выполнить();
		ТекстЗапросаВТРасшифровкаВедомостиСКопейками = "ВТРасшифровкаВедомостиСКопейками";
		
		Запрос.Текст = " ВЫБРАТЬ * ИЗ ВТРасшифровкаВедомостиСКопейками";
		
		Запрос.Текст = ТекстЗапросаВТ;
	КонецЕсли;
	
	
	// По регистру ВзаиморасчетыСРаботникамиОрганизаций
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Выплаты.Период							КАК Период,
	|	Выплаты.ОтражатьВБухгалтерскомУчете,
	|	Выплаты.ОтражатьВУправленческомУчете,
	|	Выплаты.ОтражатьВБухгалтерскомУчетеВедомость,
	|	Выплаты.ОтражатьВУправленческомУчетеВедомость,
	|	Выплаты.Организация						КАК Организация,
	|	Выплаты.Ведомость						КАК Ведомость,
	|	Выплаты.Сотрудник						КАК Сотрудник,
	|	Выплаты.Сотрудник.ФизЛицо				КАК ФизЛицо,
	|	Выплаты.ПериодВзаиморасчетов			КАК ПериодВзаиморасчетов,
	|	Выплаты.СчетУчета						КАК СчетУчета,
    |	Выплаты.ВедомостьДепонента				КАК ВедомостьДепонента,
	|	Выплаты.СтатьяДвиженияДенежныхСредств	КАК СтатьяДвиженияДенежныхСредств,
	|   Выплаты.ДокументРегистратор				КАК ДокументРегистратор,
	|
	|	РанееВыплаченныеСуммы.Регистратор		КАК РегистраторРанееВыплаченные,
	|
	|	ВЫБОР КОГДА	Выплаты.СуммаВзаиморасчетовУпр <> 0 ТОГДА Выплаты.СуммаВзаиморасчетовУпр
	|		КОГДА &КурсВалютыУпрУчета = 0 ТОГДА  0 ИНАЧЕ Выплаты.СуммаВзаиморасчетов/&КурсВалютыУпрУчета КОНЕЦ	КАК СуммаУпр,
	|	Выплаты.СуммаВзаиморасчетов 			КАК СуммаВзаиморасчетов,
	|	Выплаты.СуммаВзаиморасчетовУпр 			КАК СуммаВзаиморасчетовУпр,
	|	Выплаты.СуммаОкругления 				КАК СуммаОкругления
	|        
	|ИЗ	ВТРасшифровкаВедомостиСКопейками КАК Выплаты
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК РанееВыплаченныеСуммы
	|ПО	Выплаты.Ведомость = РанееВыплаченныеСуммы.Ведомость
	|И	Выплаты.Сотрудник = РанееВыплаченныеСуммы.Сотрудник
	|И  Выплаты.СчетУчета = РанееВыплаченныеСуммы.СчетУчета
	|
	|ИТОГИ СУММА(СуммаВзаиморасчетов), СУММА(СуммаВзаиморасчетовУпр), СУММА(СуммаОкругления), МАКСИМУМ(Период), МАКСИМУМ(ПериодВзаиморасчетов)
	|ПО Организация, Сотрудник, Ведомость
	|
	|";
	
	
	
	Запрос.Текст = ТекстЗапроса;
	
	НаборЗаписей = Движения.ВзаиморасчетыСРаботникамиОрганизаций;
	////НаборЗаписейУпр = Движения.ВзаиморасчетыСРаботниками;
	НаборЗаписейСведенияОВыплатах = Движения.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям;
	СчетУчетаДепонентов = ПланыСчетов.Хозрасчетный.РасчетыПоДепонентам;
	
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока ВыборкаОрганизация.Следующий() Цикл
		ВыборкаСотрудник = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
		Пока ВыборкаСотрудник.Следующий() Цикл
			
			ВыборкаВедомость = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ведомость");
			Пока ВыборкаВедомость.Следующий() Цикл
				
				Если ЭтоДепонирование Тогда
					
					// нужны все движения по взаиморасчетам
					// + надо  задепонировать сумму 
					ДобавитьСтрокуВзаиморасчетыСДепонентамиОрганизаций(ВыборкаВедомость, ДокументВыплаты.Дата, ВидДвиженияНакопления.Приход, Движения.ВзаиморасчетыСДепонентамиОрганизаций);
					
				КонецЕсли;
				
				
				// теперь движения по каждому счету
				Выборка = ВыборкаВедомость.Выбрать(ОбходРезультатаЗапроса.Прямой);
				СтрокаПоРаботнику = 1;

				
				Пока Выборка.Следующий() Цикл
					Если Выборка.РегистраторРанееВыплаченные <> NULL И Выборка.РегистраторРанееВыплаченные <> ДокументВыплаты Тогда
						// выплата по ФизЛицу и по ведомости уже производилась
						Если ДокументВыплаты.Метаданные().Имя = "РасходныйКассовыйОрдер" И ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
							Продолжить
						КонецЕсли;	
					КонецЕсли;
					ЭтоВыплатаДепонента = ?( Выборка.Ведомость.ВидВыплаты = Справочники.ВидыВыплат.Депоненты, Истина, Ложь);
					
					Если ОтражатьВБухгалтерскомУчете И ПроводкиБУ <> "" И НЕ ЭтоВыплатаДепонента Тогда
						ДобавитьСтрокуВыполнитьПроводкуВыплатыЗарплаты(Выборка, ПроводкиБУ, Выборка.СчетУчета, СчетКт, ДокументВыплаты.Дата, СчетОрганизации, ОбособленноеПодразделениеОрганизации); 
					КонецЕсли;
					
					Если (Выборка.РегистраторРанееВыплаченные <> NULL И Выборка.РегистраторРанееВыплаченные <> ДокументВыплаты) Тогда
						// выплата по ФизЛицу и по ведомости уже производилась
					ИначеЕсли СтрокаПоРаботнику = 1 Тогда	
						// зарегистрируем факт выплаты по работнику и по ведомости
						ДобавитьСтрокуСведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям(Выборка, НаборЗаписейСведенияОВыплатах);
					КонецЕсли;
					
					
					Если ЭтоВыплатаДепонента Тогда
						
						Если ОтражатьВБухгалтерскомУчете И ПроводкиБУ <> "" Тогда
							ДобавитьСтрокуВыполнитьПроводкуВыплатыЗарплаты(Выборка, ПроводкиБУ, СчетУчетаДепонентов, СчетКт, ДокументВыплаты.Дата, СчетОрганизации, ОбособленноеПодразделениеОрганизации); 
						КонецЕсли;	
						ДобавитьСтрокуВзаиморасчетыСДепонентамиОрганизаций(Выборка, ДокументВыплаты.Дата, ВидДвиженияНакопления.Расход, Движения.ВзаиморасчетыСДепонентамиОрганизаций);
						
					Иначе
						ДобавитьСтрокуВзаиморасчетыСРаботникамиОрганизаций( Выборка, НаборЗаписей );
					КонецЕсли;	
					СтрокаПоРаботнику = СтрокаПоРаботнику + 1;

					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьДвиженияПоЗарплате()

Процедура	ДобавитьСтрокуВзаиморасчетыСРаботникамиОрганизаций(Выборка, НаборЗаписей)
	
	Если Выборка.СуммаВзаиморасчетов = 0
		И Выборка.СуммаВзаиморасчетовУпр = 0
		И Выборка.СуммаОкругления = 0
		Тогда
		Возврат;
	КонецЕсли;
	
	Если Выборка.ДокументРегистратор.Метаданные().Имя ="РасходныйКассовыйОрдер" Тогда
		мСпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу;
	ИначеЕсли Выборка.ДокументРегистратор.Метаданные().Имя = "ПлатежноеПоручениеИсходящее" Тогда
		мСпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк;
   	ИначеЕсли Выборка.ДокументРегистратор.Метаданные().Имя = "ПлатежныйОрдерНаСписаниеДенежныхСредств" Тогда
		мСпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк;
	Иначе
		мСпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ПустаяСсылка();
	КонецЕсли;	
	
	Движение = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	Движение.КодОперации = Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетов + Выборка.СуммаОкругления;	
	
	Если Выборка.ОтражатьВУправленческомУчете И Выборка.ОтражатьВУправленческомУчетеВедомость И Выборка.СуммаУпр <> 0 Тогда	
		Движение.СуммаВзаиморасчетовУпр = Выборка.СуммаУпр;	
	КонецЕсли;
	
	Если Выборка.СуммаОкругления > 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.КодОперации = Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.ПереносОстатковНаСледующийМесяц;
		Движение.ПериодВзаиморасчетов = ДобавитьМесяц(НачалоМесяца(Выборка.ПериодВзаиморасчетов),1);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.СуммаВзаиморасчетов 	= - Выборка.СуммаОкругления;
		Движение.СуммаВзаиморасчетовУпр = 0;
		Движение.СуммаОкругления = 0;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВзаиморасчетыСРаботникамиОрганизаций()

Процедура	ДобавитьСтрокуСведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям(Выборка, НаборЗаписей)
	
	Если	Выборка.СуммаВзаиморасчетов = 0
		И	Выборка.СуммаВзаиморасчетовУпр = 0
		И	Выборка.СуммаОкругления = 0
		Тогда
		Возврат;
	КонецЕсли;
	
	Движение = НаборЗаписей.Добавить();
	Движение.Ведомость	= Выборка.Ведомость;
	Движение.Сотрудник	= Выборка.Сотрудник;
	Движение.СчетУчета  = Выборка.СчетУчета;
	
КонецПроцедуры // ДобавитьСтрокуСведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям()

Процедура	ДобавитьСтрокуВзаиморасчетыСДепонентамиОрганизаций(Выборка, Период, ВидДвижения, НаборЗаписей)
	
	Если	Выборка.СуммаВзаиморасчетов = 0
		И	Выборка.СуммаВзаиморасчетовУпр = 0
		И	Выборка.СуммаОкругления = 0
		Тогда
		Возврат;
	КонецЕсли;
	
	Движение = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	Движение.ВидДвижения	= ВидДвижения;
	Движение.Сумма			= Выборка.СуммаВзаиморасчетов + Выборка.СуммаОкругления;	
	Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда
		Движение.Ведомость	= Выборка.ВедомостьДепонента;
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьСтрокуВзаиморасчетыСДепонентамиОрганизаций()

Процедура	ДобавитьСтрокуВыполнитьПроводкуВыплатыЗарплаты(Выборка, ПроводкиБУ, СчетДт, СчетКт, Дата, СчетОрганизации = Неопределено, ОбособленноеПодразделениеОрганизации = Неопределено ) Экспорт
	
	Если Выборка.СуммаВзаиморасчетов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Проводка = ПроводкиБУ.Добавить();

	Проводка.Период      = Дата;
	Проводка.Активность  = Истина;
	Проводка.Организация = Выборка.Организация;
	Проводка.Содержание  = "Выплата зарплаты";
	Проводка.Сумма       = Выборка.СуммаВзаиморасчетов;

	Проводка.СчетКт      = СчетКт;
	Если ЗначениеЗаполнено(СчетОрганизации) Тогда
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "БанковскиеСчета", СчетОрганизации);
	КонецЕсли;                                                                  
	Если ЗначениеЗаполнено(ОбособленноеПодразделениеОрганизации) Тогда
	    ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбособленныеПодразделенияБезОбразованияЮрЛица" ,ОбособленноеПодразделениеОрганизации);
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", Выборка.СтатьяДвиженияДенежныхСредств);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РаботникиОрганизаций", Выборка.Сотрудник.ФизЛицо);
				
	Проводка.СчетДт      = СчетДт;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций", Выборка.Сотрудник.ФизЛицо);

	
КонецПроцедуры	

Процедура ПолучитьКурсВалютыУпрУчета(ДатаКурса, ВалютаУпрУчета, КурсВалютыУпрУчета, ВалютаРегламентированногоУчета) Экспорт
	ВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	Если ВалютаРегламентированногоУчета = ВалютаУпрУчета Тогда
		КурсВалютыУпрУчета = 1;
	Иначе
		Отбор = Новый Структура("Валюта", ВалютаУпрУчета);
		СведенияОКурсе = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.СрезПоследних( НачалоМесяца(ДатаКурса), Отбор );
		
		Если СведенияОКурсе.Количество() = 0 Тогда
		    КурсВалютыУпрУчета = 0;
			Сообщить(НСтр("ru='Внимание! Для валюты ';uk='Увага! Для валюти '") + ВалютаУпрУчета + НСтр("ru=' на дату ';uk=' на дату '")+ ДатаКурса + НСтр("ru=' не определен курс!';uk=' не визначено курс!'"));
			Возврат;
		КонецЕсли; 
		
		КурсВалютыУпрУчета = СведенияОКурсе[0].Курс / СведенияОКурсе[0].Кратность;
	КонецЕсли;
КонецПроцедуры	// ПолучитьКурсВалютыУпрУчета

//Функция, которая возвращает текст запроса, в котором выбираются параметры заполнения платежных документов с учетом того
//что пустая организация = организация по умолчанию 
Функция ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация,СтатьяНалоговойДекларации = Истина , СчетУчета = Истина, Контрагент = Истина, СчетКонтрагента = Истина) Экспорт
	//Какие записи считаем заполнеными для организации :
	//1. Те которые есть счета для самой организации
	//2. Те которых нет  счетов для самой организации, но которые есть для пустой организации.
	ТекстЗапроса =  "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Организация КАК Организация
	|	" + ?(СтатьяНалоговойДекларации," ,ПолныеСведения.СтатьяНалоговойДекларации КАК СтатьяНалоговойДекларации", "") + "
	|	" + ?(СчетУчета, ",ПолныеСведения.СчетУчета КАК СчетУчета" ,"") + "
	|	" + ?(Контрагент, ",ПолныеСведения.Контрагент КАК Контрагент","") + "
	|	" + ?(СчетКонтрагента,",ПолныеСведения.СчетКонтрагента КАК СчетКонтрагента","") + "	
	|ИЗ
	|	(
    |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&Организация	КАК Организация
	|		" + ?(СтатьяНалоговойДекларации," ,Сведения.СтатьяНалоговойДекларации КАК СтатьяНалоговойДекларации", "") + "
	|		" + ?(СчетУчета, ",Сведения.СчетУчета КАК СчетУчета" ,"") + "
	|		" + ?(Контрагент, ",Сведения.Контрагент КАК Контрагент","") + "
	|		" + ?(СчетКонтрагента,",Сведения.СчетКонтрагента КАК СчетКонтрагента","") + "	
	|		ИЗ
	|			РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК Сведения
	|		ГДЕ
	|			Сведения.Организация = &Организация
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ

	|		ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация
	|		" + ?(СтатьяНалоговойДекларации," ,СведенияПоУмолчанию.СтатьяНалоговойДекларации КАК СтатьяНалоговойДекларации", "") + "
	|		" + ?(СчетУчета, ",СведенияПоУмолчанию.СчетУчета КАК СчетУчета" ,"") + "
	|		" + ?(Контрагент, ",СведенияПоУмолчанию.Контрагент КАК Контрагент","") + "
	|		" + ?(СчетКонтрагента,",СведенияПоУмолчанию.СчетКонтрагента КАК СчетКонтрагента","") + "	
	|	ИЗ
	|		РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК СведенияПоУмолчанию
	|	ГДЕ
	|		СведенияПоУмолчанию.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И СведенияПоУмолчанию.СчетУчета НЕ В
	|		(	
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Сведения.СчетУчета КАК СчетУчета
	|		ИЗ
	|			РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК Сведения
	|		ГДЕ
	|			Сведения.Организация = &Организация
	|		)
	|	) КАК ПолныеСведения
	|";	
	Возврат ТекстЗапроса;
		
КонецФункции

// Функция предназначена для автонумерации новых элементов планов видов расчета
//
// Параметры:
// 	 ИмяПВР - Строка: имя плана видов расчета
//
// Возвращаемое значение:
// Число - следующий возможный числовой код
//
Функция УстановитьКодПВР(ИмяПВР) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПВР.Код
	|ИЗ
	|	ПланВидовРасчета."+ИмяПВР+" КАК ПВР";

	СписокКодов = Запрос.Выполнить().Выбрать();
	
    МаксКод = 0;
	Пока СписокКодов.Следующий() Цикл
		Попытка
			ТекущийКод = Число(СписокКодов.Код);
		Исключение
			//использован нечисловой код. Такие пропустим
			Продолжить;
		КонецПопытки;
		МаксКод = Макс(МаксКод,ТекущийКод);
	КонецЦикла;
	
	Возврат МаксКод+1;
	
КонецФункции

// Открывает список видов расчета для подбора
Процедура ОткрытьФормуПодбора(ИмяПВР, ЭтаФорма) Экспорт

	ФормаПодбора = ПланыВидовРасчета[ИмяПВР].ПолучитьФормуВыбора(, ЭтаФорма);
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	ФормаПодбора.Открыть();

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПРАВЛЕНИЕ ДОКУМЕНТОВ

// Функция получает документ(ы), которым был исправлен расчетный документ
//
// Параметры
//  ДокументСсылка - ссылка на документ, включенный в механизм исправлений
//  Режим - строка, допустимые значения: "КритерийОтбора", "ТаблицаДокумента" 
//  ИмяДокумента - имя соответствующего объекта метаданных
//
// Возвращаемое значение:
//   Режим = "КритерийОтбора": массив документов-исправлений, возможно, пустой.
//   Режим = "ТаблицаДокумента": ссылка на документ того же вида, что и переданный параметр; 
//   или Неопределено, если документ-исправление не найден.
//
Функция ПолучитьДокументИсправление(ДокументСсылка = Неопределено, Режим = Неопределено, ИмяДокумента = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено	
	КонецЕсли;	
	
	Если Режим = Неопределено Тогда
		Режим = ?(ДокументСсылка.Метаданные().Реквизиты.Найти("Сотрудник") = Неопределено, "КритерийОтбора","ТаблицаДокумента")	
	КонецЕсли;
	
	Если Режим = "КритерийОтбора" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДокументыИсправления.Ссылка
		|ИЗ
		|	КритерийОтбора.ДокументыИсправления(&ИсходныйДокумент) КАК ДокументыИсправления
		|";
	ИначеЕсли Режим = "ТаблицаДокумента" Тогда
		Если Не ЗначениеЗаполнено(ИмяДокумента) Тогда
			ИмяДокумента = ДокументСсылка.Метаданные().Имя;
		КонецЕсли;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДокументыИсправления.Ссылка
		|ИЗ
		|	Документ." + ИмяДокумента + " КАК ДокументыИсправления
		|ГДЕ
		|	ДокументыИсправления.ПерерассчитываемыйДокумент = &ИсходныйДокумент";
	Иначе
		Возврат Неопределено	
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИсходныйДокумент",ДокументСсылка);
	Результат = Запрос.Выполнить();
	
	Если Режим = "КритерийОтбора" Тогда
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка
		Иначе
			Возврат Неопределено	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Функция получает документ(ы), которым был исправлен расчетный документ
//
// Параметры
//  ДокументСсылка - ссылка на документ, включенный в механизм исправлений
//  Режим - строка, допустимые значения: "КритерийОтбора", "ТаблицаДокумента" 
//
// Возвращаемое значение:
//   Режим = "КритерийОтбора": массив документов-исправлений, возможно, пустой.
//   Режим = "ТаблицаДокумента": ссылка на документ того же вида, что и переданный параметр; 
//   или Неопределено, если документ-исправление не найден.
//
Функция ПолучитьДокументСторнирование(ДокументСсылка = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено	
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыИсправления.Ссылка
	|ИЗ
	|	Документ.Сторнирование КАК ДокументыИсправления
	|ГДЕ
	|	ДокументыИсправления.СторнируемыйДокумент = &ИсходныйДокумент";
	
	Запрос.УстановитьПараметр("ИсходныйДокумент",ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка
	Иначе
		Возврат Документы.Сторнирование.ПустаяСсылка()
	КонецЕсли;
	
КонецФункции

// Определяет, можно ли изменять документ "задним числом", т.е. проверяет
//   отсутствие исправлений и сторнирований.
//
// Параметры
//  ДокументСсылка - ссылка на документ, включенный в механизм исправлений
//  ОписаниеПричиныОтказа - переменная, куда возвращается описание проблемы
//
// Возвращаемое значение:
//  булево
//
Функция ДокументНельзяИзменятьЗаднимЧислом(ДокументСсылка = Неопределено, ОписаниеПричиныОтказа = "") Экспорт 
	
	ОписаниеПричиныОтказа = "";
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь
	ИначеЕсли ЗначениеЗаполнено(ПолучитьДокументИсправление(ДокументСсылка)) Тогда
		ОписаниеПричиныОтказа = НСтр("ru='Документ был исправлен, перерасчет документа ""задним числом"" запрещен!';uk='Документ був виправлений, перерахунок документа ""заднім числом"" заборонений!'");
		Возврат Истина
	ИначеЕсли ЗначениеЗаполнено(ПолучитьДокументСторнирование(ДокументСсылка)) Тогда
		ОписаниеПричиныОтказа = НСтр("ru='Документ был сторнирован, перерасчет документа ""задним числом"" запрещен!';uk='Документ був сторнований, перерахунок документа ""заднім числом"" заборонений!'");
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь
		
КонецФункции

// Выбирает из документов-исправлений сотрудников и помещает их в соответствие
//
// Параметры
//  ТекстЗапроса - строка. содержит текст запроса выора сотрудников
//  ДокументыИсправления - массив документов-исправлений
//  ИмяПоля - строка, имя поля запроса, содержащего сотрудника
//  ИмяПараметра - строка, имя параметра запроса, содержащего документы-исправления
//
// Возвращаемое значение:
//   Соответствие с сотрудниками документов исправлений
//
Функция СформироватьСоответствиеСотрудниковСИсправлениями(ТекстЗапроса = "", ДокументыИсправления = Неопределено, ИмяПоля = "Сотрудник", ИмяПараметра = "Исправления") Экспорт
                                                                             
	Сотрудники = Новый Соответствие;
	
	Если ПустаяСтрока(ТекстЗапроса) Или Не ЗначениеЗаполнено(ДокументыИсправления) Тогда
		Возврат	Сотрудники
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр(ИмяПараметра,ДокументыИсправления);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сотрудники.Вставить(Выборка[ИмяПоля], Истина);
	КонецЦикла;
	
	Возврат Сотрудники

КонецФункции // СформироватьСоответствиеСотрудниковСИсправлениями()

// Обработчик подписки ПередЗаписьюДокументаИсправление
// 
Процедура ПередЗаписьюДокументаПроверкаИсправленногоДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЗначениеЗаполнено(ПолучитьДокументИсправление(Источник.Ссылка)) Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ТекстСообщенияОбОшибке = НСтр("ru='Документ был исправлен, проведение документа запрещено!';uk='Документ був виправлений, проведення документа заборонено!'");
			Иначе 	
				ТекстСообщенияОбОшибке = НСтр("ru='Документ был исправлен, отмена проведения документа запрещена!';uk='Документ був виправлений, скасування проведення документа заборонено!'");
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Отказ);
		ИначеЕсли ЗначениеЗаполнено(ПолучитьДокументСторнирование(Источник.Ссылка)) Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ТекстСообщенияОбОшибке = НСтр("ru='Документ был сторнирован, проведение документа запрещено!';uk='Документ був сторнований, проведення документа заборонено!'");
			Иначе 	
				ТекстСообщенияОбОшибке = НСтр("ru='Документ был сторнирован, отмена проведения документа запрещена!';uk='Документ був сторнований, скасування проведення документа заборонено!'");
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Проверяет необходимость выполнения перерасчета документа
// если в таблицах перерасчета по документу ссылка, на который передана 
// есть хоть одна запись - возвращает Истина
// Параметры:
//  Регистратор - ссылка на документ
// Возвращаемое значение:
//  булево
//
Функция НеобходимостьПерерасчета(Регистратор) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Перерасчет.Сотрудник КАК Сотрудник
	|ИЗ РегистрРасчета.Начисления.ПерерасчетНачислений КАК Перерасчет
	|ГДЕ Перерасчет.ОбъектПерерасчета = &парамРегистратор
	|	
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Перерасчет.Сотрудник КАК Сотрудник
	|ИЗ РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
	|ГДЕ Перерасчет.ОбъектПерерасчета = &парамРегистратор
	|	
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Перерасчет.Сотрудник КАК Сотрудник
	|ИЗ РегистрРасчета.ВзносыВФонды.ПерерасчетВзносовВФонды КАК Перерасчет
	|ГДЕ Перерасчет.ОбъектПерерасчета = &парамРегистратор
	|");
	Запрос.УстановитьПараметр("парамРегистратор", Регистратор);
	Если Запрос.Выполнить().Пустой() Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции  // НеобходимостьПерерасчета

Процедура ПроверкаБазыЕСВ(ВидРасчета) Экспорт
	
	Если НЕ ВидРасчета.ЕСВ Тогда
		Возврат; 
	КонецЕсли;
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВидРасчета",ВидРасчета.Ссылка);
	Запрос.УстановитьПараметр("СпособРасчета",ВидРасчета.СпособРасчета);

	Запрос.Текст = "ВЫБРАТЬ
	|	ВзносыВФондыБазовыеВидыРасчета.ВидРасчета
	|ПОМЕСТИТЬ ВТБазаВидаРасчета
	|ИЗ
	|	ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК ВзносыВФондыБазовыеВидыРасчета
	|ГДЕ
	|	ВзносыВФондыБазовыеВидыРасчета.Ссылка = &ВидРасчета";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТБазаВидаРасчета.ВидРасчета КАК ВидРасчетаБазы,
	|	ВзносыВФондыБазовыеВидыРасчета.Ссылка КАК ВидВзноса
	|ИЗ
	|	ВТБазаВидаРасчета КАК ВТБазаВидаРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК ВзносыВФондыБазовыеВидыРасчета
	|		ПО (ВзносыВФондыБазовыеВидыРасчета.Ссылка.СпособРасчета = &СпособРасчета)
	|			И (ВзносыВФондыБазовыеВидыРасчета.Ссылка <> &ВидРасчета)
	|			И ВТБазаВидаРасчета.ВидРасчета = ВзносыВФондыБазовыеВидыРасчета.ВидРасчета
	|			И (ВзносыВФондыБазовыеВидыРасчета.Ссылка.ЕСВ = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТБазаВидаРасчета.ВидРасчета,
	|	ВзносыВФондыБазовыеВидыРасчета.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	
	|	ВидРасчетаБазы";
	
	табПересечений = Запрос.Выполнить().Выгрузить();
	
	Если табПересечений.Количество() > 0 Тогда 

		массивВидыВзносов = табПересечений.ВыгрузитьКолонку("ВидВзноса"); 
		массивВидыРасчетаБазы = табПересечений.ВыгрузитьКолонку("ВидРасчетаБазы");
				
		Сообщить(НСтр("ru='Проверьте состав базы для взноса ';uk='Перевірте склад бази для внеску '") + ВидРасчета + "!", СтатусСообщения.Важное);
		Сообщить(НСтр("ru='Виды расчета';uk='Види розрахунку'"));
		СтрокаСообщенияВидыРасчетаБазы = ""; СтрокаСообщенияВзносы = ""; 
		Для Каждого ВидРасчетаБазы из массивВидыРасчетаБазы Цикл 
			Если  Найти(СтрокаСообщенияВидыРасчетаБазы, ВидРасчетаБазы) = 0 Тогда 
				СтрокаСообщенияВидыРасчетаБазы =  СтрокаСообщенияВидыРасчетаБазы + ВидРасчетаБазы + "; ";
				Сообщить("  " +ВидРасчетаБазы);	 
			КонецЕсли;	
		КонецЦикла;
		Для Каждого ВидВзноса из массивВидыВзносов Цикл 
			
			СтрокаСообщенияВзносы = ?(Найти(СтрокаСообщенияВзносы, ВидВзноса) > 0, СтрокаСообщенияВзносы, СтрокаСообщенияВзносы + ВидВзноса + "  ");	 
		КонецЦикла;
		Сообщить(НСтр("ru='входят также в базу взносов ';uk='входять також в базу внесків '")+СтрокаСообщенияВзносы);
	КонецЕсли;
		
КонецПроцедуры	

// Функция возвращает дату изменения Порядка №100 расчета средней согласно Постановлению КМУ №917 от 01.09.21 г. 
 //
Функция ДатаИзмененияПорядка100_486() Экспорт
	
	Возврат Дата(2022,4,29);
	
КонецФункции

Функция РассчитатьСреднююПорядок100_вр(Регистратор, КомментироватьРасчет = Ложь) Экспорт 
	
	Организация = Регистратор.Организация;
	мЕстьПремии = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьПремии;
	мЕстьГодоваяПремия = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ЕстьГодоваяПремия;
	
	// сам расчет ТЧ РасчетСреднего
	Запрос = Новый Запрос;     
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр( "Регистратор", Регистратор );
	Запрос.УстановитьПараметр( "парамОрганизация", Организация );
	Запрос.УстановитьПараметр( "парамСотрудник", Регистратор.Сотрудник );
	Запрос.УстановитьПараметр( "парамПериодРегистрации", Регистратор.ПериодРегистрации );
	Запрос.УстановитьПараметр( "ПериодРасчетаСреднегоНачало", Регистратор.ПериодРасчетаСреднегоНачало );
	Запрос.УстановитьПараметр( "ПериодРасчетаСреднегоКонец", Регистратор.ПериодРасчетаСреднегоКонец );
	Запрос.УстановитьПараметр( "ВидУчетаВремениДляСредней", Регистратор.ВидУчетаВремениДляСредней );
	
	СтруктураКурса = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(Регистратор.ПериодРегистрации, Новый Структура("Валюта", глЗначениеПеременной("ВалютаУправленческогоУчета")));
	Запрос.УстановитьПараметр( "парамКурсВалютыУУ", ?(Регистратор.ОтражатьВУпрУчете И СтруктураКурса.Кратность <> 0,СтруктураКурса.Курс/СтруктураКурса.Кратность,0) );
	
	Если Не Регистратор.Метаданные().ТабличныеЧасти.Найти("Отпуска") = Неопределено Тогда
		Если Регистратор.Отпуска.Количество() > 0  Тогда
			ДатаНачалаСобытия = Регистратор.Отпуска[0].ДатаНачала
		Иначе	
			ДатаНачалаСобытия = Регистратор.ПериодРегистрации
		КонецЕсли	
	Иначе
		ДатаНачалаСобытия = Регистратор.ДатаНачала
	КонецЕсли;	
	Если ДатаНачалаСобытия < ПроведениеРасчетов.ДатаИзмененияПорядка100() Тогда
		// Формула такая: Результат * Мин(ДнейВСреднего, ДнейВсегоПоНачислениям) / ДнейВсегоПоНачислениям
		// Если Коэффициент не повышался в середине месяца, то Коэф=1 и КоэфГодПремии=1
		Коэф = "
		|		(1 + РАЗНОСТЬДАТ(	ВЫБОР КОГДА Средняя.БазовыйПериодНачало > Начисления.ПериодДействияНачало ТОГДА Средняя.БазовыйПериодНачало ИНАЧЕ Начисления.ПериодДействияНачало КОНЕЦ
		|                        ,	ВЫБОР КОГДА Средняя.БазовыйПериодКонец < Начисления.ПериодДействияКонец ТОГДА Средняя.БазовыйПериодКонец ИНАЧЕ Начисления.ПериодДействияКонец КОНЕЦ
		|					, ДЕНЬ))
		|		/ (1 + РАЗНОСТЬДАТ(Начисления.ПериодДействияНачало, Начисления.ПериодДействияКонец, ДЕНЬ))";       
		КоэфПремии = "
		|		(1 + РАЗНОСТЬДАТ(	Средняя.БазовыйПериодНачало, Средняя.БазовыйПериодКонец, ДЕНЬ))
		|		/ (1 + РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ), КОНЕЦПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ) , ДЕНЬ))";       
		
		мНеУчитыватьСовместителейДляСредних = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).НеУчитыватьСовместителейДляСредних;
		//	ВТПоВремени
		Если Истина Тогда
			//	Описание:
			// 		таблица с расчетами по зарплате
			//		если в строке нет авторасчета, то берм значения проставленные пользователем. Они потом понадобятся для премии пропорционально
			//		
			ТекстЗапросаВТ = " 
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|   
			|	СУММА(Средняя.ОтработаноДнейБаза)	КАК ОтработаноДнейБаза,
			|	СУММА(Средняя.ОтработаноЧасовБаза)	КАК ОтработаноЧасовБаза,
			|	СУММА(Средняя.НормаДнейБаза)		КАК НормаДнейБаза,
			|	СУММА(Средняя.НормаЧасовБаза)		КАК НормаЧасовБаза,
			|	СУММА(Средняя.КалендарныеДниБаза)	КАК КалендарныеДниБаза
			|   
			|ПОМЕСТИТЬ ВТПоВремени	
			|ИЗ (
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|		СУММА(Начисления.ОтработаноДней*"+Коэф+")	КАК ОтработаноДнейБаза,
			|		СУММА(Начисления.ОтработаноЧасов*"+Коэф+")	КАК ОтработаноЧасовБаза,
			|		СУММА(Начисления.НормаДней*"+Коэф+")		КАК НормаДнейБаза,
			|		СУММА(Начисления.НормаЧасов*"+Коэф+")		КАК НормаЧасовБаза,
			|		0	КАК КалендарныеДниБаза
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|	
			|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|	ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|        И  (Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|        ИЛИ  Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления  
			|	ПО		Начисления.Сотрудник = &парамСотрудник
			|		И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ) = Начисления.ПериодДействия
			|		И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
			|		И	Начисления.Организация = &парамОрганизация
			|		"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|		И	(Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|				ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|		И Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета 
			|		И НЕ (Средняя.БазовыйПериодКонец < Начисления.ПериодДействияНачало ИЛИ Средняя.БазовыйПериодНачало > Начисления.ПериодДействияКонец) 
			| 		
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|								, ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 		
			| 	СГРУППИРОВАТЬ ПО
			|   	Средняя.БазовыйПериодНачало,
			|   	Средняя.БазовыйПериодКонец
			| 		
			| 		
			|   // Данные календарным с вычетом праздников и невыходов
			|	ОбЪЕДИНИТЬ ВСЕ   
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|	
			|		0	КАК ОтработаноДнейБаза,
			|		0	КАК ОтработаноЧасовБаза,
			|		0	КАК НормаДнейБаза,
			|		0	КАК НормаЧасовБаза,
			|    	СУММА(ВЫБОР КОГДА НЕ Начисления.Сторно ТОГДА       
	       	|        Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия * "+Коэф+" 
	      	|  		ИНАЧЕ
	       	|        -Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия * "+Коэф+"
	      	|   	КОНЕЦ)  КАК КалендарныеДниБаза
			|	
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(
			|		Назначение = &парамСотрудник И ПериодДействияНачало <= &ПериодРасчетаСреднегоКонец И ПериодДействияКонец >= &ПериодРасчетаСреднегоНачало
			|		И ВидРасчета.ЗачетНормыВремени И ВидРасчета.ЗачетКалендарных
			|		И ВидРасчета В (ВЫБРАТЬ База.ВидРасчета ИЗ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК База ГДЕ База.Ссылка В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)))
			|		) КАК Начисления
			|	ПО		Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец  
			|		И	Начисления.ПериодДействияКонец >= Средняя.БазовыйПериодНачало  
			|
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 
			|	СГРУППИРОВАТЬ ПО
			|		Средняя.БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец
			| 
			|) КАК Средняя
			|СГРУППИРОВАТЬ ПО
			|	Средняя.БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец
			|   
			|			
			|// записиси отредактированные пользователем			
			|ОБЪЕДИНИТЬ ВСЕ			
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|
			|		Средняя.ОтработаноДней				КАК ОтработаноДней,
			|		Средняя.ОтработаноЧасов				КАК ОтработаноЧасов,
			|		Средняя.НормаДней					КАК НормаДней,
			|		Средняя.НормаЧасов					КАК НормаЧасов,
			|		Средняя.КалендарныеДни				КАК КалендарныеДни
			|
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|			
			|	ГДЕ		НЕ Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			
			Запрос.Выполнить();
			ТекстЗапросаВТПоВремени = "ВТПоВремени";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоВремени";
		
		
		ТекстЗапроса = " 
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.НомерСтроки					КАК НомерСтроки,
		|		Основной.Авторасчет						КАК Авторасчет,
		|		Основной.ВидРасчета						КАК ВидРасчета,
		|		Основной.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|		Основной.БазовыйПериодКонец				КАК БазовыйПериодКонец,
		|		Основной.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза ИНАЧЕ 0 КОНЕЦ КАК Коэф,			
		|		ВЫБОР КОГДА Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеПремия,			
		|		ВЫБОР КОГДА Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеМеньшеНормы, 
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеБольшеНуля, 
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	&ВидУчетаВремениДляСредней  = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням) 
		|						И	Время.ОтработаноДнейБаза < Время.НормаДнейБаза И Время.НормаДнейБаза > 0  
		|					ТОГДА	Основной.Результат * Время.ОтработаноДнейБаза / Время.НормаДнейБаза
		|				КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		|					ТОГДА	Основной.Результат * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		|				ИНАЧЕ		Основной.Результат КОНЕЦ    
		|												КАК Результат,
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	&ВидУчетаВремениДляСредней  = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням) 
		|						И	Время.ОтработаноДнейБаза < Время.НормаДнейБаза И Время.НормаДнейБаза > 0  
		|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноДнейБаза / Время.НормаДнейБаза
		|				КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ    
		|												КАК РезультатУпр,
		|           
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	&ВидУчетаВремениДляСредней  = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням) 
		|						И	Время.ОтработаноЧасовБаза < Время.НормаДнейБаза И Время.НормаДнейБаза > 0  
		|					ТОГДА	1
		|				КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска))			
		|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		|					ТОГДА	2
		|				ИНАЧЕ		3 КОНЕЦ    
		|												КАК Результат1,
		////|		ВЫБОР	КОГДА	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)			
		////|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		////|					ТОГДА	Основной.Результат * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		////|				ИНАЧЕ		Основной.Результат КОНЕЦ    
		////|												КАК Результат,
		////|		ВЫБОР	КОГДА	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)			
		////|						И	Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза И Время.НормаЧасовБаза > 0  
		////|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноЧасовБаза / Время.НормаЧасовБаза
		////|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ    
		////|												КАК РезультатУпр,
		|		Основной.РезультатПолный				КАК РезультатПолный,
		|           
		|		ВремяДляСредней.ОтработаноДнейБаза				КАК ОтработаноДней,
		|		ВремяДляСредней.ОтработаноЧасовБаза				КАК ОтработаноЧасов,
		|		ВремяДляСредней.НормаДнейБаза					КАК НормаДней,
		|		ВремяДляСредней.НормаЧасовБаза					КАК НормаЧасов,
		|		ВремяДляСредней.КалендарныеДниБаза				КАК КалендарныеДни";
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			| Время.НормаЧасовБаза КАК НормаЧасовБаза,
		    | Время.ОтработаноЧасовБаза КАК  ОтработаноЧасовБаза,
			| Время.НормаДнейБаза КАК НормаДнейБаза,
		    | Время.ОтработаноДнейБаза КАК  ОтработаноДнейБаза,
			| Основной.ВидРасчетаРазрез КАК ВидРасчетаРазрез";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
	    |
		|	ИЗ (
		|	ВЫБРАТЬ 
		|		Основной1.НомерСтроки				КАК НомерСтроки,
		|		Основной1.Авторасчет				КАК Авторасчет,
		|		Основной1.ВидРасчета				КАК ВидРасчета,
		|		Основной1.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
		|		Основной1.КоэффициентПовышенияОкладов		КАК КоэффициентПовышенияОкладов, 
		|		СУММА(Основной1.Результат)			КАК Результат,
		|		СУММА(Основной1.РезультатУпр)		КАК РезультатУпр,
		|		СУММА(Основной1.РезультатПолный)	КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
		|		ИЗ (
		|		ВЫБРАТЬ 
		|			Средняя.НомерСтроки				КАК НомерСтроки,
		|			Средняя.Авторасчет				КАК Авторасчет,
		|			Средняя.ВидРасчета				КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			ВЫБОР	КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)   
		|							ТОГДА	ВЫБОР	КОГДА Начисления.ВидРасчета.ЧислоМесяцев <= 1
		|											ТОГДА Начисления.Результат
		|											ИНАЧЕ 0 КОНЕЦ
		|						ИНАЧЕ Начисления.Результат КОНЕЦ
		|				*"+Коэф+"					КАК Результат,
		|			ВЫБОР	КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)   
		|							ТОГДА	ВЫБОР	КОГДА Начисления.ВидРасчета.ЧислоМесяцев <= 1
		|											ТОГДА Начисления.РезультатУпр
		|											ИНАЧЕ 0 КОНЕЦ
		|						ИНАЧЕ Начисления.РезультатУпр КОНЕЦ
		|				*"+Коэф+"					КАК РезультатУпр,
		|			ВЫБОР	КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
		|								ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)   
		|							ТОГДА	ВЫБОР	КОГДА Начисления.ВидРасчета.ЧислоМесяцев <= 1
		|											ТОГДА Начисления.Результат
		|											ИНАЧЕ 0 КОНЕЦ
		|						ИНАЧЕ Начисления.Результат КОНЕЦ
		|				*"+Коэф+"					КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 		Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя     
		|  	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		(Начисления.Сотрудник = &парамСотрудник ИЛИ Начисления.Сотрудник.ОсновноеНазначение = &парамСотрудник) 
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	Начисления.Организация = &парамОрганизация  
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец
		|			И	Средняя.БазовыйПериодНачало <= Начисления.ПериодДействияКонец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|  	
		|		ГДЕ		Средняя.Регистратор = &Регистратор  
		|			И	Средняя.Авторасчет И Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)		
		|			
		|			
		|			
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются полной суммой ОТПУСК			
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат * "+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр * "+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат * "+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало, МЕСЯЦ) = Начисления.ПериодДействия	
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ	Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)			
		|			
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются полной суммой СРЕДНЯЯ			
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
	    |		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	Средняя.БазовыйПериодКонец		>=	Начисления.БазовыйПериодНачало	
		|			И	Начисления.БазовыйПериодКонец	>=	Средняя.БазовыйПериодНачало		
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ	Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
		|			
		|
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются пропорционально отработанному времени ОТПУСК	
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев * "+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр/Начисления.ВидРасчета.ЧислоМесяцев * "+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев * "+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
	    |		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало, МЕСЯЦ) = Начисления.ПериодДействия	
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ		Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)			
		|			
		|			
		|		//------------------------------------------------------------	
		|		// по премиям, которые учитываются пропорционально отработанному времени СРЕДНЯЯ		
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки					КАК НомерСтроки,
		|			Средняя.Авторасчет					КАК Авторасчет,
		|			Средняя.ВидРасчета               	КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК Результат,
		|			Начисления.РезультатУпр/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"	КАК РезультатУпр,
		|			Начисления.Результат/Начисления.ВидРасчета.ЧислоМесяцев *"+КоэфПремии+"		КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		| 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
		|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
		|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
		|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
		|			И	Начисления.ПериодДействия МЕЖДУ &ПериодРасчетаСреднегоНачало И &ПериодРасчетаСреднегоКонец	
		|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
		|			И	Начисления.ВидРасчета.ЧислоМесяцев > 1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
		|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
		|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
		|			
		|		ГДЕ		Средняя.Авторасчет		
		|			И	Средняя.Регистратор = &Регистратор			
		|			И	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)			
		|			
		|			
		|		//------------------------------------------------------------	
		|		// записиси отредактированные пользователем	или годовая премия		
		|		ОБЪЕДИНИТЬ ВСЕ	
		|		ВЫБРАТЬ
		|			Средняя.НомерСтроки				КАК НомерСтроки,
		|			Средняя.Авторасчет				КАК Авторасчет,
		|			Средняя.ВидРасчета				КАК ВидРасчета,
		|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец,
		|			Средняя.КоэффициентПовышенияОкладов	КАК КоэффициентПовышенияОкладов,
		|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
		|							ТОГДА	Средняя.Результат
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) 
		|							ТОГДА (Средняя.Регистратор.ГодоваяПремия/12)*("+КоэфПремии+")
		|						ИНАЧЕ 0 КОНЕЦ
		|				КАК Результат,
		|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
		|							ТОГДА	Средняя.РезультатУпр
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) 
		|			                И	&парамКурсВалютыУУ <> 0
		|							ТОГДА (Средняя.Регистратор.ГодоваяПремия/(&парамКурсВалютыУУ*12))*("+КоэфПремии+")
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)			
		|			                И	&парамКурсВалютыУУ <> 0
		|							ТОГДА (Средняя.Регистратор.ГодоваяПремия/12)*("+КоэфПремии+")
		|						ИНАЧЕ 0 КОНЕЦ
		|				КАК РезультатУпр,
		|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
		|							ТОГДА	Средняя.РезультатПолный
		|						КОГДА 	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) 
		|							ТОГДА Средняя.Регистратор.ГодоваяПремия*("+КоэфПремии+")
		|						ИНАЧЕ 0 КОНЕЦ
		|				КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 			Средняя.ВидРасчета КАК ВидРасчетаРазрез","") + "
		|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
		|		ГДЕ		Средняя.Регистратор = &Регистратор			
		|			И	(НЕ Средняя.Авторасчет		
		|			ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии) )		
		|	) КАК Основной1		
		|	СГРУППИРОВАТЬ ПО 
		|		Основной1.НомерСтроки,
		|		Основной1.Авторасчет,
		|		Основной1.ВидРасчета,
		|		Основной1.БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец,	 
		|		Основной1.КоэффициентПовышенияОкладов
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез","") + "
		|	) КАК Основной		
		|			
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК Время			
		|	ПО	Время.БазовыйПериодНачало = Основной.БазовыйПериодНачало		
		|			
		|	// Чтобы не писать в каждой строке условие, сделаем левое соединение по этому условию		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК ВремяДляСредней			
		|	ПО	ВремяДляСредней.БазовыйПериодНачало = Основной.БазовыйПериодНачало		
		|		И	(Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
		|		ИЛИ	Основной.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
		|			
		|УПОРЯДОЧИТЬ ПО           
		|  Основной.НомерСтроки УБЫВ         
		|";
	Иначе
		мНеУчитыватьСовместителейДляСредних = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).НеУчитыватьСовместителейДляСредних;
		
		//	ВТПоВремени
		Если Истина Тогда
			//	Описание:
			// 		таблица с расчетами по зарплате
			//		если в строке нет авторасчета, то берем значения, проставленные пользователем. Они потом понадобятся для премии пропорционально
			//		
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	РаботникиОрганизаций.Период КАК ДатаПриема
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПервых(
			|			,
			|			Организация = &парамОрганизация
			|				И Сотрудник = &парамСотрудник) КАК РаботникиОрганизаций
			|";
			Выборка = Запрос.Выполнить().Выбрать();
			ДатаПриема = Дата(1,1,1);
			Если Выборка.Следующий() Тогда
				ДатаПриема = Выборка.ДатаПриема
			КонецЕсли;	
			Запрос.УстановитьПараметр("ДатаПриема", ДатаПриема);
			ТекстЗапросаВТ = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|   
			|	СУММА(Средняя.ОтработаноДнейБаза)	КАК ОтработаноДнейБаза,
			|	СУММА(Средняя.ОтработаноЧасовБаза)	КАК ОтработаноЧасовБаза,
			|	СУММА(Средняя.НормаДнейБаза)		КАК НормаДнейБаза,
			|	СУММА(Средняя.НормаЧасовБаза)		КАК НормаЧасовБаза,
			|	СУММА(Средняя.КалендарныеДниБаза)	КАК КалендарныеДниБаза
			|   
			|ПОМЕСТИТЬ ВТПоВремени	
			|ИЗ (
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|		СУММА(Начисления.ОтработаноДней)	КАК ОтработаноДнейБаза,
			|		СУММА(Начисления.ОтработаноЧасов)	КАК ОтработаноЧасовБаза,
			|		СУММА(Начисления.НормаДней)			КАК НормаДнейБаза,
			|		СУММА(Начисления.НормаЧасов)		КАК НормаЧасовБаза,
			|		0	КАК КалендарныеДниБаза
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|	ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|        И  (Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|        ИЛИ  Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления  
			|	ПО		Начисления.Сотрудник = &парамСотрудник
			|		И	НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало,МЕСЯЦ) = Начисления.ПериодДействия
			|		И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
			|		И	Начисления.Организация = &парамОрганизация
			|		"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|		И	(Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) 
			|				ИЛИ	Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)) 
			|		И Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|		И НЕ (Средняя.БазовыйПериодКонец < Начисления.ПериодДействияНачало ИЛИ Средняя.БазовыйПериодНачало > Начисления.ПериодДействияКонец) 
			| 		
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|								, ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 		
			| 	СГРУППИРОВАТЬ ПО
			|   	Средняя.БазовыйПериодНачало,
			|   	Средняя.БазовыйПериодКонец
			| 		
			| 		
			|   // Данные календарным с вычетом праздников и невыходов
			|	ОбЪЕДИНИТЬ ВСЕ   
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|	
			|		0	КАК ОтработаноДнейБаза,
			|		0	КАК ОтработаноЧасовБаза,
			|		0	КАК НормаДнейБаза,
			|		0	КАК НормаЧасовБаза,
			|    	СУММА(ВЫБОР КОГДА НЕ Начисления.Сторно ТОГДА       
	       	|        Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия  
	      	|  		ИНАЧЕ
	       	|        -Начисления.ПроизводственныйКалендарьКалендарныеДниФактическийПериодДействия 
			|	    КОНЕЦ) + СУММА(ЕСТЬNULL(ЗапросМесяцПриема.КалендарныхДнейБезПраздников, 0)) КАК КалендарныеДниБаза 
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(
			|		Назначение = &парамСотрудник И ПериодДействияНачало <= &ПериодРасчетаСреднегоКонец И ПериодДействияКонец >= &ПериодРасчетаСреднегоНачало
			|		И ВидРасчета.ЗачетНормыВремени И ВидРасчета.ЗачетКалендарных
			|		И ВидРасчета В (ВЫБРАТЬ База.ВидРасчета ИЗ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК База ГДЕ База.Ссылка В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)))
			|		) КАК Начисления
			|	ПО		Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец  
			|		И	Начисления.ПериодДействияКонец >= Средняя.БазовыйПериодНачало  
			| 
			|   // Данные по календарным дням без праздников для средней за 12 месяцев в месяце приема до даты приема для принятых не 1-м числом, но в 1-й рабочий день
			|  ЛЕВОЕ СОЕДИНЕНИЕ
			|  (ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|		ДЕНЬ(&ДатаПриема) - КОЛИЧЕСТВО(ЕСТЬNULL(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, 0)) КАК КалендарныхДнейБезПраздников
			|	ИЗ
			|		РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|		ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаПриема, МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаПриема, ДЕНЬ, -1), ДЕНЬ))
			|				И (РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|				ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье))
			|	ГДЕ
			|		ДЕНЬ(&ДатаПриема) > 1
			|		И Средняя.Авторасчет
			|		И Средняя.Регистратор = &Регистратор
			|		И НАЧАЛОПЕРИОДА(Средняя.БазовыйПериодНачало, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаПриема, МЕСЯЦ)
			|		И Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)
			|
			|	СГРУППИРОВАТЬ ПО
			|		Средняя.БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец
			|	
			|  ) КАК ЗапросМесяцПриема
			|		ПО Средняя.БазовыйПериодНачало = ЗапросМесяцПриема.БазовыйПериодНачало
			|		И Средняя.БазовыйПериодКонец = ЗапросМесяцПриема.БазовыйПериодКонец
			|
			|	ГДЕ		Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			| 
			|	СГРУППИРОВАТЬ ПО
			|		Средняя.БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец
			| 
			|) КАК Средняя
			|СГРУППИРОВАТЬ ПО
			|	Средняя.БазовыйПериодНачало,
			|	Средняя.БазовыйПериодКонец
			|   
			|			
			|// записиси отредактированные пользователем			
			|ОБЪЕДИНИТЬ ВСЕ			
			|	ВЫБРАТЬ
			|		Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|		Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|
			|		Средняя.ОтработаноДней				КАК ОтработаноДней,
			|		Средняя.ОтработаноЧасов				КАК ОтработаноЧасов,
			|		Средняя.НормаДней					КАК НормаДней,
			|		Средняя.НормаЧасов					КАК НормаЧасов,
			|		Средняя.КалендарныеДни				КАК КалендарныеДни
			|
			|	ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|			
			|	ГДЕ		НЕ Средняя.Авторасчет		
			|		И	Средняя.Регистратор = &Регистратор			
			|		И	Средняя.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)			
			|									,ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска) )			
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			
			Запрос.Выполнить();
			ТекстЗапросаВТПоВремени = "ВТПоВремени";
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПоВремени";
		

		Если Истина Тогда
			// Запрос по начислениям кроме премий и записям, отредактированные пользователем 
			ТекстЗапросаВТ = "
			|		ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|			Средняя.НомерСтроки				КАК НомерСтроки,
			|			Средняя.Авторасчет				КАК Авторасчет,
			|			Средняя.ВидРасчета				КАК ВидРасчета,
			|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
			|			Начисления.Результат			КАК Результат,
			|			Начисления.РезультатУпр			КАК РезультатУпр,
			|			Начисления.Результат 			КАК РезультатПолный
			| " + ?(КомментироватьРасчет,",	
			| 		Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
			|	    ПОМЕСТИТЬ ВТНачисленияБезПремий
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя     
			|  	
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
			|		ПО		(Начисления.Сотрудник = &парамСотрудник ИЛИ Начисления.Сотрудник.ОсновноеНазначение = &парамСотрудник) 
			|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
			|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|			И	Начисления.Организация = &парамОрганизация  
			|			И	Начисления.ПериодРегистрации <= &парамПериодРегистрации
			|			И	Начисления.ПериодДействияНачало <= Средняя.БазовыйПериодКонец
			|			И	Средняя.БазовыйПериодНачало <= Начисления.ПериодДействияКонец
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|  	
			|		ГДЕ		Средняя.Регистратор = &Регистратор И Средняя.Авторасчет
			|				И 	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)			
			|				И	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)   
			|				И	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)   
			|				И	Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)
			|               И   Средняя.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)
			|		// записи, отредактированные пользователем			
			|		ОБЪЕДИНИТЬ ВСЕ	
			|		ВЫБРАТЬ
			|			Средняя.НомерСтроки				КАК НомерСтроки,
			|			Средняя.Авторасчет				КАК Авторасчет,
			|			Средняя.ВидРасчета				КАК ВидРасчета,
			|			Средняя.БазовыйПериодНачало		КАК БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец		КАК БазовыйПериодКонец,
			|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
			|							ТОГДА	Средняя.Результат
			|						ИНАЧЕ 0 КОНЕЦ
			|				КАК Результат,
			|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
			|							ТОГДА	Средняя.РезультатУпр
			|						ИНАЧЕ 0 КОНЕЦ
			|				КАК РезультатУпр,
			|			ВЫБОР	КОГДА 	НЕ Средняя.Авторасчет   
			|							ТОГДА	Средняя.РезультатПолный
			|						ИНАЧЕ 0 КОНЕЦ
			|				КАК РезультатПолный
			| " + ?(КомментироватьРасчет,",	
			| 			Средняя.ВидРасчета КАК ВидРасчетаРазрез","") + "
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			|		ГДЕ		Средняя.Регистратор = &Регистратор			
			|			И	(НЕ Средняя.Авторасчет)		
			|
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНачисленияБезПремий";
		
		ИспользуемыеВидыРасчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
		Если НЕ ИспользуемыеВидыРасчета.Найти(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку) = Неопределено Тогда
			Запрос.УстановитьПараметр("ЗаДваМесяца", Истина)
		Иначе
			Запрос.УстановитьПараметр("ЗаДваМесяца", Ложь)
		КонецЕсли;	
		
		Если Истина Тогда
			// Запрос по полным суммам премий
			ТекстЗапросаВТ = "
			|		ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|			Средняя.НомерСтроки					КАК НомерСтроки,
			|			Средняя.Авторасчет					КАК Авторасчет,
			|			Средняя.ВидРасчета               	КАК ВидРасчета,
			|			Средняя.БазовыйПериодНачало			КАК БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец			КАК БазовыйПериодКонец,
			|			СУММА(Начисления.Результат) 		КАК Результат,
			|			СУММА(Начисления.РезультатУпр)		КАК РезультатУпр,
			|			СУММА(Начисления.Результат) 		КАК РезультатПолный,
			|           Начисления.ВидРасчета.ЧислоМесяцев  КАК КоличествоМесяцев,
			|			Начисления.БазовыйПериодНачало КАК БазовыйПериодПремииНачало,
			|			Начисления.БазовыйПериодКонец КАК БазовыйПериодПремииКонец
			| " + ?(КомментироватьРасчет,",	
			| 			Начисления.ВидРасчета КАК ВидРасчетаРазрез","") + "
			|       ПОМЕСТИТЬ ВТПолныеСуммыПремий
			|		ИЗ РегистрРасчета.РасчетСреднегоЗаработка КАК Средняя
			| 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
			|		ПО		Средняя.Сотрудник = Начисления.Сотрудник  
			|			// фильтр в случае если не надо учитывать внутренние совмещения: или основное назначение или замена			
			|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|//УсловиеПремии
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК БазовыеВидыРасчета
			|		ПО		Средняя.ВидРасчета = БазовыеВидыРасчета.Ссылка  
			|			И	Начисления.ВидРасчета = БазовыеВидыРасчета.ВидРасчета
			|			
			|		ГДЕ	Средняя.Авторасчет		
			|			И	Средняя.Регистратор = &Регистратор			
			|			И	(Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска)
			|			ИЛИ Средняя.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))
			|		СГРУППИРОВАТЬ ПО
			|			Средняя.НомерСтроки,
			|			Средняя.Авторасчет,
			|			Средняя.ВидРасчета,
			|			Средняя.БазовыйПериодНачало,
			|			Средняя.БазовыйПериодКонец,
			|			Начисления.ВидРасчета.ЧислоМесяцев,
			|			Начисления.БазовыйПериодНачало,
			|			Начисления.БазовыйПериодКонец
			| " + ?(КомментироватьРасчет,",	
			| 			Начисления.ВидРасчета","") + "
			|";
			Если ДатаНачалаСобытия < ДатаИзмененияПорядка100_917() Тогда 
				ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "//УсловиеПремии",	"	
				|			И (Начисления.БазовыйПериодНачало <= Средняя.БазовыйПериодКонец)
				|			И (Начисления.БазовыйПериодКонец >= Средняя.БазовыйПериодНачало)");
			Иначе
				ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "//УсловиеПремии",	"	
				|			И (Начисления.ПериодДействия >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Средняя.БазовыйПериодНачало, МЕСЯЦ, -Начисления.ВидРасчета.ЧислоМесяцев + 1), МЕСЯЦ)
				|			И Начисления.ПериодДействия <= Средняя.БазовыйПериодКонец)");
			КонецЕсли;
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
			
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПолныеСуммыПремий";	
		
		Если Истина Тогда
			// Запрос по всем возможным базовым периодам премий
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ
			|		МИНИМУМ(Премии.БазовыйПериодПремииНачало) КАК БазовыйПериодПремииНачалоМин,
			|		МАКСИМУМ(Премии.БазовыйПериодПремииКонец) КАК БазовыйПериодПремииКонецМакс
			|	ПОМЕСТИТЬ ВТИнтервалБазовогоПериодаПремий
			|	ИЗ
			|		ВТПолныеСуммыПремий КАК Премии
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТИнтервалБазовогоПериодаПремий";	
		
		Если Истина Тогда
			// Запрос по отработанным дням в базовых периодах премий
			ТекстЗапросаВТ = "
			|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|		СУММА(Начисления.ОтработаноДней) КАК ОтработаноДней,
			|		СУММА(ВЫБОР КОГДА Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
			|				ТОГДА Начисления.ОтработаноДней ИНАЧЕ 0 КОНЕЦ) КАК ОтработаноДнейВКомандировке,
			|		Начисления.ПериодДействия КАК ПериодДействия
			|	ПОМЕСТИТЬ ВТОтработаноДнейВБазовыхПериодахПремийПредварительно
			|	ИЗ
			|		РегистрРасчета.Начисления КАК Начисления
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалБазовогоПериодаПремий КАК БазовыеПериодыПремий
			|			ПО (НАЧАЛОПЕРИОДА(Начисления.ПериодДействия, МЕСЯЦ) МЕЖДУ НАЧАЛОПЕРИОДА(БазовыеПериодыПремий.БазовыйПериодПремииНачалоМин, МЕСЯЦ) 
			|			И КОНЕЦПЕРИОДА(БазовыеПериодыПремий.БазовыйПериодПремииКонецМакс,МЕСЯЦ))
			|	ГДЕ
			|		(Начисления.Сотрудник = &парамСотрудник
			|			"+ ?(мНеУчитыватьСовместителейДляСредних,"И Начисления.Назначение.ОсновноеНазначение <> Начисления.Сотрудник","")+"
			|			И Начисления.Организация = &парамОрганизация)
			|	СГРУППИРОВАТЬ ПО
			|		Начисления.ПериодДействия,
			|		Начисления.Сотрудник
			|;
			|ВЫБРАТЬ
			|   СУММА(ВЫБОР КОГДА &ЗаДваМесяца 
			|		ТОГДА ОтработаноДнейВБазовыхПериодахПремийПредварительно.ОтработаноДней - ОтработаноДнейВБазовыхПериодахПремийПредварительно.ОтработаноДнейВКомандировке 
			|		ИНАЧЕ ОтработаноДнейВБазовыхПериодахПремийПредварительно.ОтработаноДней 
			|	КОНЕЦ) КАК ОтработаноДней,
			|   ОтработаноДнейВБазовыхПериодахПремийПредварительно.ПериодДействия КАК ПериодДействия
			|	ПОМЕСТИТЬ ВТОтработаноДнейВБазовыхПериодахПремий
			|ИЗ
			|	ВТОтработаноДнейВБазовыхПериодахПремийПредварительно КАК ОтработаноДнейВБазовыхПериодахПремийПредварительно
			|СГРУППИРОВАТЬ ПО
			|		ОтработаноДнейВБазовыхПериодахПремийПредварительно.ПериодДействия
			|";
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТОтработаноДнейВБазовыхПериодахПремий";	
		
		Если Истина Тогда
			// Запрос для определения учитываемой части премий
			ТекстЗапросаВТ = "
			|ВЫБРАТЬ
			|	Премии.НомерСтроки КАК НомерСтроки,
			|	Премии.Авторасчет КАК Авторасчет,
			|	Премии.ВидРасчета КАК ВидРасчета,
			|	Премии.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|	Премии.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|	Премии.КоличествоМесяцев КАК КоличествоМесяцев,
			|	Премии.РезультатПолный КАК РезультатПолный,
			|	Премии.РезультатУпр КАК РезультатУпр,
			|	Премии.Результат КАК Результат,
			|	СУММА(ВЫБОР
			|			КОГДА Премии.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработку)
			|					ИЛИ Премии.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)
			|				ТОГДА 0
			|			ИНАЧЕ ВТОтработаноДней.ОтработаноДней
			|		КОНЕЦ) КАК ОтработаноДней
			| " + ?(КомментироватьРасчет,",	
			| 			Премии.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
			|ПОМЕСТИТЬ ВТУчитываемыеПремии
			|ИЗ
			|	ВТПолныеСуммыПремий КАК Премии
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработаноДнейВБазовыхПериодахПремий КАК ВТОтработаноДней
			|		ПО (НАЧАЛОПЕРИОДА(ВТОтработаноДней.ПериодДействия, МЕСЯЦ) МЕЖДУ НАЧАЛОПЕРИОДА(Премии.БазовыйПериодПремииНачало, МЕСЯЦ)
			|		И НАЧАЛОПЕРИОДА(Премии.БазовыйПериодПремииКонец, МЕСЯЦ))
			|
			|СГРУППИРОВАТЬ ПО
			|	Премии.НомерСтроки,
			|	Премии.Авторасчет,
			|	Премии.ВидРасчета,
			|	Премии.БазовыйПериодНачало,
			|	Премии.БазовыйПериодКонец,
			|	Премии.КоличествоМесяцев,
			|	Премии.Результат,
			|	Премии.РезультатУпр,
			|	Премии.РезультатПолный
			| " + ?(КомментироватьРасчет,",	
			| 	Премии.ВидРасчетаРазрез","") + "";
			
			Запрос.Текст = ТекстЗапросаВТ;
			Запрос.Выполнить();
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТУчитываемыеПремии";	
		
		
		ТекстЗапроса = " 
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.НомерСтроки					КАК НомерСтроки,
		|		Основной.Авторасчет						КАК Авторасчет,
		|		Основной.ВидРасчета						КАК ВидРасчета,
		|		Основной.БазовыйПериодНачало			КАК БазовыйПериодНачало,
		|		Основной.БазовыйПериодКонец				КАК БазовыйПериодКонец,
		|		1										КАК КоэффициентПовышенияОкладов,
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеПремия,			
		|		ВЫБОР КОГДА Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеМеньшеНормы, 
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК УсловиеБольшеНуля, 
		|
		|//УсловиеПремии
		|												КАК Результат,
		|
		|//_УсловиеПремииУпр
		|												КАК РезультатУпр,
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|					ТОГДА	1
		|				ИНАЧЕ		3 КОНЕЦ    
		|												КАК Результат1,
		|		СУММА(Основной.РезультатПолный)				КАК РезультатПолный,
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноДнейБаза КОНЕЦ КАК ОтработаноДней,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноЧасовБаза КОНЕЦ КАК ОтработаноЧасов,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаДнейБаза КОНЕЦ КАК НормаДней,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаЧасовБаза КОНЕЦ КАК НормаЧасов,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.КалендарныеДниБаза КОНЕЦ КАК КалендарныеДни";
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			| Время.НормаЧасовБаза КАК НормаЧасовБаза,
		    | Время.ОтработаноЧасовБаза КАК  ОтработаноЧасовБаза,
			| Время.НормаДнейБаза КАК НормаДнейБаза,
	   		| Время.ОтработаноДнейБаза КАК  ОтработаноДнейБаза,
			| Основной.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
			| Основной.ОтработаноВБазовомПериодеПремии КАК ОтработаноВБазовомПериодеПремии";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ИЗ (
		|	ВЫБРАТЬ 
		|		Основной1.НомерСтроки				КАК НомерСтроки,
		|		Основной1.Авторасчет				КАК Авторасчет,
		|		Основной1.ВидРасчета				КАК ВидРасчета,
		|		Основной1.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец		КАК БазовыйПериодКонец,
		|       Основной1.КоличествоМесяцев         КАК КоличествоМесяцев,
		|		СУММА(Основной1.Результат)			КАК Результат,
		|		СУММА(Основной1.РезультатУпр)		КАК РезультатУпр,
		|		СУММА(Основной1.РезультатПолный)	КАК РезультатПолный
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ОтработаноВБазовомПериодеПремии КАК ОтработаноВБазовомПериодеПремии","") + "
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
		|		ИЗ (
		|		ВЫБРАТЬ  
		|			НачисленияБезПремий.НомерСтроки				КАК НомерСтроки,
		|			НачисленияБезПремий.Авторасчет				КАК Авторасчет,
		|			НачисленияБезПремий.ВидРасчета				КАК ВидРасчета,
		|			НачисленияБезПремий.БазовыйПериодНачало		КАК БазовыйПериодНачало,
		|			НачисленияБезПремий.БазовыйПериодКонец		КАК БазовыйПериодКонец, 
		|           0                                           КАК КоличествоМесяцев,
		|			НачисленияБезПремий.Результат				КАК Результат,
		|			НачисленияБезПремий.РезультатУпр			КАК РезультатУпр,
		|			НачисленияБезПремий.Результат 				КАК РезультатПолный
		| 		" + ?(КомментироватьРасчет,",	
		| 			0  КАК ОтработаноВБазовомПериодеПремии","") + "                                
		| 		" + ?(КомментироватьРасчет,",	
		| 			НачисленияБезПремий.ВидРасчетаРазрез КАК ВидРасчетаРазрез","") + "
		|	    ИЗ ВТНачисленияБезПремий КАК НачисленияБезПремий
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Премии.НомерСтроки,
		|		Премии.Авторасчет,
		|		Премии.ВидРасчета,
		|		Премии.БазовыйПериодНачало,
		|		Премии.БазовыйПериодКонец,
		|		Премии.КоличествоМесяцев,
		|//УсловиеПремииЗаМесяц
		|//_УсловиеПремииЗаМесяцУпр
		|       Премии.Результат
		| 		" + ?(КомментироватьРасчет,",	
		| 			Премии.ОтработаноДней","") + "
		| 		" + ?(КомментироватьРасчет,",	
		| 			Премии.ВидРасчетаРазрез","") + "
		|	ИЗ
		|	ВТУчитываемыеПремии КАК Премии
		|	) КАК Основной1		
		|	СГРУППИРОВАТЬ ПО 
		|		Основной1.НомерСтроки,
		|		Основной1.Авторасчет,
		|		Основной1.ВидРасчета,
		|		Основной1.БазовыйПериодНачало,
		|		Основной1.БазовыйПериодКонец,
		|		Основной1.КоличествоМесяцев
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ОтработаноВБазовомПериодеПремии","") + "
		| " + ?(КомментироватьРасчет,",	
		| 		Основной1.ВидРасчетаРазрез","") + "
		|	) КАК Основной		
		|			
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК Время			
		|	ПО	Время.БазовыйПериодНачало = Основной.БазовыйПериодНачало		
		|			
		|	// Чтобы не писать в каждой строке условие, сделаем левое соединение по этому условию		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПоВремени КАК ВремяДляСредней			
		|	ПО	ВремяДляСредней.БазовыйПериодНачало = Основной.БазовыйПериодНачало
		|   СГРУППИРОВАТЬ ПО
		|		Основной.НомерСтроки,
		|		Основной.Авторасчет,
		|		Основной.ВидРасчета,
		|		Основной.БазовыйПериодНачало,
		|		Основной.БазовыйПериодКонец,
		|		1,
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,			
		|		ВЫБОР КОГДА Время.ОтработаноЧасовБаза < Время.НормаЧасовБаза ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
		|		ВЫБОР КОГДА Время.НормаЧасовБаза > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
		|
		|           
		|		ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска),
		|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|					ТОГДА	1
		|				ИНАЧЕ		3 КОНЕЦ,    
		|												
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноДнейБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.ОтработаноЧасовБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаДнейБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.НормаЧасовБаза КОНЕЦ,			
		|		ВЫБОР КОГДА Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
		|			ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии))			
		|		ТОГДА 0 ИНАЧЕ ВремяДляСредней.КалендарныеДниБаза КОНЕЦ";
		Если КомментироватьРасчет Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			| Время.НормаЧасовБаза,
		    | Время.ОтработаноЧасовБаза,
			| Время.НормаДнейБаза,
	   		| Время.ОтработаноДнейБаза,
			| Основной.ВидРасчетаРазрез,
			| Основной.ОтработаноВБазовомПериодеПремии";
		КонецЕсли;	
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО           
		|  Основной.НомерСтроки УБЫВ         
		|";
		Если ДатаНачалаСобытия < ДатаИзмененияПорядка100_917() Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремииЗаМесяц",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 И  Премии.КоличествоМесяцев > 1
			|       	ТОГДА Премии.РезультатПолный / Премии.ОтработаноДней
			|           КОГДА Премии.ОтработаноДней > 0 И Премии.КоличествоМесяцев = 1
			|           ТОГДА Премии.РезультатПолный
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииЗаМесяцУпр",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 И  Премии.КоличествоМесяцев > 1
			|       	ТОГДА Премии.РезультатУпр / Премии.ОтработаноДней
			|           КОГДА Премии.ОтработаноДней > 0 И Премии.КоличествоМесяцев = 1
			|           ТОГДА Премии.РезультатУпр
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремии",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) И Основной.КоличествоМесяцев > 1			
			|					ТОГДА	Основной.Результат * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.Результат КОНЕЦ)");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииУпр",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) И Основной.КоличествоМесяцев > 1			
			|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ)")    

		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремииЗаМесяц",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 
			|       	ТОГДА Премии.РезультатПолный / Премии.ОтработаноДней
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииЗаМесяцУпр",	"	
			|		ВЫБОР КОГДА Премии.ОтработаноДней > 0 
			|       	ТОГДА Премии.РезультатУпр / Премии.ОтработаноДней
			|       ИНАЧЕ 0
			|       КОНЕЦ,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УсловиеПремии",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) 			
			|					ТОГДА	Основной.Результат * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.Результат КОНЕЦ)"); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//_УсловиеПремииУпр",	"	
			|		СУММА(ВЫБОР	КОГДА	Основной.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиям),ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиям),
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоПремиямОтпуска), ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоФиксПремиямОтпуска), 
			|						ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоГодовойПремии)) 			
			|					ТОГДА	Основной.РезультатУпр * Время.ОтработаноДнейБаза
			|				ИНАЧЕ		Основной.РезультатУпр КОНЕЦ)");    
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции
