
Процедура ПриОткрытии(Форма, Отказ) Экспорт

КонецПроцедуры

// Выполняет переопределяемую команду
//
// Параметры:
//  Форма	- УправляемаяФорма - форма, в которой расположена команда
//  Команда	- КомандаФормы - команда формы
//  ДополнительныеПараметры	- Структура - дополнительные параметры
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры = Неопределено) Экспорт

	Если Команда.Имя = "ОчиститьТаблицуТоваров" Тогда
		ВыполнитьПереопределяемуюКомандуОчиститьТаблицуТоваров(Форма, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьПереопределяемуюКомандуОчиститьТаблицуТоваров(Форма, ДополнительныеПараметры)

	Если Форма.Объект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОтвета = Новый Структура("Форма", Форма);
	ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОчиститьТаблицуТоваровЗавершение", ЭтотОбъект, ПараметрыОтвета);
	ТекстВопроса = "Табличну частину товарів буде повністю очищено. Продовжити?";
	ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Товары");

КонецПроцедуры

Процедура ОчиститьТаблицуТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.Форма.Объект.Товары.Очистить();
	КонецЕсли;

КонецПроцедуры