

&НаСервере
Процедура ОтключитьПРРОнаСервере ()	 		
	//	ПЕРЕМ РезультатВыполнения,ПараметрыКоманды;
	//	
	//	Если  НЕ мФРПодключенСервер Тогда
	//			//Сообщить("++++++++++++++++ ПРРО был отключен ранее  ++++++++++++++++++ ");	
	//		
	//			Возврат;
	//		КонецЕсли;
	
	//ОтветФРБулево=ОбъектПРРОСервер.Драйвер.Finalization("<?xml version=""1.0"" encoding=""UTF-8""?><InputParameters><Parameters FN="""+ОбъектПРРОСервер.ПараметрыПРРО.FN+"""/></InputParameters>");
	//СтрокаXMLОтвет = ОбъектПРРОСервер.Драйвер.StatusBarXML();
	
	
	//	Если не  ОтветФРБулево  Тогда	
	//		мФРПодключенСервер = Ложь;
	//		//Сообщить("++++++++++++++++ Ошибка отключения ФР ++++++++++++++++++ " + Символы.ПС +"Ошибка : "+СтрокаXMLОтвет +Символы.ПС);	
	//		возврат;
	//	КонецЕсли;
	
	
КонецПроцедуры



&НаСервере
Процедура ПодключитьПРРОнаСервере(ФискальныйНомер) Экспорт 
	// установка ключа и пароля, не обязательно , если не указать используются пароль и ключ из БД настроек ФН
	//Если (ПутькКлючу<> неопределено и ПаролькКлючу<>неопределено)  ТОгда
	//Ответ = Драйвер.SetSignSettings("<InputParameters><Parameters keypath="""+ПутькКлючу+""" keypass="""+ПаролькКлючу+""" /></InputParameters>") ;
	//КонецЕсли;
	//	мФРПодключенСервер = Истина;
	//	
	//	ПараметрыКоманды = Новый Структура("FN", ФискальныйНомер);	
	//	СтруктураПараметров = ВыполнитьКомандуПРРОнаСервере("Initialization", ПараметрыКоманды); 		
	//	Если не  СтруктураПараметров.Результат  Тогда	                                                     
	//		//Сообщить("++++++++++++++++ Ошибка выполнения команды Initialization ++++++++++++++++++" + Символы.ПС);
	//		мФРПодключенСервер = Ложь;
	//
	//		возврат;
	//	КонецЕсли;
	//	СтрокаЛиц= "(Бесплатная версия)";
	//	Если  СтруктураПараметров.ВыходныеПараметрыПРРО.license <> "free" Тогда
	//		
	//		СтрокаЛиц = "(лицензия до " +СтруктураПараметров.ВыходныеПараметрыПРРО.license +")";
	//	КонецЕсли;	
	//	мФРПодключенСервер = Истина;
		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНастроекПРРОнаСервере (ОбъектПРРОСервер,ФН1="")
	//ПодключитьПРРО (ОбъектПРРО,ФН1);
	//	
	//	СтруктураПараметров =ВыполнитьКомандуПРРОнаСервере(ОбъектПРРОСервер,"GetSettingRRO");
	//	Если не  СтруктураПараметров.Результат  Тогда	                                                     
	//		//Сообщить("++++++++++++++++ Ошибка выполнения команды GetSettingRRO++++++++++++++++++" + Символы.ПС);	
	//		возврат "";
	//	КонецЕсли;
	//	
	//	
	//	
	//	лЧтение = Новый ЧтениеXML;				
	//	лЧтение.УстановитьСтроку(СтруктураПараметров.ВыходныеПараметрыПРРО.xmlreport);//лФайл - это файл xml
	//	лФабрика = Новый ФабрикаXDTO;
	//	попытка
	//		лОбъектXDTO = лФабрика.ПрочитатьXML(лЧтение);	
	//	исключение
	//		//Сообщить ("Ошибка  xml настроек ПРРО");
	//		возврат "";
	//	конецпопытки;
	////		ОтключитьПРРОнаСервере();
	//	
	//	Возврат лОбъектXDTO;
	
	
КонецФункции

&НаСервере
Функция ВыполнитьКомандуПРРОнаСервере(Команда,ВходныеПараметрыПРРО = неопределено)  Экспорт
	ПЕРЕМ РезультатВыполнения,ВыходныеПараметрыПРРО;
	ПодключитьПРРОнаСервере(ВходныеПараметрыПРРО.FN);
	
	СтруктураПараметров = Новый Структура("Результат, ВыходныеПараметрыПРРО,ВходныеПараметрыПРРО,Команда", РезультатВыполнения, ВыходныеПараметрыПРРО,ВходныеПараметрыПРРО,Команда);
	ОбработатьРезультатВыполненияПоследнейКомандынаСервере (СтруктураПараметров);
	Если не  СтруктураПараметров.Результат  Тогда 
		//ВывестиОшибку(СтруктураПараметров);
		//сообщить("Ошибка");
	иначе
		сообщить("Команда <"+СтруктураПараметров.Команда+"> Выполнена успешно !",СтатусСообщения.Информация);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Просмотр чеков",,,,ЗначениеВСтрокуВнутр(СтруктураПараметров));
	
	Возврат СтруктураПараметров;
	
КонецФункции


&НаСервере
Функция ОбработатьРезультатВыполненияПоследнейКомандынаСервере (СтруктураРезультата) 
	перем СтрокаXML;
	
	СтруктураРезультата.Результат = Истина;
	ОтветФРБулево = ложь;
	
	Драйвер = ВебЧекПРРОСервер.СоздатьОбъектПРРО();
	
	СтрокаXML = ПолучитьXMLкомандынаСервере(СтруктураРезультата);
	СтрокаXMLStatus = ПолучитьXMLStatusBar(СтруктураРезультата.ВходныеПараметрыПРРО.FN);
	СтрокаXMLОтвет = "";
	Если СтруктураРезультата.Команда = "Initialization"  Тогда
		ОтветФРБулево=Драйвер.Initialization(СтрокаXML);	
		СтрокаXMLОтвет = Драйвер.StatusBarXML();
		
	иначеесли  СтруктураРезультата.Команда = "OfflineToOnline"  Тогда		
		ОтветФРБулево=Драйвер.OfflineToOnline(СтрокаXML);		
		СтрокаXMLОтвет = Драйвер.StatusBarXML();
		
	иначеесли  СтруктураРезультата.Команда = "GetCurrentStatus"  Тогда		
		ОтветФРБулево=Драйвер.GetCurrentStatus(СтрокаXML);		
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	иначеесли  СтруктураРезультата.Команда = "GetCheck"  Тогда		
		ОтветФРБулево=Драйвер.GetCheck(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
	иначеесли  СтруктураРезультата.Команда = "GetSettingRRO"  Тогда		
		ОтветФРБулево=Драйвер.GetSetingsRRO(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
		СтруктураРезультата.Вставить("СтрокаXMLОтвет", СтрокаXMLОтвет);
		Возврат СтруктураРезультата;
	иначеесли  СтруктураРезультата.Команда = "Finalization"  Тогда
		ОтветФРБулево=Драйвер.Finalization(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	иначеесли  СтруктураРезультата.Команда = "OpenShift"  Тогда
		ОтветФРБулево=Драйвер.OpenShift(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	иначеесли  СтруктураРезультата.Команда = "ReportZ"  Тогда
		ОтветФРБулево=Драйвер.ReportZ(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	иначеесли  СтруктураРезультата.Команда = "ReportX"  Тогда
		ОтветФРБулево=Драйвер.ReportX(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	иначеесли  СтруктураРезультата.Команда = "CashInOut"  Тогда
		ОтветФРБулево=Драйвер.CashInOut(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
		
	иначеесли  СтруктураРезультата.Команда = "FiscalReceipt"  Тогда
		СтрокаXML =СформироватьXMLчеканаСервере (СтруктураРезультата);
		ОтветФРБулево=Драйвер.FiscalReceipt(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus)
		
		
	иначеесли  СтруктураРезультата.Команда = "ShowPrintByCheckFn"  Тогда
		ОтветФРБулево=Драйвер.ShowPrintByCheckFn(СтрокаXML);	
		СтрокаXMLОтвет = Драйвер.StatusBarXML();
		
			
	иначеесли  СтруктураРезультата.Команда = "GetShifts"  Тогда
		ОтветФРБулево=Драйвер.GetShifts (СтрокаXML);	
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
	
	иначеесли  СтруктураРезультата.Команда = "GetDocumentsByShift"  Тогда
		ОтветФРБулево=Драйвер.GetDocumentsByShift (СтрокаXML);	
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
		
	иначеесли  СтруктураРезультата.Команда = "AddPayForm"  Тогда
		ОтветФРБулево=Драйвер.AddPayForm(СтрокаXML);
		СтрокаXMLОтвет = Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	ИначеЕсли СтруктураРезультата.Команда = "SendMessage" Тогда	
		
		ОтветФРБулево	= Драйвер.SendMessage(СтрокаXML);
		СтрокаXMLОтвет 	= Драйвер.StatusBarXML(СтрокаXMLStatus);
		
	ИначеЕсли СтруктураРезультата.Команда = "GetCheckCloudurl" Тогда
		ОтветФРБулево	= Драйвер.GetCheckCloudurl(СтрокаXML);
		СтрокаXMLОтвет 	= Драйвер.StatusBarXML(СтрокаXMLStatus);
	КонецЕсли;	
	Если не ОтветФРБулево Тогда
		СтруктураРезультата.Результат = Ложь;
	КонецЕсли;	
	
	СтруктураПараметров = Новый Структура;	
	//	СтрокаXMLОтвет = ОбъектПРРО.Драйвер.StatusBarXML();
	////сообщить("Ответ регистратора: ");
	////Сообщить(СтрокаXMLОтвет);
	//	СтрокаXMLОтвет = ОбъектПРРО.Драйвер.StatusBarXML();
	
	Если СтрДлина(СтрокаXMLОтвет)=0 Тогда
		
		//Сообщить("Внимание ошибка !!!!!!!!!!!!!!!!!");
		////Сообщить(чекxml);
		//Сообщить("//Сообщить ответ ПРРО " +ОтветФРБулево );
		
	КонецЕсли;	
		
	Если СтруктураРезультата.Команда = "GetCurrentStatus"  или СтруктураРезультата.Команда = "GetSettingRRO"  или СтруктураРезультата.Команда = "GetShifts"  или СтруктураРезультата.Команда = "GetDocumentsByShift"  Тогда
		чектекст = "";
		Если СтруктураРезультата.Результат Тогда
			
			СтруктураРезультата.ВыходныеПараметрыПРРО = СтруктураПараметров;
			лЧтение = Новый ЧтениеXML;				
			лЧтение.УстановитьСтроку(СтрокаXMLОтвет);//лФайл - это файл xml
			лФабрика = Новый ФабрикаXDTO;
			попытка
				
				Пока лЧтение.Прочитать() Цикл
					Если лЧтение.Имя = "Parameters" И лЧтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
						Пока лЧтение.ПрочитатьАтрибут() Цикл
							СтруктураПараметров.Вставить(лЧтение.Имя,лЧтение.Значение);	
						КонецЦикла;	
					КонецЕсли;
				КонецЦикла;
				СтруктураПараметров.Вставить("ТекстоваяВерсия",чектекст);	
			исключение
				//	//сообщить ("ошибка разбора отчета xml");
				//	возврат 0;
			конецпопытки;	
			Если СтруктураРезультата.Команда = "GetSettingRRO"  Тогда
				
				Возврат СтрокаXMLОтвет;
				//лЧтение = Новый ЧтениеXML;				
				//лЧтение.УстановитьСтроку(СтрокаXMLОтвет);//лФайл - это файл xml
				//лФабрика = Новый ФабрикаXDTO;
				//попытка
				//	лОбъектXDTO = лФабрика.ПрочитатьXML(лЧтение);	
				//	СтруктураПараметров.Вставить("НастройкиПРРО",лОбъектXDTO);
				//исключение
				//	СтруктураПараметров.Вставить("НастройкиПРРО","");
				//конецпопытки;
				
			КонецЕсли;	
			
			Если СтруктураРезультата.Команда = "GetShifts"  Тогда
				СтруктураПараметров.Вставить("СменыПРРО", СтрокаXMLОтвет);
				//лЧтение = Новый ЧтениеXML;				
				//лЧтение.УстановитьСтроку(СтрокаXMLОтвет);//лФайл - это файл xml
				//лФабрика = Новый ФабрикаXDTO;
				//попытка
				//	лОбъектXDTO = лФабрика.ПрочитатьXML(лЧтение);	
				//	СтруктураПараметров.Вставить("СменыПРРО",лОбъектXDTO);
				//исключение
				//	СтруктураПараметров.Вставить("СменыПРРО","");
				//конецпопытки;					
			КонецЕсли;	
			
			
			Если СтруктураРезультата.Команда = "GetDocumentsByShift"  Тогда
				
				СтруктураПараметров.Вставить("ДокументСмены", СтрокаXMLОтвет);
				//лЧтение = Новый ЧтениеXML;				
				//лЧтение.УстановитьСтроку(СтрокаXMLОтвет);//лФайл - это файл xml
				//лФабрика = Новый ФабрикаXDTO;
				//попытка
				//	лОбъектXDTO = лФабрика.ПрочитатьXML(лЧтение);	
				//	СтруктураПараметров.Вставить("ДокументСмены",лОбъектXDTO);
				//исключение
				//	СтруктураПараметров.Вставить("ДокументСмены","");
				//конецпопытки;					
			КонецЕсли;	
			

		КонецЕсли;
	иначе	
		////Сообщить("начало ответ регистратора "+ СтруктураРезультата.Команда);
		
		чектекст = "";
		//СтрокаXMLОтвет = СтрЗаменить(СтрокаXMLОтвет,"&","&amp;");
		//  СтрокаXMLОтвет = СтрЗаменить(СтрокаXMLОтвет,"'","""");
		//  
		//	СтрокаXMLОтвет = "<?xml version=""1.0"" encoding=""utf8""?> <OutputParameters><Parameters CL=""35"" WWW=""https://cabinet.tax.gov.ua/cashregs/check?id=9CAj7Ut5aAs&amp;date=20210302""/></OutputParameters>";
		
		лЧтение = Новый ЧтениеXML;				
		лЧтение.УстановитьСтроку(СтрокаXMLОтвет);//лФайл - это файл xml
		лФабрика = Новый ФабрикаXDTO;
		попытка                                              
			Пока лЧтение.Прочитать() Цикл
				
				Если лЧтение.Имя = "Parameters" И лЧтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					Пока лЧтение.ПрочитатьАтрибут() Цикл
						Если лЧтение.Имя = "CL" Тогда
							СтруктураПараметров.Вставить("КоличествоСтрокЧека",лЧтение.Значение);	
						иначеесли лЧтение.Имя = "WWW"  тогда
							СтруктураПараметров.Вставить("СсылкаНаСайтНалоговой",лЧтение.Значение);
						иначеесли лЧтение.Имя = "CheckID"  тогда
							СтруктураПараметров.Вставить("CheckID",лЧтение.Значение);
						иначеесли лЧтение.Имя = "FN"  тогда
							СтруктураПараметров.Вставить("FN",лЧтение.Значение);
							
						иначе  
							чектекст = чектекст + лЧтение.Значение+Символы.ПС;
							СтруктураПараметров.Вставить(лЧтение.Имя,лЧтение.Значение);	
							
							
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;
			КонецЦикла;
			СтруктураПараметров.Вставить("ТекстоваяВерсия",чектекст);	
			
		исключение
			//	//сообщить ("ошибка разбора отчета xml");
			//	возврат 0;
		конецпопытки;	
		
		
		
		////сообщить("Конец ответ регистратора "+ СтруктураРезультата.Команда);
		//
		//Если СтрДлина(СтрокаXMLОтвет)>0 Тогда
		//	ЧтениеXML = Новый ЧтениеXML;
		//	ЧтениеXML.УстановитьСтроку(СтрокаXMLОтвет);
		//	//ЧтениеXML.ПерейтиКСодержимому();
		//	
		//	Пока ЧтениеXML.Прочитать() Цикл
		//		Если ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
		//			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
		//				СтруктураПараметров.Вставить(ЧтениеXML.Имя,ЧтениеXML.Значение);	
		//			КонецЦикла;	
		//		КонецЕсли;
		//	КонецЦикла;	
		//КонецЕсли;
			СтруктураРезультата.ВыходныеПараметрыПРРО = СтруктураПараметров;
	КонецЕсли;	
	//	Драйвер = неопределено;
	
	возврат 0;	
КонецФункции 

&НаСервере
Функция ПолучитьXMLкомандынаСервере(СтруктураКоманды)	
	СтрокаКоманда = СтруктураКоманды.Команда;	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("InputParameters");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
	
	Если СтрокаКоманда ="Initialization" или СтрокаКоманда ="GetCurrentStatus"  или СтрокаКоманда ="Finalization" или СтрокаКоманда ="ShowOperators" или СтрокаКоманда ="ShowDataRRO"  или СтрокаКоманда ="GetSettingRRO" или СтрокаКоманда ="OfflineToOnline" или СтрокаКоманда ="StatusBar"   Тогда
		ЗаписьXML.ЗаписатьАтрибут("FN" ,  XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.FN));	
	иначеесли СтрокаКоманда ="OpenShift" или СтрокаКоманда ="ReportZ" или СтрокаКоманда ="ReportX"  Тогда
		ЗаписьXML.ЗаписатьАтрибут("FN" ,  XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.FN));
		ЗаписьXML.ЗаписатьАтрибут("Operatorid" ,  XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.ОператорИД));
		Сообщить(" тест " +  СтруктураКоманды.ВходныеПараметрыПРРО.ОператорИД);
		Сообщить(XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.ОператорИД));
	иначеесли СтрокаКоманда ="CashInOut" или СтрокаКоманда ="GetCheck"   или СтрокаКоманда ="GetShifts"  или СтрокаКоманда ="GetDocumentsByShift"   Тогда		
		ЗаписьXML.ЗаписатьАтрибут("FN" ,  XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.FN));
		Если СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды<> неопределено Тогда
			
			если ТипЗнч(СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды)=Тип("Структура") тогда
				Для Каждого АтрибутУзла Из СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды Цикл
					ЗаписьXML.ЗаписатьАтрибут(АтрибутУзла.Ключ ,  XMLСтрока(АтрибутУзла.Значение));					
				конецЦикла;  
				
			КонецЕсли;
		КонецЕсли;
		
	иначеесли СтрокаКоманда ="AddPayForm" Тогда		
		ЗаписьXML.ЗаписатьАтрибут("FN" ,  XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.FN));
		Если СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды<> неопределено Тогда
			
			если ТипЗнч(СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды)=Тип("Структура") тогда
				Для Каждого АтрибутУзла Из СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды Цикл
					ЗаписьXML.ЗаписатьАтрибут(АтрибутУзла.Ключ ,  XMLСтрока(АтрибутУзла.Значение));					
				конецЦикла;  
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрокаКоманда = "SendMessage" Тогда
		ЗаписьXML.ЗаписатьАтрибут("CheckID", XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.CheckID));	
		ЗаписьXML.ЗаписатьАтрибут("Dest", XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.Dest));	
		ЗаписьXML.ЗаписатьАтрибут("messagetype", XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.messagetype));	
		ЗаписьXML.ЗаписатьАтрибут("FN", XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.FN));	
		
	ИначеЕсли СтрокаКоманда = "GetCheckCloudurl" Тогда	
		ЗаписьXML.ЗаписатьАтрибут("TaxNum", XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.ПараметрыКоманды.TaxNum));	
		ЗаписьXML.ЗаписатьАтрибут("FN", XMLСтрока(СтруктураКоманды.ВходныеПараметрыПРРО.FN));	
	КонецЕсли;		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();	
КонецФункции


&НаСервере
Функция ПолучитьXMLStatusBar (FN)
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("InputParameters");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
	ЗаписьXML.ЗаписатьАтрибут("FN" ,  XMLСтрока(FN));
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
	
	
КонецФункции	

&НаСервере
Функция СоздатьОбъектПРРО() Экспорт
	Драйвер = Новый COMОбъект("WebCheckServer.ClassFiscal");
	возврат Драйвер;	
	
КонецФункции	

&НаСервере
Функция СформироватьXMLчекаНаСервере (СтруктураРезультата)
	
	ERECEIPTXML=Новый ЗаписьXML();
	ERECEIPTXML.УстановитьСтроку("windows-1251");
	
	ERECEIPTXML.ЗаписатьОбъявлениеXML();
	//	
	ERECEIPTXML.ЗаписатьНачалоЭлемента("check"); 
	ERECEIPTXML.ЗаписатьАтрибут("number",XMLСтрока(СтруктураРезультата.ВходныеПараметрыПРРО.НомерЧекаВСмене));
	ERECEIPTXML.ЗаписатьАтрибут("fn",XMLСтрока(СтруктураРезультата.ВходныеПараметрыПРРО.FN ));
	ERECEIPTXML.ЗаписатьАтрибут("operationtype",XMLСтрока(СтруктураРезультата.ВходныеПараметрыПРРО.ВидОперации ));
	ERECEIPTXML.ЗаписатьАтрибут("uuid",XMLСтрока(Новый УникальныйИдентификатор()) );
	
	ERECEIPTXML.ЗаписатьНачалоЭлемента("checkhead"); 
	
	ERECEIPTXML.ЗаписатьНачалоЭлемента("ver"); 
	ERECEIPTXML.ЗаписатьТекст(XMLСтрока("1")); 
	ERECEIPTXML.ЗаписатьКонецЭлемента(); 
	
	ERECEIPTXML.ЗаписатьКонецЭлемента(); 	
	
	ФормаОплаты = "1";
	
	//	//формы оплаты
	ERECEIPTXML.ЗаписатьНачалоЭлемента("payments"); 
	Если  СтруктураРезультата.ВходныеПараметрыПРРО.Оплаты.Количество() > 0 Тогда
		Для Каждого СтрокаCHECKPAY  из СтруктураРезультата.ВходныеПараметрыПРРО.Оплаты  Цикл
			
			ERECEIPTXML.ЗаписатьНачалоЭлемента("payment"); 
			ERECEIPTXML.ЗаписатьАтрибут("id",XMLСтрока(СтрокаCHECKPAY.ID) ); 
			ERECEIPTXML.ЗаписатьАтрибут("sum",XMLСтрока(СтрокаCHECKPAY.Сумма) ); 
			ERECEIPTXML.ЗаписатьКонецЭлемента(); 
			ФормаОплаты = СтрокаCHECKPAY.ID;
		КонецЦикла;
	КонецЕсли;
	ERECEIPTXML.ЗаписатьКонецЭлемента(); 
	
	//	// товары
	ERECEIPTXML.ЗаписатьНачалоЭлемента("goods"); 
	
	Если  СтруктураРезультата.ВходныеПараметрыПРРО.Товары.Количество() > 0 Тогда
		НомерСтроки =1;
		
		Для Каждого СтрокаCHECKBODY  из СтруктураРезультата.ВходныеПараметрыПРРО.Товары Цикл
			ERECEIPTXML.ЗаписатьНачалоЭлемента("good"); 
			ERECEIPTXML.ЗаписатьАтрибут("code",XMLСтрока("0") ); 
			ERECEIPTXML.ЗаписатьАтрибут("name",XMLСтрока(СтрокаCHECKBODY.Наименование) ); 
			ERECEIPTXML.ЗаписатьАтрибут("quantity",XMLСтрока(СтрокаCHECKBODY.Количество) ); 
			ERECEIPTXML.ЗаписатьАтрибут("price",XMLСтрока(СтрокаCHECKBODY.Цена) ); 
			ERECEIPTXML.ЗаписатьАтрибут("sum",XMLСтрока(СтрокаCHECKBODY.Сумма) ); 
			ERECEIPTXML.ЗаписатьАтрибут("taxrate",XMLСтрока(СтрокаCHECKBODY.СтавкаНалога) ); 
			//	ERECEIPTXML.ЗаписатьАтрибут("uktzed",XMLСтрока(СтрокаCHECKBODY.УКТЗЕД) ); 			
			ERECEIPTXML.ЗаписатьКонецЭлемента(); 
			НомерСтроки =НомерСтроки +1;
			
		КонецЦикла;
	КонецЕсли;
	ERECEIPTXML.ЗаписатьКонецЭлемента(); 
	
	Если ФормаОплаты = "2" 
		И СтруктураРезультата.ВходныеПараметрыПРРО.Свойство("ДанныеОбОплате")
		И СтруктураРезультата.ВходныеПараметрыПРРО.ДанныеОбОплате.Количество() > 0 Тогда 
		
		СтрДанныеОбОплате = СтруктураРезультата.ВходныеПараметрыПРРО.ДанныеОбОплате[0];
		
		
		ERECEIPTXML.ЗаписатьНачалоЭлемента("L");
			
		ERECEIPTXML.ЗаписатьАтрибут("PC", XMLСтрока("СПЛАТА"));
		ERECEIPTXML.ЗаписатьАтрибут("PSNM",XMLСтрока(СтрДанныеОбОплате.ПлатежнаяСистема));
		ERECEIPTXML.ЗаписатьАтрибут("RRN", XMLСтрока(СтрДанныеОбОплате.КодRRN));
		ERECEIPTXML.ЗаписатьАтрибут("PE", XMLСтрока(СтрДанныеОбОплате.КодАвторизации));
		ERECEIPTXML.ЗаписатьАтрибут("PD", XMLСтрока(СтрДанныеОбОплате.ПлатежнаяКарта));
		ERECEIPTXML.ЗаписатьАтрибут("PB", XMLСтрока(СтрДанныеОбОплате.ТерминалID));
		ERECEIPTXML.ЗаписатьАтрибут("PA", XMLСтрока(СтрДанныеОбОплате.Эквайер));
		
		ERECEIPTXML.ЗаписатьКонецЭлемента(); 
		
	КонецЕсли;
	
	ERECEIPTXML.ЗаписатьКонецЭлемента(); 
	возврат ERECEIPTXML.Закрыть();
	
КонецФункции

&НаСервере
Функция ПодготовкаНаименованияНаСервере (НаименованиеТовара)
	НаименованиеТовара = СтрЗаменить(НаименованиеТовара,"`"," ");
	НаименованиеТовара = СтрЗаменить(НаименованиеТовара,"'"," ");
	
	НаименованиеТовара = СтрЗаменить(НаименованиеТовара,""""," ");
	НаименованиеТовара = СтрЗаменить(НаименованиеТовара,"<"," ");
	НаименованиеТовара = СтрЗаменить(НаименованиеТовара,">"," ");
	
	
	
	возврат НаименованиеТовара;	
КонецФункции

&НаСервере
Функция Расш2_ОткрытьINI(Файл, Кодировка = Неопределено, Отладка = Истина) Экспорт
	СтруктураИни = Новый Структура;
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.ANSI;
	КонецЕсли;
	Попытка
		Текст = Новый ЧтениеТекста(Файл, Кодировка);
	Исключение
		Возврат Новый Структура;//Неопределено;
	КонецПопытки;
	
	Группа = Неопределено;
	Стр = Текст.ПрочитатьСтроку();
	НомерСтр = 1;
	Пока Стр <> Неопределено Цикл         // строки читаются до символа перевода строки
		Стр = СокрЛП(Стр);
		Если Лев(Стр, 1) = ";" Или ПустаяСтрока(Стр)  Тогда        //Игнорируем комментарий
			//Перейти ~Следующий;
		ИначеЕсли Лев(Стр, 1) = "[" Тогда    //Нашли секцию
			Если Прав(Стр, 1) <> "]" Тогда
				Если Отладка Тогда
					//Сообщить ("Ошибка синтаксиса формата INI: Строка " + НомерСтр);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
			Группа = Сред(Стр, 2, СтрДлина(Стр) - 2);
			СтруктураИни.Вставить(Группа, Новый Структура);
		Иначе                                //Параметр
			ПозицияРавно = Найти(Стр, "=");
			Если Группа = Неопределено ИЛИ ПозицияРавно = 0 Тогда
				Если Отладка Тогда
					//Сообщить ("Ошибка синтаксиса формата INI: Строка " + НомерСтр);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
			Значение = Сред(Стр, ПозицияРавно + 1);
			Попытка
				СтруктураИни[Группа].Вставить("F"+Лев(Стр, ПозицияРавно - 1), ?(ПустаяСтрока(Значение), Неопределено, Значение));
			исключение
				//	продолжить;
			Конецпопытки;
		КонецЕсли;
		
		//~Следующий:
		Стр = Текст.ПрочитатьСтроку();
		НомерСтр = НомерСтр + 1;
	КонецЦикла;
	
	Возврат СтруктураИни;
КонецФункции


Функция ЗакрытьСменыЗадание ()  Экспорт
	ПЕрем НастройкиПРРО,СтатусПРРО;
	ВремяПослеКоторогоЗАкрывать  = "23:00";
	ДанныеИНИ = Расш2_ОткрытьINI("C:\ProgramData\WebCheck\settings.ini");
	СписокTIN = Новый СписокЗначений;   
	СписокВыбора = Новый СписокЗначений;  
	Для Каждого Элемент из ДанныеИНИ Цикл 
		Если Найти( Элемент.Ключ,"Fns") Тогда
			Для Каждого ЭлементFN из Элемент.Значение Цикл
				ПараметрыКоманды = Новый Структура("FN", ЭлементFN.Значение );
				СтруктураНастроекПРРО = ВыполнитьКомандуПРРОнаСервере ("GetCurrentStatus",ПараметрыКоманды);
				Сообщить("Получаем настройки ФН: "+Строка(ЭлементFN.Значение));
				
				Если СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.Err = "0" Тогда
					Если СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.ShiftNumber <> "0"  Тогда	
						Если СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.CashBalance ="0.00"  Тогда
							
							ВходныеПараметры = Новый Структура("FN, ОператорИД", ЭлементFN.Значение,СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.Cashier);
							СтруктураПараметров =  ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("ReportZ",ВходныеПараметры);					
							
							Если не  СтруктураПараметров.Результат   Тогда				
								Сообщить("++++++++++++++++ Ошибка Z отчета ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);		
								ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не удалось закрыть смену. " + "++++++++++++++++ Ошибка Z отчета ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);	
								продолжить  ;	
							КонецЕсли;  	
							
						иначе
							ПараметрыКомандыВнесения = Новый Структура ("SumOut",-1*Число(СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.CashBalance));	
							ПараметрыКоманды = Новый Структура("FN,ПараметрыКоманды",ЭлементFN.Значение,ПараметрыКомандыВнесения);
							СтруктураПараметров = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("CashInOut",ПараметрыКоманды); 
							
							Если НЕ СтруктураПараметров.Результат И СтруктураПараметров.ВыходныеПараметрыПРРО.Err = "46" Тогда //смена превысила 24 часа - нужно закрыть
								
								ВходныеПараметры = Новый Структура("FN, ОператорИД", ЭлементFN.Значение,СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.Cashier);
								СтруктураПараметров =  ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("ReportZ",ВходныеПараметры);					
								Если не  СтруктураПараметров.Результат  Тогда				
									Сообщить("++++++++++++++++ Ошибка Z отчета ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);		
									ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка Z отчета " + "++++++++++++++++ Ошибка Z отчета ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);	
								КонецЕсли;
													
							КонецЕсли;
							
							Если не  СтруктураПараметров.Результат и СтруктураПараметров.ВыходныеПараметрыПРРО.Err <> "46"   Тогда //Err =  "46" превышен лимит 24 часа отрытой смены, закрываем по любому без выноса 				
								Сообщить("++++++++++++++++ Ошибка внесения ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);		
								ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка внесения " + "++++++++++++++++ Ошибка внесения ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);	
								продолжить  ;	
							иначе  			
								
								
								ВходныеПараметры = Новый Структура("FN, ОператорИД", ЭлементFN.Значение,СтруктураНастроекПРРО.ВыходныеПараметрыПРРО.Cashier);
								СтруктураПараметров =  ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("ReportZ",ВходныеПараметры);					
								Если не  СтруктураПараметров.Результат  Тогда				
									Сообщить("++++++++++++++++ Ошибка Z отчета ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);		
									ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка Z отчета " + "++++++++++++++++ Ошибка Z отчета ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++" + Символы.ПС);	
									продолжить  ;	
								КонецЕсли;
								
								
							КонецЕсли;
							
							
							
						КонецЕсли;
						
						
						
					КонецЕсли;	
				КонецЕсли;	
				//			Попытка
				//				НоваяСтрокаФН = ТабличноеПоле2.Добавить();
				//				НоваяСтрокаФН.ВерсияПРРОВебЧек = НастройкиПРРО.Parameters.versionDLL;
				//
				//				НоваяСтрокаФН.ФН = ЭлементFN.Значение;
				//			Если СтатусПРРО.ВыходныеПараметры.Err <> "0" Тогда
				//				НоваяСтрокаФН.ОшибкаИницализации  =СтатусПРРО.ВыходныеПараметры.ErrHelp;
				//				НоваяСтрокаФН.ОшибкаИницализацииНомер = СтатусПРРО.ВыходныеПараметры.Err;
				//			КонецЕсли;
				//				НоваяСтрокаФН.Организация = НастройкиПРРО.Parameters.taxobjects.taxobject.ORGNAME;
				//				НоваяСтрокаФН.Лицензия = НастройкиПРРО.Parameters.license;
				//				НоваяСтрокаФН.Едрпоу = НастройкиПРРО.Parameters.taxobjects.taxobject.TIN;
				//				НоваяСтрокаФН.СерверДФС = ?(СтатусПРРО.ВыходныеПараметры.FiscalMode = "0","Тестовый","Фискальный");
				//				НоваяСтрокаФН.Вкассе =  СтатусПРРО.ВыходныеПараметры.CashBalance;
				//				НоваяСтрокаФН.ShiftStart =  СтатусПРРО.ВыходныеПараметры.ShiftStart;
				//				НоваяСтрокаФН.СтатусРаботы = ?(СтатусПРРО.ВыходныеПараметры.Offline="1","Оффлайн c "+СтатусПРРО.ВыходныеПараметры.LastOfflineStart,"Онлайн"); 
				//				НоваяСтрокаФН.ДиапазонОффлайнномеров = СтатусПРРО.ВыходныеПараметры.OfflinePool;
				//				НоваяСтрокаФН.Смена =СтатусПРРО.ВыходныеПараметры.ShiftNumber;
				//				НоваяСтрокаФН.Оператор =НастройкиПРРО.Parameters.operators.Operator.INN; 
				//	
				//				НоваяСтрокаФН.ВремяРаботыВоффлайн = РазностьВремени(ТекущаяДата(),СтатусПРРО.ВыходныеПараметры.LastOfflineStart);
				//				
				//			исключение
				//			КонецПопытки;
				
			КонецЦикла;			
		КонецЕсли;			
	КонецЦикла;
	
	
	
КонецФункции	