Функция ПолучитьТипДокументаСводногоПеремещения(ВидНоменклатуры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат ВидНоменклатуры.ТипыДокументовСводногоПеремещения;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьТоварыДляПеремещенияТоваров() Экспорт
	
	Таблица = ТоварыМалоценка.Выгрузить();
	Инд = Таблица.Количество() - 1;
	
	Пока Инд >= 0 Цикл
		
		Если ПолучитьТипДокументаСводногоПеремещения(Таблица[Инд].ВидНоменклатуры) <>
			Перечисления.ТипыДокументовСводногоПеремещения.ПеремещениеТоваров Тогда
			Таблица.Удалить(Инд);
		КонецЕсли;
		
		Инд = Инд - 1;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТоварыДляПеремещенияМалоценки() Экспорт
	
	Таблица = ТоварыМалоценка.Выгрузить();
	Инд = Таблица.Количество() - 1;
	
	Пока Инд >= 0 Цикл
		
		Если ПолучитьТипДокументаСводногоПеремещения(Таблица[Инд].ВидНоменклатуры) <>
			Перечисления.ТипыДокументовСводногоПеремещения.ПеремещениеМалоценки Тогда
			Таблица.Удалить(Инд);
		КонецЕсли;
		
		Инд = Инд - 1;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции