
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТекУзел = "";
	Если Не Разработка.ВерсияКлиентаОбновлена(, ТекУзел) Тогда
		ПоказатьПредупреждение(, "Оновiть додаток! " + ТекУзел);
		Возврат;
	КонецЕсли;
	
	ОбменУспешноВыполнен = Разработка.ВыполнитьОбменДанными();
	Если ОбменУспешноВыполнен Тогда
		ТекстОповещения = "Обмін даними виконано";
		КартинкаОповещения = БиблиотекаКартинок.Успешно;
	Иначе
		ТекстОповещения = "Обмін даними не виконано";
		КартинкаОповещения = БиблиотекаКартинок.Ошибка;
	КонецЕсли;
	ПоказатьОповещениеПользователя(ТекстОповещения, , ТекущаяДата(), КартинкаОповещения);

	//+NovashIV_19.02.2023
	ПроцедурыОбменаДанными.ОтправкаФотоПриОбмене();
	//-NovashIV_19.02.2023
	Оповестить("ВыполненОбменДанными");

КонецПроцедуры

