Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТЗ = Сотруднкики.Выгрузить();
	ТЗ.Свернуть("Сотрудник, Подразделение", "КВыплате");
	НаборЗаписей = РегистрыНакопления.ВзаиморасчетыСРаботникамиУправленческий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Для Каждого стр Из ТЗ Цикл
		Если ЗначениеЗаполнено(стр.Сотрудник) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Активность   		= Истина;
			Запись.Регистратор  		= Ссылка;
			Запись.Период       		= ПериодРегистрации;
			Запись.ПериодВзаиморасчетов = ПериодРегистрации;
			Запись.Сотрудник    		= стр.Сотрудник;
			Запись.Подразделение    	= стр.Подразделение;
			Запись.СуммаВзаиморасчетов  = стр.КВыплате;
			Запись.Ведомость  = Ссылка;
			Запись.КодОперации = Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления;
			НаборЗаписей.Записать();	
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ Тогда
		ПроводкиБУ = Движения.Хозрасчетный;
		ПроводкиБУ.Записывать = Истина;
		//
		КассаВВалюте = Ложь;
		МоментДокумента = Новый МоментВремени(Дата, Ссылка);
		
		ТЗВедомость = Сотруднкики.Выгрузить();
		ТЗВедомость.Свернуть("Подразделение", "ВсегоНачисленно,Ставка,Сверхурочные,Выработка,ПродажиМесячные,ПродажиОборудования,КПИМесяц,КПИКвартал,КПИПроект,ГодоваяПремия,Премия,СтавкаОтработано,ОфицЗП");
		
		
		Для Каждого стр Из ТЗВедомость Цикл
			
			ВсегоНачисленно = стр.ВсегоНачисленно ;
			ПремииИКПИ = стр.ПродажиМесячные + стр.ПродажиОборудования + стр.КПИМесяц + стр.КПИКвартал + стр.КПИПроект + стр.ГодоваяПремия + стр.Премия + стр.Выработка+стр.Сверхурочные;
			ВсегоНачисленноБезОфЗП = ВсегоНачисленно - стр.ОфицЗП - ПремииИКПИ;
			
			Для инд = 1 По 3 Цикл
				
				
				Если инд = 1 Тогда
					
					Если ПремииИКПИ = 0 Тогда 
						Продолжить;
					КонецЕсли;
					Проводка = ПроводкиБУ.Добавить();
					
					Проводка.Период      = ПериодРегистрации;
					Проводка.Организация = Организация;
					Проводка.Регистратор = Ссылка;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6611");
					
					
					СтатьяЗатрат = стр.Подразделение.СтатьяПремийИKPI;
					Сумма = ПремииИКПИ;
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, стр.Подразделение);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПериодРегистрации);
					Если стр.Подразделение.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000366") Тогда
						
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("903");
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтатьяЗатрат);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, стр.Подразделение.Проект);
						
						
						
					ИначеЕсли стр.Подразделение.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000379") Тогда
						
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("92");
						
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтатьяЗатрат);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, стр.Подразделение.Проект);
						
						
					КонецЕсли;
					
					
					
					Проводка.Сумма  = Сумма;
					
				ИначеЕсли инд = 2 Тогда
					
					Если ВсегоНачисленноБезОфЗП = 0 Тогда 
						Продолжить;
					КонецЕсли;	
					Проводка = ПроводкиБУ.Добавить();

					Проводка.Период      = ПериодРегистрации;
					Проводка.Организация = Организация;
					Проводка.Регистратор = Ссылка;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6611");
					
					СтатьяЗатрат = стр.Подразделение.СтатьяЗатрат;
					Сумма = ВсегоНачисленноБезОфЗП;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, стр.Подразделение);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, ПериодРегистрации);
					Если стр.Подразделение.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000366") Тогда
						
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("903");
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтатьяЗатрат);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, стр.Подразделение.Проект);
						
						
						
					ИначеЕсли стр.Подразделение.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000379") Тогда
						
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("92");
						
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтатьяЗатрат);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, стр.Подразделение.Проект);
						
						
					КонецЕсли;
					
					
					
					Проводка.Сумма  = Сумма;
					
				Иначе
					
					Если стр.ОфицЗП = 0 Тогда 
						Продолжить;
					КонецЕсли;
					
					Проводка = ПроводкиБУ.Добавить();

					Проводка.Период      = ПериодРегистрации;
					Проводка.Организация = Организация;
					Проводка.Регистратор = Ссылка;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("84");
					
					СтатьяЗатрат = стр.Подразделение.СтатьяЗатрат;
					Сумма = стр.ОфицЗП;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтатьяЗатрат);
					Если стр.Подразделение.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000366") Тогда
						
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("903");
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтатьяЗатрат);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, стр.Подразделение.Проект);
						
						
						
					ИначеЕсли стр.Подразделение.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("100000379") Тогда
						
						Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("92");
						
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтатьяЗатрат);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, стр.Подразделение);
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, стр.Подразделение.Проект);
						
						
					КонецЕсли;
					
					
					
					Проводка.Сумма  = Сумма;
					
				КонецЕсли;	
				
				
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.Записать();
КонецПроцедуры
