
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТекстВопроса = "Процедура початкової ініціалізації може зайняти тривалий час. Виконати завантаження всієї інформації на пристрій (крім цін і залишків)?";
	ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Поч. заповнення (крім цін і залишків)");

КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Разработка.ВыполнитьНачальнуюИнициализациюдляМобильногоУстройства();
		Оповестить("ВыполненаНачальнаяИнициализация");
	КонецЕсли;

КонецПроцедуры
