Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми

Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

#Если Клиент Тогда
	
Функция ПолучитьДолжностьУпр(ФизЛицо,ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РаботникиСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&ДатаСреза, ФизЛицо = &ФизЛицо) КАК РаботникиСрезПоследних
		|ГДЕ
		|	РаботникиСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Должность =  ВыборкаДетальныеЗаписи.Должность;
		КонецЦикла;
		
		Возврат Должность;
		
	Иначе
		
		Возврат "";

	КонецЕсли;
	
КонецФункции

// Функция формирует табличный документ унифицированной формы ОЗ-2
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ по форме ОЗ-2.
//
Функция ПечатьОЗ2(ПечатьПоДаннымУпрУчета = Истина)

	Макет       = ПолучитьОбщийМакет("ОЗ2");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма_ОЗ2";
	
	
	Если Не ПечатьПоДаннымУпрУчета Тогда
		
		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("Период"            , МоментВремени());
		Запрос.УстановитьПараметр("ТекОрганизация"    , Организация);
		Запрос.УстановитьПараметр("ГлавныйБухгалтер"  , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запрос.УстановитьПараметр("РуководительОтдела", РуководительОтдела);
		Запрос.УстановитьПараметр("Сдал"              , Сдал);
		Запрос.УстановитьПараметр("Принял"            , Принял);
		Запрос.УстановитьПараметр("Ссылка"            , Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизации.Организация.НаименованиеПолное                КАК Организация,
		|	КодыОрганизации.КодПоЕДРПОУ                                   КАК ЕДРПОУ,
		|	МодернизацияОС.Номер                                          КАК НомерАкта,
		|	МодернизацияОС.Дата                                           КАК ДатаАкта,
		|	МодернизацияОС.СобытиеОС                                      КАК ВидОперации,
		|	МодернизацияОС.СчетУчетаБУВнеоборотногоАктива                 КАК СчетКт,
		|	МодернизацияОС.ДатаНачалаМодернизации                         КАК ДатаНачала,
		|	МодернизацияОС.ДатаОкончанияМодернизации                      КАК ДатаОкончания,
		|	МодернизацияОС.ЧтоНеВыполнено                                 КАК ЧтоНеВыполнено,
		|	МодернизацияОС.ЧтоИзменилось                                  КАК ЧтоИзменилось,
		|	РАЗНОСТЬДАТ(МодернизацияОС.ДатаНачалаМодернизации,
		|	            МодернизацияОС.ДатаОкончанияМодернизации,
		|	            ДЕНЬ)                                             КАК КоличествоДней,
		|	ФИОГлавногоБухгалтера.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОГлавногоБухгалтера.Имя, 1, 1) + "". "" 
		|		+ ПОДСТРОКА(ФИОГлавногоБухгалтера.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер,
		|	ФИОРуководителяОтдела.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОРуководителяОтдела.Имя, 1, 1) + "". "" 
		|		+ ПОДСТРОКА(ФИОРуководителяОтдела.Отчество, 1, 1) + ""."" КАК РуководительОтдела,
		|	ФИОСдал.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОСдал.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОСдал.Отчество, 1, 1) + "".""               КАК Сдал,
		|	ФИОПринял.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОПринял.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОПринял.Отчество, 1, 1) + "".""             КАК Принял,
		|	ДолжностьСдал.Должность                                       КАК СдалДолжность,
		|	ДолжностьПринял.Должность                                     КАК ПринялДолжность
		|ИЗ
		|	Документ.МодернизацияОС КАК МодернизацияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.КодыОрганизации.СрезПоследних(
		|			                &Период,
		|			                Организация = &ТекОрганизация) КАК КодыОрганизации
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И Сотрудник.Физлицо = &Сдал) КАК ДолжностьСдал
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И Сотрудник.Физлицо = &Принял) КАК ДолжностьПринял
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		                    &Период,
		|		                    ФизЛицо В
		|		                    (ВЫБРАТЬ
		|		                        ОтветственныеЛица.ФизическоеЛицо
		|		                    ИЗ
		|		                        РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|		                                        &Период,
		|		                                        СтруктурнаяЕдиница = &ТекОрганизация
		|		                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
		|			                 ) КАК ФИОГлавногоБухгалтера
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период, 
		|			                ФизЛицо = &РуководительОтдела) КАК ФИОРуководителяОтдела
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период,
		|			                ФизЛицо = &Сдал) КАК ФИОСдал
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период,
		|			                ФизЛицо = &Принял) КАК ФИОПринял
		|		ПО (ИСТИНА)
		|ГДЕ
		|	МодернизацияОС.Ссылка = &Ссылка";
		ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
		ВыборкаПоШапке.Следующий();
	
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("Период",         МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	
	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	Запрос.УстановитьПараметр("СписокОС",       СписокОС);
	
	Если ПечатьПоДаннымУпрУчета Тогда
		
		СдалПринялДолжности = Новый Структура;
		СдалПринялДолжности.Вставить("СдалДолжность"  ,ПолучитьДолжностьУпр(Сдал, Дата));
		СдалПринялДолжности.Вставить("ПринялДолжность",ПолучитьДолжностьУпр(Принял, Дата));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МодернизацияОСОС.Ссылка.Номер                        КАК НомерАкта,
		|	МодернизацияОСОС.Ссылка.Дата                         КАК ДатаАкта,
		|	МодернизацияОСОС.Ссылка.СобытиеОС                    КАК ВидОперации,
		|	МодернизацияОСОС.ОсновноеСредство.Код                КАК ИнвентарныйНомер,
		|	МодернизацияОСОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
		|	МодернизацияОСОС.ОсновноеСредство.НаименованиеПолное КАК ОсновноеСредствоНаименование,
		|	ВЫБОР
		|		КОГДА НЕ (МодернизацияОСОС.Ссылка.ВидУлучшения = ЗНАЧЕНИЕ(Перечисление.ВидыУлучшения.Ремонт))
		|			ТОГДА МодернизацияОСОС.СуммаМодернизацииУУ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаМодернизации,
		|	ВЫБОР
		|		КОГДА МодернизацияОСОС.Ссылка.ВидУлучшения = ЗНАЧЕНИЕ(Перечисление.ВидыУлучшения.Ремонт)
		|			ТОГДА МодернизацияОСОС.СуммаМодернизацииУУ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРемонта,
		|	МодернизацияОСОС.СуммаМодернизацииУУ                 КАК СуммаМодернизацииИРемонта,
		|	МодернизацияОСОС.ЛиквидационнаяСтоимостьУУ           КАК ЛиквидационнаяСтоимость,
		|	МодернизацияОСОС.СрокПолезногоИспользованияУУ        КАК СрокПолезногоИспользования,
		|	МодернизацияОСОС.ОбъемПродукцииРаботУУ               КАК ОбъемПродукцииРабот,
		|	МодернизацияОСОС.Ссылка.Сдал       					 КАК Сдал,
		|	МодернизацияОСОС.Ссылка.Принял       				 КАК Принял,
		|	МодернизацияОСОС.Ссылка.ДатаНачалаМодернизации       КАК ДатаНачала,
		|	МодернизацияОСОС.Ссылка.ДатаОкончанияМодернизации    КАК ДатаОкончания,
		|	МодернизацияОСОС.Ссылка.ЧтоНеВыполнено 				 КАК ЧтоНеВыполнено,
		|	МодернизацияОСОС.Ссылка.ЧтоИзменилось                КАК ЧтоИзменилось,
		|	РАЗНОСТЬДАТ(МодернизацияОСОС.Ссылка.ДатаНачалаМодернизации,
		|	            МодернизацияОСОС.Ссылка.ДатаОкончанияМодернизации,
		|	            ДЕНЬ)                                    КАК КоличествоДней,
		|	МестонахождениеОС.МОЛ.Код                            КАК КодМОЛа,
		|	МестонахождениеОС.Местонахождение.Наименование       КАК Подразделение
		|ИЗ
		|	Документ.МодернизацияОС.ОС КАК МодернизацияОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|ГДЕ
		|	МодернизацияОСОС.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МодернизацияОСОС.ОсновноеСредство.ЗаводскойНомер       КАК ЗаводскойНомер,
		|	МодернизацияОСОС.ОсновноеСредство.НаименованиеПолное   КАК ОсновноеСредствоНаименование,
		|	ВЫБОР
		|		КОГДА НЕ (МодернизацияОСОС.Ссылка.ВидУлучшения = ЗНАЧЕНИЕ(Перечисление.ВидыУлучшения.Ремонт))
		|			ТОГДА МодернизацияОСОС.СуммаМодернизацииБУ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаМодернизации,
		|	ВЫБОР
		|		КОГДА МодернизацияОСОС.Ссылка.ВидУлучшения = ЗНАЧЕНИЕ(Перечисление.ВидыУлучшения.Ремонт)
		|			ТОГДА МодернизацияОСОС.СуммаМодернизацииБУ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРемонта,
		|	МодернизацияОСОС.СуммаМодернизацииБУ                   КАК СуммаМодернизацииИРемонта,
		|	СчетаБухгалтерскогоУчетаОС.СчетУчета                   КАК СчетДт,
		|	ПервоначальныеСведенияОС.ИнвентарныйНомер              КАК ИнвентарныйНомер,
		|	МестонахождениеОС.МОЛ.Код                              КАК КодМОЛа,
		|	МестонахождениеОС.Местонахождение.Наименование         КАК Подразделение
		|ИЗ
		|	Документ.МодернизацияОС.ОС КАК МодернизацияОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК СчетаБухгалтерскогоУчетаОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|ГДЕ
		|	МодернизацияОСОС.Ссылка = &Ссылка";
	
	КонецЕсли;	
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	НеПервая = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если НеПервая Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ2");
		
		Если Не ПечатьПоДаннымУпрУчета Тогда
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
			//ОбластьМакета.Параметры.Организация = СокрП(ВыборкаПоШапке.Организация);
			
		Иначе
			
			ОбластьМакета.Параметры.Организация = "Управлінський облік";
			ОбластьМакета.Параметры.Заполнить(СдалПринялДолжности);
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
			
		ТабДокумент.Вывести(ОбластьМакета);
		НеПервая = Истина;
	
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ2()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОЗ2упр" тогда
		
		// Управленческая печатная форма документа
		ТабДокумент = ПечатьОЗ2();
		
	ИначеЕсли ИмяМакета = "ОЗ2бух" тогда
		
		// Бухг печатная форма документа
		ТабДокумент = ПечатьОЗ2(Ложь);
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НСтр("ru='Модернизация ОС';uk='Модернізація ОЗ'")), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ОЗ2упр,ОЗ2бух",НСтр("ru='Форма ОЗ-2(упр. учет)';uk='Форма ОЗ-2(упр. облік)'"),НСтр("ru='Форма ОЗ-2(бух. учет)';uk='Форма ОЗ-2(бух. облік)'"));

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

	мСтрокаРеквизитыБухУчета =  "СтоимостьБУ,
								|СчетУчетаБУВнеоборотногоАктива,
								|ОС.СрокПолезногоИспользованияБУ,
								|ОС.ФактСрокИспользованияБУ,
								|ОС.ОстСрокИспользованияБУ,
								|ОС.ОбъемПродукцииРаботБУ,
								|ОС.ФактОбъемПродукцииРаботБУ,
								|ОС.ОстОбъемПродукцииРаботБУ,
								|ОС.СтоимостьБУ,
								|ОС.СуммаМодернизацииБУ,
								|ОС.АмортизацияБУ,
								|ОС.АмортизацияЗаМесяцБУ,
								|ОС.ОстСтоимостьБУ,
								|ОС.ЛиквидационнаяСтоимостьБУ";

	мСтрокаРеквизитыНалУчета =  "СтоимостьНУ,
								|ОС.СуммаМодернизацииНУ";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если ОтражатьВУправленческомУчете Тогда
		
		мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), );
		
		Если НЕ ЗначениеЗаполнено(мУчетнаяПолитика) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			СтруктураШапкиДокумента.Вставить("УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ_УУ", мУчетнаяПолитика.УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ);
			
			ДатаНКУ2015 = глЗначениеПеременной("ДатаНКУ2015");
			Если СтруктураШапкиДокумента.Дата >=  ДатаНКУ2015 Тогда
				СтруктураШапкиДокумента.Вставить("УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ_УУ", Ложь);
			КонецЕсли;	
			
		КонецЕсли;
	
	КонецЕсли;	
		
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Бух");
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль);
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015", мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыльДо2015);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.ЕстьНДС);
		
		СтруктураШапкиДокумента.Вставить("УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ", мУчетнаяПолитикаБУ.УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ);
		
		ДатаНКУ2015 = глЗначениеПеременной("ДатаНКУ2015");
		Если СтруктураШапкиДокумента.Дата >=  ДатаНКУ2015 Тогда
			СтруктураШапкиДокумента.Вставить("УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ", Ложь);
		КонецЕсли;	
		
		Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеОбъектаСтроительства", Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
		КонецЕсли;									 
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация, ОбъектСтроительства, СчетУчетаБУВнеоборотногоАктива, СобытиеОС";
	
	ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", ВидУлучшения";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
		 Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.НалоговоеНазначениеОбъектаСтроительства) Тогда
			 
			 ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено налоговое назначение у объекта строительства';uk=""Не заповнене податкове призначення в об'єкта будівництва"""), Отказ, Заголовок);
		 	
		 КонецЕсли;
		
	КонецЕсли;
	
	Если  СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015
		И ИспользоватьОбщийСпособОтраженияРасходов
		И Дата >= глЗначениеПеременной("ДатаНачалаРаспределенияОПЗвНУ") Тогда
		
		Для каждого СтрокаСпособа Из СпособОтраженияРасходов.Способы  Цикл
			
			НомерСтроки = СпособОтраженияРасходов.Способы.Индекс(СтрокаСпособа) + 1;
			
			Если УправлениеПроизводством.ПолучитьХарактерЗатратПоСчетуЗатрат(СтрокаСпособа.СчетЗатрат,,Дата) = "ОПЗ" 
				И НЕ ЗначениеЗаполнено(СтрокаСпособа.НалоговоеНазначение) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке %1 табличной части способа отражения расходов  указан счет ОПЗ и не указано налоговое назначение НДС. Для отражения расходов по данному документу налоговое назначение НДС должно быть указано!';uk='У рядку %1 табличної частини спосіб відображення витрат зазначений рахунок ЗВВ, але не зазначене податкове призначення ПДВ. Для відображення витрат по даному документу податкове призначення ПДВ має буту зазначеним!'"), НомерСтроки), Отказ, Заголовок);
		    КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
		
	//Проверим на виды операций, которые не будут полностью отработаны в данном документе
	Если СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.ПодготовкаКПередаче
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.Передача
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.Списание
	Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='События с основными средствами с видом <%1>"
"не будут полноценно отражены данным документом (учетное состояние ОС не изменится)!';uk='Події з основними засобами з видом <%1>"
"не будуть повноцінно відображені даним документом (обліковий стан ОЗ не зміниться)!'"), строка(СтруктураШапкиДокумента.ВидСобытияОС)),,Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверка реквизитов в ТЧ по упр. учету
// 
Процедура ПроверкаРеквизитовТЧУпр(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	// Проверим что суммы модернизации относимые на каждый объект ОС в сумме равны данным из шапки документа
	Если ТаблицаОС.Итог("СуммаМодернизацииУУ")<> СтруктураШапкиДокумента.СтоимостьУУ Тогда
		
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По управленческому учету общая сумма модернизации, указанная в шапке документа, не соответствует в итоге суммам, отнесенным на основные средства!';uk='По управлінському обліку загальна сума модернізації, зазначена в шапці документа, не відповідає в результаті сумам, віднесеним на основні засоби!'"), Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверка реквизитов в ТЧ по регл. учету
// 
Процедура ПроверкаРеквизитовТЧРегл(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок)

	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	// Проверим что суммы модернизации относимые на каждый объект ОС в сумме равны данным из шапки документа
	Если ТаблицаОС.Итог("СуммаМодернизацииБУ")<> СтруктураШапкиДокумента.СтоимостьБУ Тогда
		
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По бухгалтерскому учету общая сумма модернизации, не соответствует в итоге суммам, отнесенным на основные средства!';uk='По бухгалтерському обліку загальна сума модернізації, не відповідає в підсумку сумам, віднесеним на основні засоби!'"), Отказ, Заголовок);
							 
	КонецЕсли;

	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
		// Проверим что суммы модернизации относимые на каждый объект ОС в сумме равны данным из шапки документа
		Если СтруктураШапкиДокумента.Дата < глЗначениеПеременной("ДатаНКУ2015") И ТаблицаОС.Итог("СуммаМодернизацииНУ") <> СтруктураШапкиДокумента.СтоимостьНУ Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По налоговому учету общая сумма модернизации, не соответствует в итоге суммам, отнесенным на основные средства!';uk='По податковому обліку загальна сума модернізації, не відповідає в підсумку сумам, віднесеним на основні засоби!'"), Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт

	РеквизитыТабОС = "ОсновноеСредство"; //через запятую
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура(РеквизитыТабОС), Отказ, Заголовок);

	// Логические проверки
	ПроверкаРеквизитовТЧУпр(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок);
	ПроверкаРеквизитовТЧРегл(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок);

КонецПроцедуры // ПроверкаРеквизитов()

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаНаправлений, ТаблицаМестонахождений, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	ДатаДока = Дата;

	СобытияОС           	= Движения.СобытияОС;
	АмортизацияОС          	= Движения.СтоимостьОС;
	ПараметрыАмортизацииОС 	= Движения.ПараметрыАмортизацииОС;
	НазваниеДокумента      	= Метаданные().Представление();

	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации", 	Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТабАмортизации.Колонки.Добавить("ОбъектУчета",            	Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТабАмортизации.Колонки.Добавить("Местонахождение", 			Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТабАмортизации.Колонки.Добавить("Амортизация", 				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла( 15, 2)));
	
	ТекНаправление = СтруктураШапкиДокумента.СпособОтраженияРасходов;
	
	ТаблицаДвиженийАмортизация = АмортизацияОС.Выгрузить();
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл

		ТекОС = СтрокаТЧ.ОсновноеСредство;

		СуммаВСтоимостьУУ 	= 0;
		СуммаНаЗатратыУУ 	= 0;
		
		// в зависимости от вида улучшения
		Если ВидУлучшения = Перечисления.ВидыУлучшения.Ремонт Тогда
			Если СтруктураШапкиДокумента.УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ_УУ Тогда
				СуммаВСтоимостьУУ 	= Макс(0, СтрокаТЧ.СуммаМодернизацииУУ - СтрокаТЧ.СуммаУлучшенияВПределахНормУУ);
				СуммаНаЗатратыУУ 	= Макс(0, СтрокаТЧ.СуммаУлучшенияВПределахНормУУ);
			Иначе	
				СуммаВСтоимостьУУ 	= 0;
				СуммаНаЗатратыУУ 	= СтрокаТЧ.СуммаМодернизацииУУ;
			КонецЕсли;	
		Иначе // Модернизация 
			Если СтруктураШапкиДокумента.УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ_УУ Тогда
				СуммаВСтоимостьУУ 	= Макс(0, СтрокаТЧ.СуммаМодернизацииУУ - СтрокаТЧ.СуммаУлучшенияВПределахНормУУ);
				СуммаНаЗатратыУУ 	= Макс(0, СтрокаТЧ.СуммаУлучшенияВПределахНормУУ);
			Иначе	 
				СуммаВСтоимостьУУ 	= СтрокаТЧ.СуммаМодернизацииУУ;
				СуммаНаЗатратыУУ 	= 0;
			КонецЕсли;	
		КонецЕсли;
		
		// Движения по регистру СобытияОС
		Движение = СобытияОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Событие              = СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента    = НазваниеДокумента;
		Движение.НомерДокумента       = Номер;
		Движение.СуммаЗатрат          = СтрокаТЧ.СуммаМодернизацииУУ;
		

		Если СуммаВСтоимостьУУ <> 0 Тогда
			// Движения по регистру ПараметрыАмортизацииОС
			Движение = ПараметрыАмортизацииОС.Добавить();
			Движение.Период 										= ДатаДока;
			Движение.ОсновноеСредство        						= ТекОС;
			Движение.СрокПолезногоИспользования                 	= СтрокаТЧ.СрокПолезногоИспользованияУУ;
			
			Движение.СрокИспользованияДляВычисленияАмортизации    	= СтрокаТЧ.СрокИспользованияДляВычисленияАмортизацииУУ;
			Движение.СтоимостьДляВычисленияАмортизации    		  	= СтрокаТЧ.СтоимостьДляВычисленияАмортизацииУУ;
			Движение.ОбъемПродукцииРаботДляВычисленияАмортизации 	= Макс(0, СтрокаТЧ.ОбъемПродукцииРаботУУ 
			                                                            	    - СтрокаТЧ.ФактОбъемПродукцииРаботУУ);
			Движение.ЛиквидационнаяСтоимость                     	= СтрокаТЧ.ЛиквидационнаяСтоимостьУУ;
			Движение.ОбъемПродукцииРабот                         	= СтрокаТЧ.ОбъемПродукцииРаботУУ;
			Движение.ПрименитьВТекущемМесяце 					 	= Ложь;
		
			// Движения по регистру СтоимостьОС
			Движение = ТаблицаДвиженийАмортизация.Добавить();
			Движение.ОсновноеСредство        = ТекОС;
			Движение.Амортизация             = 0;
			Движение.Стоимость               = СуммаВСтоимостьУУ;

		КонецЕсли;	
		
		Если СуммаНаЗатратыУУ > 0 Тогда

			Если ТаблицаНаправлений <> Неопределено Тогда
				
				//Затраты списываются по способу отражения расходов по амортзации
				ТекНаправление = ТаблицаНаправлений.Найти(СтрокаТЧ.ОсновноеСредство,"ОС_УУ");
				ТекНаправление = ?(ТекНаправление = Неопределено, Неопределено, ТекНаправление.Направление_УУ);
				                                          
			КонецЕсли;
			
			НоваяСтрока    = ТабАмортизации.Добавить();

			НоваяСтрока.Амортизация            	= СуммаНаЗатратыУУ;
			НоваяСтрока.ОбъектУчета            	= СтрокаТЧ.ОсновноеСредство;
	 		НоваяСтрока.НаправлениеАмортизации 	= ТекНаправление;
			
			ТекМестонахождение 					= ТаблицаМестонахождений.Найти(СтрокаТЧ.ОсновноеСредство,"ОС_УУ");
			НоваяСтрока.Местонахождение 		= ?(ТекМестонахождение = Неопределено, Неопределено, ТекМестонахождение.Местонахождение_УУ);
			
		КонецЕсли;		

	КонецЦикла;

	АмортизацияОС.мПериод          = ДатаДока;
	АмортизацияОС.мТаблицаДвижений = ТаблицаДвиженийАмортизация;
	Движения.СтоимостьОС.ВыполнитьПриход();
	
	// вызов процедуры списания амортизации по направлениям
	УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента);
	
	// Движения по регистру Строительство
	СтроительствоОС       = Движения.СтроительствоОбъектовОсновныхСредств;
	ТаблицаСтроительство = СтроительствоОС.Выгрузить();
	Движение = ТаблицаСтроительство.Добавить();
	Движение.ОбъектСтроительства        = СтруктураШапкиДокумента.ОбъектСтроительства;
	Движение.Сумма                      = ТаблицаПоОС.Итог("СуммаМодернизацииУУ");
	
	СтроительствоОС.мПериод          = ДатаДока;
	СтроительствоОС.мТаблицаДвижений = ТаблицаСтроительство;
	Движения.СтроительствоОбъектовОсновныхСредств.ВыполнитьРасход();


КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаМестонахождений, Отказ, Заголовок)


	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		Возврат;
	КонецЕсли;

	ДатаДока       = Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;

	УправлениеВнеоборотнымиАктивами.ДополнитьТабличнуюЧастьСведениямиОбОСБухНалогРегл(МоментВремени(), ТаблицаПоОС,
	                                                  СтруктураШапкиДокумента, 
													  Отказ, Заголовок, , Истина);

	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;								
													  
	ОперацииОС             		= Движения.СобытияОСОрганизаций;
	ПараметрыАмортизацииОС 		= Движения.ПараметрыАмортизацииОСБухгалтерскийУчет;
	ПараметрыАмортизацииОС_НУ 	= Движения.ПараметрыАмортизацииОСНалоговыйУчет;
	ПроводкиБУ             		= Движения.Хозрасчетный;
	
	// Подготовим таблицу с данными по амортизации для списания амортизации по направлениям затрат
	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации", 	Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТабАмортизации.Колонки.Добавить("ОбъектУчета", 				Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТабАмортизации.Колонки.Добавить("Сумма", 					ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТабАмортизации.Колонки.Добавить("СуммаНУ", 					ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТабАмортизации.Колонки.Добавить("СчетАмортизации", 			Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТабАмортизации.Колонки.Добавить("НалоговоеНазначение", 		Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТабАмортизации.Колонки.Добавить("Местонахождение",			Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
	
	ДатаНКУ2015 = глЗначениеПеременной("ДатаНКУ2015");
	ЭтоДокументДо2015 = (Дата < ДатаНКУ2015);
	
	Для Каждого СтрокаТЧ Из ТаблицаПоОС Цикл

		ТекОС = СтрокаТЧ.ОсновноеСредство;

		НепроизводственныйОС = (СтрокаТЧ.НалоговоеНазначение_ОС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
		
		СуммаВСтоимостьБУ 	= 0;
		СуммаНаЗатратыБУ 	= 0;
		
		СуммаВСтоимостьНУ 	= Макс(0, СтрокаТЧ.СуммаМодернизацииНУ - СтрокаТЧ.СуммаУлучшенияВПределахНормНУ);
		СуммаНаЗатратыНУ 	= СтрокаТЧ.СуммаУлучшенияВПределахНормНУ;
		
		// в зависимости от вида улучшения
		Если ВидУлучшения = Перечисления.ВидыУлучшения.Ремонт Тогда
			Если СтруктураШапкиДокумента.УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ Тогда
				СуммаВСтоимостьБУ 	= Макс(0, СтрокаТЧ.СуммаМодернизацииНУ - СтрокаТЧ.СуммаУлучшенияВПределахНормНУ);
				СуммаНаЗатратыБУ 	= Макс(0, СтрокаТЧ.СуммаУлучшенияВПределахНормНУ + СтрокаТЧ.СуммаМодернизацииБУ - СтрокаТЧ.СуммаМодернизацииНУ);
			Иначе	
				СуммаВСтоимостьБУ 	= 0;
				СуммаНаЗатратыБУ 	= СтрокаТЧ.СуммаМодернизацииБУ;
			КонецЕсли;	
		Иначе // Модернизация 
			Если СтруктураШапкиДокумента.УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ Тогда
				СуммаВСтоимостьБУ 	= Макс(0, СтрокаТЧ.СуммаМодернизацииНУ - СтрокаТЧ.СуммаУлучшенияВПределахНормНУ);
				СуммаНаЗатратыБУ 	= Макс(0, СтрокаТЧ.СуммаУлучшенияВПределахНормНУ + СтрокаТЧ.СуммаМодернизацииБУ - СтрокаТЧ.СуммаМодернизацииНУ);
			Иначе	 
				СуммаВСтоимостьБУ 	= СтрокаТЧ.СуммаМодернизацииБУ;
				СуммаНаЗатратыБУ 	= 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ ЭтоДокументДо2015 Тогда
			СуммаВСтоимостьНУ 	= СуммаВСтоимостьБУ;
			СуммаНаЗатратыНУ 	= СуммаНаЗатратыБУ;
			
			Если НепроизводственныйОС Тогда
				СуммаВСтоимостьНУ = 0;	
				СуммаНаЗатратыНУ = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		// Движения по регистру СобытияОСОрганизаций
		Движение = ОперацииОС.Добавить();
		Движение.Период				= ДатаДока;
		Движение.ОсновноеСредство	= ТекОС;
		Движение.Организация		= ТекОрганизация;
		Движение.Событие 			= СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента	= Строка(СтруктураШапкиДокумента.Ссылка.Метаданные());
		Движение.НомерДокумента		= СтруктураШапкиДокумента.Номер;
		Движение.СуммаЗатратБУ		= СтрокаТЧ.СуммаМодернизацииБУ;
		

		Если СуммаВСтоимостьБУ > 0 Тогда
			// Движения по регистру ПараметрыАмортизации
			Движение = ПараметрыАмортизацииОС.Добавить();
			Движение.Период                                       = ДатаДока;
			Движение.ОсновноеСредство                             = ТекОС;
			Движение.Организация                                  = ТекОрганизация;
			Движение.СрокПолезногоИспользования                   = СтрокаТЧ.СрокПолезногоИспользованияБУ;
			Движение.СрокИспользованияДляВычисленияАмортизации    = СтрокаТЧ.СрокИспользованияДляВычисленияАмортизацииБУ;
			Движение.СтоимостьДляВычисленияАмортизации    		  = СтрокаТЧ.СтоимостьДляВычисленияАмортизацииБУ;
			Движение.ОбъемПродукцииРаботДляВычисленияАмортизации  = Макс(0, СтрокаТЧ.ОбъемПродукцииРаботБУ 
			                                                                - СтрокаТЧ.ФактОбъемПродукцииРаботБУ);
			Движение.ОбъемПродукцииРабот                          = СтрокаТЧ.ОбъемПродукцииРаботБУ;
			Движение.ЛиквидационнаяСтоимость                      = СтрокаТЧ.ЛиквидационнаяСтоимостьБУ;
        КонецЕсли;
			
		Если СуммаВСтоимостьНУ > 0 Тогда
			// Движения по регистру ПараметрыАмортизацииНУ
			Движение = ПараметрыАмортизацииОС_НУ.Добавить();
			Движение.Период                                       = ДатаДока;
			Движение.ОсновноеСредство                             = ТекОС;
			Движение.Организация                                  = ТекОрганизация;
			Движение.СрокПолезногоИспользования                   = СтрокаТЧ.СрокПолезногоИспользованияНУ;
			Движение.СрокИспользованияДляВычисленияАмортизации    = СтрокаТЧ.СрокИспользованияДляВычисленияАмортизацииНУ;
			Движение.СтоимостьДляВычисленияАмортизации    		  = СтрокаТЧ.СтоимостьДляВычисленияАмортизацииНУ;
		КонецЕсли;
		
		// списание модернизации Д СчетУчета К СчетУчетаВнеоборотногоАктива
		Если СтрокаТЧ.СуммаМодернизацииБУ <> 0 ИЛИ СтрокаТЧ.СуммаМодернизацииНУ <> 0 Тогда

			Если СуммаВСтоимостьБУ <> 0 ИЛИ СуммаВСтоимостьНУ <> 0 Тогда
			
				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период       = ДатаДока;
				Проводка.Организация  = ТекОрганизация;
				Проводка.Содержание   = "Модернизация """ + ТекОС + """";
				Проводка.НомерЖурнала = "ОС";
				Проводка.Сумма        = СуммаВСтоимостьБУ;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
					
					Проводка.НалоговоеНазначениеДт  = СтрокаТЧ.НалоговоеНазначение_ОС;
					
				КонецЕсли;	
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
					Если СтрокаТЧ.НалоговоеНазначение_ОС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						Проводка.СуммаНУДт = 0;	
					Иначе	
						Проводка.СуммаНУДт = СуммаВСтоимостьНУ;
					КонецЕсли;	
					
				КонецЕсли;
				
				Проводка.СчетДт       = СтрокаТЧ.СчетУчетаБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", ТекОС);
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
					
					Проводка.НалоговоеНазначениеКт  = СтруктураШапкиДокумента.НалоговоеНазначениеОбъектаСтроительства;
					
				КонецЕсли;	
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
					
					Если СтрокаТЧ.НалоговоеНазначение_ОС = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
						Проводка.СуммаНУКт = 0;	
					Иначе
					    Проводка.СуммаНУКт = СуммаВСтоимостьНУ;
					КонецЕсли;	
					
				КонецЕсли;
				
				Проводка.СчетКт       = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбъектыСтроительства", СтруктураШапкиДокумента.ОбъектСтроительства);
				
				Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
					// организация - не плательщик НДС. 
					Если НепроизводственныйОС Тогда
						// Непроизводственное
						Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение_ОС;
					Иначе	
						Проводка.НалоговоеНазначениеДт = НеОблНДСДеятельность;
					КонецЕсли;	
					
					Проводка.НалоговоеНазначениеКт = НеОблНДСДеятельность;
				КонецЕсли;	
				
			КонецЕсли;	
			
			Если СуммаНаЗатратыБУ <> 0 ИЛИ СуммаНаЗатратыНУ <> 0 Тогда
			
				НоваяСтрока = ТабАмортизации.Добавить();
				
				НоваяСтрока.Сумма                  = СуммаНаЗатратыБУ;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					НоваяСтрока.СуммаНУ          = СуммаНаЗатратыНУ;
				КонецЕсли;	
				НоваяСтрока.ОбъектУчета            = ТекОС;
				НоваяСтрока.НаправлениеАмортизации = ?(СтруктураШапкиДокумента.ИспользоватьОбщийСпособОтраженияРасходов,
				СтруктураШапкиДокумента.СпособОтраженияРасходов,
				СтрокаТЧ.НаправлениеБУ);
				
				НоваяСтрока.СчетАмортизации        = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
				НоваяСтрока.НалоговоеНазначение    = СтруктураШапкиДокумента.НалоговоеНазначениеОбъектаСтроительства;
				
				ТекМестонахождение 					= ТаблицаМестонахождений.Найти(СтрокаТЧ.ОсновноеСредство,"ОС_БУ");
				НоваяСтрока.Местонахождение 		= ?(ТекМестонахождение = Неопределено, Неопределено, ТекМестонахождение.Местонахождение_БУ);
				
			КонецЕсли;	
				
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТабАмортизации <> Неопределено Тогда
		
		// Вызов процедуры списания амортизации по направлениям.
		// Создаются движения по начислению амортизации.
		УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект,
		                                                   Отказ,
														   Заголовок,
														   ТабАмортизации,
														   СтруктураШапкиДокумента,
														   "ОС",
														   "Начисление амортизации ОС");
		
	КонецЕсли;

КонецПроцедуры

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаПоОС, ТаблицаНаправлений, ТаблицаМестонахождений, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаНаправлений, ТаблицаМестонахождений, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаМестонахождений, Отказ, Заголовок);
	

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ,РежимПроведения)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	СтруктураШапкиДокумента.Вставить("ВидСобытияОС",
	                                 СтруктураШапкиДокумента.СобытиеОС.ВидСобытияОС);
	СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеОбъектаСтроительства", 
	                                 СтруктураШапкиДокумента.ОбъектСтроительства.НалоговоеНазначение);
                                                                                                    
	// Получим данные учетной политики                                                             
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;

	СтруктураПолей.Вставить("ОсновноеСредство",             "ОсновноеСредство");

	СтруктураПолей.Вставить("СтоимостьУУ",                  "СтоимостьУУ");
	СтруктураПолей.Вставить("СуммаМодернизацииУУ",          "СуммаМодернизацииУУ");
	СтруктураПолей.Вставить("АмортизацияУУ",                "АмортизацияУУ");
	СтруктураПолей.Вставить("АмортизацияЗаМесяцУУ",         "АмортизацияЗаМесяцУУ");
	СтруктураПолей.Вставить("ЛиквидационнаяСтоимостьУУ",    "ЛиквидационнаяСтоимостьУУ");
	
	СтруктураПолей.Вставить("СрокПолезногоИспользованияУУ", "СрокПолезногоИспользованияУУ");
	СтруктураПолей.Вставить("ФактСрокИспользованияУУ",      "ФактСрокИспользованияУУ");
	
	СтруктураПолей.Вставить("ОбъемПродукцииРаботУУ",        "ОбъемПродукцииРаботУУ");
	СтруктураПолей.Вставить("ФактОбъемПродукцииРаботУУ",    "ФактОбъемПродукцииРаботУУ");
	
	СтруктураПолей.Вставить("СтоимостьБУ",                  "СтоимостьБУ");
	СтруктураПолей.Вставить("СуммаМодернизацииБУ",          "СуммаМодернизацииБУ");
	СтруктураПолей.Вставить("АмортизацияБУ",                "АмортизацияБУ");
	СтруктураПолей.Вставить("АмортизацияЗаМесяцБУ",         "АмортизацияЗаМесяцБУ");
	СтруктураПолей.Вставить("ЛиквидационнаяСтоимостьБУ",    "ЛиквидационнаяСтоимостьБУ");
	
	СтруктураПолей.Вставить("СрокПолезногоИспользованияБУ", "СрокПолезногоИспользованияБУ");
	СтруктураПолей.Вставить("ФактСрокИспользованияБУ",      "ФактСрокИспользованияБУ");
	
	СтруктураПолей.Вставить("ОбъемПродукцииРаботБУ",        "ОбъемПродукцииРаботБУ");
	СтруктураПолей.Вставить("ФактОбъемПродукцииРаботБУ",    "ФактОбъемПродукцииРаботБУ");

	СтруктураПолей.Вставить("СуммаМодернизацииНУ",          "СуммаМодернизацииНУ");
	
	СтруктураПолей.Вставить("СтоимостьНУ",                  "СтоимостьНУ");
	СтруктураПолей.Вставить("АмортизацияНУ",                "АмортизацияНУ");
	СтруктураПолей.Вставить("АмортизацияЗаМесяцНУ",         "АмортизацияЗаМесяцНУ");
	СтруктураПолей.Вставить("ФактСрокИспользованияНУ",      "ФактСрокИспользованияНУ");
	СтруктураПолей.Вставить("СрокПолезногоИспользованияНУ", "СрокПолезногоИспользованияНУ");
	
	СтруктураПолей.Вставить("СуммаУлучшенияВПределахНормУУ", 			"СуммаУлучшенияВПределахНормУУ");
	СтруктураПолей.Вставить("СуммаУлучшенияВПределахНормНУ", 			"СуммаУлучшенияВПределахНормНУ");
	
	СтруктураПолей.Вставить("СрокИспользованияДляВычисленияАмортизацииУУ", 	"СрокИспользованияДляВычисленияАмортизацииУУ");
	СтруктураПолей.Вставить("СрокИспользованияДляВычисленияАмортизацииБУ", 	"СрокИспользованияДляВычисленияАмортизацииБУ");
	СтруктураПолей.Вставить("СрокИспользованияДляВычисленияАмортизацииНУ", 	"СрокИспользованияДляВычисленияАмортизацииНУ");
	СтруктураПолей.Вставить("СтоимостьДляВычисленияАмортизацииУУ", 			"СтоимостьДляВычисленияАмортизацииУУ");
	СтруктураПолей.Вставить("СтоимостьДляВычисленияАмортизацииБУ", 			"СтоимостьДляВычисленияАмортизацииБУ");
	СтруктураПолей.Вставить("СтоимостьДляВычисленияАмортизацииНУ", 			"СтоимостьДляВычисленияАмортизацииНУ");

	РезультатЗапросаПоОС = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей);
	ТаблицаПоОС          = РезультатЗапросаПоОС.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоОС, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	//проверка, нет ли списанных ОС в табличной части
	УправлениеВнеоборотнымиАктивами.ПроверитьНаСписанность(Дата, Организация, ТаблицаПоОС, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(ОС, "ОсновноеСредство", НСтр("ru='Основное средство';uk='Основний засіб'"), Отказ, Заголовок);

	ТаблицаНаправлений = Неопределено;

	Если НЕ СтруктураШапкиДокумента.ИспользоватьОбщийСпособОтраженияРасходов Тогда
		// подготовка таблицы для списания
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекПериод",      МоментВремени());
		СписокОС = ТаблицаПоОС.ВыгрузитьКолонку("ОсновноеСредство");
		Запрос.УстановитьПараметр("СписокОС",       СписокОС);
		Запрос.Текст = "ВЫБРАТЬ
		               |	СпособыОтраженияРасходов_УУ.ОсновноеСредство КАК ОС_УУ,
		               |	СпособыОтраженияРасходов_УУ.СпособыОтраженияРасходовПоАмортизации КАК Направление_УУ
		               |ИЗ
		               |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних(&ТекПериод, ОсновноеСредство В (&СписокОС)) КАК СпособыОтраженияРасходов_УУ";
		ТаблицаНаправлений = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
	
	// Подготовим таблицу местонахождения для ТабАмортизации
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекОрганизация",  СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ТекПериод",       Дата);
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаПоОС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
   	|	ОсновноеСредство
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник
	|";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство 									КАК ОсновноеСредство,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство 	КАК ОС_БУ,
	|	МестонахождениеОССрезПоследних.ОсновноеСредство 					КАК ОС_УУ,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение 	КАК Местонахождение_БУ,
	|	МестонахождениеОССрезПоследних.Местонахождение                  	КАК Местонахождение_УУ
	|ИЗ
	|	ОсновныеСредства
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства) И Организация = &ТекОрганизация) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	|	ПО ОсновныеСредства.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства)) КАК МестонахождениеОССрезПоследних
	|	ПО ОсновныеСредства.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство";
	ТаблицаМестонахождений = Запрос.Выполнить().Выгрузить();
	
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаПоОС, ТаблицаНаправлений, ТаблицаМестонахождений, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда 
		
		ДатаНКУ2015 = глЗначениеПеременной("ДатаНКУ2015");
		Если Дата >= ДатаНКУ2015 Тогда
			СтоимостьНУ = СтоимостьБУ;
			Для Каждого СтрокаОС Из ОС Цикл
				СтрокаОС.СуммаМодернизацииНУ = СтрокаОС.СуммаМодернизацииБУ;
			КонецЦикла; 
		КонецЕсли;	
		
		мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
		
		Если НЕ Отказ Тогда
			Если НЕ мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
				СтоимостьНУ = 0;	
				Для Каждого СтрокаОС Из ОС Цикл
					СтрокаОС.СуммаМодернизацииНУ = 0;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;	
		
	КонецЕсли;	
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
