////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С УНИВЕРСАЛЬНЫМ ПОИСКОМ ДАННЫХ

//функция создает сервисный объект для поиска номенклатуры
Функция СоздатьОбъектПоискаДанныхДляНоменклатуры(Знач ЭлементФормыЗначениеОтбора, Знач ОбъектФормыСписок, Знач СписокДанных) Экспорт
	
	мПоискОбъектовВСпискахДанных = Обработки.ПоискОбъектовВСпискахДанных.Создать();
	мПоискОбъектовВСпискахДанных.ТипОбъектовПоиска = Тип("СправочникСсылка.Номенклатура");
	мПоискОбъектовВСпискахДанных.ПрефиксНазванияСпискаДляСохранения = "мСписокЗначенийОтбораНоменклатуры.";

	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам = Новый СписокЗначений();
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Наименование", НСтр("ru='Наименование';uk='Найменування'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Артикул", "Артикул");
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("НаименованиеПолное", НСтр("ru='Полное наименование';uk='Повне найменування'"));

	мПоискОбъектовВСпискахДанных.ОбъектФормыЗначениеОтбораСпискаДанных = ЭлементФормыЗначениеОтбора;
	мПоискОбъектовВСпискахДанных.ОбъектФормыСписок = ОбъектФормыСписок;
	мПоискОбъектовВСпискахДанных.Список = СписокДанных;
	мПоискОбъектовВСпискахДанных.ПрефиксПутиСохраненияНастроекПользователя = "Справочники.Номенклатура.ФормаСписка";
		
	Возврат мПоискОбъектовВСпискахДанных;
	
КонецФункции

//функция создает сервисный объект для поиска Контрагенты
Функция СоздатьОбъектПоискаДанныхДляКонтрагентов(Знач ЭлементФормыЗначениеОтбора, Знач ОбъектФормыСписок, Знач СписокДанных) Экспорт
	
	мПоискОбъектовВСпискахДанных = Обработки.ПоискОбъектовВСпискахДанных.Создать();
	мПоискОбъектовВСпискахДанных.ТипОбъектовПоиска = Тип("СправочникСсылка.Контрагенты");
	мПоискОбъектовВСпискахДанных.ПрефиксНазванияСпискаДляСохранения = "мСписокЗначенийОтбораКонтрагенты.";

	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам = Новый СписокЗначений();
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Код", "Код");
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Наименование", НСтр("ru='Наименование';uk='Найменування'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("НаименованиеПолное", НСтр("ru='Полное наименование';uk='Повне найменування'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("КодПоЕДРПОУ", НСтр("ru='Код ЕГРПОУ';uk='Код ЄДРПОУ'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("ИНН", НСтр("ru='ИНН';uk='ІПН'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("НомерСвидетельства", НСтр("ru='Номер свидетельства';uk='Номер свідоцтва'"));

	мПоискОбъектовВСпискахДанных.ОбъектФормыЗначениеОтбораСпискаДанных = ЭлементФормыЗначениеОтбора;
	мПоискОбъектовВСпискахДанных.ОбъектФормыСписок = ОбъектФормыСписок;
	мПоискОбъектовВСпискахДанных.Список = СписокДанных;
	мПоискОбъектовВСпискахДанных.ПрефиксПутиСохраненияНастроекПользователя = "Справочники.Контрагенты.ФормаСписка";
		
	Возврат мПоискОбъектовВСпискахДанных;
	
КонецФункции

//функция создает сервисный объект для поиска Физические лица
Функция СоздатьОбъектПоискаДанныхДляФизЛиц(Знач ЭлементФормыЗначениеОтбора, Знач ОбъектФормыСписок, Знач СписокДанных) Экспорт
	
	мПоискОбъектовВСпискахДанных = Обработки.ПоискОбъектовВСпискахДанных.Создать();
	мПоискОбъектовВСпискахДанных.ТипОбъектовПоиска = Тип("СправочникСсылка.ФизическиеЛица");
	мПоискОбъектовВСпискахДанных.ПрефиксНазванияСпискаДляСохранения = "мСписокЗначенийОтбораФизическиеЛица.";

	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам = Новый СписокЗначений();
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Наименование", НСтр("ru='Наименование';uk='Найменування'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("ИНН", НСтр("ru='ИНН';uk='ІПН'"));
	мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("СтраховойНомерПФР", НСтр("ru='Страховой номер ПФР';uk='Страховий номер ПФР'"));

	мПоискОбъектовВСпискахДанных.ОбъектФормыЗначениеОтбораСпискаДанных = ЭлементФормыЗначениеОтбора;
	мПоискОбъектовВСпискахДанных.ОбъектФормыСписок = ОбъектФормыСписок;
	мПоискОбъектовВСпискахДанных.Список = СписокДанных;
	мПоискОбъектовВСпискахДанных.ПрефиксПутиСохраненияНастроекПользователя = "Справочники.ФизическиеЛица.ФормаСписка";
		
	Возврат мПоискОбъектовВСпискахДанных;
	
КонецФункции

