
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА СЕРВЕРЕ

// бит_MZyubin Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_НастройкиРежимовТрансляции;
	
	//// вызов механизма защиты
	////бит_МодульЗащиты.ПроверитьВозможностьРаботы(ЭтаФорма,МетаданныеОбъекта.ПолноеИмя(),Отказ);
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//фКэшЗначений = Новый Структура;
	//фКэшЗначений.Вставить("ВидОбъектаДокумент",Перечисления.бит_ВидыОбъектовСистемы.Документ);
	
КонецПроцедуры

// бит_MZyubin Процедура - обработчик события "НачалоВыбора" поля ввода "НачалоВыбора".
//
&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//СписокВидовОбъектов = Новый СписокЗначений;
	//СписокВидовОбъектов.Добавить(фКэшЗначений.ВидОбъектаДокумент);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ВидыОбъектов"           ,СписокВидовОбъектов);
	//ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   ,Запись.ОбъектСистемы);
	//ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемыУправляемая",ПараметрыФормы,Элемент);
	
	
КонецПроцедуры
