
Функция ПолучитьДанныеФотоСнимка() Экспорт
	
	Данные = Неопределено;
	
	#Если МобильноеПриложениеКлиент Тогда 
		//ЗапуститьПриложение("MediaStore.ACTION_IMAGE_CAPTURE");
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			ТипКамеры = ТипКамерыУстройства.Задняя;
			
			РазрешениеВысота = 900;
			РазрешениеШирина = 900;
			
			
			пКачество = 100;
			
			Если РазрешениеВысота <> 0 И РазрешениеШирина <> 0 Тогда
				РазрешениеКамеры = Новый РазрешениеКамерыУстройства;
				РазрешениеКамеры.Высота = РазрешениеВысота;
				РазрешениеКамеры.Ширина = РазрешениеШирина;
				
				Данные = СредстваМультимедиа.СделатьФотоснимок(ТипКамеры, РазрешениеКамеры, пКачество,,ТипПодсветкиКамеры.Выключена); 
				
			Иначе
				Данные = СредстваМультимедиа.СделатьФотоснимок(ТипКамеры,  , пКачество,,ТипПодсветкиКамеры.Выключена); 
			КонецЕсли; 
			
			Возврат Данные; 
		Иначе 
			Сообщить("Даний пристрій не підтримує фотознімок!") 
		КонецЕсли; 
		
	#КонецЕсли
	
	Возврат Данные;
	
КонецФункции 



