
#Область ПолучениеЦен
функция ПолучитьКурсВалютыЦен(Дата,Валюта= Неопределено) Экспорт
	
	Курс = 0;
	Если Валюта = Неопределено Тогда 
		Валюта = Справочники.Валюты.НайтиПоКоду("978");	
	КонецЕсли;
	ЗапросПоКурсу = новый Запрос;
	ЗапросПоКурсу.Текст =  "ВЫБРАТЬ
	                       |	КурсыВалютДляЦенСрезПоследних.Курс
	                       |ИЗ
	                       |	РегистрСведений.КурсыВалютДляЦен.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютДляЦенСрезПоследних";
	ЗапросПоКурсу.УстановитьПараметр("Валюта",Валюта);
	ЗапросПоКурсу.УстановитьПараметр("Дата",Дата);

	
	РезультатЗапроса =  ЗапросПоКурсу.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		
		Курс = РезультатЗапроса[0].Курс;
		
	КонецЕсли;
	
	Возврат Курс;
	
КонецФункции

Функция ПолучитьБазовуюЦенуРоссия(Номенклатура,Дата) Экспорт 
	Цена = 0;
	
	ЗапросПоЦене = новый Запрос;
	ЗапросПоЦене.Текст = "ВЫБРАТЬ
	                     |	ЦеныНоменклатурыСрезПоследних.Цена
	                     |ИЗ
	                     |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                     |			,
	                     |			Номенклатура = &Номенклатура
	                     |				И ТипЦен = &ТипЦен
	                     |				И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросПоЦене.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоЦене.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("УТ0000072"));
	
	РезультатЗапроса = ЗапросПоЦене.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
		
		Цена = РезультатЗапроса.Выгрузить()[0].Цена;
		
	КонецЕсли;
	
	Возврат Цена;
КонецФункции

Функция ПолучитьБазовуюЦенуЕвропа(Номенклатура,Дата) Экспорт 
	Цена = 0;
	
	ЗапросПоЦене = новый Запрос;
	ЗапросПоЦене.Текст = "ВЫБРАТЬ
	                     |	ЦеныНоменклатурыСрезПоследних.Цена
	                     |ИЗ
	                     |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                     |			,
	                     |			Номенклатура = &Номенклатура
	                     |				И ТипЦен = &ТипЦен
	                     |				И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросПоЦене.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоЦене.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("УТ0000194"));
	
	РезультатЗапроса = ЗапросПоЦене.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
		
		Цена = РезультатЗапроса.Выгрузить()[0].Цена;
		
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

Функция ПолучитьРозничнуюЦенуБУТовара(Номенклатура, Характеристика, Дата = Неопределено) Экспорт

	// + 003565 ДДГ 16 окт 2020
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Цена = 0;

	ЗапросПоЦене = новый Запрос;
	ЗапросПоЦене.Текст = "ВЫБРАТЬ
	                     |	ЦеныНоменклатурыСрезПоследних.Цена
	                     |ИЗ
	                     |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                     |			&Дата,
	                     |			Номенклатура = &Номенклатура
	                     |				И ТипЦен = &ТипЦен
	                     |				И ХарактеристикаНоменклатуры = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросПоЦене.УстановитьПараметр("Номенклатура",		Номенклатура);
	ЗапросПоЦене.УстановитьПараметр("Характеристика",	Характеристика);
	ЗапросПоЦене.УстановитьПараметр("ТипЦен", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));	// Розница СПБ-МСК
	ЗапросПоЦене.УстановитьПараметр("Дата",				Дата);

	РезультатЗапроса = ЗапросПоЦене.Выполнить();

	Если не РезультатЗапроса.Пустой() Тогда 

		Цена = РезультатЗапроса.Выгрузить()[0].Цена;

	КонецЕсли;

	Возврат Цена;
	// - 003565 ДДГ 16 окт 2020

КонецФункции

// + 50979 ДДГ 23 мар 2022
// обнов PN3-133 ДДГ  4 окт 2023
Функция ПолучитьЦенуТовара(ТипЦен, Валюта = Неопределено, Номенклатура, Характеристика = Неопределено, Дата = Неопределено) Экспорт

	Если Валюта = Неопределено Тогда
		Валюта = ТипЦен.ВалютаЦены;
	КонецЕсли;

	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Цена = 0;

	ЗапросПоЦене = новый Запрос;
	ЗапросПоЦене.Текст = "ВЫБРАТЬ
	                     |	ЦеныНоменклатурыСрезПоследних.Цена
	                     |ИЗ
	                     |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                     |			&Дата,
	                     |			Номенклатура = &Номенклатура
	                     |				И ТипЦен = &ТипЦен
						 |				И Валюта = &Валюта
	                     |				И ХарактеристикаНоменклатуры = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросПоЦене.УстановитьПараметр("Номенклатура",		Номенклатура);
	ЗапросПоЦене.УстановитьПараметр("Характеристика",	Характеристика);
	ЗапросПоЦене.УстановитьПараметр("ТипЦен",			ТипЦен);
	ЗапросПоЦене.УстановитьПараметр("Валюта",			Валюта);
	ЗапросПоЦене.УстановитьПараметр("Дата",				Дата);

	РезультатЗапроса = ЗапросПоЦене.Выполнить();

	Если не РезультатЗапроса.Пустой() Тогда 

		Цена = РезультатЗапроса.Выгрузить()[0].Цена;

	КонецЕсли;

	Возврат Цена;

КонецФункции

Функция ПолучитьЦеныТоваров(ТипЦен, Валюта = Неопределено, МассивТоваров, Дата = Неопределено) Экспорт

	Если МассивТоваров.Количество() < 1 Тогда
		ПустаяТаблица = Новый ТаблицаЗначений;
		КолонкиПТ = ПустаяТаблица.Колонки;
		КолонкиПТ.Добавить("Номенклатура");
		КолонкиПТ.Добавить("ХарактеристикаНоменклатуры");
		КолонкиПТ.Добавить("Цена");
		Возврат ПустаяТаблица;
	КонецЕсли;

	Если Валюта = Неопределено Тогда
		Валюта = ТипЦен.ВалютаЦены;
	КонецЕсли;

	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	ЗапросПоЦене = новый Запрос;
	ЗапросПоЦене.Текст = "
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	Справочник.Номенклатура
	|КАК
	|	СпрНоменклатура
	|
	|ГДЕ Ссылка В (&МассивТоваров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрХарактеристики.Владелец КАК Номенклатура,
	|	СпрХарактеристики.Ссылка КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры
	|КАК
	|	СпрХарактеристики
	|
	|ГДЕ Ссылка В (&МассивТоваров)
	|;
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры,
	|	ISNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	Товары
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|		&Дата,
	|		ТипЦен = &ТипЦен
	|		И Валюта = &Валюта
	|		И (Номенклатура, ХарактеристикаНоменклатуры) В (
	|			ВЫБРАТЬ Номенклатура, ХарактеристикаНоменклатуры ИЗ Товары
	|		)
	|) КАК ЦеныНоменклатурыСрезПоследних
	|ПО Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	| И Товары.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|
	|";

	ЗапросПоЦене.УстановитьПараметр("МассивТоваров",	МассивТоваров);
	ЗапросПоЦене.УстановитьПараметр("ТипЦен",			ТипЦен);
	ЗапросПоЦене.УстановитьПараметр("Валюта",			Валюта);
	ЗапросПоЦене.УстановитьПараметр("Дата",				Дата);

	РезультатЗапроса = ЗапросПоЦене.Выполнить();

	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции

Функция ИзвлечьЦенуИзТаблицыЦен(ТаблицаЦен, Номенклатура, Характеристика = Неопределено) Экспорт

	Цена = 0;

	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",				Номенклатура);
	СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры",	Характеристика);

	НайденныеСтроки = ТаблицаЦен.НайтиСтроки(СтруктураПоиска);

	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		Цена = НайденнаяСтрока.Цена;
	КонецЕсли;

	Возврат Цена;

КонецФункции
// - 50979 ДДГ 23 мар 2022

// + S1-230 ДДГ 23 ноя 2024
Функция ПолучитьДанныеПоследнейУстановленнойЦеныНаТовар(ТипЦен = NULL, Валюта = NULL, СпособРасчетаЦены = NULL, Номенклатура, Характеристика = Неопределено, Дата = Неопределено) Экспорт

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Период"					, Дата(1,1,1));
	СтруктураВозврата.Вставить("ТипЦен"					, Неопределено);
	СтруктураВозврата.Вставить("Валюта"					, Неопределено);
	СтруктураВозврата.Вставить("СпособРасчетаЦены"		, Неопределено);
	СтруктураВозврата.Вставить("ПроцентСкидкиНаценки"	, 0);
	СтруктураВозврата.Вставить("Цена"					, 0);
	СтруктураВозврата.Вставить("ПроцентПродажи"			, 0);

	Если Валюта = NULL И ТипЦен <> NULL Тогда
		Валюта = ТипЦен.ВалютаЦены;
	КонецЕсли;

	Если СпособРасчетаЦены = NULL И ТипЦен <> NULL Тогда
		СпособРасчетаЦены = ТипЦен.СпособРасчетаЦены;
	КонецЕсли;

	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	ЗапросПоЦене = новый Запрос;
	ЗапросПоЦене.Текст = "
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Период,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.ПроцентСкидкиНаценки,
	|	ЦеныНоменклатурыСрезПоследних.СпособРасчетаЦены,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.ТипЦен.ИспользоватьПроцентЦеныСвязанногоТовара
	|		ТОГДА 100 + ЦеныНоменклатурыСрезПоследних.ПроцентСкидкиНаценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентПродажи
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|		&Дата
	|		, Номенклатура = &Номенклатура
	|		И ХарактеристикаНоменклатуры = &Характеристика
	|		И ВЫБОР
	|			КОГДА &ТипЦен IS NULL
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ТипЦен = &ТипЦен
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &Валюта IS NULL
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ Валюта = &Валюта
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &СпособРасчетаЦены IS NULL
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ СпособРасчетаЦены = &СпособРасчетаЦены
	|		КОНЕЦ
	|) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Период УБЫВ
	|";
	ЗапросПоЦене.УстановитьПараметр("Номенклатура"			, Номенклатура);
	ЗапросПоЦене.УстановитьПараметр("Характеристика"		, Характеристика);
	ЗапросПоЦене.УстановитьПараметр("Дата"					, Дата);
	ЗапросПоЦене.УстановитьПараметр("ТипЦен"				, ТипЦен);
	ЗапросПоЦене.УстановитьПараметр("Валюта"				, Валюта);
	ЗапросПоЦене.УстановитьПараметр("СпособРасчетаЦены"		, СпособРасчетаЦены);

	РезультатЗапроса = ЗапросПоЦене.Выполнить();
	ВыборкаРезульта  = РезультатЗапроса.Выбрать();

	Если ВыборкаРезульта.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаРезульта);
	КонецЕсли;

	Возврат СтруктураВозврата;

КонецФункции
// - S1-230 ДДГ 23 ноя 2024
#КонецОбласти

#Область ПолучениеДанныхПоТоварам
//////////////////////// ABC-классификация ////////////////////////
Функция ПолучитьКоефициентНаценки(Цена,Номенклатура) Экспорт 
	Коеф = 0;
	Группа= Неопределено;
	ЗапросПоГруппе = новый Запрос;
	ЗапросПоГруппе.Текст =  "ВЫБРАТЬ
	                        |	ABCКлассификацияНоменклатуры.Группа
	                        |ИЗ
	                        |	РегистрСведений.ABCКлассификацияНоменклатуры КАК ABCКлассификацияНоменклатуры
	                        |ГДЕ
	                        |	ABCКлассификацияНоменклатуры.Номенклатура = &Номенклатура";
	ЗапросПоГруппе.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = ЗапросПоГруппе.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		
		Группа = РезультатЗапроса[0].Группа;
		
	КонецЕсли;
	
	Если Группа = Неопределено Тогда 
		
	ИначеЕсли Группа = Перечисления.ABCDКласификацияНоменклатуры.A Тогда 
		Если Цена> 1 и Цена<=100 Тогда 
			Коеф = 1.3;	
		ИначеЕсли Цена> 100 и Цена<=500  Тогда 
			Коеф = 1.2;	
		ИначеЕсли Цена> 500 и Цена<=1000  Тогда 
			Коеф = 1.1;	
		Иначе 
			Коеф = 0;	
		КонецЕсли;
	ИначеЕсли Группа = Перечисления.ABCDКласификацияНоменклатуры.B Тогда 
		Если Цена> 1 и Цена<=100 Тогда 
			Коеф = 1.1;	
		ИначеЕсли Цена> 100 и Цена<=500  Тогда 
			Коеф = 1;	
		ИначеЕсли Цена> 500 и Цена<=1000  Тогда 
			Коеф = 0.9;	
		Иначе 
			Коеф = 0;	
		КонецЕсли;
	ИначеЕсли Группа = Перечисления.ABCDКласификацияНоменклатуры.C Тогда 
		Если Цена> 1 и Цена<=100 Тогда 
			Коеф = 0.9;	
		ИначеЕсли Цена> 100 и Цена<=500  Тогда 
			Коеф = 0.8;	
		ИначеЕсли Цена> 500 и Цена<=1000  Тогда 
			Коеф = 0.7;	
		Иначе 
			Коеф = 0;	
		КонецЕсли;
	ИначеЕсли Группа = Перечисления.ABCDКласификацияНоменклатуры.D Тогда 
		Если Цена> 1 и Цена<=100 Тогда 
			Коеф = 0.6;	
		ИначеЕсли Цена> 100 и Цена<=500  Тогда 
			Коеф = 0.6;	
		ИначеЕсли Цена> 500 и Цена<=1000  Тогда 
			Коеф = 0.6;	
		Иначе 
			Коеф = 0;	
		КонецЕсли;
	ИначеЕсли Группа = Перечисления.ABCDКласификацияНоменклатуры.E Тогда 
		Если Цена> 1 и Цена<=100 Тогда 
			Коеф = 1.3;	
		ИначеЕсли Цена> 100 и Цена<=500  Тогда 
			Коеф = 1.3;	
		ИначеЕсли Цена> 500 и Цена<=1000  Тогда 
			Коеф = 1.3;	
		Иначе 
			Коеф = 0;	
		КонецЕсли;

		
	КонецЕсли;	
	Возврат 1;	
КонецФункции

Функция ПолучитьТекущююГруппу(Номенклатура) Экспорт
	
	ВозвраЩаемоеЗначение = "";
	
	ЗапросПоГруппе = новый запрос;
	ЗапросПоГруппе.Текст =  "ВЫБРАТЬ
	                        |	ABCКлассификацияНоменклатурыСрезПоследних.Группа
	                        |ИЗ
	                        |	РегистрСведений.ABCКлассификацияНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ABCКлассификацияНоменклатурыСрезПоследних
	                        |ГДЕ
	                        |	ABCКлассификацияНоменклатурыСрезПоследних.Номенклатура = &Номенклатура" ;
	ЗапросПоГруппе.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = ЗапросПоГруппе.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		ВозвраЩаемоеЗначение = РезультатЗапроса[0].Группа;
	КонецЕсли;
	
	Возврат ВозвраЩаемоеЗначение;
КонецФункции
//

// + ДДГ 27 янв 2023
Функция ПолучитьОстатокТовара(Номенклатура, Характеристика = Неопределено, СкладИлиМассив = Неопределено, Дата = Неопределено) Экспорт

	ВсеСклады = Ложь;
	МассивСкладов = СкладИлиМассив;

	Если ТипЗнч(МассивСкладов) = Тип("Массив") Тогда
		// ничего не делаем

	ИначеЕсли ТипЗнч(МассивСкладов) = Тип("СправочникСсылка.Склады") Тогда
		Склад = МассивСкладов;
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(Склад);

	ИначеЕсли МассивСкладов = Неопределено
	 ИЛИ МассивСкладов = NULL
	 ИЛИ ТипЗнч("МассивСкладов") = Тип("Булево")
	Тогда
		ВсеСклады = Истина;

	Иначе
		ВызватьИсключение "ПолучитьОстатокТовара параметр неверного типа: МассивСкладов " + МассивСкладов;
	КонецЕсли;

	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Остаток = 0;

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|		&Дата
		|		, Номенклатура = &Номенклатура
		|		И ХарактеристикаНоменклатуры = &Характеристика
		|		И ВЫБОР
		|			КОГДА &ВсеСклады
		|			ТОГДА ИСТИНА
		|			ИНАЧЕ Склад В (&МассивСкладов)
		|		КОНЕЦ
		|) КАК ТоварыНаСкладахОстатки
	|";
	Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура);
	Запрос.УстановитьПараметр("Характеристика"	, Характеристика);
	Запрос.УстановитьПараметр("МассивСкладов"	, МассивСкладов);
	Запрос.УстановитьПараметр("ВсеСклады"		, ВсеСклады);
	Запрос.УстановитьПараметр("Дата"			, Дата);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Остаток = РезультатЗапроса.Выгрузить()[0].КоличествоОстаток;
	КонецЕсли;

	Возврат Остаток;

КонецФункции
// - ДДГ 27 янв 2023

Функция ПолучитьЗначениеСойства(Харатеристика,Свойство)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Объект = &Объект
	               |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект",Харатеристика);				   
	Запрос.УстановитьПараметр("Свойство",Свойство);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		
		Возврат РезультатЗапроса[0].Значение;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// + S1-230 ДДГ 29 ноя 2024
// обнов S1-468 ДДГ 17 фев 2025
Функция ЭтаУслугаДопустимаКакТовар(НоменклатураУслуги = Неопределено, Знач ВидНоменклатуры = Неопределено, СоотвУслуг = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда

		Если НЕ ЗначениеЗаполнено(НоменклатураУслуги) Тогда
			Возврат Ложь;
		КонецЕсли;

		ВидНоменклатуры = НоменклатураУслуги.ВидНоменклатуры;

	КонецЕсли;

	Если СоотвУслуг = Неопределено Тогда
		СоотвУслуг = СфСоотвУслугДопустимыхКакТовары();
	КонецЕсли;

	Допустимо = СоотвУслуг.Получить(ВидНоменклатуры);

	Возврат Допустимо = Истина;

КонецФункции

Функция СфСоотвУслугДопустимыхКакТовары() Экспорт

	СоотвУслуг = Новый Соответствие;
	СоотвУслуг.Вставить(Справочники.ВидыНоменклатуры.Гарантия, Истина);
	СоотвУслуг.Вставить(Справочники.ВидыНоменклатуры.Оплата  , Истина);

	Возврат СоотвУслуг;

КонецФункции
// - S1-230 ДДГ 29 ноя 2024
#КонецОбласти

#Область ПодсистемаРаботыСБизнесПроцессами
//Функция запускаемая регламентным заданием
Функция ПереводСтатусов() Экспорт 
	
//	ТаблицаЗаказовБезБП = ПолучитьЗаказыБезБП();

	ТаблицаЗаказовБезБП = ПолучитьЗаказыБезБП_Новая();

	Для каждого СтрокаТаблицы Из ТаблицаЗаказовБезБП цикл

//		Если (не ((СокрЛП(СтрокаТаблицы.Статускод) = "10") или (СокрЛП(СтрокаТаблицы.Статускод) = "35") или (СокрЛП(СтрокаТаблицы.Статускод) = "800"))) и СтрокТоваров > 0 Тогда  

			// + S1-545 ДДГ 26 мар 2025
			БП = ЗапуститьЗаказ(СтрокаТаблицы.Ссылка, СтрокаТаблицы.Дата, Ложь);
			// - S1-545 ДДГ 26 мар 2025

//			Если БП = Неопределено Тогда
//				Продолжить;
//			КонецЕсли;

//			Шлюз = Константы.БП_ИспользуемыйSMSШлюз.Получить();
			//Шлюз.ПолучитьОбъект().ОтправитьСМС("Новый заказ " + Заказ.номер,"+380936839334");
//		КонецЕсли;
		
	КонецЦикла;
	
	
	//Контроль оплаты 
	//Пишем систему которая будет проверять 1 раз в 10 минут зашла ли оплата от покупателя
	//Если зашла, закрываем задачу если под ответственность менеджера тогда тоже закрываем
	
	
	//Задачи заказа
	////ОбработатьЗадачи("Отправить письмо и смс заказ зарегистрирован");
	ОбработатьЗадачи("Система ждет оплаты");
	//ОбработатьЗадачи("Система ждет протавление способов доставки");
	//Задачи строки заказа
	ОбработатьЗадачи("Система ждет реакцию поставщика");
	ОбработатьЗадачи("Система ждет прихода товара от поставщика");
	ОбработатьЗадачи("Ожидание перемещения товара");
	ОбработатьЗадачи("Система ждет выполнения дочерних БП");
	ОбработатьЗадачи("Уточнить у покупателя продление резерва");

//	ОбработатьЗадачиВыдатьТовары();

	////ПроверитьПросроченныеЗадачи();

КонецФункции

Процедура ПроверитьПросроченныеЗадачи()
	ЗапросПоЗадачам = новый запрос;
	ЗапросПоЗадачам.Текст = "ВЫБРАТЬ
	                        |	БП_ЗадачиИсполнителей.Ссылка
	                        |ИЗ
	                        |	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
	                        |ГДЕ
	                        |	БП_ЗадачиИсполнителей.КрайнийСрок < &ТекущаяДата
	                        |	И БП_ЗадачиИсполнителей.КрайнийСрок <> ДАТАВРЕМЯ(1, 1, 1)
	                        |	И не БП_ЗадачиИсполнителей.Выполнена";
	ЗапросПоЗадачам.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	РезультатЗапроса = ЗапросПоЗадачам.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат из РезультатЗапроса цикл
		Если не СтрокаРезультат.Ссылка.ОтправленноПисьмоПоПросроченнымЗадачам Тогда 
			Пользователь  = СтрокаРезультат.Ссылка.Исполнитель;	
			ЕмейлПользователя  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Пользователь);
			
			
			Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
			Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("robot@7detalei.ru");
			Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
			Письмо.Тема 			 = "Просроченна задача "+СтрокаРезультат.Ссылка.Номер ;
			Письмо.Дата              = ТекущаяДата();
			Письмо.ЕстьВложения      = Ложь;
			Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
			Письмо.КодировкаПисьма   = "koi8-r";
			Письмо.ЗаголовокПисьма   = "Просроченна задача "+СтрокаРезультат.Ссылка.Номер;
			Письмо.ОтправительАдресЭлектроннойПочты =  "robot@7detalei.ru";
			Письмо.Кому              = ЕмейлПользователя;
			Письмо.КомуПредставление = Пользователь.Наименование;
			Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
			Письмо.ТекстПисьма       = "";
			Письмо.ПроверитьЗаполнение();
			
			Получатели = Письмо.КомуТЧ.Добавить();
			Получатели.АдресЭлектроннойПочты = ЕмейлПользователя;
			Получатели.Представление 	     = Пользователь;
			
			Письмо.ТекстПисьма = "<HTML>Просроченна задача "+СтрокаРезультат.Ссылка.Номер+".<BR>Тема задачи:"+СтрокаРезультат.Ссылка.Наименование+"+<BR>Обратите внимание важность выполнения задач в срок!</HTML>";
			Письмо.ОтправитьПисьмо();
			
			ОБ = СтрокаРезультат.Ссылка.ПолучитьОбъект();
			Об.ОтправленноПисьмоПоПросроченнымЗадачам = Истина;
			Об.Записать();
		КонецЕсли;	
КонецЦикла;

КонецПроцедуры

//Процедура обработки задач системы
Процедура ОбработатьЗадачи(НаименованиеЗадачи) Экспорт 
	
	
	Если НаименованиеЗадачи = "Система ждет оплаты" Тогда 
		ЗапросПоЗадачамОплата = новый запрос;
		ЗапросПоЗадачамОплата.Текст = "ВЫБРАТЬ
		                              |	БП_ЗадачиИсполнителей.Ссылка,
		                              |	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП,
		                              |	ВЫБОР
		                              |		КОГДА БП_ЗадачиИсполнителей.БизнесПроцесс ССЫЛКА БизнесПроцесс.БП_ОбработкаСтрокиЗаказа
		                              |			ТОГДА БП_ЗадачиИсполнителей.БизнесПроцесс.РодительскийБизнесПроцес.ЗаказПокупателя
		                              |		КОГДА БП_ЗадачиИсполнителей.БизнесПроцесс ССЫЛКА БизнесПроцесс.БП_ОбработкаЗаказа
		                              |			ТОГДА БП_ЗадачиИсполнителей.БизнесПроцесс.ЗаказПокупателя
		                              |	КОНЕЦ КАК ЗаказПокупателя
		                              |ИЗ
		                              |	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		                              |ГДЕ
		                              |	БП_ЗадачиИсполнителей.Исполнитель = &Система
		                              |	И НЕ БП_ЗадачиИсполнителей.Выполнена
		                              |	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		ЗапросПоЗадачамОплата.УстановитьПараметр("Система", Справочники.Пользователи.Система);
		ЗапросПоЗадачамОплата.УстановитьПараметр("Наименование","Система ждет оплаты");
		
		РезультатЗапросаОплата = ЗапросПоЗадачамОплата.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРезультатЗапроса из РезультатЗапросаОплата цикл
			
			БП = СтрокаРезультатЗапроса.БП;
			
			ЗаказПокупателя = СтрокаРезультатЗапроса.ЗаказПокупателя;
		
			Если ЕстьОплата(ЗаказПокупателя) Тогда 
				Задача = СтрокаРезультатЗапроса.Ссылка.ПолучитьОбъект();
				Задача.ВыполнитьЗадачу();
				Задача.Записать();
			////ИначеЕсли ЗаказПокупателя.ПодОтветственностьМенеджера Тогда 
			////	Задача = СтрокаРезультатЗапроса.Ссылка.ПолучитьОбъект();	
			////	Задача.ВыполнитьЗадачу();
			////	Задача.Записать();
			////ИначеЕсли ОплаченЧеком(ЗаказПокупателя) Тогда 
			////	Задача = СтрокаРезультатЗапроса.Ссылка.ПолучитьОбъект();	
			////	Задача.ВыполнитьЗадачу();
			////	Задача.Записать();
			////	ЗаказВыполнен(ЗаказПокупателя);
			//ИначеЕсли ЕстьПредоплата(ЗаказПокупателя) Тогда 
			//	Задача = СтрокаРезультатЗапроса.Ссылка.ПолучитьОбъект();	
			//	Задача.ВыполнитьЗадачу();
			//////	Задача.Записать();
			////ИначеЕсли ЗаказПокупателя.ДоговорКонтрагента.НеКонтролироватьОплаты Тогда 
			////	Задача = СтрокаРезультатЗапроса.Ссылка.ПолучитьОбъект();	
			////	Задача.ВыполнитьЗадачу();
			////	Задача.Записать();
			////ИначеЕсли ЕстьДСКлиента(ЗаказПокупателя) Тогда 
			////	Задача = СтрокаРезультатЗапроса.Ссылка.ПолучитьОбъект();	
			////	Задача.ВыполнитьЗадачу();
			////	Задача.Записать();
			////	Продолжить;
			КонецЕсли;
			
		КонецЦикла;
	ИначеЕсли НаименованиеЗадачи = "Система ждет протавление способов доставки" Тогда 
		ЗапросПоЗадачамЗакПост = новый запрос;
		ЗапросПоЗадачамЗакПост.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка,
		|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.Исполнитель = &Система
		|	И НЕ БП_ЗадачиИсполнителей.Выполнена
		|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		ЗапросПоЗадачамЗакПост.УстановитьПараметр("Система",Справочники.Пользователи.Система);
		ЗапросПоЗадачамЗакПост.УстановитьПараметр("Наименование","Система ждет протавление способов доставки");
		
		РезультатЗапросаПоЗадачам = ЗапросПоЗадачамЗакПост.Выполнить().Выгрузить();
		Для Каждого Задача из РезультатЗапросаПоЗадачам цикл
			
			ЗаказПокупателя = Задача.ссылка.БизнесПроцесс.ЗаказПокупателя;
			
			ДоставкаПроставленна = Истина;
			
			Для Каждого СтрокаТовары из ЗаказПокупателя.товары цикл
				Если ЗначениеЗаполнено(СтрокаТовары.СпособДоставки) и ЗначениеЗаполнено(СтрокаТовары.Склад) И СтрокаТовары.Склад<> Справочники.Склады.ПустаяСсылка() Тогда
				Иначе
					ДоставкаПроставленна = Ложь;				
				КонецЕсли;
			КонецЦикла;
			
			Если ДоставкаПроставленна  Тогда 
				
				Об = Задача.ссылка.получитьОбъект();
				Об.ВыполнитьЗадачу();
				Об.Записать();
				
			КонецЕсли;
			
		КонецЦикла;	
	ИначеЕсли НаименованиеЗадачи = "Система ждет реакцию поставщика" Тогда  
		ЗапросПоЗадачамЗакПост = новый запрос;
		ЗапросПоЗадачамЗакПост.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка,
		|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.Исполнитель = &Система
		|	И НЕ БП_ЗадачиИсполнителей.Выполнена
		|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		ЗапросПоЗадачамЗакПост.УстановитьПараметр("Система",Справочники.Пользователи.Система);
		ЗапросПоЗадачамЗакПост.УстановитьПараметр("Наименование","Система ждет реакцию поставщика");
		
		РезультатЗапросаПоЗакПост = ЗапросПоЗадачамЗакПост.Выполнить().Выгрузить();
		Для Каждого Задача из РезультатЗапросаПоЗакПост цикл
			
			ЗаказПоставщику = Задача.ссылка.БизнесПроцесс.заказПоставщику;
			Если ЗначениеЗаполнено(ЗаказПоставщику.БП_СтатусЗаказа) Тогда 
				Если не ЗаказПоставщику.БП_СтатусЗаказа = Перечисления.БП_СтатусыЗаказовПоставщику.Неизвестно Тогда 
					
					Об = Задача.ссылка.получитьОбъект();
					Об.ВыполнитьЗадачу();
					Об.Записать();
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	ИначеЕсли НаименованиеЗадачи = "Система ждет прихода товара от поставщика" Тогда 
		ЗапросПоЗадачамПостОтПоставщ = новый запрос;
		ЗапросПоЗадачамПостОтПоставщ.Текст = "ВЫБРАТЬ
		                                     |	БП_ЗадачиИсполнителей.Ссылка,
		                                     |	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП,
		                                     |	ЕСТЬNULL(БП_ЗадачиИсполнителей.БизнесПроцесс.ЗаказПоставщику, ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)) КАК ЗаказПоставщику
		                                     |ИЗ
		                                     |	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		                                     |ГДЕ
		                                     |	БП_ЗадачиИсполнителей.Исполнитель = &Система
		                                     |	И НЕ БП_ЗадачиИсполнителей.Выполнена
		                                     |	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		ЗапросПоЗадачамПостОтПоставщ.УстановитьПараметр("Система",Справочники.Пользователи.Система);
		ЗапросПоЗадачамПостОтПоставщ.УстановитьПараметр("Наименование","Система ждет прихода товара от поставщика");
		
		РезультатЗапросаПоЗакПоставщ = ЗапросПоЗадачамПостОтПоставщ.Выполнить().Выгрузить();
		Для Каждого Задача из РезультатЗапросаПоЗакПоставщ цикл
			
			ЗаказПоставщику = Задача.заказПоставщику;
			Если ЗаказПоставщику.проведен Тогда 
				Если ЕстьПриход(ЗаказПоставщику,Задача.ссылка.БизнесПроцесс.Номенклатура,Задача.ссылка.БизнесПроцесс.ХарактеристикаНоменклатуры) Тогда 
					
					Об = Задача.ссылка.получитьОбъект();
					Об.ВыполнитьЗадачу();
					Об.Записать();
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли НаименованиеЗадачи = "Ожидание перемещения товара" Тогда 
		ЗапросПоЗадачамПеремещение = новый запрос;
		ЗапросПоЗадачамПеремещение.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка,
		|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.Исполнитель = &Система
		|	И НЕ БП_ЗадачиИсполнителей.Выполнена
		|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		ЗапросПоЗадачамПеремещение.УстановитьПараметр("Система",Справочники.Пользователи.Система);
		ЗапросПоЗадачамПеремещение.УстановитьПараметр("Наименование","Ожидание перемещения товара");
		
		РезультатЗапросаПоЗадПеремещ = ЗапросПоЗадачамПеремещение.Выполнить().Выгрузить();
		Для Каждого Задача из РезультатЗапросаПоЗадПеремещ цикл
			
			ВнутреннийЗаказ = Задача.ссылка.БизнесПроцесс.ВнутреннийЗаказ;
			
			Если ЕстьПеремещение(ВнутреннийЗаказ,Задача.ссылка.БизнесПроцесс.Номенклатура,Задача.ссылка.БизнесПроцесс.ХарактеристикаНоменклатуры,Задача.ссылка.БизнесПроцесс.Количество) Тогда 
				
				Об = Задача.ссылка.получитьОбъект();
				Об.ВыполнитьЗадачу();
				Об.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли НаименованиеЗадачи = "Система ждет выполнения дочерних БП" Тогда 
		ЗапросПоЗадачамПеремещение = новый запрос;
		ЗапросПоЗадачамПеремещение.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка,
		|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.Исполнитель = &Система
		|	И НЕ БП_ЗадачиИсполнителей.Выполнена
		|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		ЗапросПоЗадачамПеремещение.УстановитьПараметр("Система",Справочники.Пользователи.Система);
		ЗапросПоЗадачамПеремещение.УстановитьПараметр("Наименование","Система ждет выполнения дочерних БП");
		
		РезультатЗапроса = ЗапросПоЗадачамПеремещение.Выполнить().Выгрузить();
		
		
		Для Каждого Задача из РезультатЗапроса цикл
			
			ЗапросПоДочернимБП = новый Запрос;
			ЗапросПоДочернимБП.Текст =  "ВЫБРАТЬ
			|	БП_ОбработкаСтрокиЗаказа.Ссылка КАК БП,
			|	БП_ОбработкаСтрокиЗаказа.Завершен
			|ИЗ
			|	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
			|ГДЕ
			|	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес";
			ЗапросПоДочернимБП.УстановитьПараметр("РодительскийБизнесПроцес",Задача.БП);										
			РезультатЗапросаПоДочернимБП = ЗапросПоДочернимБП.Выполнить().Выгрузить();
			ЗавершеныДочерниеБП = Истина;
			Для каждого строкаРезультат из РезультатЗапросаПоДочернимБП цикл
				Если не строкаРезультат.Завершен Тогда 
					ЗавершеныДочерниеБП = Ложь;	
				КонецЕсли;
			КонецЦикла;
			Если ЗавершеныДочерниеБП Тогда 
				
				Об = Задача.ссылка.получитьОбъект();
				Об.ВыполнитьЗадачу();
				Об.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
	ИначеЕсли НаименованиеЗадачи = "Отправить письмо и смс заказ зарегистрирован" Тогда 
		
		////ЗапросПоЗадачамПеремещение = новый запрос;
		////ЗапросПоЗадачамПеремещение.Текст = "ВЫБРАТЬ
		////|	БП_ЗадачиИсполнителей.Ссылка,
		////|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
		////|ИЗ
		////|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		////|ГДЕ
		////|	БП_ЗадачиИсполнителей.Исполнитель = &Система
		////|	И НЕ БП_ЗадачиИсполнителей.Выполнена
		////|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
		////ЗапросПоЗадачамПеремещение.УстановитьПараметр("Система",Справочники.Пользователи.Система);
		////ЗапросПоЗадачамПеремещение.УстановитьПараметр("Наименование","Отправить письмо и смс заказ зарегистрирован");
		////
		////РезультатЗапроса = ЗапросПоЗадачамПеремещение.Выполнить().Выгрузить();
		////
		////
		////Для Каждого Задача из РезультатЗапроса цикл			
		////	Об = Задача.ссылка.получитьОбъект();
		////	Об.ВыполнитьЗадачу();
		////	Об.Записать();		
		////КонецЦикла;
	ИначеЕсли НаименованиеЗадачи = "Уточнить у покупателя продление резерва" Тогда 
	////	ЗапросПоЗадачамПеремещение = новый запрос;
	////	ЗапросПоЗадачамПеремещение.Текст = "ВЫБРАТЬ
	////	|	БП_ЗадачиИсполнителей.Ссылка,
	////	|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
	////	|ИЗ
	////	|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
	////	|ГДЕ
	////	|	 НЕ БП_ЗадачиИсполнителей.Выполнена
	////	|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование";
	////	ЗапросПоЗадачамПеремещение.УстановитьПараметр("Система",Справочники.Пользователи.Система);
	////	ЗапросПоЗадачамПеремещение.УстановитьПараметр("Наименование","Отправить письмо и смс заказ зарегистрирован");
	////	
	////	РезультатЗапроса = ЗапросПоЗадачамПеремещение.Выполнить().Выгрузить();
	////	
	////	Для Каждого Задача из РезультатЗапроса цикл	
	////		Если ПолучитьОстатокПоЗаказу(Задача.ЗаказПоукпателя)=0 Тогда 
	////			Об = Задача.ссылка.получитьОбъект();
	////			Об.ВыполнитьЗадачу();
	////			Об.Записать();
	////		КонецЕсли;
	////	КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// + S1-177 ДДГ 14 окт 2024
// обнов S1-545 ДДГ 11 мар 2025
Процедура ОбработатьЗадачиВыдатьТовары(Знач пЗаказПокупателя = NULL) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БП_ЗадачиИсполнителей.Ссылка,
	|	БП_ЗадачиИсполнителей.БизнесПроцесс,
	|	БП_ЗадачиИсполнителей.ЗаказПокупателя,
	|	МИНИМУМ(ISNULL(БП_ОбработкаСтрокиЗаказа.Завершен, ЛОЖЬ)) КАК Завершить,
	|	МАКСИМУМ(ЭлектронныйСчет.ОплатаQRкодом) КАК ОплатаQRкодом
	|ИЗ
	|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	|		ПО БП_ЗадачиИсполнителей.БизнесПроцесс = БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйСчет КАК ЭлектронныйСчет
	|		ПО БП_ЗадачиИсполнителей.ЗаказПокупателя = ЭлектронныйСчет.Сделка
	|ГДЕ
	|	НЕ БП_ЗадачиИсполнителей.Выполнена
	|	 И БП_ЗадачиИсполнителей.БизнесПроцесс ССЫЛКА БизнесПроцесс.БП_ОбработкаЗаказа
	|	 И БП_ЗадачиИсполнителей.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.БП_ТипыЗадач.ВыдатьТовар)
	|	 И ВЫБОР
	|		КОГДА &ЗаказПокупателя IS NULL
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ БП_ЗадачиИсполнителей.ЗаказПокупателя = &ЗаказПокупателя
	|	КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	БП_ЗадачиИсполнителей.Ссылка,
	|	БП_ЗадачиИсполнителей.БизнесПроцесс
	|";

	пЗаказПокупателя = ?(ЗначениеЗаполнено(пЗаказПокупателя), пЗаказПокупателя, NULL);

	Запрос.УстановитьПараметр("ЗаказПокупателя", пЗаказПокупателя);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Пока ВыборкаРезультата.Следующий() Цикл

		Если НЕ ВыборкаРезультата.Завершить Тогда
			Продолжить;
		КонецЕсли;

//		эСсылка = Документы.ЭлектронныйСчет.НайтиПоРеквизиту("Сделка", ВыборкаРезультата.ЗаказПокупателя);

//		Если НЕ ЗначениеЗаполнено(эСсылка) Тогда
//			Продолжить;
//		КонецЕсли;

		ЗаказПокупателя = ВыборкаРезультата.ЗаказПокупателя;
		ОплатаQRкодом   = ВыборкаРезультата.ОплатаQRкодом;

		ВидОплаты = ?(ОплатаQRкодом, Справочники.ВидыОплатЧекаККМ.QRкод, Справочники.ВидыОплатЧекаККМ.Сайт);
		ТипЧека   = Перечисления.ТипыЧеков.ЗачетПредоплаты;

		СтруктураВозврата = Документы.РеализацияТоваровУслуг.ВыполнитьПродажуПоЗаказу(
			  ЗаказПокупателя
			, ВидОплаты
			, ТипЧека
			, Ложь
			, Истина
			, Ложь
			, Истина
		);

		СтатусОшибки  = РазработкаСервер.ИзвлечьСвойствоИзСтруктуры(СтруктураВозврата, "Ошибка"		, Истина, Истина);
		ТекстОшибки   = РазработкаСервер.ИзвлечьСвойствоИзСтруктуры(СтруктураВозврата, "ТекстОшибки", ""	, Истина);

		Если СтатусОшибки Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли;

//		Если НЕ СтатусОшибки Тогда

//			ОбъектЗадачи = ВыборкаРезультата.Ссылка.ПолучитьОбъект();
//			ОбъектЗадачи.ВыполнитьЗадачу();

//			ОбъектБП = ВыборкаРезультата.БизнесПроцесс.ПолучитьОбъект();
//			ОбъектБП.Завершен		= Истина;
//			ОбъектБП.СтатусЗаказа	= Перечисления.БП_СтатусыЗаказов.ЗаказВыполнен;
//			ОбъектБП.Записать();

//		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
// - S1-177 ДДГ 14 окт 2024

// + S1-545 ДДГ 26 мар 2025
Функция ПолучитьЗаказыБезБП_Новая()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументЗаказПокупателя.Ссылка,
		|	ДокументЗаказПокупателя.Дата
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДокументЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
		|		ПО (БП_ОбработкаЗаказа.ЗаказПокупателя = ДокументЗаказПокупателя.Ссылка)
		|ГДЕ
		|	БП_ОбработкаЗаказа.Ссылка ЕСТЬ NULL
		|	И ДокументЗаказПокупателя.Проведен
		|	И ДокументЗаказПокупателя.Дата > &Дата
		|	И ДокументЗаказПокупателя.Проект = &Проект";

	ДатаВыборки = ТекущаяДатаСеанса() - 1 * 24 * 3600;

	Запрос.УстановитьПараметр("Дата"	, ДатаВыборки);
	Запрос.УстановитьПараметр("Проект"	, Справочники.Проекты.НайтиПоКоду("S00000085"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;

КонецФункции
// - S1-545 ДДГ 26 мар 2025

//Функция ПолучитьОстатокПоЗаказу(ЗаказПоукпателя)
//ОстаткиПоРегистру = РегистрыНакопления.ЗаказыПокупателей.Остатки(ТекущаяДата(),Новый структура("ЗаказПокупателя",ЗаказПоукпателя));
//	
//Возврат ОстаткиПоРегистру.Количество; 

//КонецФункции
//Функция получающая заказы без Бизнес - процессов
Функция ПолучитьЗаказыБезБП()
	
	ЗапросПоЗаказамВБП = новый запрос;
	ЗапросПоЗаказамВБП.Текст = "ВЫБРАТЬ
	                           |	БП_ОбработкаЗаказа.ЗаказПокупателя
	                           |ИЗ
	                           |	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа";
	МассивЗаказовВБП =  ЗапросПоЗаказамВБП.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
	//Отберем все заказы кроме тех которые есть в БП
	
	ЗапросПоЗаказамНеВБП = новый запрос;
	ЗапросПоЗаказамНеВБП.Текст = "ВЫБРАТЬ
	                             |	ЗаказПокупателя.Ссылка КАК Заказ,
	                             |	ЗаказПокупателя.Статус.Код,
	                             |	ЗаказПокупателя.Ссылка,
	                             |	ЗаказПокупателя.Дата
	                             |ИЗ
	                             |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	                             |ГДЕ
	                             |	НЕ ЗаказПокупателя.Ссылка В (&МассивЗаказов)
	                             |	И ЗаказПокупателя.Дата > &Дата
	                             |	И ЗаказПокупателя.Проведен";
	ЗапросПоЗаказамНеВБП.УстановитьПараметр("МассивЗаказов",МассивЗаказовВБП);								 
	ЗапросПоЗаказамНеВБП.УстановитьПараметр("Дата",Дата(2020,06,01));								 
	Возврат ЗапросПоЗаказамНеВБП.Выполнить().Выгрузить();								 
	
КонецФункции

Функция ЕстьОплата(ЗаказПокупателя) Экспорт 
	
	ВозвращаемоеЗначение = Ложь;
	
	СуммаДолгаПоКорректировке = 0;
	
	ЗапросПоСуммеКорректировки = новый Запрос;
	ЗапросПоСуммеКорректировки.Текст = "ВЫБРАТЬ
	                                   |	ЕСТЬNULL(СУММА(КорректировкаЗаказаПокупателя.СуммаДокумента), 0) КАК СуммаДокумента
	                                   |ИЗ
	                                   |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	                                   |ГДЕ
	                                   |	КорректировкаЗаказаПокупателя.ЗаказПокупателя = &ЗаказПокупателя
	                                   |	И КорректировкаЗаказаПокупателя.Проведен";
	ЗапросПоСуммеКорректировки.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапросаПоСуммеКорректировки = ЗапросПоСуммеКорректировки.Выполнить().Выгрузить();
	Если РезультатЗапросаПоСуммеКорректировки.Количество()>0 Тогда 
		СуммаДолгаПоКорректировке = РезультатЗапросаПоСуммеКорректировки[0].СуммаДокумента;
	КонецЕсли;
		
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	               |ГДЕ
	               |	ОплатаОтПокупателяПлатежнойКартой.Проведен
	               |	И ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &ЗаказПокупателя
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПлатежноеПоручениеВходящее.СуммаДокумента
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящее.Проведен
	               |	И ПлатежноеПоручениеВходящее.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдер.СуммаДокумента
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.Проведен
	               |	И ПриходныйКассовыйОрдер.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.следующий() Тогда  
		Если РезультатЗапроса.СуммаДокумента >= ЗаказПокупателя.СуммаДокумента+СуммаДолгаПоКорректировке Тогда 
			//Полученна оплата
			ВозвращаемоеЗначение =  Истина;
		Иначе
			//Не полученна оплата
			ВозвращаемоеЗначение =  Ложь;
		КонецЕсли;
	Иначе
		ВозвращаемоеЗначение =  Ложь;
	КонецЕсли;
	
	////Если ЗначениеЗаполнено(ЗаказПокупателя) И ЗаказПокупателя.ВалютаДокумента.код <> "" Тогда 
	////	 ВозвращаемоеЗначение = Ложь;
	////КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция ЕстьПредоплата(ЗаказПокупателя) Экспорт 
	
	
	СуммаДолгаПоКорректировке = 0;
	
	ЗапросПоСуммеКорректировки = новый Запрос;
	ЗапросПоСуммеКорректировки.Текст = "ВЫБРАТЬ
	                                   |	ЕСТЬNULL(СУММА(ЕСТЬNULL(КорректировкаЗаказаПокупателя.СуммаДокумента, 0)), 0) КАК СуммаДокумента
	                                   |ИЗ
	                                   |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	                                   |ГДЕ
	                                   |	КорректировкаЗаказаПокупателя.ЗаказПокупателя = &ЗаказПокупателя";
	ЗапросПоСуммеКорректировки.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапросаПоСуммеКорректировки = ЗапросПоСуммеКорректировки.Выполнить().Выгрузить();
	Если РезультатЗапросаПоСуммеКорректировки.Количество()>0 Тогда 
		СуммаДолгаПоКорректировке = РезультатЗапросаПоСуммеКорректировки[0].СуммаДокумента;
	КонецЕсли;

	
	ВсеЕдиницыЕстьНаОстатке = Истина;
	Для каждого СтрокаЗаказа из ЗаказПокупателя.товары цикл
		Запрос = новый запрос;
		запрос.Текст= "ВЫБРАТЬ
		              |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		              |ИЗ
		              |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		              |			&Период,
		              |			Номенклатура = &Номенклатура
		              |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		              |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		Запрос.УстановитьПараметр("Период",ЗаказПокупателя.дата);
		Запрос.УстановитьПараметр("Склад",СтрокаЗаказа.Склад);
		Запрос.УстановитьПараметр("Номенклатура",СтрокаЗаказа.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",СтрокаЗаказа.ХарактеристикаНоменклатуры);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество()> 0 Тогда 
			Если РезультатЗапроса[0].КоличествоОстаток >= СтрокаЗаказа.Количество Тогда 
			иначе
				ВсеЕдиницыЕстьНаОстатке = Ложь;	
			КонецЕсли;
		иначе
			ВсеЕдиницыЕстьНаОстатке = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	
	
	ВозвращаемоеЗначение = Ложь;
	
	если ВсеЕдиницыЕстьНаОстатке Тогда  
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.СуммаДокумента, 0)) КАК СуммаДокумента
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		СУММА(ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента) КАК СуммаДокумента
		               |	ИЗ
		               |		Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
		               |	ГДЕ
		               |		ОплатаОтПокупателяПлатежнойКартой.Проведен
		               |		И ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &ЗаказПокупателя
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		СУММА(ПлатежноеПоручениеВходящее.СуммаДокумента)
		               |	ИЗ
		               |		Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
		               |	ГДЕ
		               |		ПлатежноеПоручениеВходящее.Проведен
		               |		И ПлатежноеПоручениеВходящее.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		СУММА(ПриходныйКассовыйОрдер.СуммаДокумента)
		               |	ИЗ
		               |		Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		               |	ГДЕ
		               |		ПриходныйКассовыйОрдер.Проведен
		               |		И ПриходныйКассовыйОрдер.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя) КАК ВложенныйЗапрос";
		Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество()>0 Тогда  
			Если РезультатЗапроса[0].СуммаДокумента >= (ЗаказПокупателя.СуммаДокумента+СуммаДолгаПоКорректировке)-(ЗаказПокупателя.СуммаДокумента+СуммаДолгаПоКорректировке)/100*70  Тогда 
				//Есть предоплата
				ВозвращаемоеЗначение = Истина;
			Иначе
				//Нет предоплаты
				ВозвращаемоеЗначение = Ложь;
			КонецЕсли;
		Иначе
			ВозвращаемоеЗначение = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаказПокупателя.ВалютаДокумента <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		 ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;	
КонецФункции

Функция ЕстьДСКлиента(ЗаказПокупателя) Экспорт 
	
	ВозвращаемоеЗначение = Ложь;
	
	//СуммаДолгаПоКорректировке = 0;
	//
	//ЗапросПоСуммеКорректировки = новый Запрос;
	//ЗапросПоСуммеКорректировки.Текст = "ВЫБРАТЬ
	//                                   |	ЕстьNULL(СУММА(КорректировкаЗаказаПокупателя.СуммаДокумента),0) КАК СуммаДокумента
	//                                   |ИЗ
	//                                   |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	//                                   |ГДЕ
	//                                   |	КорректировкаЗаказаПокупателя.ЗаказПокупателя = &ЗаказПокупателя";
	//ЗапросПоСуммеКорректировки.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	//
	//РезультатЗапросаПоСуммеКорректировки = ЗапросПоСуммеКорректировки.Выполнить().Выгрузить();
	//Если РезультатЗапросаПоСуммеКорректировки.Количество()>0 Тогда 
	//	СуммаДолгаПоКорректировке = РезультатЗапросаПоСуммеКорректировки[0].СуммаДокумента;
	//КонецЕсли;
	//	
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента КАК СуммаДокумента
	//               |ИЗ
	//               |	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	//               |ГДЕ
	//               |	ОплатаОтПокупателяПлатежнойКартой.Проведен
	//               |	И ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &ЗаказПокупателя
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	ПлатежноеПоручениеВходящее.СуммаДокумента
	//               |ИЗ
	//               |	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	//               |ГДЕ
	//               |	ПлатежноеПоручениеВходящее.Проведен
	//               |	И ПлатежноеПоручениеВходящее.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	ПриходныйКассовыйОрдер.СуммаДокумента
	//               |ИЗ
	//               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	//               |ГДЕ
	//               |	ПриходныйКассовыйОрдер.Проведен
	//               |	И ПриходныйКассовыйОрдер.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя";
	//Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//
	//Если РезультатЗапроса.Количество()>0 Тогда  
	//	Если РезультатЗапроса[0].СуммаДокумента >= ЗаказПокупателя.СуммаДокумента+СуммаДолгаПоКорректировке Тогда 
	//		//Полученна оплата
	//		ВозвращаемоеЗначение =  Истина;
	//	Иначе
	//		//Не полученна оплата
	//		ВозвращаемоеЗначение =  Ложь;
	//	КонецЕсли;
	//Иначе
	//	ВозвращаемоеЗначение =  Ложь;
	//КонецЕсли;
	//
	//Если не ВозвращаемоеЗначение Тогда 
	//	
	//	ЗапросПоВзаиморасчетам = новый запрос;
	//	//ЗапросПоВзаиморасчетам.Текст = ;
	//	
	//КонецЕсли;
	
	СуммаДолгаПоКорректировке = 0;
	
	ЗапросПоСуммеКорректировки = новый Запрос;
	ЗапросПоСуммеКорректировки.Текст = "ВЫБРАТЬ
	                                   |	ЕСТЬNULL(СУММА(КорректировкаЗаказаПокупателя.СуммаДокумента), 0) КАК СуммаДокумента
	                                   |ИЗ
	                                   |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	                                   |ГДЕ
	                                   |	КорректировкаЗаказаПокупателя.ЗаказПокупателя = &ЗаказПокупателя
	                                   |	И КорректировкаЗаказаПокупателя.Проведен";
	ЗапросПоСуммеКорректировки.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапросаПоСуммеКорректировки = ЗапросПоСуммеКорректировки.Выполнить().Выгрузить();
	Если РезультатЗапросаПоСуммеКорректировки.Количество()>0 Тогда 
		СуммаДолгаПоКорректировке = РезультатЗапросаПоСуммеКорректировки[0].СуммаДокумента;
	КонецЕсли;

	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Контрагент",ЗаказПокупателя.контрагент);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда 
		Если -1*РезультатЗапроса.СуммаУпрОстаток>= ЗаказПокупателя.СуммаДокумента+СуммаДолгаПоКорректировке  Тогда 
			ВозвращаемоеЗначение = Истина;
		Иначе
			ВозвращаемоеЗначение = Ложь;
		КонецЕсли;
	Иначе
		ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Если ЗаказПокупателя.ВалютаДокумента <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		 ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция ЕстьПриход(ЗаказПостацщику,Номенклатура,ХарактеристикаНоменклатуры) Экспорт 
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПоставщикамОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	               |			,
	               |			ЗаказПоставщику = &ЗаказПоставщику
	               |				И Номенклатура = &Номенклатура
	               |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЗаказыПоставщикамОстатки";
	Запрос.УстановитьПараметр("ЗаказПоставщику",ЗаказПостацщику);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса[0].КоличествоОстаток = 0  Тогда 
		//Товар пришел
		Возврат Истина;
	Иначе
		//Товар не пришел
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЕстьПеремещение(ВнутреннийЗаказ,Номенклатура,ХарактеристикаНоменклатуры,Количество)
	
	ЕстьПеремещение = Ложь;
	
	ЗапросПоВнутреннимЗаказам = новый Запрос;
	ЗапросПоВнутреннимЗаказам.Текст = "ВЫБРАТЬ
	                                  |	ВнутренниеЗаказыОстатки.КоличествоОстаток
	                                  |ИЗ
	                                  |	РегистрНакопления.ВнутренниеЗаказы.Остатки(, ВнутреннийЗаказ = &ВнутреннийЗаказ) КАК ВнутренниеЗаказыОстатки";
	ЗапросПоВнутреннимЗаказам.УстановитьПараметр("ВнутреннийЗаказ",ВнутреннийЗаказ);								  
	РезультатЗапроса = ЗапросПоВнутреннимЗаказам.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		КоличетсвоОстаток = РезультатЗапроса[0].КоличествоОстаток; 	
		Если КоличетсвоОстаток=0 Тогда 
			ЕстьПеремещение = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Склад =  ВнутреннийЗаказ.Заказчик;
	
	ЗапросПоОстатку = новый запрос;
	ЗапросПоОстатку.Текст = "ВЫБРАТЬ
	                        |	ТоварыНаСкладахОстатки.Номенклатура,
	                        |	ТоварыНаСкладахОстатки.КоличествоОстаток
	                        |ИЗ
	                        |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                        |			&Дата,
	                        |			Склад = &склад
	                        |				И Номенклатура = &Номенклатура
	                        |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ТоварыНаСкладахОстатки";
	ЗапросПоОстатку.УстановитьПараметр("Дата",ТекущаяДата());
	ЗапросПоОстатку.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоОстатку.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	ЗапросПоОстатку.УстановитьПараметр("Склад",Склад);
	
	
	РезультатЗапроса = ЗапросПоОстатку.Выполнить().Выгрузить();
	
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		КоличествоОстаток = РезультатЗапроса[0].КоличествоОстаток;	
	Иначе
		КоличествоОстаток = 0;
	КонецЕсли;
	
	Если КоличествоОстаток >= Количество Тогда 
		ЕстьПеремещение = Истина;
	Иначе
		ЕстьПеремещение = Ложь;	
	КонецЕсли;
	
	
	
	Возврат ЕстьПеремещение;
	
КонецФункции

// Корректировка паука
Процедура УдалитьСтрокуЗаказаИзПаука(КорректировкаОбьект,ЗаказПокупателя,Строка) Экспорт

	// + 52141 ДДГ  3 июня
	ЭтоСтрокаТоварыСТО = (ТипЗнч(Строка) = Тип("ДокументТабличнаяЧастьСтрока.СТО_ЗаказНаряд.Товары"));

	ИмяПоляХарактеристика =
		?(ЭтоСтрокаТоварыСТО, "Характеристика", "ХарактеристикаНоменклатуры");

	СсылкаБП = ПолучитьБизнесПроцессПоЗаказу(ЗаказПокупателя);

	Если ЗначениеЗаполнено(СсылкаБП) Тогда
	// - 52141 ДДГ  3 июня

		об = СсылкаБП.ПолучитьОбъект();
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",				Строка.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры",Строка[ИмяПоляХарактеристика]);
		Отбор.Вставить("Количество",				Строка.Количество);
		
		СтрокиЗаказа = об.СтрокиЗаказа.НайтиСтроки(Отбор);
		
		МассисИндексов = новый Массив;
		
		Для Каждого СтрокаЗАказа из СтрокиЗаказа цикл
			МассисИндексов.Добавить(Об.СтрокиЗаказа.Индекс(СтрокаЗАказа));
		КонецЦикла;
		
		Для Каждого ЭлементМассива из МассисИндексов Цикл
			об.СтрокиЗаказа.Удалить(ЭлементМассива);
		КонецЦикла;	
		об.записать();

	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БП_ОбработкаСтрокиЗаказа.Ссылка
	               |ИЗ
	               |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	               |ГДЕ
	               |	БП_ОбработкаСтрокиЗаказа.Номенклатура = &Номенклатура
	               |	И БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |	И БП_ОбработкаСтрокиЗаказа.Количество = &Количество
	               |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.ЗаказПокупателя = &ЗаказПокупателя";
	Запрос.УстановитьПараметр("Номенклатура",				Строка.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",	Строка[ИмяПоляХарактеристика]);
	Запрос.УстановитьПараметр("Количество",					Строка.Количество);
	Запрос.УстановитьПараметр("ЗаказПокупателя",			ЗаказПокупателя);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультатаЗапроса из РезультатЗапроса цикл
		
		БПСтроки = СтрокаРезультатаЗапроса.ссылка.ПолучитьОбъект();
		БПСтроки.Завершен = Истина;
		БПСтроки.статусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.АннулированКлиентом;
		БПСтроки.Записать();
		
				
		ЗапросПоЗадачамБП = новый запрос;
		ЗапросПоЗадачамБП.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.БизнесПроцесс = &БизнесПроцесс";
		ЗапросПоЗадачамБП.УстановитьПараметр("БизнесПроцесс",СтрокаРезультатаЗапроса.ссылка);
		РезультатЗапросаПоЗадачам = ЗапросПоЗадачамБП.Выполнить().Выгрузить();
		Для Каждого СтрокаЗадачи  из РезультатЗапросаПоЗадачам цикл
			ЗадачаОб = СтрокаЗадачи.Ссылка.получитьОбъект();
			ЗадачаОб.Удалить();
		КонецЦикла;
	
	КонецЦикла;

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезервированиеТоваров.Ссылка
	               |ИЗ
	               |	Документ.РезервированиеТоваров КАК РезервированиеТоваров
	               |ГДЕ
	               |	РезервированиеТоваров.Заказ = &Заказ
	               |	И РезервированиеТоваров.Товары.Номенклатура = &Номенклатура
	               |	И РезервированиеТоваров.Товары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("Заказ",ЗаказПокупателя);
	Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",строка.ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();					   
	
	Для каждого СтрокаРезультат из РезультатЗапроса цикл
		об = СтрокаРезультат.Ссылка.ПолучитьОбъект();
		//об.ОбменДанными.Загрузка = Истина;
		об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Попытка
		об.удалить();
	Исключение
		КонецПопытки;
	КонецЦикла;

	СтрокаКорректировка = КорректировкаОбьект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаКорректировка,строка);
	СтрокаКорректировка.ХарактеристикаНоменклатуры      = Строка[ИмяПоляХарактеристика];
	СтрокаКорректировка.ЕдиницаИзмерения = СтрокаКорректировка.Номенклатура.ЕдиницаХраненияОстатков;
	СтрокаКорректировка.КоличествоМест 	 = -1*СтрокаКорректировка.Количество;
	СтрокаКорректировка.Количество 	   	 = -1*СтрокаКорректировка.Количество;
	СтрокаКорректировка.Сумма 		     = СтрокаКорректировка.Сумма*-1;

КонецПроцедуры

Процедура ДобавитьСтрокуЗаказаВПаука(КорректировкаОбьект, ЗаказПокупателя, Строка, ЗаказПоставщику = Неопределено) Экспорт

	// + 52141 ДДГ  3 июня
	ЭтоДокументСТО = (ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.СТО_ЗаказНаряд"));

	ИмяПоляХарактеристика =
		?(ЭтоДокументСТО, "Характеристика", "ХарактеристикаНоменклатуры");

	СсылкаБП = ПолучитьБизнесПроцессПоЗаказу(ЗаказПокупателя);

	Если ЗначениеЗаполнено(СсылкаБП) Тогда
	// - 52141 ДДГ  3 июня

		об = СсылкаБП.ПолучитьОбъект();
		СтрокаБП = об.СтрокиЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаБП,Строка);
		СтрокаБП.ХарактеристикаНоменклатуры      = Строка[ИмяПоляХарактеристика];
		об.записать();

		// + S1-177 ДДГ 14 окт 2024
		БП = СоздатьБП_ОбработкаСтрокиЗаказа(
			  Строка
			, СсылкаБП
			, ИмяПоляХарактеристика
			, Перечисления.БП_СтатусыСтрокЗазака.Зарегистрирован
			,
			, ЗаказПоставщику
		);
		// - S1-177 ДДГ 14 окт 2024

		БП.Старт();

	КонецЕсли;

	СтрокаКорректировка = КорректировкаОбьект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаКорректировка,строка);
	СтрокаКорректировка.ХарактеристикаНоменклатуры      = Строка[ИмяПоляХарактеристика];
	СтрокаКорректировка.ЕдиницаИзмерения = СтрокаКорректировка.Номенклатура.ЕдиницаХраненияОстатков;
	СтрокаКорректировка.КоличествоМест 	 = СтрокаКорректировка.Количество;
	СтрокаКорректировка.Количество 	   	 = СтрокаКорректировка.Количество;
	СтрокаКорректировка.Коэффициент		 = 1;

КонецПроцедуры

// + S1-177 ДДГ 14 окт 2024
// обнов S1-545 ДДГ 20 мар 2025
Функция НайтиБП_ОбработкаСтрокиЗаказа(ЗаказИлиБизнесПроцес, СтрокаЗаказа, ИмяПоляХарактеристика = "ХарактеристикаНоменклатуры") Экспорт

	ТипПараметра = ТипЗнч(ЗаказИлиБизнесПроцес);

	ЭтоЗаказ
		  = ТипПараметра = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипПараметра = Тип("ДокументОбъект.ЗаказПокупателя")
	;

	ТекстЗапроса = "ВЫБРАТЬ
	               |	БП_ОбработкаСтрокиЗаказа.Ссылка
	               |ИЗ
	               |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	               |ГДЕ
	               |	БП_ОбработкаСтрокиЗаказа.Номенклатура = &Номенклатура
	               |	И БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |	И БП_ОбработкаСтрокиЗаказа.Количество = &Количество
	               |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &Родитель";

	Если ЭтоЗаказ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РодительскийБизнесПроцес = &Родитель", "РодительскийБизнесПроцес.Заказ = &Родитель")
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура",				СтрокаЗаказа.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",	СтрокаЗаказа[ИмяПоляХарактеристика]);
	Запрос.УстановитьПараметр("Количество",					СтрокаЗаказа.Количество);
	Запрос.УстановитьПараметр("Родитель",					ЗаказИлиБизнесПроцес);

	РезультатЗапроса  = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	МассивРезультата  = ТаблицаРезультата.ВыгрузитьКолонку("Ссылка");

	Возврат МассивРезультата;

КонецФункции

Функция СоздатьБП_ОбработкаСтрокиЗаказа(
	  Строка
	, РодительскийБизнесПроцесс
	, ИмяПоляХарактеристика = "ХарактеристикаНоменклатуры"
	, СтатусСтрокиЗаказа
	, ХолодныйСтарт = Ложь
	, ЗаказПоставщику = Неопределено
) Экспорт

	БП = БизнесПроцессы.БП_ОбработкаСтрокиЗаказа.СоздатьБизнесПроцесс();
	БП.Дата         			       = ТекущаяДата();
	БП.Количество   		           = Строка.Количество;
	БП.Номенклатура 			       = Строка.Номенклатура;
	БП.ХарактеристикаНоменклатуры      = Строка[ИмяПоляХарактеристика];
	БП.Цена 	    			       = Строка.Цена;

	Попытка 
		БП.СкладВыдачи  		           = Строка.Склад;
	Исключение
		БП.СкладВыдачи  		           = Строка.Размещение;
	КонецПопытки;

	БП.РодительскийБизнесПроцес        = РодительскийБизнесПроцесс;
	БП.СтатусСтрокиЗаказа 	           = СтатусСтрокиЗаказа;
	БП.НомерСтроки 		  		       = Строка.НомерСтроки;

	Попытка
		БП.СпособДоставки			       = Строка.СпособДоставки;
		БП.АдресДоставки		           = Строка.АдресДоставки;
		БП.КомментарийДляПеремещенияТовара = Строка.Комментарий;
	Исключение
	КонецПопытки;

	Если ХолодныйСтарт Тогда
		БП.Стартован = Истина;
	КонецЕсли;

	БП.ЗаказПоставщику = ЗаказПоставщику;

	БП.Записать();

	Возврат БП;

КонецФункции

Функция ЛиВыполненаОбработкаВсехСтрокЗаказа(РодительскийБизнесПроцесс) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ISNULL(БП_ОбработкаСтрокиЗаказа.Завершен, ЛОЖЬ)) КАК Завершено
		|ИЗ
		|	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
		|ГДЕ
		|	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес";

	Запрос.УстановитьПараметр("РодительскийБизнесПроцес", РодительскийБизнесПроцесс);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Выполнена = ВыборкаРезультата.Следующий() И ВыборкаРезультата.Завершено;

	Возврат Выполнена;

КонецФункции

Процедура УдалитьЗадачиБизнесПроцесса(БизнесПроцессСсылка) Экспорт

	ЗапросПоЗадачамБП = новый запрос;
	ЗапросПоЗадачамБП.Текст = "ВЫБРАТЬ
	|	БП_ЗадачиИсполнителей.Ссылка
	|ИЗ
	|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
	|ГДЕ
	|	БП_ЗадачиИсполнителей.БизнесПроцесс = &БизнесПроцесс";
	ЗапросПоЗадачамБП.УстановитьПараметр("БизнесПроцесс",БизнесПроцессСсылка);
	РезультатЗапросаПоЗадачам = ЗапросПоЗадачамБП.Выполнить().Выгрузить();
	Для Каждого СтрокаЗадачи  из РезультатЗапросаПоЗадачам цикл
		ЗадачаОб = СтрокаЗадачи.Ссылка.получитьОбъект();
		ЗадачаОб.Удалить();
	КонецЦикла;

КонецПроцедуры

Процедура ЗавершитьБизнесПроцессОбработкиСтрокиЗаказа(БизнесПроцессСсылка, Отмена = Ложь) Экспорт

	УдалитьЗадачиБизнесПроцесса(БизнесПроцессСсылка);

	СтатусСтрокиЗаказа =
		?(Отмена
		, Перечисления.БП_СтатусыСтрокЗазака.АннулированКлиентом
		, Перечисления.БП_СтатусыСтрокЗазака.ТоварОтгружен
	);

	БПОбСтроки = БизнесПроцессСсылка.ПолучитьОБъект();
	БПОбСтроки.Завершен				= Истина;
	БПОбСтроки.СтатусСтрокиЗаказа	= СтатусСтрокиЗаказа;
	БПОбСтроки.Записать();

КонецПроцедуры
// - S1-177 ДДГ 14 окт 2024

Функция ПолучитьБизнесПроцессПоЗаказу(ЗаказПокупателя) Экспорт
	
ЗапросПоБП = новый запрос;
ЗапросПоБП.Текст = "ВЫБРАТЬ
                   |	БП_ОбработкаЗаказа.Ссылка
                   |ИЗ
                   |	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
                   |ГДЕ
                   |	БП_ОбработкаЗаказа.ЗаказПокупателя = &ЗаказПокупателя";
ЗапросПоБП.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);

РезультатЗапроса = ЗапросПоБП.Выполнить().Выгрузить();

Если РезультатЗапроса.Количество()>0 Тогда 
	Возврат РезультатЗапроса[0].ссылка;
Иначе 
	Возврат БизнесПроцессы.БП_ОбработкаЗаказа.ПустаяСсылка();
КонецЕсли;

КонецФункции

// выделил S1-545 ДДГ 26 мар 2025
Функция ЗапуститьЗаказ(
	  ЗаказПокупателя
	, ДатаЗаказа = Неопределено
	, ПроверитьПередСозданием = Истина
) Экспорт

	Если ПроверитьПередСозданием Тогда

		СсылкаБП = ПолучитьБизнесПроцессПоЗаказу(ЗаказПокупателя);

		Если ЗначениеЗаполнено(СсылкаБП) Тогда
			БП = СсылкаБП.ПолучитьОбъект();
			Возврат БП;
		КонецЕсли;

	КонецЕсли;

	ТоварыЗаказа = ЗаказПокупателя.Товары;
	СтрокТоваров = ТоварыЗаказа.Количество();

	Если СтрокТоваров = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	СписокСтрокДляОбновленияЖурнала = новый СписокЗначений;
	////УправлениеСтатусамиСтрокЗаказов.ОбработатьИзменения(ЗаказПокупателя,СписокСтрокДляОбновленияЖурнала);
	////УправлениеСтатусамиСтрокЗаказов.ОбновитьЖурналСтрокЗаказа(СписокСтрокДляОбновленияЖурнала);

	БП = СоздатьБП_ОбработкаЗаказа(ЗаказПокупателя, ДатаЗаказа);

	Возврат БП;

КонецФункции

// выделил S1-545 ДДГ 26 мар 2025
Функция СоздатьБП_ОбработкаЗаказа(ЗаказПокупателя, ДатаЗаказа = Неопределено)

	ТоварыЗаказа = ЗаказПокупателя.Товары;

	БП = БизнесПроцессы.БП_ОбработкаЗаказа.СоздатьБизнесПроцесс();

	Если ДатаЗаказа = Неопределено Тогда
		БП.Дата = ЗаказПокупателя.Дата;
	Иначе
		БП.Дата = ДатаЗаказа;
	КонецЕсли;

	БП.ЗаказПокупателя = ЗаказПокупателя;
	БП.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ЗаказПолучен;

	Для каждого СтрокаТовара Из ТоварыЗаказа Цикл

		СтрокаБП = БП.СтрокиЗаказа.Добавить();
		СтрокаБП.Номенклатура		= СтрокаТовара.Номенклатура;
		СтрокаБП.ХарактеристикаНоменклатуры = СтрокаТовара.ХарактеристикаНоменклатуры;
		СтрокаБП.Количество  		= СтрокаТовара.Количество;
		СтрокаБП.Цена         		= СтрокаТовара.Цена;
		//СтрокаБП.СкладВыдачи        = СтрокаТовара.Склад;
		СтрокаБП.СкладВыдачи        = ЗаказПокупателя.СкладГруппа;
		СтрокаБП.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.Зарегистрирован;
		//СтрокаБП.АдресДоставки  	= СтрокаТовара.АдресДоставки;
		СтрокаБП.АдресДоставки  	= "";
		//СтрокаБП.СпособДоставки 	= СтрокаТовара.СпособДоставки;
		СтрокаБП.СпособДоставки 	= ЗаказПокупателя.СпособДоставки;
		СтрокаБП.Количество			= СтрокаТовара.Количество;

	КонецЦикла;

	БП.Записать();
	БП.Старт();

	Возврат БП;

КонецФункции

//Проставление способов доставки
Процедура ПроставитьСпособыДоставки() Экспорт 
	
	ЗапросПоИзмененнымКонтрагентам = новый Запрос;
	ЗапросПоИзмененнымКонтрагентам.Текст = "ВЫБРАТЬ
	                                       |	КонтрагентыИзменения.Ссылка
	                                       |ИЗ
	                                       |	Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
	                                       |ГДЕ
	                                       |	КонтрагентыИзменения.Узел = &Узел";
	ЗапросПоИзмененнымКонтрагентам.УстановитьПараметр("Узел",ПланыОбмена.LastMod.НайтиПоКоду("Site"));	
	ВыборкаКонтрагентов = ЗапросПоИзмененнымКонтрагентам.Выполнить().Выбрать();
	
	Пока ВыборкаКонтрагентов.Следующий() цикл
		Если не ВыборкаКонтрагентов.ссылка.этоГруппа Тогда 
			
			об = ВыборкаКонтрагентов.ссылка.ПолучитьОбъект();
			try
				Отказ = Ложь;
				форма = об.ПолучитьФорму("ФормаЭлемента");
				форма.ПроверитьОсновнойДоговорКонтрагентаДляРегЗадания(Отказ, истина);
				форма.записатьВФорме();
				
				ЗапросПоДоговорам = Новый Запрос;
				ЗапросПоДоговорам.Текст = "ВЫБРАТЬ
				                          |	ДоговорыКонтрагентов.Ссылка
				                          |ИЗ
				                          |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				                          |ГДЕ
				                          |	ДоговорыКонтрагентов.Организация = &Организация
				                          |	И НЕ ДоговорыКонтрагентов.СкрытьНаСайте";
				ЗапросПоДоговорам.УстановитьПараметр("Организация",Справочники.Организации.НайтиПоНаименованию("ИП Костин Константин Николаевич СПБ"));	
				РезультатЗапроса = ЗапросПоДоговорам.Выполнить().Выгрузить();
				
				если РезультатЗапроса.Количество() Тогда 
					об.ОсновнойДоговорКонтрагента = РезультатЗапроса[0].Ссылка;	
				КонецЕсли;
			except
			endtry;
			Если ВыборкаКонтрагентов.Ссылка.Покупатель Тогда 
				ВыборкаАдресов = Справочники.АдресаСамовывоза.Выбрать();
				Пока ВыборкаАдресов.Следующий() цикл
					Для к=1 по 20 Цикл 
						Если не АдресЗанят(ВыборкаКонтрагентов.ссылка,"Адрес доставки "+к) и не АдресУжеЕсть(ВыборкаКонтрагентов.ссылка,ВыборкаАдресов.Наименование) Тогда 
							АдрессДоставки               = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
							АдрессДоставки.Активность    = Истина;
							АдрессДоставки.Вид           = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес доставки "+к);
							АдрессДоставки.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
							АдрессДоставки.Объект        = ВыборкаКонтрагентов.ссылка;
							АдрессДоставки.Представление = ВыборкаАдресов.Наименование;
							АдрессДоставки.Записать(Истина);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		УдалениеРегистрацииДанныхПоУзлу(ПланыОбмена.LastMod.НайтиПоКоду("Site"),ВыборкаКонтрагентов.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция АдресЗанят(Контрагент,Адрес)
	
	ВозвращаемоеЗначение = Ложь;
	
	
	Если Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(Адрес).Пустая() Тогда 
			Элемент = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
			Элемент.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты;
			Элемент.Наименование = Адрес;
			Элемент.Тип  = Перечисления.ТипыКонтактнойИнформации.Адрес;
			Элемент.Записать();
	КонецЕсли;
	
	ЗапросПоАдресу = новый Запрос;
	ЗапросПоАдресу.Текст =  "ВЫБРАТЬ
	                        |	КонтактнаяИнформация.Объект
	                        |ИЗ
	                        |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                        |ГДЕ
	                        |	КонтактнаяИнформация.Вид = &Вид
	                        |	И КонтактнаяИнформация.Объект = &Объект" ;
	ЗапросПоАдресу.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(Адрес));
	ЗапросПоАдресу.УстановитьПараметр("Объект",Контрагент);
	
	Результат = ЗапросПоАдресу.Выполнить().Выгрузить();
	Если Результат.Количество()>0 Тогда 
		ВозвращаемоеЗначение = Истина;	
	Иначе
		ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция АдресУжеЕсть(Контрагент,Адрес)
	
	ВозвращаемоеЗначение = Ложь;
	
	ЗапросПоАдресу = новый Запрос;
	ЗапросПоАдресу.Текст =  "ВЫБРАТЬ
	                        |	КонтактнаяИнформация.Объект
	                        |ИЗ
	                        |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                        |ГДЕ
	                        |	КонтактнаяИнформация.Объект = &Объект
	                        |	И КонтактнаяИнформация.Представление ПОДОБНО &Представление" ;
	ЗапросПоАдресу.УстановитьПараметр("Представление",Адрес);
	ЗапросПоАдресу.УстановитьПараметр("Объект",Контрагент);
	
	Результат = ЗапросПоАдресу.Выполнить().Выгрузить();
	Если Результат.Количество()>0 Тогда 
		ВозвращаемоеЗначение = Истина;	
	Иначе
		ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьСтатусЗаказа(ЗаказПокупателя) Экспорт 
	ЗапросПоБП = новый Запрос;
	ЗапросПоБП.Текст = "ВЫБРАТЬ
	                   |	БП_ОбработкаЗаказа.СтатусЗаказа как Статус
	                   |ИЗ
	                   |	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
	                   |ГДЕ
	                   |	БП_ОбработкаЗаказа.ЗаказПокупателя = &ЗаказПокупателя";
	ЗапросПоБП.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапроса = ЗапросПоБП.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.Статус;
	Иначе
		Возврат ЗаказПокупателя.статус;
	КонецЕсли;	
КонецФункции

Функция ПолучитьСтатусСтрокиЗаказа(ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры) Экспорт 
	ЗапросПоБП = новый Запрос;
	ЗапросПоБП.Текст = "ВЫБРАТЬ
	                   |	БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа
	                   |ИЗ
	                   |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                   |ГДЕ
	                   |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.ЗаказПокупателя = &ЗаказПокупателя
	                   |	И БП_ОбработкаСтрокиЗаказа.Номенклатура = &Номенклатура
	                   |	И БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	ЗапросПоБП.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	ЗапросПоБП.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоБП.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = ЗапросПоБП.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.СтатусСтрокиЗаказа;
	Иначе
		Возврат ЗаказПокупателя.статус;
	КонецЕсли;	
КонецФункции

Функция ОплаченЧеком(ЗаказПокупателя)  Экспорт 
	////ЗапросПоРеализациям = новый запрос;
	////ЗапросПоРеализациям.Текст =  "ВЫБРАТЬ
	////                             |	РеализацияТоваровУслуг.Ссылка
	////                             |ИЗ
	////                             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	////                             |ГДЕ
	////                             |	РеализацияТоваровУслуг.Проведен
	////							 ////|	И РеализацияТоваровУслуг.ОплаченоЧеком
	////                             |	И РеализацияТоваровУслуг.Сделка = &ЗаказПокупателя";
	////ЗапросПоРеализациям.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	////РезультатЗапроса = ЗапросПоРеализациям.Выполнить().Выгрузить();
	////Если РезультатЗапроса.Количество()>0 Тогда 
	////	Результат = Истина;
	////иначе
	////	Результат = Ложь;
	////КонецЕсли;
	
	Возврат ложь;
КонецФункции

//ЗавершитьЗаказ
Процедура ЗаказВыполнен(ЗаказПокупателяСсылка) Экспорт 
	
	Об = ЗаказПокупателяСсылка.получитьОбъект();
	
	ЗапросПоБизнесПроцессамЗаказа = новый запрос;
	ЗапросПоБизнесПроцессамЗаказа.Текст = "ВЫБРАТЬ
	|	БП_ОбработкаЗаказа.Ссылка 
	|ИЗ
	|	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
	|ГДЕ
	|	БП_ОбработкаЗаказа.ЗаказПокупателя = &ЗаказПокупателя";
	ЗапросПоБизнесПроцессамЗаказа.УстановитьПараметр("ЗаказПокупателя",об.ссылка);											  
	РезультатЗапроса = ЗапросПоБизнесПроцессамЗаказа.Выполнить().Выгрузить();
	
	Для Каждого БизнесПроцесс из РезультатЗапроса Цикл 
		
		ЗапросПоЗадачамБП = новый запрос;
		ЗапросПоЗадачамБП.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.БизнесПроцесс = &БизнесПроцесс";
		ЗапросПоЗадачамБП.УстановитьПараметр("БизнесПроцесс",БизнесПроцесс.ссылка);
		РезультатЗапросаПоЗадачам = ЗапросПоЗадачамБП.Выполнить().Выгрузить();
		Для Каждого СтрокаЗадачи  из РезультатЗапросаПоЗадачам цикл
			ЗадачаОб = СтрокаЗадачи.Ссылка.получитьОбъект();
			ЗадачаОб.Удалить();
		КонецЦикла;
		
		
		БПОб = БизнесПроцесс.Ссылка.ПолучитьОБъект();
		БПОб.Завершен     = истина;
		БПОб.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ЗаказВыполнен;
		// + S1-177 ДДГ 11 ноя 2024
		БПОб.СтатусСчетаОплаты = Перечисления.СтатусыЭлектронногоСчета.Оплачен;
		// - S1-177 ДДГ 11 ноя 2024
		БПОб.Записать();
		
		ЗапросПоБизнесПроцессамСтрокиЗаказа = новый запрос;
		ЗапросПоБизнесПроцессамСтрокиЗаказа.Текст = "ВЫБРАТЬ
		|	БП_ОбработкаСтрокиЗаказа.Ссылка
		|ИЗ
		|	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
		|ГДЕ
		|	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес";
		ЗапросПоБизнесПроцессамСтрокиЗаказа.УстановитьПараметр("РодительскийБизнесПроцес",БизнесПроцесс.Ссылка);											  
		РезультатЗапросаСтрокиЗаказа = ЗапросПоБизнесПроцессамСтрокиЗаказа.Выполнить().Выгрузить();
		
		Для Каждого БизнесПроцессСтроки из РезультатЗапросаСтрокиЗаказа Цикл 
			
			ЗапросПоЗадачамБПСтроки = новый запрос;
			ЗапросПоЗадачамБПСтроки.Текст = "ВЫБРАТЬ
			|	БП_ЗадачиИсполнителей.Ссылка
			|ИЗ
			|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
			|ГДЕ
			|	БП_ЗадачиИсполнителей.БизнесПроцесс = &БизнесПроцесс";
			ЗапросПоЗадачамБПСтроки.УстановитьПараметр("БизнесПроцесс",БизнесПроцессСтроки.ссылка);
			РезультатЗапросаСтрокиПоЗадачам = ЗапросПоЗадачамБПСтроки.Выполнить().Выгрузить();
			Для Каждого СтрокаЗадачиБпСтроки  из РезультатЗапросаСтрокиПоЗадачам цикл
				ЗадачаОб = СтрокаЗадачиБпСтроки.Ссылка.получитьОбъект();
				ЗадачаОб.Удалить();	
			КонецЦикла;
			
			
			БПОбСтроки = БизнесПроцессСтроки.Ссылка.ПолучитьОБъект();
			БПОбСтроки.Завершен     = истина;

			// + S1-545 ДДГ 20 мар 2025
			Если БПОбСтроки.СтатусСтрокиЗаказа <> Перечисления.БП_СтатусыСтрокЗазака.АннулированКлиентом Тогда
			// - S1-545 ДДГ 20 мар 2025
				БПОбСтроки.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ТоварОтгружен;
			КонецЕсли;

			БПОбСтроки.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаказОтменен(ЗаказПокупателяСсылка) Экспорт

	ЗапросПоБизнесПроцессамЗаказа = новый запрос;
	ЗапросПоБизнесПроцессамЗаказа.Текст = "ВЫБРАТЬ
	|	БП_ОбработкаЗаказа.Ссылка 
	|ИЗ
	|	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
	|ГДЕ
	|	БП_ОбработкаЗаказа.ЗаказПокупателя = &ЗаказПокупателя";
	ЗапросПоБизнесПроцессамЗаказа.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателяСсылка);											  
	РезультатЗапроса = ЗапросПоБизнесПроцессамЗаказа.Выполнить().Выгрузить();
	
	Для Каждого БизнесПроцесс из РезультатЗапроса Цикл 
		
		ЗапросПоЗадачамБП = новый запрос;
		ЗапросПоЗадачамБП.Текст = "ВЫБРАТЬ
		|	БП_ЗадачиИсполнителей.Ссылка
		|ИЗ
		|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		|ГДЕ
		|	БП_ЗадачиИсполнителей.БизнесПроцесс = &БизнесПроцесс";
		ЗапросПоЗадачамБП.УстановитьПараметр("БизнесПроцесс",БизнесПроцесс.ссылка);
		РезультатЗапросаПоЗадачам = ЗапросПоЗадачамБП.Выполнить().Выгрузить();
		Для Каждого СтрокаЗадачи  из РезультатЗапросаПоЗадачам цикл
			ЗадачаОб = СтрокаЗадачи.Ссылка.получитьОбъект();
			ЗадачаОб.Удалить();
		КонецЦикла;
		
		
		БПОб = БизнесПроцесс.Ссылка.ПолучитьОБъект();
		БПОб.Завершен     = истина;
		БПОб.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ОтказКлиента;
		БПОб.Записать();

		ЗапросПоБизнесПроцессамСтрокиЗаказа = новый запрос;
		ЗапросПоБизнесПроцессамСтрокиЗаказа.Текст = "ВЫБРАТЬ
		|	БП_ОбработкаСтрокиЗаказа.Ссылка
		|ИЗ
		|	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
		|ГДЕ
		|	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес";
		ЗапросПоБизнесПроцессамСтрокиЗаказа.УстановитьПараметр("РодительскийБизнесПроцес",БизнесПроцесс.Ссылка);											  
		РезультатЗапросаСтрокиЗаказа = ЗапросПоБизнесПроцессамСтрокиЗаказа.Выполнить().Выгрузить();
		
		Для Каждого БизнесПроцессСтроки из РезультатЗапросаСтрокиЗаказа Цикл 
			
			ЗапросПоЗадачамБПСтроки = новый запрос;
			ЗапросПоЗадачамБПСтроки.Текст = "ВЫБРАТЬ
			|	БП_ЗадачиИсполнителей.Ссылка
			|ИЗ
			|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
			|ГДЕ
			|	БП_ЗадачиИсполнителей.БизнесПроцесс = &БизнесПроцесс";
			ЗапросПоЗадачамБПСтроки.УстановитьПараметр("БизнесПроцесс",БизнесПроцессСтроки.ссылка);
			РезультатЗапросаСтрокиПоЗадачам = ЗапросПоЗадачамБПСтроки.Выполнить().Выгрузить();
			Для Каждого СтрокаЗадачиБпСтроки  из РезультатЗапросаСтрокиПоЗадачам цикл
				ЗадачаОб = СтрокаЗадачиБпСтроки.Ссылка.получитьОбъект();
				ЗадачаОб.Удалить();	
			КонецЦикла;
			
			БПОбСтроки = БизнесПроцессСтроки.Ссылка.ПолучитьОБъект();
			БПОбСтроки.Завершен           = истина;
			БПОбСтроки.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.АннулированКлиентом;
			БПОбСтроки.Записать();
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция ЗакрытьЗаказПокупателя(ЗаказПокупателяСсылка, Комментарий = "") Экспорт

	ЗакрытиеЗаказаПокупателя = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
	ЗакрытиеЗаказаПокупателя.Дата = ТекущаяДата();
	ЗакрытиеЗаказаПокупателя.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	
	СтрокаЗаказы = ЗакрытиеЗаказаПокупателя.Заказы.Добавить();
	СтрокаЗаказы.ЗаказПокупателя = ЗаказПокупателяСсылка;
	ЗакрытиеЗаказаПокупателя.Подразделение = ЗаказПокупателяСсылка.Подразделение;
	ЗакрытиеЗаказаПокупателя.Комментарий   = Комментарий;
	ЗакрытиеЗаказаПокупателя.Записать(РежимЗаписиДокумента.Проведение);

	Возврат ЗакрытиеЗаказаПокупателя;

КонецФункции

Процедура УдалитьЗадачиУточнитьУПокупателяПродлениеРезерва(ЗаказПокупателяСсылка) Экспорт
	ЗапросПоЗадачам = новый запрос;
		ЗапросПоЗадачам.Текст = "ВЫБРАТЬ
		                        |	БП_ЗадачиИсполнителей.Ссылка
		                        |ИЗ
		                        |	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		                        |ГДЕ
		                        |	БП_ЗадачиИсполнителей.Наименование = &Наименование
		                        |	И БП_ЗадачиИсполнителей.ЗаказПокупателя = &ЗаказПокупателя";
		ЗапросПоЗадачам.УстановитьПараметр("Наименование","%Уточнить у покупателя продление резерва%");	
		ЗапросПоЗадачам.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателяСсылка);
		
		РезультатЗапроса = ЗапросПоЗадачам.Выполнить().Выгрузить();
		
		Для Каждого СтрокаЗадача из РезультатЗапроса Цикл 
			Менеджер = РегистрыСведений.ОбъектыКУдалению.СоздатьМенеджерЗаписи();
			Менеджер.Объект = СтрокаЗадача.Ссылка;
			Менеджер.Записать();
		КонецЦикла;

КонецПроцедуры

Процедура ЗакрытьЗадачиОтправкиТовара(ЗаказПокупателяСсылка, СтрокаЗаказа, УдалитьПолностью = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БП_ЗадачиИсполнителей.Ссылка
	|ИЗ
	|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
	|ГДЕ
	|	  БП_ЗадачиИсполнителей.ЗаказПокупателя = &ЗаказПокупателя
	|	И БП_ЗадачиИсполнителей.ТипЗадачи = &ТипЗадачи
	|	И НЕ БП_ЗадачиИсполнителей.Выполнена
	|	И БП_ЗадачиИсполнителей.Номенклатура = &Номенклатура
	|	И БП_ЗадачиИсполнителей.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту.Ссылка
	|ИЗ
	|	Задача.БП_ЗадачиИсполнителей.ТоварыКВыдачеКлиенту КАК БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту
	|ГДЕ
	|	  БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту.Ссылка.ЗаказПокупателя = &ЗаказПокупателя
	|	И БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту.Ссылка.ТипЗадачи = &ТипЗадачи
	|	И НЕ БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту.Ссылка.Выполнена
	|	И БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту.Номенклатура = &Номенклатура
	|	И БП_ЗадачиИсполнителейТоварыКВыдачеКлиенту.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|";

	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателяСсылка);
	Запрос.УстановитьПараметр("ТипЗадачи", Перечисления.БП_ТипыЗадач.ОтправитьТовар);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаЗаказа.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаЗаказа.ХарактеристикаНоменклатуры);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Пока ВыборкаРезультата.Следующий() Цикл

		ЗадачаОб = ВыборкаРезультата.Ссылка.ПолучитьОбъект();

		Если УдалитьПолностью Тогда
			ЗадачаОб.Удалить();
		Иначе
			ЗадачаОб.УстановитьПометкуУдаления(Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСтрокуЗаказа(ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,цена) Экспорт 
		ЗапросПоСтрокеЗаказа = новый Запрос;
		ЗапросПоСтрокеЗаказа.Текст = "ВЫБРАТЬ
		                             |	СтрокиЗаказа.Ссылка Как СтрокаЗаказа
		                             |ИЗ
		                             |	Справочник.СтрокиЗаказа КАК СтрокиЗаказа
		                             |ГДЕ
		                             |	СтрокиЗаказа.ЗаказПокупателя = &ЗаказПокупателя
		                             |	И СтрокиЗаказа.Номенклатура = &Номенклатура
		                             |	И СтрокиЗаказа.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		                             |	И СтрокиЗаказа.ЦенаПродажи = &ЦенаПродажи";
		ЗапросПоСтрокеЗаказа.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
		ЗапросПоСтрокеЗаказа.УстановитьПараметр("Номенклатура",Номенклатура);
		ЗапросПоСтрокеЗаказа.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
		ЗапросПоСтрокеЗаказа.УстановитьПараметр("ЦенаПродажи",Цена);
		
		РезультатЗапроса = ЗапросПоСтрокеЗаказа.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() >0 Тогда 
			
			СтрокаЗаказа = РезультатЗапроса[0].СтрокаЗаказа;
		Иначе
			СтрокаЗаказа  = Справочники.СтрокиЗаказа.ПустаяСсылка();
		КонецЕсли;
		
		Возврат СтрокаЗаказа;
	КонецФункции

Процедура ПроверитьСрокРезерва() Экспорт 
	ЗапросПоНевыполненнымЗаказам = новый запрос;
	ЗапросПоНевыполненнымЗаказам.Текст = "ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ) КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
	|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата > &Дата";
	ЗапросПоНевыполненнымЗаказам.УстановитьПараметр("Дата",Дата("20150522"));
	
	РезультатЗапроса = ЗапросПоНевыполненнымЗаказам.Выполнить().Выгрузить();
		
		Для каждого СтрокаРезультат из РезультатЗапроса цикл
			ЗаказПокупателя       = СтрокаРезультат.ЗаказПокупателя;
			КоличествоДнейРезерва = ЗаказПокупателя.КоличествоДнейРезерва;
			
			СтатусЗаказа = ПолучитьСтатусЗаказа(ЗаказПокупателя);
			
			Если (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.ЗаказВРаботе) 
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.СборкаЗаказа) 
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.ОтказКлиента)
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.Удален) 
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.ГотовКОтгрузке) 
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.ЕстьПроблемныеПозиции) 
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.ЗаказВыполнен)
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.ОтказСклада)
				или (СтатусЗаказа=Перечисления.БП_СтатусыЗаказов.Удален)Тогда
				
				Продолжить;
			КонецЕсли;
			
			Если ЗаказПокупателя.Дата +КоличествоДнейРезерва*60*60*24 <= ТекущаяДата() и не КоличествоДнейРезерва=0 Тогда 
				//Найдем уже присутствующюю задачу
				ЗапросПоЗадачамОплата = новый запрос;
				ЗапросПоЗадачамОплата.Текст = "ВЫБРАТЬ
				|	БП_ЗадачиИсполнителей.Ссылка,
				|	БП_ЗадачиИсполнителей.БизнесПроцесс КАК БП
				|ИЗ
				|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
				|ГДЕ
				|	НЕ БП_ЗадачиИсполнителей.Выполнена
				|	И БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование
				|	И БП_ЗадачиИсполнителей.ЗаказПокупателя = &ЗаказПокупателя";
				ЗапросПоЗадачамОплата.УстановитьПараметр("Система", Справочники.Пользователи.Система);
				ЗапросПоЗадачамОплата.УстановитьПараметр("Наименование","Уточнить у покупателя продление резерва");
				ЗапросПоЗадачамОплата.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
				
				РезультатЗапросаОплата = ЗапросПоЗадачамОплата.Выполнить().Выгрузить();
				
				Если РезультатЗапросаОплата.Количество() >0 Тогда 
					Продолжить;
				Иначе
					Если ПолучитьОстатокПоЗаказу(ЗаказПокупателя)>0 Тогда 
						Задача = Задачи.БП_ЗадачиИсполнителей.СоздатьЗадачу();
						Задача.Наименование = "Уточнить у покупателя продление резерва";
						Если ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
							Задача.Подразделение = Справочники.Подразделения.НайтиПоКоду("4");	
						Иначе
							Задача.Подразделение = ЗаказПокупателя.Подразделение;	
						КонецЕсли;
						Задача.Роль = Перечисления.БП_РолиИсполнителей.Менеджер;
						Задача.ЗаказПокупателя = ЗаказПокупателя;
						Задача.Дата = ТекущаяДата();
						Задача.Записать();
						ОтправитьСМСОбОкончанииСрокаРезерва(ЗаказПокупателя);
						ОтправитьEmailОбОкончанииСрокаРезерва(ЗаказПокупателя);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ЗаказПокупателя.ответственный = Справочники.Пользователи.Сайт 
				и ЗаказПокупателя.Статус = Справочники.СтатусыСтрокиЗаказа.Корзина и не ЕстьБППоЗаказу(ЗаказПокупателя) Тогда 
				Если (ТекущаяДата() - ЗаказПокупателя.дата)/(60*60*24) >2 и ЗаказПокупателя.Контрагент.Наименование = "Гость" Тогда 
					ЗаказПокупателяОб = ЗаказПокупателя.ПолучитьОбъект();
					ЗаказПокупателяОб.статус = Справочники.СтатусыСтрокиЗаказа.АннулированКлиентом;
					ЗаказПокупателяОб.Товары.Очистить();
					ЗаказПокупателяОб.Записать(РежимЗаписиДокумента.Проведение);
					
					//ЗакрытиеЗаказовПокупателей = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
					//ЗакрытиеЗаказовПокупателей.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
					//ЗакрытиеЗаказовПокупателей.Дата = ТекущаяДата();
					//ЗакрытиеЗаказовПокупателей.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					//ЗаказДляЗакрытия = ЗакрытиеЗаказовПокупателей.Заказы.Добавить();
					//ЗаказДляЗакрытия.ЗаказПокупателя = ЗаказПокупателя;
					//ЗакрытиеЗаказовПокупателей.Комментарий = "Закрыт автоматически";
					//ЗакрытиеЗаказовПокупателей.Записать(РежимЗаписиДокумента.Проведение);
				ИначеЕсли (ТекущаяДата() - ЗаказПокупателя.дата)/(60*60*24)>48 и  не ЕстьБППоЗаказу(ЗаказПокупателя) Тогда 
					
					ЗаказПокупателяОб = ЗаказПокупателя.ПолучитьОбъект();
					ЗаказПокупателяОб.статус = Справочники.СтатусыСтрокиЗаказа.АннулированКлиентом;
					ЗаказПокупателяОб.Товары.Очистить();
					ЗаказПокупателяОб.Записать(РежимЗаписиДокумента.Проведение);
					
					//ЗакрытиеЗаказовПокупателей = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
					//ЗакрытиеЗаказовПокупателей.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
					//ЗакрытиеЗаказовПокупателей.Дата = ТекущаяДата();
					//ЗакрытиеЗаказовПокупателей.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					//ЗаказДляЗакрытия = ЗакрытиеЗаказовПокупателей.Заказы.Добавить();
					//ЗаказДляЗакрытия.ЗаказПокупателя = ЗаказПокупателя;
					//ЗакрытиеЗаказовПокупателей.Комментарий = "Закрыт автоматически";
					//ЗакрытиеЗаказовПокупателей.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
КонецПроцедуры

Процедура ОтправитьСМСОбОкончанииСрокаРезерва(ЗаказПокупателя)
	
	НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);

	
	Если ЗаказПокупателя.ПересылКлиента Тогда 
		НомерЗаказа = ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер);
		Попытка
			ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Ваш резерв "+ЗаказПокупателя.Организация.Подразделение+" " +НомерЗаказа+" истекает.",НомерТелефона);
			//ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Резерв запчастей в подразделении "+ЗаказПокупателя.Организация.Подразделение+" соглсно заказу " +НомерЗаказа+" истекает сегодня.","+79219340568");			
			
			Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
			Менеджер.Активность        = Истина;
			Менеджер.Период            = ТекущаяДата();
			Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
			Менеджер.СодержаниеСобытия = "Ваш резерв "+ЗаказПокупателя.Организация.Подразделение+" " +НомерЗаказа+" истекает.";
			Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
			Менеджер.Ответственный     = Справочники.Пользователи.Система;
			Менеджер.СсылкаНаОбъект    = "Ваш резерв "+ЗаказПокупателя.Организация.Подразделение+" " +НомерЗаказа+" истекает.";
			
			Менеджер.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

Процедура ОтправитьEmailОбОкончанииСрокаРезерва(ЗаказПокупателя)
////	Если ЗаказПокупателя.ПересылКлиента Тогда 
////		
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);

////		// + 58813 ДДГ 28 апр 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ 28 апр 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Истекает срок резерва товара. Интернет-магазин ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Истекает срок резерва товара. Интернет-магазин ""7detalei.ru""";;
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = БизнесПроцессы.БП_ОбработкаЗаказа.ПолучитьМакет("ШапкаИстекаетСрокРезерва").ПолучитьТекст();
////		ТекстПодвал = БизнесПроцессы.БП_ОбработкаЗаказа.ПолучитьМакет("ПодвалИстекаетСрокРезерва").ПолучитьТекст(); 
////		ТекстСтрока = БизнесПроцессы.БП_ОбработкаЗаказа.ПолучитьМакет("Строка").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЗаказПокупателя.товары цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","Истекает срок резерва");
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ДатаИстеченияРезерва",Формат(ЗаказПокупателя.дата + ЗаказПокупателя.КоличествоДнейРезерва*60*60*24,"ДФ=dd.MM.yyyy"));
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#АдресСамовывоза",Организация.Подразделение.АдресСамовывозаДляПисьма);
////	
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо();
////		
////		Менеджер                   = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = Письмо.Тема;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		
////		Менеджер.Записать();
////	КонецЕсли;

КонецПроцедуры

// + PN3-141 ДДГ  4 мар 2024
Функция ОтправитьСМС(ТекстСообщения, НомерТелефона, Контрагент = Неопределено) Экспорт

	////СтруктураВозврата = Новый Структура;
	////ТекстОшибки = "";

	////ШлюзСМССсылка	= Константы.БП_ИспользуемыйSMSШлюз.Получить();
	////ШлюзСМС			= ШлюзСМССсылка.ПолучитьОбъект();
	////ТекстОтвета		= ШлюзСМС.ОтправитьСМС(ТекстСообщения, НомерТелефона, Контрагент);

	////ОтветСервисаСоотв = РазработкаСервер.ПолучитьДанныеДжСОН(ТекстОтвета);

	////МассивИдСМС			= ОтветСервисаСоотв.Получить("cid");
	////МассивИдСтатистики	= ОтветСервисаСоотв.Получить("id");

	////Ошибка = (МассивИдСМС = Неопределено) И (МассивИдСтатистики = Неопределено);

	////идСМС = 0;
	////идСтатистики = 0;

	////Если Ошибка Тогда
	////	ТекстОшибки = "Не удалось отправить SMS.";
	////Иначе
	////	идСМС				= ?(МассивИдСМС.Количество(), МассивИдСМС[0], 0);
	////	идСтатистики		= ?(МассивИдСтатистики.Количество(), МассивИдСтатистики[0], 0);
	////КонецЕсли;

	////СтруктураВозврата.Вставить("Ошибка"			, Ошибка);
	////СтруктураВозврата.Вставить("ТекстОшибки"	, ТекстОшибки);
	////СтруктураВозврата.Вставить("идСМС"			, идСМС);
	////СтруктураВозврата.Вставить("идСтатистики"	, идСтатистики);

	////Возврат СтруктураВозврата;
	Возврат Null;

КонецФункции
// - PN3-141 ДДГ  4 мар 2024

Процедура ПеревестиСтатусыЗаявокНаДеталь()  Экспорт 
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапросНаДеталь.Ссылка
	               |ИЗ
	               |	Документ.ЗапросНаДеталь КАК ЗапросНаДеталь
	               |ГДЕ
	               |	НЕ ЗапросНаДеталь.Закрыт
	               |	И ЗапросНаДеталь.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗапросыНаДетали.ЗапросНаДетальКонстантину)";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() цикл
		об = РезультатЗапроса.ссылка.получитьОбъект();
		
		ЗапросПоПисьмам = новый запрос;
		ЗапросПоПисьмам.Текст =  "ВЫБРАТЬ
		|	ЭлектронноеПисьмо.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
		|ГДЕ
		|	ЭлектронноеПисьмо.Ссылка.Тема ПОДОБНО &Тема СПЕЦСИМВОЛ ""\""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлектронноеПисьмо.Ссылка.Дата УБЫВ";
		ЗапросПоПисьмам.УстановитьПараметр("Тема","%\["+РезультатЗапроса.ссылка.номер+"\]%");
		
		РезультатЗапросаПоПисьмам =ЗапросПоПисьмам.Выполнить().Выгрузить() ;
		
		Если РезультатЗапросаПоПисьмам.Количество() >0 Тогда 
			Письмо = РезультатЗапросаПоПисьмам[0].ссылка;
			
			Если Письмо.ссылка.статусПисьма = Перечисления.СтатусыПисем.Полученное и не об.СостояниеЗапроса = Перечисления.СостояниеЗавкиНаДеталь.ПолученОтвет Тогда 
				
				об = РезультатЗапроса.ссылка.получитьОбъект();
				Если не об.СостояниеЗапроса  = Перечисления.СостояниеЗавкиНаДеталь.НаУтверждении и не об.СостояниеЗапроса = Перечисления.СостояниеЗавкиНаДеталь.ДетальЗаказана Тогда 
					об.СостояниеЗапроса = Перечисления.СостояниеЗавкиНаДеталь.ПолученОтвет;
				КонецЕсли;
				
				Если не об.СостояниеЗапроса = Перечисления.СостояниеЗавкиНаДеталь.ДетальЗаказана и об.СостояниеЗапроса  = Перечисления.СостояниеЗавкиНаДеталь.НаУтверждении Тогда 
					Если Врег(Прав(Письмо.ссылка.Тема,70)) = Врег("Просьба подтвердить закупку деталей по запросу на запчасть ["+РезультатЗапроса.ссылка.номер+"]") Тогда 
						об.СостояниеЗапроса = Перечисления.СостояниеЗавкиНаДеталь.ДетальЗаказана;
						Задача = Задачи.БП_ЗадачиИсполнителей.СоздатьЗадачу();
						Задача.Дата = ТекущаяДата();
						Задача.Наименование ="Сформировать заказы по запросу";
						Задача.ЗапросНаДеталь = об.ссылка;
						Задача.Исполнитель    = об.Ответственный;
						Задача.Записать();	
					КонецЕсли;
				КонецЕсли;
				
				Попытка
					об.записать();
				Исключение
				КонецПопытки;
				
				ЗапросПоЗадачам = новый запрос;
				ЗапросПоЗадачам.Текст = "ВЫБРАТЬ
				|	БП_ЗадачиИсполнителей.Ссылка
				|ИЗ
				|	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
				|ГДЕ
				|	БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование
				|	И НЕ БП_ЗадачиИсполнителей.Выполнена
				|	И БП_ЗадачиИсполнителей.ЗапросНаДеталь = &ЗапросНаДеталь";
				ЗапросПоЗадачам.УстановитьПараметр("Наименование","Пришел ответ на запрос. Свяжитесь с клиентом");
				ЗапросПоЗадачам.УстановитьПараметр("ЗапросНаДеталь",об.ссылка);
				РезультатЗапросНаЗапчасть = ЗапросПоЗадачам.Выполнить().Выгрузить();
				Если РезультатЗапросНаЗапчасть.Количество()>0 Тогда 
					
				иначе
					ЗадачаПользователю = Задачи.БП_ЗадачиИсполнителей.СоздатьЗадачу();
					ЗадачаПользователю.Наименование   = "Пришел ответ на запрос. Свяжитесь с клиентом";
					ЗадачаПользователю.ЗапросНаДеталь = об.ссылка;
					ЗадачаПользователю.Подразделение  = об.подразделение;
					ЗадачаПользователю.Роль           = Перечисления.БП_РолиИсполнителей.Менеджер;
					ЗадачаПользователю.Исполнитель    = об.ответственный;
					ЗадачаПользователю.Дата 		  = ТекущаяДата();
					ЗадачаПользователю.Записать();
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ЗапросПоПисьмам = новый запрос;
		ЗапросПоПисьмам.Текст =  "ВЫБРАТЬ
		                         |	ЭлектронноеПисьмоИзменения.Ссылка КАК Ссылка
		                         |ИЗ
		                         |	Документ.ЭлектронноеПисьмо.Изменения КАК ЭлектронноеПисьмоИзменения
		                         |ГДЕ
		                         |	ЭлектронноеПисьмоИзменения.Ссылка.Тема ПОДОБНО &Тема СПЕЦСИМВОЛ ""\""
		                         |	И ЭлектронноеПисьмоИзменения.Ссылка.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыПисем.Полученное)
		                         |	И ЭлектронноеПисьмоИзменения.Узел = &Узел
		                         |
		                         |УПОРЯДОЧИТЬ ПО
		                         |	ЭлектронноеПисьмоИзменения.Ссылка.Дата УБЫВ";
		ЗапросПоПисьмам.УстановитьПараметр("Тема","%\["+РезультатЗапроса.ссылка.номер+"\]%");
		ЗапросПоПисьмам.УстановитьПараметр("Узел", ПланыОбмена.LastMod.НайтиПоКоду("Site"));
		
		
		РезультатЗапросаПоПисьмам = ЗапросПоПисьмам.Выполнить().Выбрать() ;
		
		Пока РезультатЗапросаПоПисьмам.Следующий() цикл
			ЕмейлПользователя  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(об.Ответственный);
			НовоеПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовоеПисьмо,РезультатЗапросаПоПисьмам.Ссылка);
			НовоеПисьмо.УчетнаяЗапись	  = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("robot@7detalei.ru");
			НовоеПисьмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
			НовоеПисьмо.Дата = ТекущаяДата();
			
			НовоеПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			НовоеПисьмо.Дата = ТекущаяДата();
			НовоеПисьмо.КомуТЧ.Очистить();
			НовоеПисьмо.КопииТЧ.Очистить();
			НовоеПисьмо.Кому 			   = ЕмейлПользователя;
			НовоеПисьмо.КомуПредставление  = об.ответственный;
			НовоеПисьмо.КопииПредставление = "";
			НовоеПисьмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
			НовоеПисьмо.ОтправительАдресЭлектроннойПочты  = "parts@7detalei.ru";
			НовоеПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("parts@7detalei.ru");
			НовоеПисьмо.Номер = "";
			НовоеПисьмо.ДатаТранспорта = Дата("00010101");
				
			Получатели = НовоеПисьмо.КомуТЧ.Добавить();
			Получатели.АдресЭлектроннойПочты = ЕмейлПользователя;
			Получатели.Представление 	     = об.ответственный;
			
			Если об.Куратор<> Справочники.Пользователи.ПустаяСсылка() Тогда 
				ЕмейлКуратора =  ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(об.Куратор);
				Получатели = НовоеПисьмо.КомуТЧ.Добавить();
				Получатели.АдресЭлектроннойПочты = ЕмейлКуратора;
				Получатели.Представление 	     = об.Куратор;
			КонецЕсли;
			
			Если Найти(РезультатЗапросаПоПисьмам.Ссылка.Тема,"Просьба подтвердить закупку деталей")<>0 Тогда 
				НовоеПисьмо.ТекстПисьма = "Необходимо выкупить запчасти по запросу №" + об.номер + Символы.ПС+Символы.ПС + НовоеПисьмо.ТекстПисьма;
				Получатели = НовоеПисьмо.КомуТЧ.Добавить();
				Получатели.АдресЭлектроннойПочты = ПолучитьАдресЭлектроннойПочты(об.Контрагент);
				Получатели.Представление 	     = об.Контрагент;
				Если об.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Дима запчасти") Тогда  
					Получатели = НовоеПисьмо.КомуТЧ.Добавить();
					Получатели.АдресЭлектроннойПочты = "zokazi.lv@gmail.com";
					Получатели.Представление 	     = "Роберт Бондаренко";
				КонецЕсли;
	            об.СодержаниеЗапроса             = Перечисления.СостояниеЗавкиНаДеталь.ДетальЗаказана;
				об.записать();
				
				//Нужно создать заказ поставщику, но откуда взять номенклатуру?
				//TODO
			КонецЕсли;	
			
			НовоеПисьмо.Записать();
			
			
			ЗапросПоВложениям = новый запрос;
			ЗапросПоВложениям.Текст = "ВЫБРАТЬ
			|	ВложенияЭлектронныхПисем.Ссылка
			|ИЗ
			|	Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
			|ГДЕ
			|	ВложенияЭлектронныхПисем.Объект = &Объект";
			ЗапросПоВложениям.УстановитьПараметр("Объект",РезультатЗапросаПоПисьмам.Ссылка);									  
			
			РезультатЗапросаПоВложениям = ЗапросПоВложениям.Выполнить().Выгрузить();
			
			Если РезультатЗапросаПоВложениям.Количество()> 0 Тогда 
				НовоеПисьмо.ЕстьВложения   = Истина;
				НовоеПисьмо.Записать();
			КонецЕсли;
			
			Для Каждого СтрокаРезультатаЗапросаПоВложениям из РезультатЗапросаПоВложениям цикл
				
				обв = СтрокаРезультатаЗапросаПоВложениям.Ссылка.ПолучитьОбъект();
				обв.Объект = НовоеПисьмо.Ссылка;
				обв.Записать();
				
			КонецЦикла;
			НовоеПисьмо.ОтправитьПисьмо();
			
			УдалениеРегистрацииДанныхПоУзлу(ПланыОбмена.LastMod.НайтиПоКоду("Site"),РезультатЗапросаПоПисьмам.Ссылка);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЗадачуМенеджеру(ЗапросНаДеталь,Номенклатура,Характеристика,Подразделение,склад)
	
	Объект = ЗапросНаДеталь.ПолучитьОбъект();
	Объект.ОтправленSMS = Истина;
	Объект.Записать();
	
	Задача = Задачи.БП_ЗадачиИсполнителей.СоздатьЗадачу();
	Задача.Дата 	      			  = ТекущаяДата();
	Задача.ЗапросНаДеталь			  = ЗапросНаДеталь;
	Задача.Наименование   			  = "Связаться с клиентом по запчастям из системы ожидания";
	Задача.Номенклатура   			  = Номенклатура;
	Задача.ХарактеристикаНоменклатуры = Характеристика;
	Задача.Роль 	      			  = Перечисления.БП_РолиИсполнителей.Менеджер;
	Задача.Подразделение			  = Подразделение;
	Задача.СкладДляПроверкиОстатка    = Склад; 
	Задача.Записать();
	
КонецФункции

Функция ЕстьБППоЗаказу(ЗаказПокупателя)
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	БП_ОбработкаЗаказа.Ссылка
	|ИЗ
	|	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
	|ГДЕ
	|	БП_ОбработкаЗаказа.ЗаказПокупателя = &ЗаказПокупателя" ;
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗАпроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗАпроса.Количество() Тогда 
		Возврат истина	
	иначе
		Возврат Ложь;		
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьДокументДвиженияСтрок(ЗаказПокупателя)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыСтрокЗаказаОбороты.Регистратор
	               |ИЗ
	               |	РегистрНакопления.СтатусыСтрокЗаказа.Обороты(, , Регистратор, ) КАК СтатусыСтрокЗаказаОбороты
	               |ГДЕ
	               |	СтатусыСтрокЗаказаОбороты.СтрокаЗаказа.ЗаказПокупателя = &ЗаказПокупателя";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Регистратор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции
#КонецОбласти

#Область КонтактнаяИнформация
Функция ПолучитьАдресЭлектроннойПочты_БезУчетаАккаунтов(Контрагент) Экспорт 
	Адрес = "";
	
	ЗапросПоАдресу = Новый запрос;
	ЗапросПоАдресу.Текст= "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	ЗапросПоАдресу.УстановитьПараметр("Объект",Контрагент);	
	ЗапросПоАдресу.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
	ЗапросПоАдресу.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес для маркетинговой рассылки"));	
																									 
	РезультетЗапроса = ЗапросПоАдресу.Выполнить().Выгрузить();
	
	Если РезультетЗапроса.Количество()>0 Тогда 
		Адрес = РезультетЗапроса[0].Представление; 	
	Иначе 
		ЗапросПоАдресу = Новый запрос;
		ЗапросПоАдресу.Текст= "ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
		ЗапросПоАдресу.УстановитьПараметр("Объект",Контрагент);	
		ЗапросПоАдресу.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
		ЗапросПоАдресу.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами);	
		
		РезультетЗапроса = ЗапросПоАдресу.Выполнить().Выгрузить();
		
		Если РезультетЗапроса.Количество()>0 Тогда 
			Адрес = РезультетЗапроса[0].Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Адрес = "" Тогда 
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СайтПользователиКонтрагенты.Пользователь.ЭлектроннаяПочта как ЭлектроннаяПочта
		               |ИЗ
		               |	РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
		               |ГДЕ
		               |	СайтПользователиКонтрагенты.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		
		РезультатЗапроса = запрос.Выполнить().Выгрузить();
		Если РезультатЗапроса.Количество() Тогда 
			Адрес = РезультатЗапроса[0].ЭлектроннаяПочта;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Адрес;
КонецФункции

Функция ПолучитьНомерТелефонаКонтрагента_БезУчетаАккаунтов(Контрагент) Экспорт 
Телефон = "";
	
	ЗапросПотелефону = Новый запрос;
	ЗапросПотелефону.Текст= "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	ЗапросПотелефону.УстановитьПараметр("Объект",Контрагент);	
	ЗапросПотелефону.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);	
	ЗапросПотелефону.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);	
	
	РезультетЗапроса = ЗапросПотелефону.Выполнить().Выгрузить();
	
	Если РезультетЗапроса.Количество()>0 Тогда 
		Телефон = РезультетЗапроса[0].Представление; 	
	Иначе 
		ЗапросПотелефону = Новый запрос;
		ЗапросПотелефону.Текст= "ВЫБРАТЬ
		                        |	КонтактнаяИнформация.Представление
		                        |ИЗ
		                        |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		                        |ГДЕ
		                        |	КонтактнаяИнформация.Объект = &Объект
		                        |	И КонтактнаяИнформация.Тип = &Тип
		                        |	И КонтактнаяИнформация.Вид.Наименование = ""мобильный""";
		ЗапросПотелефону.УстановитьПараметр("Объект",Контрагент);	
		ЗапросПотелефону.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);	

		
		РезультетЗапроса = ЗапросПотелефону.Выполнить().Выгрузить();
		
		Если РезультетЗапроса.Количество()>0 Тогда 
			Телефон = РезультетЗапроса[0].Представление;
		КонецЕсли;
		
	КонецЕсли;
	Возврат Телефон;
КонецФункции

// + PN3-134 ДДГ 27 янв 2024
Функция ПолучитьАдресЭлектроннойПочты(Контрагент) Экспорт

	Представление = "";

	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ АдресаКонтрагента
	| ИЗ РегистрСведений.КонтактнаяИнформация
	|КАК КонтактнаяИнформация
	|ГДЕ КонтактнаяИнформация.Объект			= &Объект
	|  И КонтактнаяИнформация.Тип				= ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|  И КонтактнаяИнформация.Вид.Наименование	= ""Адрес для маркетинговой рассылки""
	|;
	|
	|ВЫБРАТЬ АдресаКонтрагента.Представление
	|ПОМЕСТИТЬ НеВсеАдресаКонтрагента
	|ИЗ АдресаКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	| ИЗ РегистрСведений.КонтактнаяИнформация
	|КАК КонтактнаяИнформация
	|ГДЕ ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ АдресаКонтрагента)
	|  И КонтактнаяИнформация.Объект = &Объект
	|  И КонтактнаяИнформация.Тип    = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|  И КонтактнаяИнформация.Вид    = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|;
	|
	|ВЫБРАТЬ НеВсеАдресаКонтрагента.Представление
	|ПОМЕСТИТЬ ВсеАдресаКонтрагента
	|ИЗ НеВсеАдресаКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СайтПользователиКонтрагенты.Пользователь.ЭлектроннаяПочта КАК Представление
	| ИЗ РегистрСведений.СайтПользователиКонтрагенты
	|КАК СайтПользователиКонтрагенты
	|ГДЕ ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ НеВсеАдресаКонтрагента)
	|  И СайтПользователиКонтрагенты.Контрагент = &Объект
	|  И СайтПользователиКонтрагенты.Пользователь.ЭлектроннаяПочта <> """"
	|;
	|
	|ВЫБРАТЬ
	|	РегистрСведенийАллокацииАккаунтовСрезПоследних.Аккаунт,
	|	РегистрСведенийАллокацииАккаунтовСрезПоследних.Подтверждено,
	|	РегистрСведенийАллокацииАккаунтовСрезПоследних.Аккаунт.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ АллокацииКонтрагентов
	|ИЗ РегистрСведений.АллокацииАккаунтов.СрезПоследних(
	|	, ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ ВсеАдресаКонтрагента)
	|	И ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.Контрагенты)
	|	И ОбъектАллокации = &Объект
	|) КАК РегистрСведенийАллокацииАккаунтовСрезПоследних
	|
	|ГДЕ ТипАллокации <> ЗНАЧЕНИЕ(Перечисление.ТипАллокации.Отвязка)
	|;
	|
	|ВЫБРАТЬ
	|	ВсеАдресаКонтрагента.Представление,
	|	ИСТИНА КАК ПодтвержденАккаунт,
	|	ЛОЖЬ КАК ПометкаУдаленияАккаунт,
	|	ИСТИНА КАК Основная,
	|	ИСТИНА КАК Подтверждено,
	|	ЛОЖЬ КАК ПометкаУдаления
	|ИЗ ВсеАдресаКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.Логин КАК Представление,
	|	АллокацииКонтрагентов.Подтверждено КАК ПодтвержденАккаунт,
	|	АллокацииКонтрагентов.ПометкаУдаления КАК ПометкаУдаленияАккаунт,
	|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.Основная КАК Основная,
	|	АллокацииАккаунтовСрезПоследних.Подтверждено,
	|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ РегистрСведений.АллокацииАккаунтов.СрезПоследних(
	|	, ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ ВсеАдресаКонтрагента)
	|	И Аккаунт В (ВЫБРАТЬ Аккаунт ИЗ АллокацииКонтрагентов)
	|	И ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.ПользователиСайтов)
	|	И ОбъектАллокации ССЫЛКА Справочник.КонтактнаяИнформация
	|) КАК АллокацииАккаунтовСрезПоследних
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ АллокацииКонтрагентов
	|ПО АллокацииАккаунтовСрезПоследних.Аккаунт = АллокацииКонтрагентов.Аккаунт
	|
	|ГДЕ ТипАллокации <> ЗНАЧЕНИЕ(Перечисление.ТипАллокации.Отвязка)
	|  И ОбъектАллокации.ВидЛогина = 2
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаленияАккаунт ВОЗР,
	|	ПометкаУдаления ВОЗР,
	|	ПодтвержденАккаунт УБЫВ,
	|	Подтверждено УБЫВ,
	|	Основная УБЫВ
	|");

	Запрос.УстановитьПараметр("Объект", Контрагент);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда
		Представление = ВыборкаРезультата.Представление;
	КонецЕсли;

	Возврат Представление;

КонецФункции

Функция ПолучитьНомерТелефонаКонтрагента(Контрагент) Экспорт

	Представление = "";

	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ ТелефоныКонтрагента
	| ИЗ РегистрСведений.КонтактнаяИнформация
	|КАК КонтактнаяИнформация
	|ГДЕ КонтактнаяИнформация.Объект = &Объект
	|  И КонтактнаяИнформация.Тип    = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|  И КонтактнаяИнформация.Вид    = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|;
	|
	|ВЫБРАТЬ ТелефоныКонтрагента.Представление
	|ПОМЕСТИТЬ ВсеТелефоныКонтрагента
	|ИЗ ТелефоныКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	| ИЗ РегистрСведений.КонтактнаяИнформация
	|КАК КонтактнаяИнформация
	|ГДЕ ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ ТелефоныКонтрагента)
	|  И КонтактнаяИнформация.Объект			= &Объект
	|  И КонтактнаяИнформация.Тип				= ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|  И КонтактнаяИнформация.Вид.Наименование	= ""мобильный""
	|;
	|
	|ВЫБРАТЬ
	|	РегистрСведенийАллокацииАккаунтовСрезПоследних.Аккаунт,
	|	РегистрСведенийАллокацииАккаунтовСрезПоследних.Подтверждено,
	|	РегистрСведенийАллокацииАккаунтовСрезПоследних.Аккаунт.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ АллокацииКонтрагентов
	|ИЗ РегистрСведений.АллокацииАккаунтов.СрезПоследних(
	|	, ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ ВсеТелефоныКонтрагента)
	|	И ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.Контрагенты)
	|	И ОбъектАллокации = &Объект
	|) КАК РегистрСведенийАллокацииАккаунтовСрезПоследних
	|
	|ГДЕ ТипАллокации <> ЗНАЧЕНИЕ(Перечисление.ТипАллокации.Отвязка)
	|;
	|
	|ВЫБРАТЬ
	|	ВсеТелефоныКонтрагента.Представление,
	|	ИСТИНА КАК ПодтвержденАккаунт,
	|	ЛОЖЬ КАК ПометкаУдаленияАккаунт,
	|	ИСТИНА КАК Основная,
	|	ИСТИНА КАК Подтверждено,
	|	ЛОЖЬ КАК ПометкаУдаления
	|ИЗ ВсеТелефоныКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.Логин КАК Представление,
	|	АллокацииКонтрагентов.Подтверждено КАК ПодтвержденАккаунт,
	|	АллокацииКонтрагентов.ПометкаУдаления КАК ПометкаУдаленияАккаунт,
	|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.Основная КАК Основная,
	|	АллокацииАккаунтовСрезПоследних.Подтверждено,
	|	АллокацииАккаунтовСрезПоследних.ОбъектАллокации.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ РегистрСведений.АллокацииАккаунтов.СрезПоследних(
	|	, ИСТИНА В (ВЫБРАТЬ КОЛИЧЕСТВО(*) < 1 ИЗ ВсеТелефоныКонтрагента)
	|	И Аккаунт В (ВЫБРАТЬ Аккаунт ИЗ АллокацииКонтрагентов)
	|	И ВидАллокации = ЗНАЧЕНИЕ(Перечисление.ВидыАллокаций.ПользователиСайтов)
	|	И ОбъектАллокации ССЫЛКА Справочник.КонтактнаяИнформация
	|) КАК АллокацииАккаунтовСрезПоследних
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ АллокацииКонтрагентов
	|ПО АллокацииАккаунтовСрезПоследних.Аккаунт = АллокацииКонтрагентов.Аккаунт
	|
	|ГДЕ ТипАллокации <> ЗНАЧЕНИЕ(Перечисление.ТипАллокации.Отвязка)
	|  И ОбъектАллокации.ВидЛогина = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаленияАккаунт ВОЗР,
	|	ПометкаУдаления ВОЗР,
	|	ПодтвержденАккаунт УБЫВ,
	|	Подтверждено УБЫВ,
	|	Основная УБЫВ
	|");

	Запрос.УстановитьПараметр("Объект", Контрагент);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда
		Представление = ВыборкаРезультата.Представление;
	КонецЕсли;

	Возврат Представление;

КонецФункции
// - PN3-134 ДДГ 27 янв 2024

Функция ПолучитьАдресЭлектроннойПочтыПользователя(Пользователь) Экспорт 
	Адрес = "";
	
	ЗапросПоАдресу = Новый запрос;
	ЗапросПоАдресу.Текст= "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	ЗапросПоАдресу.УстановитьПараметр("Объект",Пользователь);	
	ЗапросПоАдресу.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
	ЗапросПоАдресу.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);	
	
	РезультетЗапроса = ЗапросПоАдресу.Выполнить().Выгрузить();
	
	Если РезультетЗапроса.Количество()> 0 Тогда
		Адрес = РезультетЗапроса[0].Представление; 	
	КонецЕсли;
	
	Возврат Адрес;
КонецФункции

Функция ПолучитьАдресЭлектроннойПочтыРуководителяПользователя(Пользователь) Экспорт 
	Адрес = "";
	
	////ПодразделениеПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь,"ОсновноеПодразделение");
	////Должность 				  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь,"Должность");
	////Если не Должность.Администрация Тогда 
	////	
	////	Руководитель = ry_ПолучениеДанных.ПолучитьПользователейПоРоли(Перечисления.РольВКомпании.СтаршийПодразделения,ПодразделениеПользователя);
	////	
	////	ЗапросПоАдресу = Новый запрос;
	////	ЗапросПоАдресу.Текст= "ВЫБРАТЬ
	////	|	КонтактнаяИнформация.Представление
	////	|ИЗ
	////	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	////	|ГДЕ
	////	|	КонтактнаяИнформация.Объект = &Объект
	////	|	И КонтактнаяИнформация.Тип = &Тип
	////	|	И КонтактнаяИнформация.Вид = &Вид";
	////	ЗапросПоАдресу.УстановитьПараметр("Объект",Руководитель);	
	////	ЗапросПоАдресу.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
	////	ЗапросПоАдресу.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);	
	////	
	////	РезультетЗапроса = ЗапросПоАдресу.Выполнить().Выгрузить();
	////	
	////	Если РезультетЗапроса.Количество()> 0 Тогда
	////		Адрес = РезультетЗапроса[0].Представление; 	
	////	КонецЕсли;
	////КонецЕсли;
	
	Возврат Адрес;
КонецФункции

// + PN3-134 ДДГ  5 дек 2023
Функция ПолучитьВсеКонтактныеДанныеКонтрагента(Контрагент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Контакт,
		|	КонтактнаяИнформация.Тип КАК ТипКонтакта,
		|	КонтактнаяИнформация.Вид КАК ВидКонтакта,
		|	КонтактнаяИнформация.ЗначениеПоУмолчанию КАК ПоУмолчанию
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Контрагент
		|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|	И КонтактнаяИнформация.Представление ЕСТЬ НЕ NULL 
		|	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(200))) <> """"
		|";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	РезультатЗапроса = Запрос.Выполнить();

	ТабКонтактИнфо = РезультатЗапроса.Выгрузить();

	Возврат ТабКонтактИнфо;

КонецФункции
// - PN3-134 ДДГ  5 дек 2023

Функция ПолучитьАдресОрагнизации(Организация) Экспорт 
	
	ВозвращаемоеЗначение = "";
	
	ЗапросПоКонтактнойИнформации = новый запрос;
	ЗапросПоКонтактнойИнформации.Текст = "ВЫБРАТЬ
	                                     |	КонтактнаяИнформация.Представление
	                                     |ИЗ
	                                     |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                                     |ГДЕ
	                                     |	КонтактнаяИнформация.Объект = &Объект
	                                     |	И КонтактнаяИнформация.Тип = &Тип
	                                     |	И КонтактнаяИнформация.Вид = &Вид";
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Объект",Организация);
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	
	РезультатЗапроса = ЗапросПоКонтактнойИнформации.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Представление;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьТелефонОрагнизации(Организация) Экспорт 
	
	ВозвращаемоеЗначение = "";
	
	ЗапросПоКонтактнойИнформации = новый запрос;
	ЗапросПоКонтактнойИнформации.Текст = "ВЫБРАТЬ
	                                     |	КонтактнаяИнформация.Представление
	                                     |ИЗ
	                                     |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                                     |ГДЕ
	                                     |	КонтактнаяИнформация.Объект = &Объект
	                                     |	И КонтактнаяИнформация.Тип = &Тип
	                                     |	И КонтактнаяИнформация.Вид = &Вид";
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Объект",Организация);
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	РезультатЗапроса = ЗапросПоКонтактнойИнформации.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Представление;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьЕмейПодразделения(Организация) Экспорт 
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Объект",Организация);
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("e-mail"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Представление;
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

Функция ПолучитьАдресКонтрагента(Контрагент) Экспорт 
	
	ВозвращаемоеЗначение = "";
	
	ЗапросПоКонтактнойИнформации = новый запрос;
	ЗапросПоКонтактнойИнформации.Текст = "ВЫБРАТЬ
	                                     |	КонтактнаяИнформация.Представление
	                                     |ИЗ
	                                     |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                                     |ГДЕ
	                                     |	КонтактнаяИнформация.Объект = &Объект
	                                     |	И КонтактнаяИнформация.Тип = &Тип
	                                     |	И КонтактнаяИнформация.Вид = &Вид";
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Объект",Контрагент);
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
	ЗапросПоКонтактнойИнформации.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	
	РезультатЗапроса = ЗапросПоКонтактнойИнформации.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Представление;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
////

// + PN3-134 ДДГ 27 янв 2024
Функция ДобавитьАдресЭлектроннойПочты(Контрагент, ЕмейлКонтрагента) Экспорт

	СтруктураОтвета = Новый Структура;

	Представление = СокрЛП(ЕмейлКонтрагента);

	Если НЕ ЗначениеЗаполнено(Представление) Тогда

		СтатусОшибки = Истина;
		ТекстОшибки  = "Запрещено добавлять пустой контакт.";

		СтруктураОтвета.Вставить("СтатусОшибки", СтатусОшибки);
		СтруктураОтвета.Вставить("ТекстОшибки" , ТекстОшибки);

		Возврат СтруктураОтвета;

	КонецЕсли;

	СтатусОшибки = Ложь;
	ТекстОшибки  = "";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Представление";
	
	Запрос.УстановитьПараметр("Представление", Представление);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда

		НайденныйОбъект = ВыборкаРезультата.Объект;

		Если ВыборкаРезультата.Объект = Контрагент Тогда
			ТекстОшибки  = "Контакт уже привязан.";
		Иначе
			СтатусОшибки = Истина;
			ТекстОшибки  = "Контакт: " + Представление + " уже привязан к объекту: " + НайденныйОбъект;
		КонецЕсли;

	Иначе
		СоздатьЗаписьАдресЭлектроннойПочты(Контрагент, Представление);
	КонецЕсли;

	СтруктураОтвета.Вставить("СтатусОшибки", СтатусОшибки);
	СтруктураОтвета.Вставить("ТекстОшибки" , ТекстОшибки);

	Возврат СтруктураОтвета;

КонецФункции

Функция ДобавитьНомерТелефонаКонтрагента(Контрагент, ТелефонКонтрагента) Экспорт

	СтруктураОтвета = Новый Структура;

	Представление = ОчиститьНомерТелефона(ТелефонКонтрагента);

	Если НЕ ЗначениеЗаполнено(Представление) Тогда

		СтатусОшибки = Истина;
		ТекстОшибки  = "Запрещено добавлять пустой контакт.";

		СтруктураОтвета.Вставить("СтатусОшибки", СтатусОшибки);
		СтруктураОтвета.Вставить("ТекстОшибки" , ТекстОшибки);

		Возврат СтруктураОтвета;

	КонецЕсли;

	СтатусОшибки = Ложь;
	ТекстОшибки  = "";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Представление";
	
	Запрос.УстановитьПараметр("Представление", Представление);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаРезультата = РезультатЗапроса.Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда

		НайденныйОбъект = ВыборкаРезультата.Объект;

		Если ВыборкаРезультата.Объект = Контрагент Тогда
			ТекстОшибки  = "Контакт уже привязан.";
		Иначе
			СтатусОшибки = Истина;
			ТекстОшибки  = "Контакт: " + Представление + " уже привязан к объекту: " + НайденныйОбъект;
		КонецЕсли;

	Иначе
		СоздатьЗаписьНомерТелефонаКонтрагента(Контрагент, Представление);
	КонецЕсли;

	СтруктураОтвета.Вставить("СтатусОшибки", СтатусОшибки);
	СтруктураОтвета.Вставить("ТекстОшибки" , ТекстОшибки);

	Возврат СтруктураОтвета;

КонецФункции

Процедура СоздатьЗаписьАдресЭлектроннойПочты(Контрагент, ЕмейлКонтрагента) Экспорт
	НоваяЗапись               = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	НоваяЗапись.Вид           = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
	НоваяЗапись.Тип           = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяЗапись.Объект        = Контрагент;
	НоваяЗапись.Представление = ЕмейлКонтрагента;
	НоваяЗапись.Записать(Истина);
КонецПроцедуры

Процедура СоздатьЗаписьНомерТелефонаКонтрагента(Контрагент, ТелефонКонтрагента) Экспорт
	НоваяЗапись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	НоваяЗапись.Вид    = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	НоваяЗапись.Тип    = Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяЗапись.Объект = Контрагент;
	НоваяЗапись.Представление = ТелефонКонтрагента;
	НоваяЗапись.Записать(Истина);
КонецПроцедуры

Функция ОчиститьНомерТелефона(Знач ТелефонКонтрагента)

	Представление = ТелефонКонтрагента;
	Представление = СтрЗаменить(Представление,Символы.ПС,"");
	Представление = СтрЗаменить(Представление," ","");
	Представление = СтрЗаменить(Представление,"-","");
	Представление = СтрЗаменить(Представление,")","");
	Представление = СтрЗаменить(Представление,"(","");

	Возврат Представление;

КонецФункции
// - PN3-134 ДДГ 27 янв 2024

// + S1-107 ДДГ 13 авг 2024
Функция ВыбратьКонтактКонтрагента(ФормаВладелец, Контрагент, ТипКонтактнойИнформации) Экспорт

	ФормаВыбора = РегистрыСведений.КонтактнаяИнформация.ПолучитьФормуСписка("ФормаСписка", ФормаВладелец);
	ФормаВыбора.РежимВыбора = Истина;

	ФормаВыбора.РегистрСведенийСписок.Отбор.Объект.Значение = Контрагент;
	ФормаВыбора.РегистрСведенийСписок.Отбор.Объект.Использование = Истина;

	СписокТиповКИ = Новый СписокЗначений;

	Если ТипЗнч(ТипКонтактнойИнформации) = Тип("СписокЗначений") Тогда
		СписокТиповКИ = ТипКонтактнойИнформации;
	Иначе
		СписокТиповКИ.Добавить(ТипКонтактнойИнформации);
	КонецЕсли;

	ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.Значение = СписокТиповКИ;
	ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.Использование = Истина;
	ФормаВыбора.ЭлементыФормы.РегистрСведенийСписок.Колонки.Тип.Видимость = Ложь;

	ВыбранныйКонтакт = ФормаВыбора.ОткрытьМодально();

	Возврат ВыбранныйКонтакт;

КонецФункции
// - S1-107 ДДГ 13 авг 2024

Процедура ВыполнитьПереносКонтактнойИнформации() Экспорт 
	
	ЗапросПоКонтрагентамБезИнфо = новый запрос;
	ЗапросПоКонтрагентамБезИнфо.Текст = "ВЫБРАТЬ
	                                    |	СайтПользователиИзменения.Ссылка КАК Пользователь,
	                                    |	СайтПользователиКонтрагенты.Контрагент КАК Контрагент
	                                    |ИЗ
	                                    |	Справочник.СайтПользователи.Изменения КАК СайтПользователиИзменения
	                                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
	                                    |		ПО СайтПользователиИзменения.Ссылка = СайтПользователиКонтрагенты.Пользователь
	                                    |ГДЕ
	                                    |	СайтПользователиИзменения.Ссылка.ДатаРегистрации > &ДатаРегистрации";
	ЗапросПоКонтрагентамБезИнфо.УстановитьПараметр("ДатаРегистрации",Дата(2015,12,4));									
	РезультатЗапроса = ЗапросПоКонтрагентамБезИнфо.Выполнить().Выгрузить();
	
	//Для каждого строкаРезультата из РезультатЗапроса цикл
	//	ПользовательОб = строкаРезультата.Пользователь.ПолучитьОбъект();
	//	ПользовательОб.КонтактныйТелефон = ПользовательОб.Код;
	//	ПользовательОб.записать();
	//КонецЦикла;
	

	
	ЗапросПоКонтрагентамБезИнфо = новый запрос;
	ЗапросПоКонтрагентамБезИнфо.Текст = "ВЫБРАТЬ
	                                    |	СайтПользователиИзменения.Ссылка КАК Пользователь,
	                                    |	СайтПользователиКонтрагенты.Контрагент КАК Контрагент
	                                    |ИЗ
	                                    |	Справочник.СайтПользователи.Изменения КАК СайтПользователиИзменения
	                                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СайтПользователиКонтрагенты КАК СайтПользователиКонтрагенты
	                                    |		ПО СайтПользователиИзменения.Ссылка = СайтПользователиКонтрагенты.Пользователь
	                                    |ГДЕ
	                                    |	СайтПользователиИзменения.Узел = &Узел";
	ЗапросПоКонтрагентамБезИнфо.УстановитьПараметр("Узел",ПланыОбмена.LastMod.НайтиПоКоду("Site"));										
	РезультатЗапроса = ЗапросПоКонтрагентамБезИнфо.Выполнить().Выгрузить();
	
	Для каждого строкаРезультата из РезультатЗапроса цикл
		
		ЗаписатьДанные(строкаРезультата.Пользователь,строкаРезультата.Контрагент);
		
		Если не ЗначениеЗаполнено(строкаРезультата.Контрагент) Тогда 
			Продолжить;
		КонецЕсли;
		
		Об = строкаРезультата.Контрагент.ПолучитьОбъект();
		//Об.Наименование = строкаРезультата.Пользователь.Имя;
		//Об.ОсновнойДоговорКонтрагента = Неопределено;
		//об.Записать();
				//об.Записать();
		//ккк= ТекущаяДата();
		//Пока ккк+4>ТекущаяДата() цикл
		//	
		//КонецЦикла;
		
		ЗапросПоДоговорам = Новый  Запрос;
		ЗапросПоДоговорам.УстановитьПараметр("Владелец",об.ссылка);
		ЗапросПоДоговорам.УстановитьПараметр("Организация",Справочники.Организации.НайтиПоНаименованию("ИП Костин Константин Николаевич СПБ"));
		ЗапросПоДоговорам.Текст = "ВЫБРАТЬ
		                    |	ДоговорыКонтрагентов.Ссылка
		                    |ИЗ
		                    |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		                    |ГДЕ
		                    |	ДоговорыКонтрагентов.Организация = &Организация
		                    |	И ДоговорыКонтрагентов.Владелец = &Владелец";
		РезуьтатЗапросаПоДоговорам = ЗапросПоДоговорам.Выполнить().Выгрузить();
		Если РезуьтатЗапросаПоДоговорам.Количество()>0 Тогда 
			об.ОсновнойДоговорКонтрагента = РезуьтатЗапросаПоДоговорам[0].Ссылка;		
		КонецЕсли;
		
		попытка
			
			об.Записать();
			ПроверитьОсновнойДоговорКонтрагента(об.ссылка,Ложь, Истина);
			ПланыОбмена.УдалитьРегистрациюИзменений(ПланыОбмена.LastMod.НайтиПоКоду("Site"),строкаРезультата.Пользователь);
			
		Исключение
			
		//Сообщить(ОписаниеОшибки());	
			
		КонецПопытки;

	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаписатьДанные(Пользователь,НовыйКонтрагент)
	
//Записываем контактную информацию о контрагенте
		Попытка
		//Записываем Телефон
		Если не СокрЛП(Пользователь.Код) = "" тогда
			Телефон = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Телефон.Объект = НовыйКонтрагент;
			Телефон.Тип   = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Телефон.Вид   = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			Телефон.Поле3 = Пользователь.КонтактныйТелефон; 
			Телефон.Прочитать();
			Если Не Телефон.Выбран() тогда
				Телефон.Объект = НовыйКонтрагент;
				Телефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				Телефон.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				Телефон.Поле3 = Пользователь.Код; 
				Телефон.Представление = Пользователь.Код;
				Телефон.Записать(Ложь);
			КонецЕсли;
		КонецЕсли;
		//Записываем e-mail
		Если не СокрЛП(Пользователь.ЭлектроннаяПочта) = "" тогда
			ЭлектроннаяПочта = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			ЭлектроннаяПочта.Объект = НовыйКонтрагент;
			ЭлектроннаяПочта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			ЭлектроннаяПочта.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
			ЭлектроннаяПочта.Представление = Пользователь.ЭлектроннаяПочта; 
			ЭлектроннаяПочта.Прочитать();
			Если Не ЭлектроннаяПочта.Выбран() тогда
				ЭлектроннаяПочта.Объект = НовыйКонтрагент;
				ЭлектроннаяПочта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				ЭлектроннаяПочта.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
				ЭлектроннаяПочта.Представление = Пользователь.ЭлектроннаяПочта;
				ЭлектроннаяПочта.Записать();
			КонецЕсли;
		КонецЕсли;
		//Записываем фактический адрес контрагента
		Если не СокрЛП(Пользователь.Адрес) = "" тогда	
		   ФактАдресКонтрагента = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		   ФактАдресКонтрагента.Объект = НовыйКонтрагент;
		   ФактАдресКонтрагента.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		   ФактАдресКонтрагента.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		   ФактАдресКонтрагента.Представление = Пользователь.Адрес;
		   ФактАдресКонтрагента.Прочитать();
		   Если Не ФактАдресКонтрагента.Выбран() тогда
				ФактАдресКонтрагента.Объект = НовыйКонтрагент;
				ФактАдресКонтрагента.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				ФактАдресКонтрагента.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
				ФактАдресКонтрагента.Представление = Пользователь.Адрес;
				ФактАдресКонтрагента.Записать();
			КонецЕсли;
		КонецЕсли;
		//Записываем юридический адрес контрагента
		Если не СокрЛП(Пользователь.ЮридическийАдрес) = "" тогда
           ЮридическийАдресКонтрагента = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		   ЮридическийАдресКонтрагента.Объект = НовыйКонтрагент;
		   ЮридическийАдресКонтрагента.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		   ЮридическийАдресКонтрагента.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		   ЮридическийАдресКонтрагента.Представление = Пользователь.ЮридическийАдрес;
		   ЮридическийАдресКонтрагента.Прочитать();
		   Если Не ЮридическийАдресКонтрагента.Выбран() тогда
				ЮридическийАдресКонтрагента.Объект = НовыйКонтрагент;
				ЮридическийАдресКонтрагента.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				ЮридическийАдресКонтрагента.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
				ЮридическийАдресКонтрагента.Представление = Пользователь.ЮридическийАдрес;
				ЮридическийАдресКонтрагента.Записать();
			КонецЕсли;
		КонецЕсли;    
	Исключение
		ЗаписьЖурналаРегистрации("Выполенение сопоставления контрагентов",,,Пользователь,ОписаниеОшибки());
		КонецПопытки;

	КонецПроцедуры

Процедура ЗаменитьЗначениеВКонтантнойИнформации(Объект,СтароеЗначение,НовоеЗначение) Экспорт 
ЗапросПоВидуИнформации = новый Запрос;
ЗапросПоВидуИнформации.Текст = "ВЫБРАТЬ
                               |	КонтактнаяИнформация.Вид
                               |ИЗ
                               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
                               |ГДЕ
                               |	КонтактнаяИнформация.Объект = &Объект
                               |	И КонтактнаяИнформация.Представление ПОДОБНО &Представление";
ЗапросПоВидуИнформации.УстановитьПараметр("Объект",Объект);
ЗапросПоВидуИнформации.УстановитьПараметр("Представление",СтароеЗначение);

РезультатЗапроса = ЗапросПоВидуИнформации.Выполнить().Выгрузить();

Если РезультатЗапроса.Количество()>0 Тогда 
	ВидИнформации = РезультатЗапроса[0].Вид;
	
	АдрессДоставки               = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	АдрессДоставки.Активность    = Истина;
	АдрессДоставки.Вид           = ВидИнформации;
	АдрессДоставки.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
	АдрессДоставки.Объект        = Объект;
	АдрессДоставки.Представление = НовоеЗначение;
	АдрессДоставки.Записать(Истина);
		
КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область Контрагенты
Функция ПолучитьСоздатьКонтрагента(КонтрагентНаименование,ТелефонКонтрагента,ЕмейлКонтрагента)
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	ТелефонКонтрагента = СтрЗаменить(ТелефонКонтрагента,Символы.ПС,"");
	ТелефонКонтрагента = СтрЗаменить(ТелефонКонтрагента," ","");
	ТелефонКонтрагента = СтрЗаменить(ТелефонКонтрагента,"-","");
	ТелефонКонтрагента = СтрЗаменить(ТелефонКонтрагента,")","");
	ТелефонКонтрагента = СтрЗаменить(ТелефонКонтрагента,"(","");
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Представление ПОДОБНО &Представление";
	Запрос.УстановитьПараметр("Представление",СокрЛП(ТелефонКонтрагента));
	
	РузультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РузультатЗапроса.Количество()>0 Тогда 
		Контрагент = РузультатЗапроса[0].Объект; 
	КонецЕсли;
	
	Если СокрЛП(ЕмейлКонтрагента)<>"" и Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда 
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Представление";
		Запрос.УстановитьПараметр("Представление",СокрЛП(ЕмейлКонтрагента));
		
		РузультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РузультатЗапроса.Количество()>0 Тогда 
			Контрагент = РузультатЗапроса[0].Объект; 
		КонецЕсли;
	КонецЕсли;
	
	
	Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда 
		
		РегистрироватьКонтЛицо = Ложь;
				
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтрагент.Наименование               = СокрЛП(КонтрагентНаименование);
		НовыйКонтрагент.НаименованиеПолное         = СокрЛП(КонтрагентНаименование);
		НовыйКонтрагент.ЮрФизЛицо                  = Перечисления.ЮрФизЛицо.ФизЛицо;
		НовыйКонтрагент.Покупатель                 = Истина;
		
		Если НовыйКонтрагент.покупатель Тогда  
			НовыйКонтрагент.Родитель               = Справочники.Контрагенты.НайтиПоНаименованию("Клиенты");    
		Иначе
			НовыйКонтрагент.Родитель               = Справочники.Контрагенты.НайтиПоНаименованию("Поставщики");  
		КонецЕсли;
		НовыйКонтрагент.ГруппаДоступаККонтрагенту  = Справочники.ГруппыДоступаККонтрагентам.НайтиПоНаименованию("Менеджеры");
		НовыйКонтрагент.ОсновнойМенеджерПокупателя = глЗначениеПеременной("глТекущийПользователь");
		НовыйКонтрагент.Записать();
		НоваяСтрокаТЧ = НовыйКонтрагент.МенеджерыПокупателя.Добавить();
		НоваяСтрокаТЧ.МенеджерПокупателя = глЗначениеПеременной("глТекущийПользователь");
		
		НачатьТранзакцию();
		
		ФиксироватьТранзакцию = Истина;
		
		НовыйКонтрагент.УстановитьНовыйКод();
		ПроверитьОсновнойДоговорКонтрагента(НовыйКонтрагент,Ложь,Истина);
		//ФормаКонтрагента = НовыйКонтрагент.ПолучитьФорму("ФормаЭлемента");
		//ФормаКонтрагента.НаборКонтактнойИнформации.Отбор.Объект.Установить(НовыйКонтрагент.Ссылка);
		
		НоваяЗапись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.Вид    = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		НоваяЗапись.Тип    = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Объект = НовыйКонтрагент.Ссылка;
		НоваяЗапись.Представление = ТелефонКонтрагента;
		НоваяЗапись.Представление = СтрЗаменить(НоваяЗапись.Представление,Символы.ПС,"");
		НоваяЗапись.Представление = СтрЗаменить(НоваяЗапись.Представление," ","");
		НоваяЗапись.Представление = СтрЗаменить(НоваяЗапись.Представление,"-","");
		НоваяЗапись.Представление = СтрЗаменить(НоваяЗапись.Представление,")","");
		НоваяЗапись.Представление = СтрЗаменить(НоваяЗапись.Представление,"(","");

		НоваяЗапись.Записать(Истина);
		Если НЕ ПустаяСтрока(ЕмейлКонтрагента) Тогда
			НоваяЗапись               = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			НоваяЗапись.Вид           = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
			НоваяЗапись.Тип           = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			НоваяЗапись.Объект        = НовыйКонтрагент.Ссылка;
			НоваяЗапись.Представление = ЕмейлКонтрагента;
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
		
		//Попытка
		//	ФормаКонтрагента.ЗаписатьВФорме();
		//Исключение
		//	ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать контрагента: " + ОписаниеОшибки());
		//	ФиксироватьТранзакцию = Ложь;
		//КонецПопытки;
		
		// если не записали ничего - значит проблемы аозникли
				
		Если ФиксироватьТранзакцию Тогда
			ЗафиксироватьТранзакцию();
			Контрагент =  НовыйКонтрагент.Ссылка;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Контрагент;
КонецФункции

Функция ПолучитьДоговорКонтрагентаПоПодразделению(Контрагент,Подразделение) Экспорт 
	ЗапросПоОрганизации = Новый запрос;
	ЗапросПоОрганизации.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                            |	ДоговорыКонтрагентов.Ссылка
	                            |ИЗ
	                            |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                            |ГДЕ
	                            |	ДоговорыКонтрагентов.Организация.Подразделение = &Подразделение
	                            |	И ДоговорыКонтрагентов.Владелец = &Контрагент";
	ЗапросПоОрганизации.УстановитьПараметр("Подразделение",Подразделение);
	ЗапросПоОрганизации.УстановитьПараметр("Контрагент",Контрагент);
	
	РезультатЗапроса = ЗапросПоОрганизации.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ДоговорКонтрагента = РезультатЗапроса[0].ссылка;
	Иначе
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ДоговорКонтрагента;
КонецФункции

Функция ПолучитьДоговорЗакупкиКонтрагентаПоПодразделению(Контрагент,Подразделение) Экспорт 
	ЗапросПоОрганизации = Новый запрос;
	ЗапросПоОрганизации.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                            |	ДоговорыКонтрагентов.Ссылка
	                            |ИЗ
	                            |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                            |ГДЕ
	                            |	ДоговорыКонтрагентов.Организация.Подразделение = &Подразделение
	                            |	И ДоговорыКонтрагентов.Владелец = &Контрагент
	                            |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)";
	ЗапросПоОрганизации.УстановитьПараметр("Подразделение",Подразделение);
	ЗапросПоОрганизации.УстановитьПараметр("Контрагент",Контрагент);
	
	РезультатЗапроса = ЗапросПоОрганизации.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ДоговорКонтрагента = РезультатЗапроса[0].ссылка;
	Иначе
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ДоговорКонтрагента;
КонецФункции
	
Функция	ПолучитьДоговорКонтрагента(Контрагент,Организация) Экспорт 
	
	ВозвращаемоеЗначение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Контрагент
	               |	И ДоговорыКонтрагентов.Организация = &Организация";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Ссылка;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция ВернутьДоговорЕслиОдин(Контрагент, Организация) Экспорт
	ВозвращаемоеЗначение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Владелец
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат СоздатьДоговорЕслиНеНашли(Контрагент, Организация);	
	КонецЕсли;
	
	Результат = Результат.Выгрузить();
	
	Если Результат.Количество() = 1 Тогда
		ВозвращаемоеЗначение = Результат[0].Договор;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция СоздатьДоговорЕслиНеНашли(Контрагент, Организация) Экспорт
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	Если Организация.НеДействует Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	Если Организация.ИНН = "" Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	НовыйДоговор.Владелец = Контрагент;
	НовыйДоговор.Организация = Организация;
	НовыйДоговор.Наименование = "Договор с контрагентом: " + Контрагент.Наименование;
	НовыйДоговор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");
	НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НовыйДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	Попытка
		НовыйДоговор.Записать();
	Исключение
		Сообщить("Не удалось записать Договор по причине: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат НовыйДоговор.Ссылка;
КонецФункции

// Процедура записывает основной договор контрагента контрагента.
//
Процедура ПроверитьОсновнойДоговорКонтрагента(ЭлементСправочника,Отказ, НовыйОсновнойДоговорУказан) экспорт

	//Организации = новый Массив;
	//Организации.Добавить(Справочники.Организации.НайтиПоКоду("УТ0000004"));
	//Организации.Добавить(Справочники.Организации.НайтиПоКоду("УТ0000003"));
	//Организации.Добавить(Справочники.Организации.НайтиПоКоду("УТ0000005"));

	// + ДДГ 24 окт 2022
	Организации = Справочники.УказательСправочников.ПолучитьМассивЗначенийСправочника("Организации", "ДляДоговораКонтрагента");
	// - ДДГ 24 окт 2022

	ОрганизацияПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
					
	Для каждого Организация из  Организации цикл
		
			ВыборкаДоговоров = Справочники.ДоговорыКонтрагентов.Выбрать(, ЭлементСправочника.Ссылка,Новый Структура("Организация",Организация.Ссылка));
			Если ВыборкаДоговоров.Следующий() Тогда
				ОсновнойДоговорКонтрагента = ВыборкаДоговоров.Ссылка;
			Иначе
				Если ЭлементСправочника.Покупатель Тогда 
					НайденныйДоговорОбъект              = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
					НайденныйДоговорОбъект.КонтролироватьЧислоДнейЗадолженности   = Ложь;
					НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом = Ложь;
					НайденныйДоговорОбъект.КонтролироватьСуммуЗадолженности	      = Ложь;
					НайденныйДоговорОбъект.ВидВзаиморасчетов 					  = Справочники.ВидыВзаиморасчетов.НайтиПоКоду("000000002");
					НайденныйДоговорОбъект.СкрытьНаСайте 						  = Истина;
					НайденныйДоговорОбъект.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
					Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.ВалютаВзаиморасчетов) Тогда
						НайденныйДоговорОбъект.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
					КонецЕсли;
					
					НайденныйДоговорОбъект.Организация = Организация.Ссылка;//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
					Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.Организация) Тогда
						Запрос = Новый Запрос();
						Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	Организации.Ссылка
						|ИЗ
						|	Справочник.Организации КАК Организации";
						Результат = Запрос.Выполнить();
						Если НЕ Результат.Пустой() Тогда
							Выборка = Результат.Выбрать();
							Выборка.Следующий();
							НайденныйДоговорОбъект.Организация = Выборка.Ссылка;
						Иначе
							Сообщить("Не удалось записать основной договор контрагента (не найдена организация).");
							Отказ = Истина;
							Возврат;
						КонецЕсли;
					КонецЕсли;
					
					НайденныйДоговорОбъект.Владелец           = ЭлементСправочника.Ссылка;
					НайденныйДоговорОбъект.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
					
					Если ЭлементСправочника.Покупатель Тогда
						НайденныйДоговорОбъект.Наименование = "Договор продажи";
						НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
						НайденныйДоговорОбъект.ТипЦен      = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
					Иначе
						НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
					КонецЕсли;
					
					Если НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
						НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
					Иначе
						НайденныйДоговорОбъект.ВедениеВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
						Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.ВедениеВзаиморасчетов) Тогда
							НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
						КонецЕсли;
						НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
						
					КонецЕсли;
					
					
					Если (НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
						ИЛИ  НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
						И НайденныйДоговорОбъект.ВалютаВзаиморасчетов <> глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
						НайденныйДоговорОбъект.РасчетыВУсловныхЕдиницах = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДоговоруВУсловныхЕдиницах");
					КонецЕсли;
					
					Если ЭлементСправочника.НеЯвляетсяРезидентом И НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
						НайденныйДоговорОбъект.РеализацияНаЭкспорт = Истина;
					КонецЕсли;
					
					Если НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
						ИЛИ НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
						НайденныйДоговорОбъект.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
					КонецЕсли;
					
					Если НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
						НайденныйДоговорОбъект.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
					КонецЕсли;
					
					Попытка
						НайденныйДоговорОбъект.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось записать основной договор контрагента.");
						Отказ = Истина;
						Возврат;
					КонецПопытки;
					Если Организация.ссылка = ОрганизацияПользователя Тогда 
						ОсновнойДоговорКонтрагента = НайденныйДоговорОбъект.Ссылка;
						НовыйОсновнойДоговорУказан = Истина;
					КонецЕсли;
				КонецЕсли;
				Если ЭлементСправочника.Поставщик Тогда 
					НайденныйДоговорОбъект              = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
					НайденныйДоговорОбъект.КонтролироватьЧислоДнейЗадолженности   = Ложь;
					НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом = Ложь;
					НайденныйДоговорОбъект.КонтролироватьСуммуЗадолженности	      = Ложь;
					НайденныйДоговорОбъект.ВидВзаиморасчетов 					  = Справочники.ВидыВзаиморасчетов.НайтиПоКоду("000000002");
					
					НайденныйДоговорОбъект.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
					Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.ВалютаВзаиморасчетов) Тогда
						НайденныйДоговорОбъект.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
					КонецЕсли;
					
					НайденныйДоговорОбъект.Организация = Организация.Ссылка; //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
					Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.Организация) Тогда
						Запрос = Новый Запрос();
						Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	Организации.Ссылка
						|ИЗ
						|	Справочник.Организации КАК Организации";
						Результат = Запрос.Выполнить();
						Если НЕ Результат.Пустой() Тогда
							Выборка = Результат.Выбрать();
							Выборка.Следующий();
							НайденныйДоговорОбъект.Организация = Выборка.Ссылка;
						Иначе
							Сообщить("Не удалось записать основной договор контрагента (не найдена организация).");
							Отказ = Истина;
							Возврат;
						КонецЕсли;
					КонецЕсли;
					
					НайденныйДоговорОбъект.Владелец           = ЭлементСправочника.Ссылка;
					НайденныйДоговорОбъект.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
					
					Если ЭлементСправочника.Поставщик Тогда
						НайденныйДоговорОбъект.Наименование = "Договор поставки";
						НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
						НайденныйДоговорОбъект.ТипЦен      = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();
					Иначе
						НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
					КонецЕсли;
					
					Если НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
						НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
					Иначе
						НайденныйДоговорОбъект.ВедениеВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
						Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.ВедениеВзаиморасчетов) Тогда
							НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
						КонецЕсли;
						НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
						
					КонецЕсли;
					
					
					Если (НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
						ИЛИ  НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
						И НайденныйДоговорОбъект.ВалютаВзаиморасчетов <> глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
						НайденныйДоговорОбъект.РасчетыВУсловныхЕдиницах = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДоговоруВУсловныхЕдиницах");
					КонецЕсли;
					
					Если ЭлементСправочника.НеЯвляетсяРезидентом И НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
						НайденныйДоговорОбъект.РеализацияНаЭкспорт = Истина;
					КонецЕсли;
					
					Если НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
						ИЛИ НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
						НайденныйДоговорОбъект.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
					КонецЕсли;
					
					Если НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
						НайденныйДоговорОбъект.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
					КонецЕсли;
					
					Попытка
						НайденныйДоговорОбъект.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось записать основной договор контрагента.");
						Отказ = Истина;
						Возврат;
					КонецПопытки;
					Если ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда 
						Если Организация.ссылка = ОрганизацияПользователя Тогда 
							ОсновнойДоговорКонтрагента = НайденныйДоговорОбъект.Ссылка;
							НовыйОсновнойДоговорУказан = Истина;
						КонецЕсли;
					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ПолучениеДанных
Функция ПолучитьЗначениеСвойства(Объект,Свойство) Экспорт 
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЗначенияСвойствОбъектов.Значение
	                |ИЗ
	                |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                |ГДЕ
	                |	ЗначенияСвойствОбъектов.Объект = &Объект
	                |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Свойство",Свойство);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.Значение;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьТелефонПодразделения(Подразделение) Экспорт 
	
	Возврат УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(ПолучитьОрганизациюПоПодразделению(Подразделение));
	
КонецФункции

Функция ПолучитьОрганизациюПоПодразделению(Подразделение)
	
	Организация = Справочники.Организации.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.Подразделение = &Подразделение";
	Запрос.УстановитьПараметр("Подразделение",Подразделение);	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Организация = РезультатЗапроса[0].Ссылка;	
	КонецЕсли;
	
	
	Возврат Организация;
КонецФункции

Функция ПолучитьОсновнуюКассу(Подразделение) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кассы.Ссылка как Касса
	               |ИЗ
	               |	Справочник.Кассы КАК Кассы
	               |ГДЕ
	               |	Кассы.Подразделение = &Подразделение
	               |	И Кассы.ОсновнаяКассаПодразделения";
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Касса;
	Иначе
		Возврат Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОстатокПоЗаказу(ЗаказПокупателя)
	
	ВозвращаемоеЗанчение = 0;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПокупателейОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПокупателя) КАК ЗаказыПокупателейОстатки";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Количество = РезультатЗапроса[0].КоличествоОстаток;
		Если Количество>0 тогда
			ВозвращаемоеЗанчение = Количество; 	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ВозвращаемоеЗанчение;
КонецФункции

Функция ПолучитьКоличествоЗвонков(Подразделение,НачалоПериода,КонецПериода) экспорт
	Запрос = новый запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МИКО_стИсторияЗвонковCDR.UID) КАК UID
	               |ИЗ
	               |	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_стИсторияЗвонковCDR
	               |ГДЕ
	               |	МИКО_стИсторияЗвонковCDR.did В
	               |			(ВЫБРАТЬ
	               |				ПодразделенияТелефоныПодразделения.НомерТелефона
	               |			ИЗ
	               |				Справочник.Подразделения.ТелефоныПодразделения КАК ПодразделенияТелефоныПодразделения
	               |			ГДЕ
	               |				ПодразделенияТелефоныПодразделения.Ссылка = &СсылкаПодразделение)
	               |	И МИКО_стИсторияЗвонковCDR.calldate МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("СсылкаПодразделение",Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].UID;
	КонецЕсли;
КонецФункции

Функция ПолучитьПоставщикаИзЗаказНарядаУслугиПоИдентификатору(Идентификатор) Экспорт 
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СТО_ЗаказНарядРаботы.Поставщик
	               |ИЗ
	               |	Документ.СТО_ЗаказНаряд.Работы КАК СТО_ЗаказНарядРаботы
	               |ГДЕ
	               |	СТО_ЗаказНарядРаботы.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор",Идентификатор);

	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Поставщик;
	КонецЕсли;
КонецФункции

Функция ЕстьЗапросВСтруктуре(Заказ)  Экспорт 
	возвращаемоеЗначение = Ложь;
	Для Каждого СтрокаТовары из Заказ.товары цикл
		Если ЗначениеЗаполнено(СтрокаТовары.Заказ) Тогда 
			Если ТипЗнч(СтрокаТовары.Заказ)  = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
				Если ТипЗнч(СтрокаТовары.Заказ.ДокументОснование)  = Тип("ДокументСсылка.ЗапросНаДеталь") Тогда 
					возвращаемоеЗначение = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат возвращаемоеЗначение;
КонецФункции
#КонецОбласти

#Область ЗагрузкаМаркетинговойИнформации
Процедура ЗагрузитьМаркетинговуюИнформацию() Экспорт
 ЗагрузитьДанныеПоПосетителямСайта();
 ЗагрузитьДанныеПоЗвонкам();
 ЗагрузитьЧаты_HTTP();

КонецПроцедуры

Процедура ЗагрузитьДанныеПоПосетителямСайта()
	
	///////////////////////////////////////Трафик////////////////////////
	//Дата  = НачалоДня(НачалоДня(ТекущаяДата())-1);
	//Дата2 = КонецДня(НачалоДня(ТекущаяДата())-1);
	//	

	//Дата1 = СтрЗаменить(Формат(Дата,"ДФ=yyyy-MM-dd; ДЛФ=D"),"-","");
	//Дата2 = СтрЗаменить(Формат(Дата,"ДФ=yyyy-MM-dd; ДЛФ=D"),"-","");
	//	
	//ДокументТрафик = Документы.Трафик.СоздатьДокумент();	
	////АдрессПост = "https://api-metrika.yandex.ru/stat/geo.json?id=6379990&pretty=1&date1="+Дата1+"&date2="+Дата2+"&oauth_token=0762f7f151694e51adfbdff27fb202ad";
	////АдрессПост = "https://api-metrika.yandex.ru/stat/traffic/summary.json?id=6379990&pretty=1&oauth_token=0762f7f151694e51adfbdff27fb202ad";
	//
	//Смещение = 1;
	//
	//ВсегоСтрок = 1;
	//
	//Пока Смещение-10000< ВсегоСтрок цикл
	//	
	//	АдрессПост = "https://api-metrika.yandex.ru/stat/v1/data?&dimensions=ym:s:date,ym:s:hour,ym:s:<attribution>TrafficSource,ym:s:<attribution>SourceEngine,ym:s:<attribution>ReferalSource,ym:s:regionCountry,ym:s:regionArea&ids=6379990&metrics=ym:s:visits,ym:s:bounceRate,ym:s:pageDepth,ym:s:percentNewVisitors,ym:s:mobilePercentage,ym:s:users,ym:s:avgVisitDurationSeconds&group=day&date1="+Дата1+"&limit=10000&offset="+Формат(Смещение,"ЧГ=0")+"&date2="+Дата2+"&oauth_token=0762f7f151694e51adfbdff27fb202ad";
	//	Ответ 	      = ОтправитьЗапросКСерверу(АдрессПост,"");
	//	Массив = Ответ.Получить("data");
	//	Если не ЗначениеЗаполнено(ВсегоСтрок) или ВсегоСтрок = 1 Тогда 
	//		ВсегоСтрок = Ответ.Получить("total_rows");
	//	КонецЕсли;
	//	Если Ответ.Получить("data") <> Неопределено Тогда 
	//		Для каждого СтрокаДанные из Массив цикл
	//			СтрокаДокумента = ДокументТрафик.ТрафикДетально.Добавить();
	//			
	//			МассивГруппировок = СтрокаДанные.Получить("dimensions");
	//			МассивМетрик      = СтрокаДанные.Получить("metrics"); 
	//			
	//			СтрокаДокумента.Период = Дата(СтрЗаменить(МассивГруппировок[0].Получить("name"),"-","")+СтрЗаменить(МассивГруппировок[1].Получить("name"),":",""));
	//			
	//			ИсточникТрафика = Справочники.ИсточникиТрафика.НайтиПоНаименованию(МассивГруппировок[2].Получить("name"),Истина);
	//			Если ИсточникТрафика = Справочники.ИсточникиТрафика.ПустаяСсылка() Тогда 
	//				ИсточникТрафика = Справочники.ИсточникиТрафика.СоздатьЭлемент();
	//				ИсточникТрафика.Наименование = МассивГруппировок[2].Получить("name");
	//				ИсточникТрафика.Записать();
	//			КонецЕсли;
	//			СтрокаДокумента.ИсточникТрафика = ИсточникТрафика.Ссылка; 
	//			
	//			Если ИсточникТрафика = Справочники.ИсточникиТрафика.НайтиПоНаименованию("Прямые заходы") Тогда 
	//				
	//				ИсточникТрафикаДетально = Справочники.ИсточникиТрафикаДетально.НайтиПоНаименованию("Прямые заходы",Истина);
	//				Если ИсточникТрафикаДетально = Справочники.ИсточникиТрафикаДетально.ПустаяСсылка() Тогда 
	//					ИсточникТрафикаДетально = Справочники.ИсточникиТрафикаДетально.СоздатьЭлемент();
	//					ИсточникТрафикаДетально.Наименование = "Прямые заходы";
	//					ИсточникТрафикаДетально.Записать();
	//				КонецЕсли;
	//			Иначе
	//				ИсточникТрафикаДетально = Справочники.ИсточникиТрафикаДетально.НайтиПоНаименованию(МассивГруппировок[3].Получить("name"),Истина);
	//				Если ИсточникТрафикаДетально = Справочники.ИсточникиТрафикаДетально.ПустаяСсылка() Тогда 
	//					ИсточникТрафикаДетально = Справочники.ИсточникиТрафикаДетально.СоздатьЭлемент();
	//					ИсточникТрафикаДетально.Наименование = МассивГруппировок[3].Получить("name");
	//					ИсточникТрафикаДетально.Записать();
	//				КонецЕсли;
	//			КонецЕсли;
	//			СтрокаДокумента.ИсточникТрафикаДетально = ИсточникТрафикаДетально.Ссылка; 
	//			
	//			Страна = Справочники.Страны.НайтиПоНаименованию(врег(МассивГруппировок[5].Получить("name")),Истина);
	//			Если Страна = Справочники.Страны.ПустаяСсылка() Тогда 
	//				Страна = Справочники.Страны.СоздатьЭлемент();
	//				Страна.Наименование = ВРег(МассивГруппировок[5].Получить("name"));
	//				//Страна.Код = лев(ВРег(Страна.Наименование),3);
	//				Страна.Записать();
	//			КонецЕсли;
	//			СтрокаДокумента.Страна = Страна.Ссылка; 
	//			
	//			Область = Справочники.Область.НайтиПоНаименованию(МассивГруппировок[6].Получить("name"),Истина);
	//			Если Область = Справочники.Область.ПустаяСсылка() Тогда 
	//				Область = Справочники.Область.СоздатьЭлемент();
	//				Область.Наименование = МассивГруппировок[6].Получить("name");
	//				Область.Записать();
	//			КонецЕсли;
	//			СтрокаДокумента.Область = Область.Ссылка; 
	//			
	//			СтрокаДокумента.Визиты           	 = МассивМетрик[0];
	//			СтрокаДокумента.Отказы 			 	 = МассивМетрик[1]; 
	//			СтрокаДокумента.ГлубинаПросмотра 	 = МассивМетрик[2]; 
	//			СтрокаДокумента.ДоляНовыхПосетителей = МассивМетрик[3]; 
	//			СтрокаДокумента.Мобильность     	 = МассивМетрик[4]; 
	//			СтрокаДокумента.Посетители      	 = МассивМетрик[5]; 
	//			СтрокаДокумента.ВремяНаСайте         = МассивМетрик[6]; 
	//		КонецЦикла;
	//	КонецЕсли;
	//	Смещение = смещение+10000;
	//КонецЦикла;	
	//
	//ДокументТрафик.Дата = Дата;
	//ДокументТрафик.Записать(РежимЗаписиДокумента.Запись);
	//ДокументТрафик.Записать(РежимЗаписиДокумента.Проведение);
	////Дата = Дата+60*60*24;
	////КонецЦикла;

	
	
КонецПроцедуры

Функция ОтправитьЗапросКСерверу(Адрес,ПараметрыПОСТ)
	
		////WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		////WinHttp.Option(2,"utf-8");
		////WinHttp.Open("GET",Адрес,0);
		////WinHttp.SetRequestHeader("Accept-Language", "ru");
		////WinHttp.setRequestHeader("Content-Language", "ru");
		////WinHttp.setRequestHeader("Content-Charset", "utf-8");
		////WinHttp.setRequestHeader("Content-type", "application/json; charset=utf-8");
		////WinHttp.setRequestHeader("Authorization", "OAuth 0762f7f151694e51adfbdff27fb202ad");
		////                                  
		////WinHttp.Send(ПараметрыПОСТ);
		////ТекстОтвета = WinHttp.ResponseText();
		////
		////
		//////Файл = Новый ТекстовыйДокумент; 
		//////Файл.УстановитьТипФайла(КодировкаТекста.UTF8); 
		//////Файл.УстановитьТекст(ТекстОтвета);
		//////Файл.Записать("F:\1.txt",КодировкаТекста.UTF8);
		////	
		////Возврат РаботаСJSON.ПрочитатьJSONЛок(ТекстОтвета);
	    Возврат Null;
КонецФункции

Процедура ЗагрузитьДанныеПоЗвонкам() Экспорт 
	
	//НашеСоединение = Новый FTPСоединение("static.7detalei.ru", , "terratruc_static", "143Gfgrf76" , ,Истина );
	//Файлы = НашеСоединение.НайтиФайлы("/statis/public_html/calls/","*.csv",Ложь);
	//Документ = Документы.Звонки.СоздатьДокумент();
	//Документ.дата  = ТекущаяДата();
	//
	//Для каждого ФайлФтп из Файлы цикл
	//	НашеСоединение.Получить(ФайлФтп.ПолноеИмя,"C:\temp\"+ФайлФтп.Имя);
	//	
	//	Таблица = ПолучитьТЗизФайлаЗвонков("C:\temp\"+ФайлФтп.Имя);
	//		
	//	Для каждого строка из Таблица цикл
	//		ДатаВремя = СтрЗаменить(Строка.calldate,"-","");
	//		ДатаВремя = СтрЗаменить(ДатаВремя,":","");
	//		ДатаВремя = СтрЗаменить(ДатаВремя," ","");
	//		
	//		Если НачалоДня(ДатаВремя) = НачалоДня(НачалоДня(ТекущаяДата())-1) Тогда 
	//			Если строка.dcontext = "from-internal" Тогда 
	//				СтрокаДокумента = Документ.ЗвонкиДетально.Добавить();
	//				СтрокаДокумента.Дата             = ДатаВремя;
	//				СтрокаДокумента.Время            = ДатаВремя;
	//				СтрокаДокумента.ВидЗвонка        = Перечисления.ВидЗвонка.Исходящий;
	//				СтрокаДокумента.ВходящийНомер    = Строка.src;
	//				СтрокаДокумента.ПринимающийНомер = Строка.dst;
	//				СтрокаДокумента.ЗвонокПринят     = строка.accountcode = "ANSWERED";
	//				СтрокаДокумента.Подразделение    = ПолучитьПодразделениеПоНомеруТелефона(строка.src);
	//				
	//			ИначеЕсли строка.dcontext = "ext-group" Тогда 
	//				СтрокаДокумента = Документ.ЗвонкиДетально.Добавить();
	//				СтрокаДокумента.Дата             = ДатаВремя;
	//				СтрокаДокумента.Время            = ДатаВремя;
	//				СтрокаДокумента.ВидЗвонка = Перечисления.ВидЗвонка.Входящий;
	//				СтрокаДокумента.ВходящийНомер    = Строка.src;
	//				СтрокаДокумента.ПринимающийНомер = Строка.dst;
	//				СтрокаДокумента.ЗвонокПринят     = строка.accountcode = "ANSWERED";
	//				СтрокаДокумента.Подразделение    = ПолучитьПодразделениеПоНомеруТелефона(Строка.dst);
	//			КонецЕсли;
	//		КонецЕсли;	
	//	КонецЦикла;
	//КонецЦикла;
	//	Документ.Записать();
	//	Документ.Записать(РежимЗаписиДокумента.Проведение);
	////0:/statis/public_html/calls/
КонецПроцедуры

Процедура ЗагрузитьЧаты_WebService()
	
	Server = "http://192.168.1.140/NewService/WebService.asmx?WSDL"; 
	
	Определение = Новый WSОпределения(Server); 
	
	Прокси = Новый WSПрокси(Определение, "http://tempuri.org/", "WebService", "WebServiceSoap"); 
	СтруктураПараметров = новый структура;
	СтруктураПараметров.Вставить("date_from",Строка(формат(НачалоДня(ТекущаяДата()-24*60*60*2),"ДФ=yyyy-MM-dd")));
	СтруктураПараметров.Вставить("date_to"  ,Строка(формат(КонецДня(ТекущаяДата())+60,"ДФ=yyyy-MM-dd")));
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ИмяФайла,,,новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON,СтруктураПараметров);
	ЗаписьJSON.Закрыть();
	
	Файл = Новый ЧтениеТекста(имяФайла,КодировкаТекста.UTF8);
	СтрокаJSON = Файл.Прочитать();
	Файл.Закрыть();

	Ответ = Прокси.SetData("chat_site", СтрокаJSON); 
	
	Если не Ответ.result Тогда 	
		Сообщить(Ответ.resultDescription);	
	КонецЕсли;
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	Результат = ответ.resultDescription;
	ЗаписьТекста = новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.ЗаписатьСтроку(Результат);
	ЗаписьТекста.Закрыть();
	
	Чтение = новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайла);
	Результат = ПрочитатьJSON(Чтение);
	
	Для каждого СтрокаРезультат из Результат цикл
		
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Чаты.id
		               |ИЗ
		               |	РегистрСведений.Чаты КАК Чаты
		               |ГДЕ
		               |	Чаты.id = &id";
		Запрос.УстановитьПараметр("id",Лев(СтрокаРезультат.ID,25));
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если не РезультатЗапроса.Количество() Тогда 
		
		Менеджер = РегистрыСведений.Чаты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер,СтрокаРезультат);
		Менеджер.date_message = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(лев(СтрокаРезультат.date_message,19),"-",""),"T",""),".",""),":",""));
		Менеджер.Период = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(лев(СтрокаРезультат.date_message,19),"-",""),"T",""),".",""),":",""));
		//++
		// + ivanSidoruk 20.11.2018
		//Менеджер.ПользовательСайт =  РаботаСПользователямиЧата.НайтиСоздатьАккаунт(СтрокаРезультат.user_phone);
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Код"				,СтрокаРезультат.user_phone);
		СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,СтрокаРезультат.user_phone);
		СтруктураПоиска.Вставить("КонтактныйТелефон",СтрокаРезультат.user_phone);
		
		ДопРеквизиты =Новый Структура;
		ДопРеквизиты.Вставить("ИзЧата", Истина);		
		
		Менеджер.ПользовательСайт = РазработкаСервер.НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина,ДопРеквизиты);
		// - ivanSidoruk 20.11.2018
		//--
		Менеджер.Записать(Истина);
		КонецЕсли;
		//Сообщить(СтрокаРезультат);
	КонецЦикла;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Чаты.Период КАК Период,
	               |	Чаты.id,
	               |	Чаты.user_cookies,
	               |	ВЫРАЗИТЬ(Чаты.user_name КАК СТРОКА(100)) КАК user_name,
	               |	ВЫРАЗИТЬ(Чаты.user_phone КАК СТРОКА(100)) КАК user_phone,
	               |	Чаты.user_ip,
	               |	Чаты.user_referal,
	               |	Чаты.staff_id,
	               |	Чаты.date_message,
	               |	Чаты.message,
	               |	РАЗНОСТЬДАТ(Чаты.Период, &ТекущаяДата, ЧАС) КАК КоличествоЧасов
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	РегистрСведений.Чаты КАК Чаты
	               |ГДЕ
	               |	РАЗНОСТЬДАТ(Чаты.Период, &ТекущаяДата, ЧАС) > 1
	               |	И НЕ Чаты.Отправлено
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(Таблица.user_name КАК СТРОКА(100)) КАК Имя,
	               |	ВЫРАЗИТЬ(Таблица.user_phone КАК СТРОКА(100)) КАК Телефон
	               |ПОМЕСТИТЬ ТаблицаСвернутая
	               |ИЗ
	               |	Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Чаты.date_message КАК date_message,
	               |	Чаты.user_name КАК user_name,
	               |	Чаты.user_phone КАК user_phone,
	               |	Чаты.Период,
	               |	Чаты.message,
	               |	Чаты.staff_id,
				   // + IvanSidoruk 07.12.2018
				   |	Чаты.ПользовательСайт,
				   // - IvanSidoruk 07.12.2018
	               |	Чаты.id
	               |ИЗ
	               |	ТаблицаСвернутая КАК ТаблицаСвернутая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Чаты КАК Чаты
	               |		ПО ТаблицаСвернутая.Имя = Чаты.user_name
	               |			И ТаблицаСвернутая.Телефон = Чаты.user_phone
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	date_message
	               |ИТОГИ ПО
	               |	user_phone,
	               |	user_name";
	запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	РезультатЗапроса = запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Текст = "";
	Пока РезультатЗапроса.Следующий() цикл
		РезультатЗапроса1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РезультатЗапроса1.Следующий() цикл
			РезультатЗапроса2 = РезультатЗапроса1.Выбрать();
			Текст = "";
			Пока РезультатЗапроса2.Следующий() цикл
				Если РезультатЗапроса2.staff_id = "00000000-0000-0000-0000-0" тогда
					Текст = Текст+ "<b><br><font  size=2px;>"+РезультатЗапроса2.date_message+" "+РезультатЗапроса1.user_name+" "+РезультатЗапроса1.user_phone+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background: #ffa07a; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial; margin-right: 40px; "">"+СтрЗаменить(РезультатЗапроса2.message,Символы.ПС,"<br>") +"</div>";
				Иначе
					Текст = Текст +"<b><br><font  size=2px; margin-left: 40px;>"+РезультатЗапроса2.date_message+" Оператор"+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background:  #7FFFD4; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial;  margin-left: 40px;"">"+СтрЗаменить(РезультатЗапроса2.message,Символы.ПС,"<br>")+"<br>"+"</div>";	
				КонецЕсли;
				Менеджер = РегистрыСведений.Чаты.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Менеджер,РезультатЗапроса2);
				//++
				//Менеджер.ПользовательСайт =  РаботаСПользователямиЧата.НайтиСоздатьАккаунт(РезультатЗапроса2.user_phone);
				//--
				Менеджер.Отправлено = Истина;
				Менеджер.Записать(Истина);
			КонецЦикла;
			ОтправитьПисьмо(Текст,РезультатЗапроса1.user_name,РезультатЗапроса1.user_phone);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЧаты_HTTP() Экспорт
	
	Попытка
		Соединение = Новый HTTPСоединение("192.168.1.140:8065");
	Исключение
		Сообщить("Не удалось установить соединение с chat.7detalei.ru");
		Возврат;
	КонецПопытки;

	СтруктураПараметров = новый структура;
	СтруктураПараметров.Вставить("date_from", Строка(формат(НачалоДня(ТекущаяДата())-24*60*60*7,"ДФ=yyyy-MM-dd")));
	СтруктураПараметров.Вставить("date_to"  , Строка(формат(КонецДня(ТекущаяДата())+60,"ДФ=yyyy-MM-dd")));
	СтруктураПараметров.Вставить("token"    , "21r6s3IXSGLtNSA1Wl0ErTMxCGnNGe4y3mvmd17VvG");
	
	Запрос = Новый HTTPЗапрос("/getmessage/" + СтруктураПараметров.token + 
										"/" + СтруктураПараметров.date_from +  
										"/" + СтруктураПараметров.date_to);
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");

	Ответ = Соединение.Получить(Запрос,ИмяФайла);
		
	Чтение = новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайла);
	РезультатJSON = ПрочитатьJSON(Чтение);

	Если ТипЗнч(РезультатJSON) = Тип("Структура") Тогда 
		Если РезультатJSON.Свойство("Messages") Тогда
			Результат = РезультатJSON.Messages;
			Для Каждого СтрокаРезультат Из Результат Цикл 
				Запрос = новый запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	Чаты.id
				               |ИЗ
				               |	РегистрСведений.Чаты КАК Чаты
				               |ГДЕ
				               |	Чаты.id = &id";
				Запрос.УстановитьПараметр("id",Лев(СтрокаРезультат.ID,25));
				
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				Если не РезультатЗапроса.Количество() Тогда 
				
					Менеджер = РегистрыСведений.Чаты.СоздатьМенеджерЗаписи();
					Менеджер.id			  = СтрокаРезультат.ID;
					Менеджер.chat_ID      = СтрокаРезультат.chatID;
					Менеджер.user_cookies = СтрокаРезультат.UserCookies;
					Менеджер.user_name	  = СтрокаРезультат.UserName;
					Менеджер.user_phone	  = СтрокаРезультат.UserPhone;
					Менеджер.user_ip 	  = СтрокаРезультат.ClientIp;
					Менеджер.user_referal = СтрокаРезультат.UserReferal;
					Менеджер.staff_id 	  = СтрокаРезультат.StaffID;
					Менеджер.message      = СтрокаРезультат.Text;
					Менеджер.user_email   = СтрокаРезультат.UserEmail;
					Менеджер.Ответственный   = ?(Строка(СтрокаРезультат.ManagerID) = "",Неопределено,Справочники.Пользователи.НайтиПоРеквизиту("IDПользователяЧата",Строка(СтрокаРезультат.ManagerID)));
					Менеджер.date_message = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(лев(СтрокаРезультат.UtcTimestamp,19),"-",""),"T",""),".",""),":",""));
					Менеджер.Период = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(лев(СтрокаРезультат.UtcTimestamp,19),"-",""),"T",""),".",""),":",""));
					
					Если ЗначениеЗаполнено(Менеджер.Ответственный) Тогда 
						Менеджер.ТипСообщения = Перечисления.Чаты_ТипСообщения.Менеджер;
					ИначеЕсли СтрокаРезультат.Type = "user" Тогда 
						Менеджер.ТипСообщения = Перечисления.Чаты_ТипСообщения.Клиент;
					Иначе
						Менеджер.ТипСообщения = Перечисления.Чаты_ТипСообщения.Система; 
					КонецЕсли;	
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Код"				,СтрокаРезультат.UserPhone);
					СтруктураПоиска.Вставить("ЭлектроннаяПочта"	,СтрокаРезультат.UserPhone);
					СтруктураПоиска.Вставить("КонтактныйТелефон",СтрокаРезультат.UserPhone);
					
					ДопРеквизиты =Новый Структура;
					ДопРеквизиты.Вставить("ИзЧата", Истина);		
					
					Менеджер.ПользовательСайт = РазработкаСервер.НайтиСоздатьАккаунт(СтруктураПоиска,,,Истина,ДопРеквизиты);
					Менеджер.Записать(Истина);
					
				КонецЕсли;	
			КонецЦикла;
			
			//Запрос = новый запрос;
			//Запрос.Текст = "ВЫБРАТЬ
			//       |	Чаты.Период КАК Период,
			//       |	Чаты.id,
			//       |	Чаты.user_cookies,
			//       |	ВЫРАЗИТЬ(Чаты.user_name КАК СТРОКА(100)) КАК user_name,
			//       |	ВЫРАЗИТЬ(Чаты.user_phone КАК СТРОКА(100)) КАК user_phone,
			//       |	Чаты.user_ip,
			//       |	Чаты.user_referal,
			//       |	Чаты.staff_id,
			//       |	Чаты.date_message,
			//       |	Чаты.message,
			//       |	РАЗНОСТЬДАТ(Чаты.Период, &ТекущаяДата, ЧАС) КАК КоличествоЧасов
			//       |ПОМЕСТИТЬ Таблица
			//       |ИЗ
			//       |	РегистрСведений.Чаты КАК Чаты
			//       |ГДЕ
			//       |	РАЗНОСТЬДАТ(Чаты.Период, &ТекущаяДата, ЧАС) > 1
			//       |	И НЕ Чаты.Отправлено
			//       |;
			//       |
			//       |////////////////////////////////////////////////////////////////////////////////
			//       |ВЫБРАТЬ РАЗЛИЧНЫЕ
			//       |	ВЫРАЗИТЬ(Таблица.user_name КАК СТРОКА(100)) КАК Имя,
			//       |	ВЫРАЗИТЬ(Таблица.user_phone КАК СТРОКА(100)) КАК Телефон
			//       |ПОМЕСТИТЬ ТаблицаСвернутая
			//       |ИЗ
			//       |	Таблица КАК Таблица
			//       |;
			//       |
			//       |////////////////////////////////////////////////////////////////////////////////
			//       |ВЫБРАТЬ
			//       |	Чаты.date_message КАК date_message,
			//       |	Чаты.user_name КАК user_name,
			//       |	Чаты.user_phone КАК user_phone,
			//       |	Чаты.Период,
			//       |	Чаты.message,
			//       |	Чаты.staff_id,
			//	   // + IvanSidoruk 07.12.2018
			//	   |	Чаты.ПользовательСайт,
			//	   // - IvanSidoruk 07.12.2018
			//       |	Чаты.id
			//       |ИЗ
			//       |	ТаблицаСвернутая КАК ТаблицаСвернутая
			//       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Чаты КАК Чаты
			//       |		ПО ТаблицаСвернутая.Имя = Чаты.user_name
			//       |			И ТаблицаСвернутая.Телефон = Чаты.user_phone
			//       |
			//       |УПОРЯДОЧИТЬ ПО
			//       |	date_message
			//       |ИТОГИ ПО
			//       |	user_phone,
			//       |	user_name";
			//запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
			//РезультатЗапроса = запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Текст = "";
			//Пока РезультатЗапроса.Следующий() цикл
			//	РезультатЗапроса1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//	Пока РезультатЗапроса1.Следующий() цикл
			//		РезультатЗапроса2 = РезультатЗапроса1.Выбрать();
			//		Текст = "";
			//		Пока РезультатЗапроса2.Следующий() цикл
			//			Если РезультатЗапроса2.staff_id = "00000000-0000-0000-0000-0" тогда
			//				Текст = Текст+ "<b><br><font  size=2px;>"+РезультатЗапроса2.date_message+" "+РезультатЗапроса1.user_name+" "+РезультатЗапроса1.user_phone+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background: #ffa07a; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial; margin-right: 40px; "">"+СтрЗаменить(РезультатЗапроса2.message,Символы.ПС,"<br>") +"</div>";
			//			Иначе
			//				Текст = Текст +"<b><br><font  size=2px; margin-left: 40px;>"+РезультатЗапроса2.date_message+" Оператор"+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background:  #7FFFD4; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial;  margin-left: 40px;"">"+СтрЗаменить(РезультатЗапроса2.message,Символы.ПС,"<br>")+"<br>"+"</div>";	
			//			КонецЕсли;
			//			Менеджер = РегистрыСведений.Чаты.СоздатьМенеджерЗаписи();
			//			ЗаполнитьЗначенияСвойств(Менеджер,РезультатЗапроса2);
			//			//++
			//			//Менеджер.ПользовательСайт =  РаботаСПользователямиЧата.НайтиСоздатьАккаунт(РезультатЗапроса2.user_phone);
			//			//--
			//			Менеджер.Отправлено = Истина;
			//			Менеджер.Записать(Истина);
			//		КонецЦикла;
			//		//ОтправитьПисьмо(Текст,РезультатЗапроса1.user_name,РезультатЗапроса1.user_phone);
			//	КонецЦикла;
			//	
			//КонецЦикла;

		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьПисьмо(Текст,Клиент,НомерТелефона)
	ЕмейлКлиентаКонстантин  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин"));
	ЕмейлКлиентаАнтон  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Кузьмин Антон"));
	

	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("chat@7detalei.ru");
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
	Письмо.Тема 			 = "Чат ["+Клиент+" "+НомерТелефона+ "]";
	Письмо.Дата              = ТекущаяДата();
	Письмо.ЕстьВложения      = Ложь;
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
	Письмо.КодировкаПисьма   = "koi8-r";
	Письмо.ЗаголовокПисьма   = "Чат ["+Клиент+" "+НомерТелефона+ "]";
	Письмо.ОтправительАдресЭлектроннойПочты =  "chat@7detalei.ru";
	Письмо.Кому              = "r_yakovlev@outlook.com";
	Письмо.КомуПредставление = "Руслан Александрович";
	Письмо.ОтправительИмя    = "Система чатов ""7detalei.ru""";
	Письмо.ТекстПисьма       = "";
	Письмо.ПроверитьЗаполнение();
	Письмо.Ответственный     = ПараметрыСеанса.ТекущийПользователь;
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = ЕмейлКлиентаКонстантин;
	Получатели.Представление 	     = "Константин Николаевич";
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = ЕмейлКлиентаАнтон;
	Получатели.Представление 	     = "Антон Михайлович";
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "office@7detalei.ru";
	Получатели.Представление 	     = "ОФИС";
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "r_yakovlev@outlook.com";
	Получатели.Представление 	     = "Руслан Александрович";


	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "shashin@7detalei.ru";
	Получатели.Представление 	     = "Шашин Антон";

	
	Письмо.ТекстПисьма = Текст;
	Письмо.Записать();	
	Письмо.ОтправитьПисьмо();
	
КонецФункции


Функция ПолучитьТЗизФайлаЗвонков(ИмяФайла)
	Разделитель = ",";
	
	Таблица = новый ТаблицаЗначений;
//очищаем таблицу и удаляем колонки 
	Таблица.Очистить();
	Таблица.Колонки.Очистить();
	Таблица.Колонки.Очистить();
	
	// чтение файла
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ИмяФайла,КодировкаТекста.UTF8);
	
	//шапка по умолчанию 1 строка, из первой строки делаем колонки таблицы
	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	
	//раскладываем строку в массив
	МассивКолонок = РазложитьСтрокуВМассивПодстрок(Шапка,Разделитель);
	
	//генерируем колонки	
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		
		ИмяБезПробелов = СтрЗаменить(ИмяКолонки," ",""); // убираем из имени колонок пробелы
		ИмяБезПробелов = СтрЗаменить(ИмяБезПробелов,Символ(34),""); // убираем из имени колонок пробелы
		ИмяБезПробелов = СтрЗаменить(ИмяБезПробелов,")",""); // убираем из имени колонок пробелы
		ИмяБезПробелов = СтрЗаменить(ИмяБезПробелов,"(",""); // убираем из имени колонок пробелы

		Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяКолонки); 		
		//НоваяКолонка = Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяКолонки);
		//НоваяКолонка.Данные = ИмяБезПробелов;
		
	КонецЦикла;
	
	
	Для НомерСтроки=2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
		
		//Состояние("Обрабатывается "+Строка(Формат(?(ЗагружаемыйФайл.КоличествоСтрок()=0,0,((100*НомерСтроки)/ЗагружаемыйФайл.КоличествоСтрок())),"ЧЦ=3; ЧДЦ=0"))+" %");
		//ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break
		
		// получить строку файла с указанным номером и преобразуем её в массив
		Строка 		  = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
	
		МассивКолонок = РазложитьСтрокуВМассивПодстрок(Строка,Разделитель);
		НоваяСтрока   = Таблица.Добавить();
		
		//Если МассивКолонок.Количество() <> Таблица.Колонки.Количество() Тогда
		//	Сообщить("Ошибка со строкой " + Строка);
		//	Продолжить; // скорее всего в тексте содержит разделитель
		//КонецЕсли;
		
		Для НомерКолонки = 1 по 16 Цикл 
			//заполняем строку значениями
			ТекущееЗначение = МассивКолонок[НомерКолонки-1];
			ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
			ТекущееЗначение = СтрЗаменить(ТекущееЗначение,Символ(34),""); // убираем из имени колонок пробелы

			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;			
		КонецЦикла;   		
		
	КонецЦикла;   
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьПодразделениеПоНомеруТелефона(Номер)
	попытка
		Если Число(номер)>10 и Число(номер)<19 Тогда 
			Возврат Справочники.Подразделения.НайтиПоКоду("4");//СПБ
		ИначеЕсли Число(номер)>50 и  Число(номер)<55 Тогда 
			Возврат Справочники.Подразделения.НайтиПоКоду("6");//КСК
		ИначеЕсли Число(номер)>40 и  Число(номер)<43 Тогда 
			Возврат Справочники.Подразделения.НайтиПоКоду("5");//МСК
		ИначеЕсли лев(номер,2) = "60" тогда 
			Возврат Справочники.Подразделения.НайтиПоКоду("4");//СПБ
		ИначеЕсли лев(номер,2) = "64" тогда 
			Возврат Справочники.Подразделения.НайтиПоКоду("6");//СПБ
		ИначеЕсли лев(номер,2) = "65" тогда 
			Возврат Справочники.Подразделения.НайтиПоКоду("5");//СПБ
			
		Иначе
			Возврат Справочники.Подразделения.ПустаяСсылка();
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецФункции
#КонецОбласти

#Область ФункцииРаботыСПостояннымиКаталогом
Процедура ЗаполнитьПоСвойстам(ГруппаКроссов,Наименование) Экспорт
	//Если Наименование = Справочники.зс_НаименованиеНоменклатуры.ПустаяСсылка() 
	//	или Наименование = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//Если ГруппаКроссов.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Автомобиль") Тогда 
	//	Возврат;
	//КонецЕсли;
	//	
	//КорневойЭлементКаталога = Справочники.СайтКаталог.НайтиПоНаименованию("Постоянный каталог"); 
	//ЗаполнитьТоварами(КорневойЭлементКаталога.Ссылка,ГруппаКроссов,,,);
	//
	//
	/////////////////////////////////////////////////////////////////////Ветка по Марка Модель Наименование/////////////////////////////////////////////////////////////
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПрименяемостьМодели.Модель.Владелец КАК Производитель
	//|ИЗ
	//|	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
	//|ГДЕ
	//|	НЕ ПрименяемостьМодели.Модель.Владелец ЕСТЬ NULL
	//|	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
	//ЗАпрос.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//
	//Для каждого СтрокаРезультата из РезультатЗапроса цикл
	//	Марка =  СтрокаРезультата.Производитель.Ссылка;
	//	
	//	ЭлементКаталогаВсеЗапчастиМарка = Справочники.СайтКаталог.НайтиПоНаименованию(Марка,Истина,КорневойЭлементКаталога.Ссылка);
	//	Если ЭлементКаталогаВсеЗапчастиМарка.Пустая() Тогда 
	//		ЭлементКаталогаВсеЗапчастиМарка              = Справочники.СайтКаталог.СоздатьГруппу();
	//		ЭлементКаталогаВсеЗапчастиМарка.Родитель     = КорневойЭлементКаталога.Ссылка;
	//		ЭлементКаталогаВсеЗапчастиМарка.Наименование = Марка;
	//		ЭлементКаталогаВсеЗапчастиМарка.Записать();
	//	КонецЕсли;
	//	//Каталог по Марке
	//	ЗаполнитьТоварами(ЭлементКаталогаВсеЗапчастиМарка.Ссылка,ГруппаКроссов,Марка,,);
	//	
	//	
	//	ЗапросПоМоделям = новый запрос;
	//	ЗапросПоМоделям.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПрименяемостьМодели.Модель
	//	|ИЗ
	//	|	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
	//	|ГДЕ
	//	|	ПрименяемостьМодели.Модель.Владелец = &Владелец
	//	|	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
	//	ЗапросПоМоделям.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
	//	ЗапросПоМоделям.УстановитьПараметр("Владелец",Марка);
	//	
	//	РезультатЗапросаПоМодели = ЗапросПоМоделям.Выполнить().Выгрузить();
	//	Для каждого СтрокаРезультатаМодели из РезультатЗапросаПоМодели цикл
	//		
	//		Модель = СтрокаРезультатаМодели.Модель;
	//		
	//		ЭлементКаталогаВсеЗапчастиМодель = Справочники.СайтКаталог.НайтиПоНаименованию(Модель,Истина,ЭлементКаталогаВсеЗапчастиМарка.Ссылка);
	//		Если ЭлементКаталогаВсеЗапчастиМодель.Пустая() Тогда 
	//			ЭлементКаталогаВсеЗапчастиМодель              = Справочники.СайтКаталог.СоздатьГруппу();
	//			ЭлементКаталогаВсеЗапчастиМодель.Родитель     = ЭлементКаталогаВсеЗапчастиМарка.Ссылка;
	//			ЭлементКаталогаВсеЗапчастиМодель.Наименование = Модель;
	//			ЭлементКаталогаВсеЗапчастиМодель.Записать();				
	//		КонецЕсли;
	//		//Каталог по модели
	//		ЗаполнитьТоварами(ЭлементКаталогаВсеЗапчастиМодель.Ссылка,ГруппаКроссов,Марка,Модель,);
	//		
	//		//Каталог по наименованию 
	//		ЭлементКаталогаПоНаименованию = Справочники.СайтКаталог.НайтиПоНаименованию(""+Наименование,Истина,ЭлементКаталогаВсеЗапчастиМодель.Ссылка);
	//		Если ЭлементКаталогаПоНаименованию.Пустая() Тогда 
	//			ЭлементКаталогаПоНаименованию              = Справочники.СайтКаталог.СоздатьГруппу();
	//			ЭлементКаталогаПоНаименованию.Родитель     = ЭлементКаталогаВсеЗапчастиМодель.Ссылка;
	//			ЭлементКаталогаПоНаименованию.Наименование = ""+Наименование;
	//			ЭлементКаталогаПоНаименованию.Записать();
	//		КонецЕсли;
	//		ЗаполнитьТоварами(ЭлементКаталогаПоНаименованию.Ссылка,ГруппаКроссов,Марка,Модель,Наименование);
	//		
	//		//Каталог по узлам
	//		ЗапросПоУзлам = новый запрос;
	//		ЗапросПоУзлам.Текст = "ВЫБРАТЬ
	//		                      |	ПрименяемостьУзлы.Узел
	//		                      |ИЗ
	//		                      |	РегистрСведений.ПрименяемостьУзлы КАК ПрименяемостьУзлы
	//		                      |ГДЕ
	//		                      |	ПрименяемостьУзлы.ГруппаКроссов = &ГруппаКроссов";
	//		ЗапросПоУзлам.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
	//		
	//		РезультатЗапросаПоУзлам = ЗапросПоУзлам.Выполнить().Выгрузить();
	//		Для каждого СтрокаРезультатаУзлам из РезультатЗапросаПоУзлам цикл
	//			ЭлементКаталогаПоУзлам = Справочники.СайтКаталог.НайтиПоНаименованию(""+СтрокаРезультатаУзлам.Узел,Истина,ЭлементКаталогаВсеЗапчастиМодель.Ссылка);
	//			Если ЭлементКаталогаПоУзлам.Пустая() Тогда 
	//				ЭлементКаталогаПоУзлам              = Справочники.СайтКаталог.СоздатьГруппу();
	//				ЭлементКаталогаПоУзлам.Родитель     = ЭлементКаталогаВсеЗапчастиМодель.Ссылка;
	//				ЭлементКаталогаПоУзлам.Наименование = ""+СтрокаРезультатаУзлам.Узел;
	//				ЭлементКаталогаПоУзлам.Записать();
	//			КонецЕсли;
	//			
	//			//Каталог по наименованию 
	//			ЗаполнитьТоварами(ЭлементКаталогаПоУзлам.Ссылка,ГруппаКроссов,Марка,Модель,Наименование,СтрокаРезультатаУзлам.Узел);
	//		КонецЦикла;

	//	КонецЦикла;
	//КонецЦикла;


	///////////////////////////////////////Каталог по наименованию/////////////////////////////////////////////////////////////
	//
	//ЗапросПоНаименованию = новый запрос;
	//ЗапросПоНаименованию.Текст = "ВЫБРАТЬ
	//                             |	СайтКаталог.Ссылка
	//                             |ИЗ
	//                             |	Справочник.СайтКаталог КАК СайтКаталог
	//                             |ГДЕ
	//                             |	СайтКаталог.ЭтоГруппа
	//                             |	И СайтКаталог.Наименование = &Наименование
	//                             |	И СайтКаталог.Родитель.Ссылка = &ПостоянныйКаталог";
	//ЗапросПоНаименованию.УстановитьПараметр("Наименование",Наименование.Наименование);
	//ЗапросПоНаименованию.УстановитьПараметр("ПостоянныйКаталог",Справочники.СайтКаталог.НайтиПоНаименованию("Постоянный каталог"));
	//
	//РезультатЗапросаПоНаименованию = ЗапросПоНаименованию.Выполнить().Выгрузить();
	//
	//Если РезультатЗапросаПоНаименованию.Количество() Тогда 
	//	КорневойЭлементКаталогаПоНаименованию = РезультатЗапросаПоНаименованию[0].Ссылка;
	//Иначе
	//	КорневойЭлементКаталогаПоНаименованию = Справочники.СайтКаталог.ПустаяСсылка();
	//КонецЕсли;
	//
	////КорневойЭлементКаталогаПоНаименованию = Справочники.СайтКаталог.НайтиПоНаименованию(""+Наименование,Истина,Справочники.СайтКаталог.НайтиПоНаименованию("Постоянный каталог"));
	//Если КорневойЭлементКаталогаПоНаименованию.Пустая() Тогда 
	//	КорневойЭлементКаталогаПоНаименованию              = Справочники.СайтКаталог.СоздатьГруппу();
	//	КорневойЭлементКаталогаПоНаименованию.Родитель     = Справочники.СайтКаталог.НайтиПоНаименованию("Постоянный каталог");
	//	КорневойЭлементКаталогаПоНаименованию.Наименование = ""+Наименование;
	//	КорневойЭлементКаталогаПоНаименованию.Записать();
	//КонецЕсли;
	////Заполняем по наименованию
	//ЗаполнитьТоварами(КорневойЭлементКаталогаПоНаименованию.Ссылка,ГруппаКроссов,,,Наименование);
	//
	////ЗаполнитьПоПрименямости(ГруппаКроссов,Наименование,КорневойЭлементКаталога.Ссылка);
	//
	//
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПрименяемостьМодели.Модель.Владелец КАК Производитель
	//|ИЗ
	//|	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
	//|ГДЕ
	//|	НЕ ПрименяемостьМодели.Модель.Владелец ЕСТЬ NULL
	//|	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
	//ЗАпрос.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//
	//Для каждого СтрокаРезультата из РезультатЗапроса цикл
	//	Марка =  СтрокаРезультата.Производитель.Ссылка;
	//			
	//	ЭлементКаталогаМарка = Справочники.СайтКаталог.НайтиПоНаименованию(""+Марка,Истина,КорневойЭлементКаталогаПоНаименованию.Ссылка);
	//	Если ЭлементКаталогаМарка.Пустая() Тогда 
	//		ЭлементКаталогаМарка              = Справочники.СайтКаталог.СоздатьГруппу();
	//		ЭлементКаталогаМарка.Родитель     = КорневойЭлементКаталогаПоНаименованию.Ссылка;
	//		ЭлементКаталогаМарка.Наименование = ""+Марка;
	//		ЭлементКаталогаМарка.Записать();
	//	КонецЕсли;
	//	ЗаполнитьТоварами(ЭлементКаталогаМарка.Ссылка,ГруппаКроссов,Марка,,Наименование);
	//	
	//	ЗапросПоМаркам = новый запрос;
	//	ЗапросПоМаркам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПрименяемостьМодели.Модель
	//	|ИЗ
	//	|	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
	//	|ГДЕ
	//	|	ПрименяемостьМодели.Модель.Владелец = &Владелец
	//	|	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
	//	ЗапросПоМаркам.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
	//	ЗапросПоМаркам.УстановитьПараметр("Владелец",Марка);
	//	
	//	РезультатЗапросаПоМарке = ЗапросПоМаркам.Выполнить().Выгрузить();
	//	Для каждого СтрокаРезультатаМарка из РезультатЗапросаПоМарке цикл
	//		
	//		ВыборкаМодели = СтрокаРезультатаМарка.Модель;
	//		
	//		Модель = ВыборкаМодели.Ссылка;
	//		
	//		ЭлементКаталогаМодель = Справочники.СайтКаталог.НайтиПоНаименованию(""+Модель,Истина,ЭлементКаталогаМарка.Ссылка);
	//		Если ЭлементКаталогаМодель.Пустая() Тогда 
	//			ЭлементКаталогаМодель              = Справочники.СайтКаталог.СоздатьГруппу();
	//			ЭлементКаталогаМодель.Родитель     = ЭлементКаталогаМарка.Ссылка;
	//			ЭлементКаталогаМодель.Наименование = ""+Модель;
	//			ЭлементКаталогаМодель.Записать();				
	//		КонецЕсли;
	//		
	//		КроссЭлементКаталога = ПолучитьКроссВеткуКаталога(Марка,Модель,Наименование);
	//		
	//		Если ЗначениеЗаполнено(ЭлементКаталогаМодель.Ссылка) Тогда 
	//			ЭлементКаталогаМодель = ЭлементКаталогаМодель.Ссылка.ПолучитьОбъект();
	//			ЭлементКаталогаМодель.КроссВеткаКаталога = КроссЭлементКаталога;
	//			ЭлементКаталогаМодель.Записать();
	//		КонецЕсли;

	//		//ЗаполнитьТоварами(ЭлементКаталогаМодель.Ссылка,ГруппаКроссов,Марка,Модель,Наименование);
	//	КонецЦикла;
	//КонецЦикла;	
	//	
КонецПроцедуры

Функция ПолучитьКроссВеткуКаталога(Марка,Модель,Наименование)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеКаталогаМаркеМоделиНаименованию.Каталог
	|ИЗ
	|	РегистрСведений.СоответствиеКаталогаМаркеМоделиНаименованию КАК СоответствиеКаталогаМаркеМоделиНаименованию
	|ГДЕ
	|	СоответствиеКаталогаМаркеМоделиНаименованию.Марка = &Марка
	|	И СоответствиеКаталогаМаркеМоделиНаименованию.Модель = &Модель
	|	И СоответствиеКаталогаМаркеМоделиНаименованию.НаименованиеНоменклатуры = &НаименованиеНоменклатуры";
	
	Запрос.УстановитьПараметр("Марка",Марка);
	Запрос.УстановитьПараметр("Модель",Модель);
	Запрос.УстановитьПараметр("НаименованиеНоменклатуры",Наименование);
	
	РезультатЗАпроса = запрос.Выполнить().Выбрать();
	
	Если РезультатЗАпроса.Следующий() тогда
		Возврат РезультатЗАпроса.Каталог;
	КонецЕсли;

	
КонецФункции
//мЭлементов         - массив произвольных элементов, образующих комбинации. Произвольный.
//ДлинаПерестановки  - количество элементов в комбинации. Целое.
//БезПовторов        - признак необходимости получать в результате комбинации в которых один и тот же элемент мЭлементов встречался бы не чаще 1 раза. Булево. По умолчанию - Ложь.

Функция Перестановки(мЭлементов, ДлинаПерестановки, БезПовторов = Ложь, Основание = Неопределено, мРезультата = Неопределено, ТекУровень = 0) Экспорт
    
	//Если Основание = Неопределено Тогда 
	//	Основание = Новый Массив 
	//КонецЕсли;
	//Если мРезультата = Неопределено Тогда 
	//	мРезультата = Новый Массив 
	//КонецЕсли;
	//
	//Если ТекУровень < ДлинаПерестановки - 1 Тогда        
	//	Для Каждого Элемент Из мЭлементов Цикл    
	//		Если БезПовторов И НЕ Основание.Найти(Элемент) = Неопределено Тогда
	//		Иначе
	//			Основание.Добавить(Элемент);
	//			мРезультата = Перестановки(мЭлементов, ДлинаПерестановки, БезПовторов, Основание, мРезультата, ТекУровень + 1);
	//			Основание.Удалить(Основание.Количество() - 1);
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	Для Каждого Элемент Из мЭлементов Цикл
	//		Если БезПовторов И НЕ Основание.Найти(Элемент) = Неопределено Тогда
	//		Иначе
	//			Основание.Добавить(Элемент);
	//			мРезультата.Добавить(Новый ФиксированныйМассив(Основание));
	//			Основание.Удалить(Основание.Количество()-1);
	//		КонецЕсли;
	//	КонецЦикла;    
	//КонецЕсли;    
	//Возврат мРезультата;
	
КонецФункции

Функция ВсеПодмножества(Множество)
	Ответ = Новый Массив;
	Ответ.Добавить(Новый СписокЗначений);
	Для ИндексЭлемента = 0 По Множество.Количество()-1 Цикл
		Для ИндексВарианта = 0 По Ответ.Количество()-1 Цикл
			Ответ.Добавить(Ответ[ИндексВарианта].Скопировать());
			Ответ[ИндексВарианта].Добавить(Множество[ИндексЭлемента])
		КонецЦикла
	КонецЦикла;
	Возврат Ответ
КонецФункции

Процедура ЗаполнитьПоПрименямости(ГруппаКроссов,Наименование,КаталогРодитель)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПрименяемостьМодели.Модель.Владелец КАК Производитель
	               |ИЗ
	               |	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
	               |ГДЕ
	               |	НЕ ПрименяемостьМодели.Модель.Владелец ЕСТЬ NULL
	               |	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
	ЗАпрос.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультата из РезультатЗапроса цикл
		марка =  СтрокаРезультата.Производитель.Ссылка;
		
		ЭлементКаталогаВсеЗапчастиМарка = Справочники.СайтКаталог.НайтиПоНаименованию("Все запчасти "+Марка,Истина,КаталогРодитель);
		Если ЭлементКаталогаВсеЗапчастиМарка.Пустая() Тогда 
			ЭлементКаталогаВсеЗапчастиМарка              = Справочники.СайтКаталог.СоздатьГруппу();
			ЭлементКаталогаВсеЗапчастиМарка.Родитель     = КаталогРодитель;
			ЭлементКаталогаВсеЗапчастиМарка.Наименование = "Все запчасти "+Марка;
			ЭлементКаталогаВсеЗапчастиМарка.Записать();
		КонецЕсли;
		ЗаполнитьТоварами(ЭлементКаталогаВсеЗапчастиМарка,ГруппаКроссов,,,);
		
		ЭлементКаталогаМарка = Справочники.СайтКаталог.НайтиПоНаименованию(""+Наименование+" "+Марка,Истина,ЭлементКаталогаВсеЗапчастиМарка.Ссылка);
		Если ЭлементКаталогаМарка.Пустая() Тогда 
			ЭлементКаталогаМарка              = Справочники.СайтКаталог.СоздатьГруппу();
			ЭлементКаталогаМарка.Родитель     = ЭлементКаталогаВсеЗапчастиМарка;
			ЭлементКаталогаМарка.Наименование = ""+Наименование+" "+Марка;
			ЭлементКаталогаМарка.Записать();
		КонецЕсли;
		ЗаполнитьТоварами(ЭлементКаталогаМарка.Ссылка,ГруппаКроссов,,,);

		ЗапросПоМаркам = новый запрос;
		ЗапросПоМаркам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                       |	ПрименяемостьМодели.Модель
		                       |ИЗ
		                       |	РегистрСведений.ПрименяемостьМодели КАК ПрименяемостьМодели
		                       |ГДЕ
		                       |	ПрименяемостьМодели.Модель.Владелец = &Владелец
		                       |	И ПрименяемостьМодели.ГруппаКроссов = &ГруппаКроссов";
		ЗапросПоМаркам.УстановитьПараметр("ГруппаКроссов",ГруппаКроссов);
		ЗапросПоМаркам.УстановитьПараметр("Владелец",Марка);
		
		РезультатЗапросаПоМарке = ЗапросПоМаркам.Выполнить().Выгрузить();
		Для каждого СтрокаРезультатаМарка из РезультатЗапросаПоМарке цикл
			
			ВыборкаМодели = СтрокаРезультатаМарка.Модель;
			
			Модель = ВыборкаМодели.Ссылка;
			ЭлементКаталогаВсеЗапчастиМодель = Справочники.СайтКаталог.НайтиПоНаименованию("Все запчасти "+Марка+" "+Модель,Истина,ЭлементКаталогаМарка.Ссылка);
			Если ЭлементКаталогаВсеЗапчастиМодель.Пустая() Тогда 
				ЭлементКаталогаВсеЗапчастиМодель              = Справочники.СайтКаталог.СоздатьГруппу();
				ЭлементКаталогаВсеЗапчастиМодель.Родитель     = ЭлементКаталогаМарка.Ссылка;
				ЭлементКаталогаВсеЗапчастиМодель.Наименование = "Все запчасти "+Марка+" "+Модель;
				ЭлементКаталогаВсеЗапчастиМодель.Записать();				
			КонецЕсли;
			ЗаполнитьТоварами(ЭлементКаталогаВсеЗапчастиМодель.Ссылка,ГруппаКроссов,,,);
			
			ЭлементКаталогаМодель = Справочники.СайтКаталог.НайтиПоНаименованию(""+Наименование+" "+Марка+" "+Модель,Истина,ЭлементКаталогаВсеЗапчастиМодель.Ссылка);
			Если ЭлементКаталогаМодель.Пустая() Тогда 
				ЭлементКаталогаМодель              = Справочники.СайтКаталог.СоздатьГруппу();
				ЭлементКаталогаМодель.Родитель     = ЭлементКаталогаВсеЗапчастиМодель.Ссылка;
				ЭлементКаталогаМодель.Наименование = ""+Наименование+" "+Марка+" "+Модель;
				ЭлементКаталогаМодель.Записать();				
			КонецЕсли;
			ЗаполнитьТоварами(ЭлементКаталогаМодель.Ссылка,ГруппаКроссов,,,);
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры

Процедура ЗаполнитьТоварами(ЭлементКаталогаРодитель,ГруппаКроссов,Марка,Модель,НаименованиеНоменклаткры,Узел=Неопределено);
	//
	//	ЭлементКаталогаМодель = Справочники.СайтКаталог.НайтиПоРеквизиту("НоменклатураГруппа",ГруппаКроссов,ЭлементКаталогаРодитель.ссылка);
	//	Если ЭлементКаталогаМодель.Пустая() Тогда 
	//		ЭлементКаталогаМодель              = Справочники.СайтКаталог.СоздатьЭлемент();
	//		ЭлементКаталогаМодель.Родитель     = ЭлементКаталогаРодитель;
	//		ЭлементКаталогаМодель.Наименование = ГруппаКроссов;
	//		ЭлементКаталогаМодель.НоменклатураГруппа = ГруппаКроссов;	
	//		ЭлементКаталогаМодель.Записать();
	//	КонецЕсли;
		
		//МенеджерЗаписи = РегистрыСведений.СоответствиеКаталогаМаркеМоделиНаименованию.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Активность = Истина;
		//МенеджерЗаписи.Марка = Марка;
		//МенеджерЗаписи.Модель = Модель;
		//МенеджерЗаписи.НаименованиеНоменклатуры = НаименованиеНоменклаткры;
		//МенеджерЗаписи.Каталог = ЭлементКаталогаРодитель.ссылка;
		//МенеджерЗаписи.Узел = Узел;
		//МенеджерЗаписи.Записать(Истина);
		
		
КонецПроцедуры
#КонецОбласти

#Область Картинки
Процедура АнализНаличияФото() Экспорт 
	
	ЗапросПоДеталямБезФото = новый запрос;
	ЗапросПоДеталямБезФото.Текст =  "ВЫБРАТЬ
	                                |	ВложенныйЗапрос.Дата КАК ДатаВремяПриемки,
	                                |	ВложенныйЗапрос.Номенклатура,
	                                |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	                                |	ХранилищеДополнительнойИнформации.Ссылка,
	                                |	ВложенныйЗапрос.Ссылка КАК Комплектация,
	                                |	ВложенныйЗапрос.СсылкаСкладПодразделение КАК Подразделение,
	                                |	ВложенныйЗапрос.СсылкаОтветственный КАК Кладовщик,
	                                |	ИСТИНА КАК НужноФото
	                                |ИЗ
	                                |	(ВЫБРАТЬ
	                                |		ВложенныйЗапрос.Дата КАК Дата,
	                                |		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                                |		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                |		ВложенныйЗапрос.Ссылка КАК Ссылка,
	                                |		ВложенныйЗапрос.Ссылка.Склад.Подразделение КАК СсылкаСкладПодразделение,
	                                |		ВложенныйЗапрос.Ссылка.Ответственный КАК СсылкаОтветственный
	                                |	ИЗ
	                                |		(ВЫБРАТЬ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.Дата КАК Дата,
	                                |			зетаБУКомплектацияСоставКомплекта.Номенклатура КАК Номенклатура,
	                                |			зетаБУКомплектацияСоставКомплекта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка КАК Ссылка
	                                |		ИЗ
	                                |			Документ.зетаБУКомплектация.СоставКомплекта КАК зетаБУКомплектацияСоставКомплекта
	                                |		ГДЕ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектов.ДетальВнеКомплекта)
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Проведен
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Дата > &ДатаНачалаУчета) КАК ВложенныйЗапрос
	                                |	
	                                |	ОБЪЕДИНИТЬ ВСЕ
	                                |	
	                                |	ВЫБРАТЬ
	                                |		ВложенныйЗапрос.Дата,
	                                |		ВложенныйЗапрос.Номенклатура,
	                                |		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	                                |		ВложенныйЗапрос.Ссылка,
	                                |		ВложенныйЗапрос.Ссылка.Склад.Подразделение,
	                                |		ВложенныйЗапрос.Ссылка.Ответственный
	                                |	ИЗ
	                                |		(ВЫБРАТЬ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.Дата КАК Дата,
	                                |			зетаБУКомплектацияСоставКомплекта.Номенклатура КАК Номенклатура,
	                                |			зетаБУКомплектацияСоставКомплекта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка КАК Ссылка
	                                |		ИЗ
	                                |			Документ.зетаБУКомплектация.СоставКомплекта КАК зетаБУКомплектацияСоставКомплекта
	                                |		ГДЕ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектов.ДетальВнеКомплекта)
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Проведен
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Дата > &ДатаНачалаУчета
	                                |			И зетаБУКомплектацияСоставКомплекта.ВидКомплектации = ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектации.ОсновнаяЧастьКомплекта)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	                                |		ПО ВложенныйЗапрос.ХарактеристикаНоменклатуры = ХранилищеДополнительнойИнформации.Объект
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДеталиБезФото КАК ДеталиБезФото
	                                |		ПО ВложенныйЗапрос.ХарактеристикаНоменклатуры = ДеталиБезФото.ХарактеристикаНоменклатуры
	                                |ГДЕ
	                                |	ХранилищеДополнительнойИнформации.Ссылка ЕСТЬ NULL
	                                |	И ДеталиБезФото.НужноФото ЕСТЬ NULL";
	ЗапросПоДеталямБезФото.УстановитьПараметр("ДатаНачалаУчета",дата(2020,04,01));
	
	РезультатЗапроса = ЗапросПоДеталямБезФото.Выполнить().Выгрузить();
	
	Для каждого строка из РезультатЗапроса цикл
		Менеджер = РегистрыСведений.ДеталиБезФото.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер,строка);
		Менеджер.Записать(Истина);
	КонецЦикла;
	
	
	ЗапросПоДеталямСФото = новый запрос;
	ЗапросПоДеталямСФото.Текст = "ВЫБРАТЬ
	                             |	ДеталиБезФото.Номенклатура,
	                             |	ДеталиБезФото.ХарактеристикаНоменклатуры,
	                             |	ДеталиБезФото.Подразделение,
	                             |	ДеталиБезФото.Кладовщик,
	                             |	ДеталиБезФото.ДатаВремяПриемки
	                             |ИЗ
	                             |	РегистрСведений.ДеталиБезФото КАК ДеталиБезФото
	                             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	                             |		ПО ДеталиБезФото.ХарактеристикаНоменклатуры = ХранилищеДополнительнойИнформации.Объект";
	РезультатЗапросаПоДеталямСФото = ЗапросПоДеталямСФото.Выполнить().Выгрузить();
	
	Для каждого СтрокаДеталейСФото из РезультатЗапросаПоДеталямСФото цикл
		Менеджер = РегистрыСведений.ДеталиСФото.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер,СтрокаДеталейСФото);
		Менеджер.ДатаВремяПоявленияФото = ТекущаяДата();
		Менеджер.Записать(Истина);
		
		НаборЗаписей = РегистрыСведений.ДеталиБезФото.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Номенклатура.Значение 				= СтрокаДеталейСФото.Номенклатура;
		НаборЗаписей.Отбор.Номенклатура.ВидСравнения			= ВидСравнения.Равно; 
		НаборЗаписей.Отбор.Номенклатура.Использование           = Истина; 

		НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Значение    	= СтрокаДеталейСФото.ХарактеристикаНоменклатуры;
		НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.ВидСравнения 	= ВидСравнения.Равно; 
		НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;

		НаборЗаписей.Отбор.Подразделение.Значение 			        = СтрокаДеталейСФото.Подразделение; 
		НаборЗаписей.Отбор.Подразделение.ВидСравнения 			    = ВидСравнения.Равно; 
		НаборЗаписей.Отбор.Подразделение.Использование 			    = Истина; 
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;

	ЗапросПоДеталямБезФото = новый запрос;
	ЗапросПоДеталямБезФото.Текст =  "ВЫБРАТЬ
	                                |	ВложенныйЗапрос.СсылкаСкладПодразделение КАК Подразделение,
	                                |	ВложенныйЗапрос.СсылкаОтветственный КАК Кладовщик,
	                                |	СУММА(ВЫБОР
	                                |			КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.Дата, &ТекущаяДата, ДЕНЬ) < 3
	                                |				ТОГДА 1
	                                |			ИНАЧЕ 0
	                                |		КОНЕЦ) КАК Категория1,
	                                |	СУММА(ВЫБОР
	                                |			КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.Дата, &ТекущаяДата, ДЕНЬ) >= 3
	                                |					И РАЗНОСТЬДАТ(ВложенныйЗапрос.Дата, &ТекущаяДата, ДЕНЬ) < 5
	                                |				ТОГДА 1
	                                |			ИНАЧЕ 0
	                                |		КОНЕЦ) КАК Категория2,
	                                |	СУММА(ВЫБОР
	                                |			КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.Дата, &ТекущаяДата, ДЕНЬ) > 5
	                                |				ТОГДА 1
	                                |			ИНАЧЕ 0
	                                |		КОНЕЦ) КАК Категория3
	                                |ИЗ
	                                |	(ВЫБРАТЬ
	                                |		ВложенныйЗапрос.Дата КАК Дата,
	                                |		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                                |		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                |		ВложенныйЗапрос.Ссылка КАК Ссылка,
	                                |		ВложенныйЗапрос.Ссылка.Склад.Подразделение КАК СсылкаСкладПодразделение,
	                                |		ВложенныйЗапрос.Ссылка.Ответственный КАК СсылкаОтветственный
	                                |	ИЗ
	                                |		(ВЫБРАТЬ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.Дата КАК Дата,
	                                |			зетаБУКомплектацияСоставКомплекта.Номенклатура КАК Номенклатура,
	                                |			зетаБУКомплектацияСоставКомплекта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка КАК Ссылка
	                                |		ИЗ
	                                |			Документ.зетаБУКомплектация.СоставКомплекта КАК зетаБУКомплектацияСоставКомплекта
	                                |		ГДЕ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектов.ДетальВнеКомплекта)
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Проведен
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Дата МЕЖДУ &НачалоТекущегоМесяца И &КонецТекущегоМесяца) КАК ВложенныйЗапрос
	                                |	
	                                |	ОБЪЕДИНИТЬ ВСЕ
	                                |	
	                                |	ВЫБРАТЬ
	                                |		ВложенныйЗапрос.Дата,
	                                |		ВложенныйЗапрос.Номенклатура,
	                                |		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	                                |		ВложенныйЗапрос.Ссылка,
	                                |		ВложенныйЗапрос.Ссылка.Склад.Подразделение,
	                                |		ВложенныйЗапрос.Ссылка.Ответственный
	                                |	ИЗ
	                                |		(ВЫБРАТЬ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.Дата КАК Дата,
	                                |			зетаБУКомплектацияСоставКомплекта.Номенклатура КАК Номенклатура,
	                                |			зетаБУКомплектацияСоставКомплекта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка КАК Ссылка
	                                |		ИЗ
	                                |			Документ.зетаБУКомплектация.СоставКомплекта КАК зетаБУКомплектацияСоставКомплекта
	                                |		ГДЕ
	                                |			зетаБУКомплектацияСоставКомплекта.Ссылка.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектов.ДетальВнеКомплекта)
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Проведен
	                                |			И зетаБУКомплектацияСоставКомплекта.Ссылка.Дата МЕЖДУ &НачалоТекущегоМесяца И &КонецТекущегоМесяца
	                                |			И зетаБУКомплектацияСоставКомплекта.ВидКомплектации = ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектации.ОсновнаяЧастьКомплекта)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	                                |		ПО ВложенныйЗапрос.ХарактеристикаНоменклатуры = ХранилищеДополнительнойИнформации.Объект
	                                |ГДЕ
	                                |	ХранилищеДополнительнойИнформации.Ссылка ЕСТЬ NULL 
	                                |
	                                |СГРУППИРОВАТЬ ПО
	                                |	ВложенныйЗапрос.СсылкаОтветственный,
	                                |	ВложенныйЗапрос.СсылкаСкладПодразделение";
	ЗапросПоДеталямБезФото.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		
	ЗапросПоДеталямБезФото.УстановитьПараметр("НачалоТекущегоМесяца",НачалоМесяца(ТекущаяДата()));
	ЗапросПоДеталямБезФото.УстановитьПараметр("КонецТекущегоМесяца",КонецМесяца(ТекущаяДата()));
	РезультатЗапроса = ЗапросПоДеталямБезФото.Выполнить().Выгрузить();
	
	Для каждого строка из РезультатЗапроса цикл
		Менеджер = РегистрыСведений.ДеталиБезФотоПоКатегориям.СоздатьМенеджерЗаписи();
		Менеджер.Период= ТекущаяДата();
		ЗаполнитьЗначенияСвойств(Менеджер,строка);
		Менеджер.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура РегистрацияКартинокДляОбменаССайтом() Экспорт 
	ЗапросПоКартинкам = новый запрос;
	ЗапросПоКартинкам.Текст = "ВЫБРАТЬ ПЕРВЫЕ 20000
	                          |	RY_КартинкиКОтправкеНаСайт.Картинка
	                          |ИЗ
	                          |	РегистрСведений.RY_КартинкиКОтправкеНаСайт КАК RY_КартинкиКОтправкеНаСайт";
	РезультатЗапросаПоКартинкам = ЗапросПоКартинкам.Выполнить().Выгрузить();
	
	Если РезультатЗапросаПоКартинкам.Количество() Тогда 
		ЗапросПоКоличествуКартинокНаРегистрации = новый запрос;
		ЗапросПоКоличествуКартинокНаРегистрации.Текст = "ВЫБРАТЬ
		                                                |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХранилищеДополнительнойИнформацииИзменения.Ссылка) КАК КоличествоКартинок
		                                                |ИЗ
		                                                |	Справочник.ХранилищеДополнительнойИнформации.Изменения КАК ХранилищеДополнительнойИнформацииИзменения";
		РезультатЗапросаПоКоличествуКартинокНаРегистрации = ЗапросПоКоличествуКартинокНаРегистрации.Выполнить().Выгрузить();
		
		Если РезультатЗапросаПоКоличествуКартинокНаРегистрации.Количество() Тогда 
			КоличествоЗаписей = РезультатЗапросаПоКоличествуКартинокНаРегистрации[0].КоличествоКартинок;	
			
				Для Каждого Картинка из РезультатЗапросаПоКартинкам цикл
					КартинкаОб = Картинка.Картинка.ПолучитьОбъект();
					Попытка
					КартинкаОб.Записать();
								Менеджер = РегистрыСведений.RY_КартинкиКОтправкеНаСайт.СоздатьМенеджерЗаписи();
					Менеджер.Картинка = КартинкаОб.Ссылка;
					Менеджер.Удалить();
						Исключение
					КонецПопытки;

				КонецЦикла;
				
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Функция ПрисутствуетФото(ХарактеристикаНоменклатура) Экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеДополнительнойИнформации.Ссылка
	               |ИЗ
	               |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	               |ГДЕ
	               |	ХранилищеДополнительнойИнформации.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",ХарактеристикаНоменклатура);				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		ЗначениеСвойство = ПолучитьЗначениеСойства(ХарактеристикаНоменклатура,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("4.Вид комплектации"));	
		Если ЗначениеЗаполнено(ЗначениеСвойство) Тогда 
			Если ЗначениеСвойство = Перечисления.зетаБУВидыКомплектации.ПустаяСсылка() Тогда 
				Возврат истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат истина;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьКоличествоФото(Объект) Экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	               |ГДЕ
	               |	ХранилищеДополнительнойИнформации.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",Объект);
	
	Возврат Запрос.Выполнить().Выгрузить().Количество();
					   	
КонецФункции
#КонецОбласти

#Область КассоваяСмена
Процедура ОбработатьПлатежи() Экспорт 
	перем ФР;
	перем глСерверТО;
		//ПолучитьСерверТО().ПодключитьКлиента(Неопределено);
	ПолучитьСерверТОЛокал(глСерверТО).ПодключитьКлиента(Документы.ОплатаОтПокупателяПлатежнойКартой.ПолучитьФорму("ФормаДокумента"));
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОплатаОтПокупателяПлатежнойКартой.Ссылка
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	|ГДЕ
	|	ОплатаОтПокупателяПлатежнойКартой.Дата > &Дата
	|	И ОплатаОтПокупателяПлатежнойКартой.НомерЧекаККМ = 0
	|	И ОплатаОтПокупателяПлатежнойКартой.Проведен
	|	И ОплатаОтПокупателяПлатежнойКартой.Ответственный = &Ответственный";
	запрос.УстановитьПараметр("Дата",Дата("20170824235959"));
	Запрос.УстановитьПараметр("Ответственный",Справочники.Пользователи.Сайт);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультата из РезультатЗапроса цикл
		
		Об = СтрокаРезультата.ссылка.получитьОбъект();
		
		

		Если Об.НомерЧекаККМ <> 0 Тогда             
			Продолжить;;
		КонецЕсли;
		
		Если Не ПолучитьПроверитьПараметрыДляПробитияЧекаЛок(ФР) Тогда
			Возврат;
		КонецЕсли;
				
		//ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		//Если (НЕ Проведен) ИЛИ Модифицированность Тогда
		//	Предупреждение("Операция не выполнена!");
		//	Возврат;
		//КонецЕсли;
		
		Позиция         = Неопределено;
		НомерСмены      = Неопределено;
		ТаблицаПлатежей = Новый ТаблицаЗначений();
		ТаблицаПлатежей.Колонки.Добавить("Заголовок");
		ТаблицаПлатежей.Колонки.Добавить("Сумма");
		ТаблицаПлатежей.Колонки.Добавить("НДС");
		
		Для Каждого Позиция Из Об.РасшифровкаПлатежа Цикл
			СтрокаТаблицы    = ТаблицаПлатежей.Добавить();
			Если Об.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя Тогда 
				СтрокаТаблицы.Заголовок = "Оплата по заказу "+ Об.ДокументОснование.СайтНомер;
			Иначе
				СтрокаТаблицы.Заголовок = "Возврат по заказу "+ Об.РасшифровкаПлатежа[0].ДокументРасчетовСКонтрагентом.Сделка.СайтНомер;	
			КонецЕсли;
			СтрокаТаблицы.Сумма     = Позиция.СуммаПлатежа;
			//СтрокаТаблицы.НДС       = УчетНДС.ПолучитьСтавкуНДС(Позиция.СтавкаНДС);
			СтрокаТаблицы.НДС       = УчетНДС.ПолучитьСтавкуНДС(Позиция.СтавкаНДС);
		КонецЦикла;
		
		Если Об.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя Тогда
			Результат = ПолучитьСерверТОЛокал(глСерверТО).ПечатьЧекаПКО(ФР,
			ПолучитьСерверТОЛокал(глСерверТО).ПолучитьПарольКассираККМ(),
			Об.НомерЧекаККМ,
			НомерСмены,
			ТаблицаПлатежей,
			0,
			Об.СуммаДокумента,
			Об.Ссылка);
		Иначе
			Результат = ПолучитьСерверТОЛокал(глСерверТО).ПечатьЧекаРКО(ФР,
			ПолучитьСерверТОЛокал(глСерверТО).ПолучитьПарольКассираККМ(),
			Об.НомерЧекаККМ,
			НомерСмены,
			ТаблицаПлатежей,
			0,
			Об.СуммаДокумента,
			Об.Ссылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат) Тогда
					Продолжить;
		КонецЕсли;
		
		Об.Записать(РежимЗаписиДокумента.Запись);

	КонецЦикла;
	# Если Клиент Тогда 
    ЗавершитьРаботуСистемы(ложь);
	#КонецЕсли
КонецПроцедуры

Процедура ПровестиДокументыСменна() Экспорт 
	////ЗапросПоДокументам = новый запрос;
	////ЗапросПоДокументам.Текст = "ВЫБРАТЬ
	////                           |	ДокументыСменаКПроведению.ДокументСмена
	////                           |ИЗ
	////                           |	РегистрСведений.ДокументыСменаКПроведению КАК ДокументыСменаКПроведению
	////                           |ГДЕ
	////                           |	ДокументыСменаКПроведению.ДокументСмена.ЗакрытыРасходыИзККМ
	////                           |	";
	////РезультатЗапроса = ЗапросПоДокументам.Выполнить().Выгрузить();
	////
	////Для Каждого Строка из РезультатЗапроса  цикл
	////	Об = Строка.ДокументСмена.ПолучитьОбъект();
	////	ОтправлятьСМС = Ложь;
	////	Если не Об.РазрешитьПроведение Тогда 
	////		Об.РазрешитьПроведение = Истина;
	////		ОтправлятьСМС = Истина;
	////	Иначе
	////		

	////		ОсновнаяКасса = Об.Касса;	
	////		Запрос = Новый Запрос;
	////		Запрос.Текст = "ВЫБРАТЬ
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ВидОперации,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Организация,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.КассаПолучатель,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Подразделение,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Комментарий,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Контрагент,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ДоговорКонтрагента,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Ответственный,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.СтатьяДвиженияДенежныхСредств,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ПериодРегистрацииЗП,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Зарплата,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ДатаВремя,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Заявка,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.РасходныйКассовыйОрдер,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ТекущаяКасса,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ДокументПеремещенияДС,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Сумма,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.Закрыт,
	////		|	РасходДСВТеченииДняИзОсновнойКассы.ДокументОснование
	////		|ИЗ
	////		|	РегистрСведений.РасходДСВТеченииДняИзОсновнойКассы КАК РасходДСВТеченииДняИзОсновнойКассы
	////		|ГДЕ
	////		|	НЕ РасходДСВТеченииДняИзОсновнойКассы.Закрыт
	////		|	И РасходДСВТеченииДняИзОсновнойКассы.ДатаВремя МЕЖДУ &НачалоДня И &КонецДня
	////		|	И РасходДСВТеченииДняИзОсновнойКассы.ТекущаяКасса = &КассаККМ";
	////		Запрос.УстановитьПараметр("КассаККМ" ,Об.Касса);
	////		Запрос.УстановитьПараметр("НачалоДня",НачалоДня(Об.Дата));
	////		Запрос.УстановитьПараметр("КонецДня" ,КонецДня(Об.Дата));
	////		
	////		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	////		
	////		Для каждого СтрокаРезультат из РезультатЗапроса цикл
	////			Менеджер = РегистрыСведений.РасходДСВТеченииДняИзОсновнойКассы.СоздатьМенеджерЗаписи();
	////			ЗаполнитьЗначенияСвойств(Менеджер,СтрокаРезультат);
	////			
	////			Менеджер.Закрыт = Истина;
	////			Менеджер.Записать(Истина);
	////			СтрокаДокумента = Об.РасходыИзОсновнойКассы.Добавить();	
	////			ЗаполнитьЗначенияСвойств(СтрокаДокумента,СтрокаРезультат);
	////		КонецЦикла;
	////		
	////	КонецЕсли;
	////	Об.ЗакрытыРасходыИзККМ = Истина;
	////	Попытка
	////	Об.Записать(РежимЗаписиДокумента.Проведение);
	////Исключение
	////		//Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ОписаниеОшибки(),"+380936839334");		
	////	
	////	КонецПопытки;
	////	ТекстСМС = ""+Формат(об.Дата,"ДФ=dd.MM") +":"+ об.Подразделение.Префикс
	////	+ " "+ СтрЗаменить(ОКР(ПолучитьПродажиЗаДаДень(об.Дата,об.Подразделение)),Символы.НПП,"")
	////	+ ","+ СтрЗаменить(ОКР(об.ИтогоСданно),Символы.НПП,"")
	////	+ ","+ ПолучитьКоличествоЗвонков(об.Подразделение,НачалоДня(об.дата),КонецДня(об.Дата))
	////	+ ","+ ПолучитьКоличествоПосетителей(об.Подразделение,НачалоДня(об.дата),КонецДня(об.Дата));
	////	НомерТелефона = Неопределено;
	////	Если ОтправлятьСМС Тогда 
	////		Если об.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("СПБ-Шушары") Тогда
	////			НомерТелефона = "+79531772646" ; 
	////		ИначеЕсли об.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Москва-Бронницы") Тогда
	////			НомерТелефона = "+79531772646" ;
	////		ИначеЕсли об.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("СПБ-Парнас") Тогда
	////			НомерТелефона = "89312256445"; //+79818938003 //89312256445
	////		ИначеЕсли об.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Красноярск") Тогда
	////			НомерТелефона = "+79332003903"; //"+7 (913) 445-41-38";
	////		ИначеЕсли об.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("СПБ-Руслан") Тогда
	////			НомерТелефона = "+79214112102";
	////		ИначеЕсли об.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("СПБ-СТО") Тогда
	////			НомерТелефона = "+79214111808";

	////		КонецЕсли;	
	////		//ry_ПолучениеДанных.ПолучитьНомерТелефонаПользователя(ry_ПолучениеДанных.ПолучитьПользователейПоРоли(Перечисления.РольВКомпании.СтаршийПодразделения,об.Подразделение));
	////		Если НомерТелефона <> Неопределено Тогда 
	////			Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,НомерТелефона);		
	////		КонецЕсли;
	////		
	////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ПолучениеДанных.ПолучитьНомерТелефонаПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин")));
	////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ПолучениеДанных.ПолучитьНомерТелефонаПользователя(Справочники.Пользователи.НайтиПоНаименованию("Кузьмин Антон")));
	////		//Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,"+380936839334");
	////	КонецЕсли;
	////	
	////	Менеджер = РегистрыСведений.ДокументыСменаКПроведению.СоздатьМенеджерЗаписи();
	////	Менеджер.ДокументСмена= Строка.ДокументСмена;
	////	Менеджер.Удалить();
	////КонецЦикла;
КонецПроцедуры

Процедура ПроведениеДокументовСменнаВ2300() Экспорт 
	//ЗапросПоДокументам = новый запрос;
	//ЗапросПоДокументам.Текст = "ВЫБРАТЬ
	//                           |	ДокументыСменаКПроведению.ДокументСмена
	//                           |ИЗ
	//                           |	РегистрСведений.ДокументыСменаКПроведению КАК ДокументыСменаКПроведению
	//                           |ГДЕ
	//                           |	ДокументыСменаКПроведению.ДокументСмена.ЗакрытыРасходыИзККМ
	//                           |	";
	//РезультатЗапроса = ЗапросПоДокументам.Выполнить().Выгрузить();
	//
	//Для Каждого Строка из РезультатЗапроса  цикл
	//	Об = Строка.ДокументСмена.ПолучитьОбъект();
	//	Об.РазрешитьПроведение = Истина;
	//	Об.Записать(РежимЗаписиДокумента.Проведение);
	//	
	//	Менеджер = РегистрыСведений.ДокументыСменаКПроведению.СоздатьМенеджерЗаписи();
	//	Менеджер.ДокументСмена= Строка.ДокументСмена;
	//	Менеджер.Удалить();
	//КонецЦикла;
	
//	ЗапросПоОсновнымКассам = новый запрос;
//	ЗапросПоОсновнымКассам.Текст = "ВЫБРАТЬ
//	|	Кассы.Ссылка
//	|ИЗ
//	|	Справочник.Кассы КАК Кассы
//	|ГДЕ
//	|	Кассы.ОсновнаяКассаПодразделения";
//	РезультатЗапроса = ЗапросПоОсновнымКассам.Выполнить().Выгрузить();
//	
//	Для каждого СтрокаРезультат из РезультатЗапроса цикл
//		ОсновнаяКасса = СтрокаРезультат[0].Ссылка;	
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		|	РасходДСВТеченииДняИзОсновнойКассы.ВидОперации,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Организация,
//		|	РасходДСВТеченииДняИзОсновнойКассы.КассаПолучатель,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Подразделение,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Комментарий,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Контрагент,
//		|	РасходДСВТеченииДняИзОсновнойКассы.ДоговорКонтрагента,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Ответственный,
//		|	РасходДСВТеченииДняИзОсновнойКассы.СтатьяДвиженияДенежныхСредств,
//		|	РасходДСВТеченииДняИзОсновнойКассы.ПериодРегистрацииЗП,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Зарплата,
//		|	РасходДСВТеченииДняИзОсновнойКассы.ДатаВремя,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Заявка,
//		|	РасходДСВТеченииДняИзОсновнойКассы.РасходныйКассовыйОрдер,
//		|	РасходДСВТеченииДняИзОсновнойКассы.ТекущаяКасса,
//		|	РасходДСВТеченииДняИзОсновнойКассы.ДокументПеремещенияДС,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Сумма,
//		|	РасходДСВТеченииДняИзОсновнойКассы.Закрыт,
//		|	РасходДСВТеченииДняИзОсновнойКассы.ДокументОснование
//		|ИЗ
//		|	РегистрСведений.РасходДСВТеченииДняИзОсновнойКассы КАК РасходДСВТеченииДняИзОсновнойКассы
//		|ГДЕ
//		|	НЕ РасходДСВТеченииДняИзОсновнойКассы.Закрыт
//		|	И РасходДСВТеченииДняИзОсновнойКассы.ДатаВремя МЕЖДУ &НачалоДня И &КонецДня
//		|	И РасходДСВТеченииДняИзОсновнойКассы.ТекущаяКасса = &КассаККМ";
//		Запрос.УстановитьПараметр("КассаККМ" ,ОсновнаяКасса);
//		Запрос.УстановитьПараметр("НачалоДня",НачалоДня(ТекущаяДата()));
//		Запрос.УстановитьПараметр("КонецДня" ,КонецДня(ТекущаяДата()));
//		
//		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//		
//		НачатьТранзакцию();
//		Для каждого СтрокаРезультат из РезультатЗапроса цикл
//			Менеджер = РегистрыСведений.РасходДСВТеченииДняИзОсновнойКассы.СоздатьМенеджерЗаписи();
//			ЗаполнитьЗначенияСвойств(Менеджер,СтрокаРезультат);
//			
//			Менеджер.Закрыт = Истина;
//			Менеджер.Записать(Истина);	
//		КонецЦикла;
//		
//		Попытка
//			ДокументСмена= ПолучитьДокументСмена(ТекущаяДата(),ОсновнаяКасса);
//			ДокументСмена= ДокументСмена.ПолучитьОбъект();
//			Для каждого СтрокаРезультат из РезультатЗапроса цикл
//				СтрокаСмены = ДокументСмена.РасходыИзОсновнойКассы.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаСмены,СтрокаРезультат);
//			КонецЦикла;
//			ДокументСмена.ЗакрытыРасходыИзОсновнойКассы = Истина;
//			ДокументСмена.Записать(РежимЗаписиДокумента.Запись);
//			ДокументСмена.Записать(РежимЗаписиДокумента.Проведение);
//			ЗафиксироватьТранзакцию();
//		Исключение
//			ОтменитьТранзакцию();
//		КонецПопытки;
//		
//		
//		СхемаКомпоновкиДанных = Отчеты.ОтчетПоДвижениюДСДляРегЗадания.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
//	
//	//Из схемы возьмем настройки по умолчанию
//	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
//	
//	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоПериода")).Значение = НачалоДня(НачалоДня(ТекущаяДата())-1);
//	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецПериода")).Значение  = КонецДня(НачалоДня(ТекущаяДата())-1);
//	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("БанковскийСчетКасса")).Значение  = ОсновнаяКасса;
//	
//	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
//	
//	//Формируем макет, с помощью компоновщика макета
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	
//	//Передаем в макет компоновки схему, настройки и данные расшифровки
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
//	
//	//Выполним компоновку с помощью процессора компоновки
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
//	
//	//Очищаем поле табличного документа
//	Результат = Новый ТабличныйДокумент;
//	Результат.Очистить();
//	
//	//Выводим результат в табличный документ
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(Результат);
//	
//	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
//	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//	Результат.Записать(ОсновнаяКасса.ПутьСохраненияОтчетов + "/"+ОсновнаяКасса + "_" + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")+".pdf",ТипФайлаТабличногоДокумента.PDF);
//		
//КонецЦикла;	

ЗакрытьОткрытьСмену();
КонецПроцедуры
		
Процедура ЗакрытьОткрытьСмену() Экспорт 
	Перем ФР;
	   перем глСерверТО;
		ПолучитьСерверТОЛокал(глСерверТО).ПодключитьКлиента(Документы.ОплатаОтПокупателяПлатежнойКартой.ПолучитьФорму("ФормаДокумента"));
		Если Не ПолучитьПроверитьПараметрыДляПробитияЧекаЛок(ФР) Тогда
			Возврат;
		КонецЕсли;
		Результат = ПолучитьСерверТОЛокал(глСерверТО).ОтчетСГашением(ФР, ПолучитьСерверТОЛокал(глСерверТО).ПолучитьПарольКассираККМ());
		Результат = ПолучитьСерверТОЛокал(глСерверТО).ОткрытьСменну(ФР);
						
	
КонецПроцедуры

Функция ПолучитьПроверитьПараметрыДляПробитияЧекаЛок(ФР) Экспорт

	ФР = ПолучитьЭлементТО(Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор,
	   "Необходимо выбрать фискальный регистратор", "Фискальный регистратор не подключен!");

	Возврат ЗначениеЗаполнено(ФР);

КонецФункции // ПолучитьПроверитьПараметрыДляПробитияЧека()

Процедура ПроведениеДокументовСменнаИзОбработки(Касса,Дата) Экспорт 
    ДокументСмена = ПолучитьДокументСмена(Дата,Касса);	

	Менеджер = РегистрыСведений.ДокументыСменаКПроведению.СоздатьМенеджерЗаписи();
	Менеджер.ДокументСмена = ДокументСмена;
	Менеджер.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьДокументСмена(Дата,Касса) Экспорт 
	ВозвращаемоеЗначение = Документы.Смена.ПустаяСсылка();
 	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Смена.Ссылка
	               |ИЗ
	               |	Документ.Смена КАК Смена
	               |ГДЕ
	               |	Смена.Дата МЕЖДУ &НачалоДня И &КонецДня
	               |	И Смена.Касса = &Касса";
	Запрос.УстановитьПараметр("НачалоДня",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня",КонецДня(Дата));
	Запрос.УстановитьПараметр("Касса",Касса);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Ссылка;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьРасходыЗаДень(Дата,Подразделение) Экспорт 
	СуммаРасхода = 0;
	ЗапросПоРасходам = новый запрос;
	ЗапросПоРасходам.Текст = "ВЫБРАТЬ
	                         |	ЕстьNull(СУММА(РасходныйКассовыйОрдер.СуммаДокумента),0) КАК СуммаДокумента
	                         |ИЗ
	                         |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	                         |ГДЕ
	                         |	РасходныйКассовыйОрдер.Проведен
	                         |	И РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                         |	И РасходныйКассовыйОрдер.Подразделение = &Подразделение
	                         |	И РасходныйКассовыйОрдер.ВидОперации В(&ВидОперации)";
	ЗапросПоРасходам.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	ЗапросПоРасходам.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	ЗапросПоРасходам.УстановитьПараметр("Подразделение",Подразделение);
	
	СписокВидовОпераций = Новый  СписокЗначений;
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийРКО.ОплатаПоставщику);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами);

	ЗапросПоРасходам.УстановитьПараметр("ВидОперации",СписокВидовОпераций);
	
	

	РезультатЗапроса = ЗапросПоРасходам.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаРасхода = РезультатЗапроса[0].СуммаДокумента; 	
	КонецЕсли;
	
	ЗапросПоАвансовым = новый запрос;
	ЗапросПоАвансовым.Текст = "ВЫБРАТЬ
	                          |	естьNull(СУММА(АвансовыйОтчет.СуммаДокумента),0) КАК СуммаДокумента
	                          |ИЗ
	                          |	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	                          |ГДЕ
	                          |	АвансовыйОтчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                          |	И АвансовыйОтчет.Проведен
	                          |	И АвансовыйОтчет.Подразделение = &Подразделение";
	ЗапросПоАвансовым.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	ЗапросПоАвансовым.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	ЗапросПоАвансовым.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = ЗапросПоАвансовым.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаРасхода = РезультатЗапроса[0].СуммаДокумента; 	
	КонецЕсли;
	
	Возврат СуммаРасхода;
		
КонецФункции

Функция ПолучитьДневнойОборот(Дата,Подразделение) Экспорт
	
	СуммаОборот = 0;
	
	ЗапросПоПродаже = новый запрос;
	ЗапросПоПродаже.Текст= "ВЫБРАТЬ
	                       |	ЕстьNULL(СУММА(РеализацияТоваровУслуг.СуммаДокумента),0) КАК СуммаДокумента
	                       |ИЗ
	                       |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                       |ГДЕ
	                       |	РеализацияТоваровУслуг.Проведен
	                       |	И РеализацияТоваровУслуг.Подразделение = &Подразделение
	                       |	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                       |	И НЕ РеализацияТоваровУслуг.ОплаченоЧеком";
	ЗапросПоПродаже.УстановитьПараметр("Подразделение",Подразделение);
	ЗапросПоПродаже.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	ЗапросПоПродаже.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	
	РезультатЗапроса = ЗапросПоПродаже.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОборот = РезультатЗапроса[0].СуммаДОкумента;	
	КонецЕсли;
	
	ЗапросПоПродаже = новый запрос;
	ЗапросПоПродаже.Текст= "ВЫБРАТЬ
	                       |	ЕстьNull(СУММА(ОтчетОРозничныхПродажах.СуммаДокумента),0) КАК СуммаДокумента
	                       |ИЗ
	                       |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	                       |ГДЕ
	                       |	ОтчетОРозничныхПродажах.Проведен
	                       |	И ОтчетОРозничныхПродажах.Подразделение = &Подразделение
	                       |	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	ЗапросПоПродаже.УстановитьПараметр("Подразделение",Подразделение);
	ЗапросПоПродаже.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	ЗапросПоПродаже.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	
	РезультатЗапроса = ЗапросПоПродаже.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОборот = СуммаОборот+ РезультатЗапроса[0].СуммаДОкумента;	
	КонецЕсли;
	
	ЗапросПоВозврат = новый запрос;
	ЗапросПоВозврат.Текст= "ВЫБРАТЬ
	                       |	ЕстьNull(СУММА(ВозвратТоваровОтПокупателя.СуммаДокумента),0) КАК СуммаДокумента
	                       |ИЗ
	                       |	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	                       |ГДЕ
	                       |	ВозвратТоваровОтПокупателя.Проведен
	                       |	И ВозвратТоваровОтПокупателя.Подразделение = &Подразделение
	                       |	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	ЗапросПоВозврат.УстановитьПараметр("Подразделение",Подразделение);
	ЗапросПоВозврат.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	ЗапросПоВозврат.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	
	РезультатЗапроса = ЗапросПоВозврат.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОборот = СуммаОборот - РезультатЗапроса[0].СуммаДОкумента;	
	КонецЕсли;

	Возврат СуммаОборот;
	
КонецФункции

Функция ПолучитьПродажиЗаДаДень(Дата,Подразделение)
	
	ВозвращаемемоеЗначение = 0;
	ЗапросПоДокументам = новый запрос;
	ЗапросПоДокументам.Текст = "ВЫБРАТЬ
	                           |	СУММА(ВложенныйЗапрос.СуммаПродажБезУчетаВозвратов) КАК Сумма,
	                           |	ВложенныйЗапрос.Подразделение,
	                           |	СУММА(ВложенныйЗапрос.СтоимостьEURОборот) КАК СуммаEUR
	                           |ИЗ
	                           |	(ВЫБРАТЬ
	                           |		СУММА(ПродажиОбороты.СтоимостьОборот) КАК СуммаПродажБезУчетаВозвратов,
	                           |		ПродажиОбороты.Подразделение КАК Подразделение,
	                           |		СУММА(ПродажиОбороты.СтоимостьEURОборот) КАК СтоимостьEURОборот
	                           |	ИЗ
	                           |		РегистрНакопления.Продажи.Обороты(&НачалоДня, &КонецДня, Запись, Подразделение = &Подразделение) КАК ПродажиОбороты
	                           |	
	                           |	СГРУППИРОВАТЬ ПО
	                           |		ПродажиОбороты.Подразделение) КАК ВложенныйЗапрос
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	ВложенныйЗапрос.Подразделение";
	ЗапросПоДокументам.УстановитьПараметр("Подразделение",Подразделение);
	ЗапросПоДокументам.УстановитьПараметр("НачалоДня",НачалоДня(Дата));
	ЗапросПоДокументам.УстановитьПараметр("КонецДня",КонецДня(Дата));
	РезультатЗапроса = ЗапросПоДокументам.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() Тогда 
		Если Подразделение.Локация = Справочники.Локации.Россия Тогда 
			ВозвращаемемоеЗначение = РезультатЗапроса[0].Сумма;
		Иначе
			ВозвращаемемоеЗначение = РезультатЗапроса[0].СуммаEUR;
		КонецЕсли;
	КонецЕсли;
	
	Возврат  ВозвращаемемоеЗначение;
	
КонецФункции

Функция ПолучитьСуммуОплатНаличными(Дата,Подразделение) Экспорт
	
	СуммаОплатНаличными = 0;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаДокумента, 0) - ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) КАК ОплатыНаличными
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СУММА(ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма) КАК Сумма,
	               |		СРЕДНЕЕ(ОтчетОРозничныхПродажах.СуммаДокумента) КАК СуммаДокумента,
	               |		ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
	               |		ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка КАК Ссылка1
	               |	ИЗ
	               |		Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
	               |			ПО (ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка = ОтчетОРозничныхПродажах.Ссылка)
	               |	ГДЕ
	               |		ОтчетОРозничныхПродажах.Подразделение = &Подразделение
	               |		И ОтчетОРозничныхПродажах.Проведен
	               |		И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ОтчетОРозничныхПродажах.Ссылка,
	               |		ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОплатНаличными = РезультатЗапроса[0].ОплатыНаличными;	
	КонецЕсли;
	
	
	ЗапросПоРасходам = новый запрос;
	ЗапросПоРасходам.Текст = "ВЫБРАТЬ
	                         |	ЕСТЬNULL(СУММА(РасходныйКассовыйОрдер.СуммаДокумента), 0) КАК СуммаДокумента
	                         |ИЗ
	                         |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	                         |ГДЕ
	                         |	РасходныйКассовыйОрдер.Проведен
	                         |	И РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                         |	И РасходныйКассовыйОрдер.Подразделение = &Подразделение
	                         |	И РасходныйКассовыйОрдер.ВидОперации В(&ВидОперации)";
	ЗапросПоРасходам.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	ЗапросПоРасходам.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	ЗапросПоРасходам.УстановитьПараметр("Подразделение",Подразделение);
	
	СписокВидовОпераций = Новый  СписокЗначений;
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю);

	ЗапросПоРасходам.УстановитьПараметр("ВидОперации",СписокВидовОпераций);
	
	

	РезультатЗапроса = ЗапросПоРасходам.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОплатНаличными = СуммаОплатНаличными - РезультатЗапроса[0].СуммаДокумента; 	
	КонецЕсли;
	
	Возврат СуммаОплатНаличными;
	
КонецФункции

Функция ПолучитьСуммуОплатБезналом(Дата,Подразделение) Экспорт
	СуммаОплатБезнал = 0;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	естьNULL(СУММА(ЕСТЬNULL(ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма, 0)),0) КАК ОплатыБезналичными
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
	               |ГДЕ
	               |	ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.Проведен
	               |	И ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.Подразделение = &Подразделение";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОплатБезнал = РезультатЗапроса[0].ОплатыБезналичными;	
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПлатежноеПоручениеВходящее.СуммаДокумента), 0) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящее.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПлатежноеПоручениеВходящее.Ссылка.Проведен
	               |	И ПлатежноеПоручениеВходящее.Подразделение = &Подразделение";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);

	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОплатБезнал = СуммаОплатБезнал + РезультатЗапроса[0].СуммаДокумента;	
	КонецЕсли;	
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента), 0) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	               |ГДЕ
	               |	ОплатаОтПокупателяПлатежнойКартой.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОплатаОтПокупателяПлатежнойКартой.Ссылка.Проведен
	               |	И ОплатаОтПокупателяПлатежнойКартой.Подразделение = &Подразделение";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);

	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОплатБезнал = СуммаОплатБезнал + РезультатЗапроса[0].СуммаДокумента;	
	КонецЕсли;
	
		
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПлатежноеПоручениеИсходящее.СуммаДокумента), 0) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	               |ГДЕ
	               |	ПлатежноеПоручениеИсходящее.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПлатежноеПоручениеИсходящее.Ссылка.Проведен
	               |	И ПлатежноеПоручениеИсходящее.Подразделение = &Подразделение
	               |	И ПлатежноеПоручениеИсходящее.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ВидОперации",Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю);

	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		СуммаОплатБезнал = СуммаОплатБезнал - РезультатЗапроса[0].СуммаДокумента;	
	КонецЕсли;

	
	Возврат СуммаОплатБезнал;
	
КонецФункции

Функция ПолучитьКоличествоПосетителей(Подразделение,НачалоПериода,КонецПериода) экспорт
	Запрос = новый запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	Смена.КоличествоПосетителей
	               |ИЗ
	               |	Документ.Смена КАК Смена
	               |ГДЕ
	               |	Смена.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И Смена.Проведен
	               |	И Смена.Подразделение = &Подразделение";
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].КоличествоПосетителей;
	КонецЕсли;
КонецФункции
	
Функция ПолучитьСерверТОЛокал(глСерверТО) Экспорт

	Если глСерверТО = Неопределено Тогда
		глСерверТО = Обработки.ТОСервер.Создать();
	КонецЕсли;

	Возврат глСерверТО;

КонецФункции // ПолучитьСерверТО()

// Функция возвращает подключенный элемент ТО, вид которого передан параметром.
//
// Параметры:
//  ВидТО - вид торгового оборудования, подключенный элемент которого требуется получить.
//  ТекстЗаголовкаВыбора - текст заголовка для выбора.
//   Используется, когда подключено несколько элементов.
//  СообщениеНеПодключен - сообщение о том, что ни один элемент не подключен.
//
// Возвращаемое значение:
//  Нужный элемент торгового оборудования.
//
Функция ПолучитьЭлементТО(ВидТО, ТекстЗаголовкаВыбора, СообщениеНеПодключен)
	#Если Клиент тогда
 
	МассивТО = ПолучитьСерверТО().ПолучитьСписокУстройств(ВидТО);

	Если МассивТО.Количество() = 0 Тогда
		ЭлементТО = Неопределено;
		Предупреждение(СообщениеНеПодключен);
	ИначеЕсли МассивТО.Количество() = 1 Тогда
		ЭлементТО = МассивТО[0];
	Иначе
		СписокУстройств = РаботаСТорговымОборудованием.ПолучитьСписокУстройствТОДляВыбора(МассивТО);
		
		Для каждого СтрокаУстройство из СписокУстройств цикл
		Если "АТОЛ: ККТ ИМ"= СтрокаУстройство.Представление Тогда
			ЭлементТО = СтрокаУстройство.Значение;
		КонецЕсли;
		КонецЦикла;
	КонецЕсли;
#Иначе
	 ЭлементТО = Неопределено;

	#КонецЕсли


	Возврат ЭлементТО;

КонецФункции // ПолучитьТО()

//Функция ПолучитьСписокУстройствТОДляВыбора(МассивУстройств) Экспорт

//	Перем ВидУстройства;
//	Перем ПредставлениеУстройства;

//	СписокУстройств = Новый СписокЗначений;

//	Для Каждого Устройство Из МассивУстройств Цикл
//		ПолучитьСерверТО().ПолучитьПредставлениеУстройства(Устройство, ВидУстройства, ПредставлениеУстройства);
//		СписокУстройств.Добавить(Устройство, ПредставлениеУстройства);
//	КонецЦикла;

//	Возврат СписокУстройств;

//КонецФункции // ПолучитьСписокУстройствДляВыбора()
#КонецОбласти

#Область ОтложенныйСпрос
Процедура ОбработкаОтложенногоСпроса() Экспорт 
	////ЗапросПоЗапчастям = новый запрос;
	////ЗапросПоЗапчастям.Текст = "ВЫБРАТЬ
	////                          |	ЗапросНаДетальТовары.Номенклатура,
	////                          |	ЗапросНаДетальТовары.Ссылка.Покупатель,
	////                          |	ЗапросНаДетальТовары.Ссылка.Дата,
	////                          |	ЗапросНаДетальТовары.Ссылка.Номер,
	////                          |	ЗапросНаДетальТовары.Ссылка
	////                          |ИЗ
	////                          |	Документ.ЗапросНаДеталь.Товары КАК ЗапросНаДетальТовары
	////                          |ГДЕ
	////                          |	ЗапросНаДетальТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос)
	////                          |	И НЕ ЗапросНаДетальТовары.Ссылка.Закрыт
	////                          |	И НЕ ЗапросНаДетальТовары.Ссылка.ОтправленSMS
	////						  // + ДДГ 27 окт 2023
	////						  |	И ЗапросНаДетальТовары.Ссылка.Покупатель.Ссылка IS NOT NULL
	////						  // - ДДГ 27 окт 2023
	////						  |";
	////Результат = ЗапросПоЗапчастям.Выполнить().Выгрузить();						  
	////
	////МассивНоменклатуры = Результат.ВыгрузитьКолонку("Номенклатура");
	////
	////ЗапросПоОстаткам = новый запрос;
	////ЗапросПоОстаткам.Текст = "ВЫБРАТЬ
	////                         |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	////                         |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	////                         |	0 КАК Резерв,
	////                         |	ТоварыНаСкладахОстатки.Склад.Подразделение КАК Подразделение,
	////                         |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	////                         |	ТоварыНаСкладахОстатки.Склад
	////                         |ИЗ
	////                         |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В (&МассивНоменклатуры)) КАК ТоварыНаСкладахОстатки
	////                         |
	////                         |ОБЪЕДИНИТЬ ВСЕ
	////                         |
	////                         |ВЫБРАТЬ
	////                         |	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	////                         |	0,
	////                         |	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток,
	////                         |	ТоварыВРезервеНаСкладахОстатки.Склад.Подразделение,
	////                         |	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
	////                         |	ТоварыВРезервеНаСкладахОстатки.Склад
	////                         |ИЗ
	////                         |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Номенклатура В (&МассивНоменклатуры)) КАК ТоварыВРезервеНаСкладахОстатки";
	////ЗапросПоОстаткам.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	////
	////РезультатЗапросаПоОстаткам = ЗапросПоОстаткам.Выполнить().Выгрузить();
	////
	////Для Каждого СтрокаОстатки из РезультатЗапросаПоОстаткам цикл
	////	
	////	Если (СтрокаОстатки.Остаток - СтрокаОстатки.Резерв) >0 Тогда 
	////		Отбор = новый Структура;
	////		Отбор.Вставить("Номенклатура",СтрокаОстатки.Номенклатура);
	////		
	////		Строки = Результат.НайтиСтроки(Отбор);
	////		
	////		Для Каждого Строка из строки цикл
	////			
	////			ОтправитьСмсИЕмейлПоОтложенномуСпросу(Строка.Номер,Строка.Дата,Строка.Покупатель,Строка.Номенклатура,СтрокаОстатки.Подразделение);	
	////			СоздатьЗадачуМенеджеру(Строка.Ссылка,Строка.Номенклатура,СтрокаОстатки.ХарактеристикаНоменклатуры,СтрокаОстатки.Подразделение,СтрокаОстатки.Склад);
	////			СтруктураДляОтправки = Новый Структура;
	////			СтруктураДляОтправки.Вставить("Номенклатура", Строка.Номенклатура);
	////			СтруктураДляОтправки.Вставить("СсыльНаДок", Строка.Ссылка);
	////			СтруктураДляОтправки.Вставить("НомерСтроки", Строка.Номер);
	////			СтруктураДляОтправки.Вставить("Подразделение", СтрокаОстатки.Подразделение);
	////			АсинхронныеОбработчики.ВыгрузкаУведомленийОПоступленииНаСайт(СтруктураДляОтправки);
	////		КонецЦикла;
	////	КонецЕсли;
	////КонецЦикла;
	////
	////ЗапросПоПисьмам = Новый Запрос;
	////ЗапросПоПисьмам.Текст = "ВЫБРАТЬ
	////                        |	ВложенныйЗапрос.Письмо,
	////                        |	ВложенныйЗапрос.Запрос
	////                        |ИЗ
	////                        |	(ВЫБРАТЬ
	////                        |		ЭлектронноеПисьмо.Ссылка КАК Письмо,
	////                        |		ЗапросНаДеталь.Ссылка КАК Запрос
	////                        |	ИЗ
	////                        |		Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	////                        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаДеталь КАК ЗапросНаДеталь
	////                        |			ПО ЭлектронноеПисьмо.Ссылка = ЗапросНаДеталь.ПисьмоПоОтлСпросу
	////                        |	ГДЕ
	////                        |		ЭлектронноеПисьмо.Тема ПОДОБНО ""%Запрос на извещение о поступлении %"") КАК ВложенныйЗапрос";
	////РезультатЗапроса = ЗапросПоПисьмам.Выполнить().Выгрузить();
	////
	////Если РезультатЗапроса.Количество() Тогда
	////	Для Каждого СтрокаТаблицыЗначений из РезультатЗапроса Цикл
	////		
	////		Если ЗначениеЗаполнено(СтрокаТаблицыЗначений.Запрос) Тогда 
	////			Продолжить;
	////		КонецЕсли;
	////		
	////		Письмо = СтрокаТаблицыЗначений.письмо;
	////		
	////		ТекстПисьма = Письмо.ТекстПисьма;
	////		ТекстПисьма = СтрЗаменить(ТекстПисьма,Символы.ПС,"");
	////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%",Символы.ПС);
	////		
	////		КонтрагентНаименование = ИзвлечьДанныеИзСтроки(СтрПолучитьСтроку(ТекстПисьма,4));
	////		ТелефонКонтрагента     = ИзвлечьДанныеИзСтроки(СтрПолучитьСтроку(ТекстПисьма,3));
	////		ЕмейлКонтрагента	   = ИзвлечьДанныеИзСтроки(СтрПолучитьСтроку(ТекстПисьма,5));
	////		Комментарий			   = ИзвлечьДанныеИзСтроки(СтрПолучитьСтроку(ТекстПисьма,6));
	////		Артикул 			   = ИзвлечьДанныеИзСтроки(СтрПолучитьСтроку(ТекстПисьма,7));
	////		
	////		ЗапросНаДеталь							   = Документы.ЗапросНаДеталь.СоздатьДокумент();
	////		ЗапросНаДеталь.Подразделение   			   = Справочники.Подразделения.НайтиПоНаименованию("СПБ-Шушары");
	////		ЗапросНаДеталь.ВидОперации     			   = Перечисления.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос;
	////		ЗапросНаДеталь.Покупатель       		   = ПолучитьСоздатьКонтрагента(КонтрагентНаименование,ТелефонКонтрагента,ЕмейлКонтрагента);
	////		ЗапросНаДеталь.ТелефонПокупателя           = ПолучитьНомерТелефонаКонтрагента(ЗапросНаДеталь.Покупатель);
	////		ЗапросНаДеталь.ЕмейлПокупателя 			   = ПолучитьАдресЭлектроннойПочты(ЗапросНаДеталь.Покупатель);
	////		ЗапросНаДеталь.СостояниеЗапроса 		   = Перечисления.СостояниеЗавкиНаДеталь.ВРаботе;
	////		ЗапросНаДеталь.СодержаниеОтложенногоСпроса = Комментарий;
	////		ЗапросНаДеталь.ПисьмоПоОтлСпросу		   = Письмо;
	////		
	////		СтрокаТовары			 	 = ЗапросНаДеталь.Товары.Добавить();
	////		СтрокаТовары.Номенклатура	 = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Артикул));
	////		ЗапросНаДеталь.Дата		 	 = ТекущаяДата();
	////		ЗапросНаДеталь.Ответственный = Справочники.Пользователи.Сайт;
	////		ЗапросНаДеталь.Записать(РежимЗаписиДокумента.Запись);
	////		ОтправитьСМСиЕмейлПоОтложенномуСпросуПриЗАпросе(ЗапросНаДеталь.Ссылка);
	////	КонецЦикла;
	////КонецЕсли;	
КонецПроцедуры

Процедура ОтправитьСмсИЕмейлПоОтложенномуСпросу(Номер,Дата,Контрагент,Номенклатура,Подразделение)
	
////	НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(Контрагент);
////	Попытка
////		ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("По ожиданию "+Номер+" поступила деталь в "+Подразделение+" " + ПолучитьТелефонПодразделения(Подразделение), НомерТелефона);
////	Исключение
////	КонецПопытки;		
////	
////	ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);

////	// + 58813 ДДГ 28 апр 2023
////	Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Подразделение, "Локация");

//////	ЕмейлОтправителя = "robot@7detalei.ru";
////	ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////	// - 58813 ДДГ 28 апр 2023

////	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////	Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////	Письмо.Тема 			 = "По вашему листу ожидания пришли детали.";
////	Письмо.Дата              = ТекущаяДата();
////	Письмо.ЕстьВложения      = Ложь;
////	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////	Письмо.КодировкаПисьма   = "koi8-r";
////	Письмо.ЗаголовокПисьма   = "По вашему листу ожидания пришли детали.";
////	Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////	Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////	Письмо.КомуПредставление = Контрагент.Наименование;
////	Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////	Письмо.ТекстПисьма       = "";
////	Письмо.ПроверитьЗаполнение();
////	
////	Получатели = Письмо.КомуТЧ.Добавить();
////	Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////	Получатели.Представление 	     = Контрагент.Наименование;
////	
////	//Получатели = Письмо.КомуТЧ.Добавить();
////	//Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////	//Получатели.Представление 	     = Контрагент.Наименование;
////	//Письмо.Записать();
////	
////	
////	ТекстШапка  = Документы.ЗапросНаДеталь.ПолучитьМакет("ШапкаПришлиЗапчасти").ПолучитьТекст();
////	ТекстПодвал = Документы.ЗапросНаДеталь.ПолучитьМакет("ПодвалПришлиЗапчасти").ПолучитьТекст();
////	ТекстСтрока = Документы.ЗапросНаДеталь.ПолучитьМакет("СтрокаПришлиЗапчасти").ПолучитьТекст();
////	                                                         
////	ТекстПисьма = ТекстШапка;
////	ТекстПисьма = СтрЗаменить(ТекстПисьма,"#Номер",Номер);
////	ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗапроса",Формат(Дата,"ДФ=dd.MM.yyyy"));
////	ТекстПисьма = СтрЗаменить(ТекстПисьма,"#Контрагент",Контрагент);
////	ТекстПисьма = СтрЗаменить(ТекстПисьма,"#Телефон",ПолучитьТелефонПодразделения(Подразделение));
////	ТекстПисьма = СтрЗаменить(ТекстПисьма,"#Подразделение",Подразделение);
////	
////	Количество = 0;                                          
////	Сумма      = 0;
////	
////	ЛокальныйТекстСтроки = ТекстСтрока;
////	ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",Номенклатура);
////	ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Комментарий","");
////	//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////	//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////	ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////	//Количество  = Количество  + СтрокаЗаказа.Количество;
////	//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////	
////	//ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////	//ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////	//ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////	
////	ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////	
////	Письмо.ТекстПисьма = ТекстПисьма;
////	Письмо.ОтправитьПисьмо(); 
	
КонецПроцедуры

Процедура ПроверкаОтложенногоСпросаПриЗаписи(Источник, Отказ) Экспорт
Если не Источник.ОтработанПоСистемеОтлСпроса Тогда 	
	Если ТипЗнч(Источник) = тип("ДокументОбъект.зетаБУКомплектация") Тогда  
		
		ЗапросПоЗапчастям = новый запрос;
		ЗапросПоЗапчастям.Текст = "ВЫБРАТЬ
		|	ЗапросНаДетальТовары.Номенклатура,
		|	ЗапросНаДетальТовары.Ссылка.Покупатель,
		|	ЗапросНаДетальТовары.Ссылка.Дата,
		|	ЗапросНаДетальТовары.Ссылка.Номер,
		|	ЗапросНаДетальТовары.Ссылка как Запрос
		|ИЗ
		|	Документ.ЗапросНаДеталь.Товары КАК ЗапросНаДетальТовары
		|ГДЕ
		|	ЗапросНаДетальТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос)
		|	И НЕ ЗапросНаДетальТовары.Ссылка.Закрыт
		|	И НЕ ЗапросНаДетальТовары.Ссылка.ОтправленSMS
		// + ДДГ 27 окт 2023
		|	И ЗапросНаДетальТовары.Ссылка.Покупатель.Ссылка IS NOT NULL
		// - ДДГ 27 окт 2023
		|";
		Результат = ЗапросПоЗапчастям.Выполнить().Выгрузить();						  
		
		
		Для Каждого СтрокаОстатки из Результат цикл
			КоличествоОстаток = 0;
			СтрокиВДокументе = Источник.СоставКомплекта.НАйтистроки(новый структура("Номенклатура",СтрокаОстатки.Номенклатура));
			Попытка
				Для Каждого строкаДокумента из СтрокиВДокументе цикл
					КоличествоОстаток = КоличествоОстаток+1;
					Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда 
						СтрокиОснования = Источник.ДокументОснование.СоставКомплекта.НайтиСтроки(новый Структура("Номенклатура",строкаДокумента.Номенклатура)); 	
						Для Каждого строкаОснование из СтрокиОснования цикл
							КоличествоОстаток  = КоличествоОстаток - строкаОснование.Количество;
						КонецЦикла;
					КонецЕсли;
				
				
					Если КоличествоОстаток>0 Тогда 
						ОтправитьСмсИЕмейлПоОтложенномуСпросу(СтрокаОстатки.Запрос.Номер,СтрокаОстатки.Запрос.Дата,СтрокаОстатки.Запрос.Покупатель,СтрокаОстатки.Номенклатура,Источник.Склад.Подразделение);	
						СоздатьЗадачуМенеджеру(СтрокаОстатки.Запрос,СтрокаОстатки.Номенклатура,строкаДокумента.ХарактеристикаНоменклатуры,Источник.Склад.Подразделение,Источник.Склад);
					КонецЕсли;
				
				КонецЦикла;
			
			Исключение
			
			КонецПопытки;
			
			//Если (СтрокаОстатки.Остаток - СтрокаОстатки.Резерв) >0 Тогда 
			//	Отбор = новый Структура;
			//	Отбор.Вставить("Номенклатура",СтрокаОстатки.Номенклатура);
			//	
			//	Строки = Результат.НайтиСтроки(Отбор);
			//	
			//	Для Каждого Строка из строки цикл
			//		
			//		ОтправитьСмсИЕмейлПоОтложенномуСпросу(Строка.Номер,Строка.Дата,Строка.Покупатель,Строка.Номенклатура,СтрокаОстатки.Подразделение);	
			//		СоздатьЗадачуМенеджеру(Строка.Ссылка,Строка.Номенклатура,СтрокаОстатки.ХарактеристикаНоменклатуры,СтрокаОстатки.Подразделение,СтрокаОстатки.Склад);
			//		
			//	КонецЦикла;
			//КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = тип("ДокументОбъект.ПоступлениеТоваровУслуг") тогда
		
		
		ЗапросПоЗапчастям = новый запрос;
		ЗапросПоЗапчастям.Текст = "ВЫБРАТЬ
		|	ЗапросНаДетальТовары.Номенклатура,
		|	ЗапросНаДетальТовары.Ссылка.Покупатель,
		|	ЗапросНаДетальТовары.Ссылка.Дата,
		|	ЗапросНаДетальТовары.Ссылка.Номер,
		|	ЗапросНаДетальТовары.Ссылка как Запрос
		|ИЗ
		|	Документ.ЗапросНаДеталь.Товары КАК ЗапросНаДетальТовары
		|ГДЕ
		|	ЗапросНаДетальТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос)
		|	И НЕ ЗапросНаДетальТовары.Ссылка.Закрыт
		|	И НЕ ЗапросНаДетальТовары.Ссылка.ОтправленSMS
		// + ДДГ 27 окт 2023
		|	И ЗапросНаДетальТовары.Ссылка.Покупатель.Ссылка IS NOT NULL
		// - ДДГ 27 окт 2023
		|";
		Результат = ЗапросПоЗапчастям.Выполнить().Выгрузить();						  
		
		
		Для Каждого СтрокаОстатки из Результат цикл
			КоличествоОстаток = 0;
			СтрокиВДокументе = Источник.Товары.НАйтистроки(новый структура("Номенклатура",СтрокаОстатки.Номенклатура));
			
			Для Каждого строкаДокумента из СтрокиВДокументе цикл
				Если не ЗначениеЗаполнено(строкаДокумента.Заказ) Тогда 
					КоличествоОстаток = КоличествоОстаток+1;
				КонецЕсли;
				
				Если КоличествоОстаток>0 Тогда 
					ОтправитьСмсИЕмейлПоОтложенномуСпросу(СтрокаОстатки.Запрос.Номер,СтрокаОстатки.Запрос.Дата,СтрокаОстатки.Запрос.Покупатель,СтрокаОстатки.Номенклатура,строкаДокумента.Склад.Подразделение);	
					СоздатьЗадачуМенеджеру(СтрокаОстатки.Запрос,СтрокаОстатки.Номенклатура,строкаДокумента.ХарактеристикаНоменклатуры,строкаДокумента.Склад.Подразделение,строкаДокумента.Склад);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	Источник.ОтработанПоСистемеОтлСпроса = Истина;
	Попытка
		Если Источник.проведен Тогда 
		Источник.записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Источник.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Исключение
		Сообщить("Произошла ошибка при проверке отложенного спроса " + ОписаниеОшибки());
	КонецПопытки;
	
КонецЕсли;
КонецПроцедуры

Функция ОтправитьСМСиЕмейлПоОтложенномуСпросуПриЗАпросе(ЗапросНаДеталь)
	
	
////	Если ЗапросНаДеталь.ВидОперации = Перечисления.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос Тогда 
////			НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗапросНаДеталь.Покупатель);
////			Попытка
////				ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Создан запрос №"+ЗапросНаДеталь.Номер+".", ЗапросНаДеталь.ТелефонПокупателя);
////			Исключение
////			КонецПопытки;		
////		КонецЕсли; 
////		
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(ЗапросНаДеталь.Покупатель);

////		// + 58813 ДДГ 28 апр 2023
////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(ЗапросНаДеталь, "Подразделение,Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ 28 апр 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Регистрация листа ожидания ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "Вы зарегистрировали лист ожидания";
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = ЗапросНаДеталь.Покупатель;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = ЗапросНаДеталь.Покупатель;
////		
////		ТекстШапка  = Документы.ЗапросНаДеталь.ПолучитьМакет("ШапкаОтлСпрос").ПолучитьТекст();
////		ТекстПодвал = Документы.ЗапросНаДеталь.ПолучитьМакет("ПодвалОтлСпрос").ПолучитьТекст(); 
////		ТекстСтрока = Документы.ЗапросНаДеталь.ПолучитьМакет("СтрокаОтлСпрос").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#Номер",ЗапросНаДеталь.Номер);
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗапроса",Формат(ЗапросНаДеталь.Дата,"ДФ=dd.MM.yyyy"));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма," #Контрагент",ЗапросНаДеталь.Покупатель);

////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЗапросНаДеталь.Товары цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Комментарий","");
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			//Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
	Возврат Null;
	
	КонецФункции
#КонецОбласти

#Область РассылкаОтчетов
Процедура РассылкаОтчетовЕженедельная() Экспорт 
	 СхемаКомпоновкиДанных = Отчеты.ПараметрыРаботыМенеджеров.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	
	Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Значение = НачалоГода(Дата(2014,01,01));
	Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Использование = Истина;
	
	
	Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Значение = КонецМесяца(ТекущаяДата());
	Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Использование = Истина;
	
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Результат.Записать(КаталогВременныхФайлов()+"\1.htm",ТипФайлаТабличногоДокумента.HTML3);
	
	ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин"));
	
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("statistics@7detalei.ru");
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	Письмо.Тема 			 = "Отчет по параметрам работы менеджеров";
	Письмо.Дата              = ТекущаяДата();
	Письмо.ЕстьВложения      = Ложь;
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
	Письмо.КодировкаПисьма   = "koi8-r";
	Письмо.ЗаголовокПисьма   = "Отчет по параметрам работы менеджеров";
	Письмо.ОтправительАдресЭлектроннойПочты =  "statistics@7detalei.ru";
	Письмо.Кому              = ЕмейлКлиента;
	Письмо.КомуПредставление = "Менеджеры";
	Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
	Письмо.ТекстПисьма       = "Отчет по параметрам работы менеджеров";
	Письмо.ПроверитьЗаполнение();
	Письмо.ЕстьВложения = Истина;
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
	Получатели.Представление 	     = ЕмейлКлиента;
	
	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "volodin@7detalei.ru";
	//Получатели.Представление 	     = "volodin@7detalei.ru";

	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "kostin@7detalei.ru";
	//Получатели.Представление 	     = ЕмейлКлиента;
	//Письмо.Записать();
	
	ТекстИзФайла = Новый ТекстовыйДокумент;
	ТекстИзФайла.Прочитать(КаталогВременныхФайлов()+"\1.htm");                          
	Текст = ТекстИзФайла.ПолучитьТекст();

	Текст = СтрЗаменить(Текст,"1_files",КаталогВременныхФайлов()+"\1_files");
	Текст = СтрЗаменить(Текст,"SIZE=6","SIZE=4");

	Письмо.ТекстПисьма =Текст;
	Письмо.ОтправитьПисьмо();

КонецПроцедуры

Процедура РассылкаОтчетовЕжемесячная() Экспорт 
    СхемаКомпоновкиДанных = Отчеты.ОтчетПоКладовщикам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоПериода")).Значение = дата(2014,01,01);
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецПериода")).Значение = КонецМесяца(ТекущаяДата());
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоТекущегоМесяца")).Значение = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецТекущегоМесяца")).Значение = КонецМесяца(НачалоМесяца(ТекущаяДата())-1);
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоГода")).Значение = НачалоГода(ТекущаяДата());
	
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Результат.Записать(КаталогВременныхФайлов()+"\1.htm",ТипФайлаТабличногоДокумента.HTML3);

	// + ДДГ 18 мая 2022
	ИмяУказателяЕмейлов = "ОтчетПоКладовщикамЕмейлы";

	ЕмейлыДляОтправки = Справочники.УказательНастроек.ПолучитьВсеЗначенияНастройки(ИмяУказателяЕмейлов);

	Если ЕмейлыДляОтправки.Количество() < 1 Тогда
		Сообщить("Необходимо заполнить настройку: " + ИмяУказателяЕмейлов);
	КонецЕсли;
	// - ДДГ 18 мая 2022

	ЕмейлКлиентаКонстантин  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин"));

	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("statistics@7detalei.ru");
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	Письмо.Тема 			 = "Отчет по кладовщикам ежемесячный";
	Письмо.Дата              = ТекущаяДата();
	Письмо.ЕстьВложения      = Ложь;
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
	Письмо.КодировкаПисьма   = "koi8-r";
	Письмо.ЗаголовокПисьма   = "Отчет по кладовщикам ежемесячный";
	Письмо.ОтправительАдресЭлектроннойПочты =  "statistics@7detalei.ru";
	Письмо.Кому              = ЕмейлКлиентаКонстантин;
	Письмо.КомуПредставление = "Администрация";
	Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
	Письмо.ТекстПисьма       = "Отчет по кладовщикам ежемесячный";
	Письмо.ПроверитьЗаполнение();
	Письмо.ЕстьВложения = Истина;

	// + ДДГ 18 мая 2022
	Для Каждого СтрокаЕмейла Из ЕмейлыДляОтправки Цикл
		Получатели = Письмо.КомуТЧ.Добавить();
		Получатели.АдресЭлектроннойПочты = СтрокаЕмейла.Значение;
		Получатели.Представление 	     = СтрокаЕмейла.Имя;
	КонецЦикла;
	// - ДДГ 18 мая 2022

	//ЗаполнитьЕмейлыРассылкиОтчетКладовщика_Старая(Письмо);

	ТекстИзФайла = Новый ТекстовыйДокумент;
	ТекстИзФайла.Прочитать(КаталогВременныхФайлов()+"\1.htm");                          
	Текст = ТекстИзФайла.ПолучитьТекст();

	Текст = СтрЗаменить(Текст,"1_files",КаталогВременныхФайлов()+"\1_files");
	Текст = СтрЗаменить(Текст,"SIZE=7","SIZE=4");

	Письмо.ТекстПисьма =Текст;
	Письмо.ОтправитьПисьмо();

	
КонецПроцедуры

Процедура РассылкаОтчетовЕжедневная() Экспорт 
	СхемаКомпоновкиДанных = Отчеты.ОтчетПоКладовщикамЕжедневный.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоПериода")).Значение = НачалоДня(НачалоДня(ТекущаяДата())-1);
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецПериода")).Значение  = КонецДня(НачалоДня(ТекущаяДата())-1);
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоТекущегоМесяца")).Значение = НачалоМесяца(НачалоДня(НачалоДня(ТекущаяДата())-1));	
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецТекущегоМесяца")).Значение  = КонецМесяца(КонецДня(НачалоДня(ТекущаяДата())-1));
	
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоДня")).Значение = НачалоДня(НачалоДня(ТекущаяДата())-1);	
	Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецДня")).Значение  = КонецДня(НачалоДня(ТекущаяДата())-1);
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Результат.Записать(КаталогВременныхФайлов()+"\1.htm",ТипФайлаТабличногоДокумента.HTML3);

	// + ДДГ 18 мая 2022
	ИмяУказателяЕмейлов = "ОтчетПоКладовщикамЕмейлы";

	ЕмейлыДляОтправки = Справочники.УказательНастроек.ПолучитьВсеЗначенияНастройки(ИмяУказателяЕмейлов);

	Если ЕмейлыДляОтправки.Количество() < 1 Тогда
		Сообщить("Необходимо заполнить настройку: " + ИмяУказателяЕмейлов);
		Возврат;
	КонецЕсли;
	// - ДДГ 18 мая 2022

	ЕмейлКлиентаКонстантин  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин"));
	
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("statistics@7detalei.ru");
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	Письмо.Тема 			 = "Отчет по кладовщикам ежедневный";
	Письмо.Дата              = ТекущаяДата();
	Письмо.ЕстьВложения      = Ложь;
	Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
	Письмо.КодировкаПисьма   = "koi8-r";
	Письмо.ЗаголовокПисьма   = "Отчет по кладовщикам ежедневный";
	Письмо.ОтправительАдресЭлектроннойПочты =  "statistics@7detalei.ru";
	Письмо.Кому              = ЕмейлКлиентаКонстантин;
	Письмо.КомуПредставление = "Администрация";
	Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
	Письмо.ТекстПисьма       = "Отчет по кладовщикам ежедневный";
	Письмо.ПроверитьЗаполнение();
	Письмо.ЕстьВложения = Истина;

	// + ДДГ 18 мая 2022
	Для Каждого СтрокаЕмейла Из ЕмейлыДляОтправки Цикл
		Получатели = Письмо.КомуТЧ.Добавить();
		Получатели.АдресЭлектроннойПочты = СтрокаЕмейла.Значение;
		Получатели.Представление 	     = СтрокаЕмейла.Имя;
	КонецЦикла;
	// - ДДГ 18 мая 2022

	//ЗаполнитьЕмейлыРассылкиОтчетКладовщика_Старая(Письмо);

	ТекстИзФайла = Новый ТекстовыйДокумент;
	ТекстИзФайла.Прочитать(КаталогВременныхФайлов()+"\1.htm");                          
	Текст = ТекстИзФайла.ПолучитьТекст();

	Текст = СтрЗаменить(Текст,"1_files",КаталогВременныхФайлов()+"\1_files");
	Текст = СтрЗаменить(Текст,"SIZE=7","SIZE=3");

	Письмо.ТекстПисьма =Текст;
	Письмо.ОтправитьПисьмо();
	

КонецПроцедуры

Процедура ЗаполнитьЕмейлыРассылкиОтчетКладовщика_Старая(Письмо)

	ЕмейлКлиентаКонстантин  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин"));
	ЕмейлКлиентаАнтон  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Кузьмин Антон"));

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = ЕмейлКлиентаКонстантин;
	Получатели.Представление 	     = "Константин Николаевич";
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = ЕмейлКлиентаАнтон;
	Получатели.Представление 	     = "Антон Михайлович";
	
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "matsenko@7detalei.ru";
	Получатели.Представление 	     = "Маценко Павел";
	
		
	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "ismirnov@7detalei.ru";
	//Получатели.Представление 	     = "ismirnov@7detalei.ru";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "zinchenko@7detalei.ru";
	Получатели.Представление 	     = "zinchenko@7detalei.ru";

	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "babaev_d@7detalei.ru";
	//Получатели.Представление 	     = "babaev_d@7detalei.ru";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "muhamatshin@7detalei.ru";
	Получатели.Представление 	     = "muhamatshin@7detalei.ru";

	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "shashin@7detalei.ru";
	Получатели.Представление 	     = "Шашин Антон";
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "lagozin@7detalei.ru";
	Получатели.Представление 	     = "Николай Лагозин";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "volodin@7detalei.ru";
	Получатели.Представление 	     = "volodin@7detalei.ru";

	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "serbin@7detalei.ru";
	//Получатели.Представление 	     = "serbin@7detalei.ru";
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "isotov@7detalei.ee";
	Получатели.Представление 	     = "isotov@7detalei.ee";


	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "terent@7detalei.ru";
	Получатели.Представление 	     = "terent@7detalei.ru";

	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "novodmi@7detalei.ru";
	//Получатели.Представление 	     = "novodmi@7detalei.ru";

	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "ivansol@7detalei.ru";
	Получатели.Представление 	     = "ivansol@7detalei.ru";
	
	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "okrushko@7detalei.ru";
	Получатели.Представление 	     = "okrushko@7detalei.ru";

		Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "fomichev@7detalei.ru";
	Получатели.Представление 	     = "fomichev@7detalei.ru";

	//	Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "khristoforov@7detalei.ru";
	//Получатели.Представление 	     = "khristoforov@7detalei.ru";

	//	Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "zalnov@7detalei.ru";
	//Получатели.Представление 	     = "zalnov@7detalei.ru";

	//	Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "potatin@7detalei.ru";
	//Получатели.Представление 	     = "potatin@7detalei.ru";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "alekseev@7detalei.ru";
	Получатели.Представление 	     = "alekseev@7detalei.ru";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "prohorov@7detalei.ru";
	Получатели.Представление 	     = "prohorov@7detalei.ru";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "antipov_s@7detalei.ru";
	Получатели.Представление 	     = "antipov_s@7detalei.ru";

	Получатели = Письмо.КомуТЧ.Добавить();
	Получатели.АдресЭлектроннойПочты = "dubetskoy@7detalei.ru";
	Получатели.Представление 	     = "dubetskoy@7detalei.ru";

КонецПроцедуры

Процедура РассылкаОтчетовЕжедневная_Старая()
	
	//СхемаКомпоновкиДанных = Отчеты.Чаты.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	////Из схемы возьмем настройки по умолчанию
	//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//
	////Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоПериода")).Значение = НачалоДня(НачалоДня(ТекущаяДата())-1);
	////Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецПериода")).Значение  = КонецДня(НачалоДня(ТекущаяДата())-1);
	////Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоТекущегоМесяца")).Значение = НачалоМесяца(НачалоДня(НачалоДня(ТекущаяДата())-1));	
	////Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецТекущегоМесяца")).Значение  = КонецМесяца(КонецДня(НачалоДня(ТекущаяДата())-1));
	////
	////Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачалоДня")).Значение = НачалоДня(НачалоДня(ТекущаяДата())-1);	
	////Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("КонецДня")).Значение  = КонецДня(НачалоДня(ТекущаяДата())-1);
	//
	////Помещаем в переменную данные о расшифровке данных
	//ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//
	////Формируем макет, с помощью компоновщика макета
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	////Передаем в макет компоновки схему, настройки и данные расшифровки
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	//
	////Выполним компоновку с помощью процессора компоновки
	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	//
	////Очищаем поле табличного документа
	//Результат = Новый ТабличныйДокумент;
	//Результат.Очистить();
	//
	////Выводим результат в табличный документ
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(Результат);
	//
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	//
	//Результат.Записать("F:\2.htm",ТипФайлаТабличногоДокумента.HTML3);
	//
	////////////////////////////////////////////////////Чаты//////////////////////////////////////////////////////
	//ЕмейлКлиентаКонстантин  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Костин Константин"));
	//ЕмейлКлиентаАнтон  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочтыПользователя(Справочники.Пользователи.НайтиПоНаименованию("Кузьмин Антон"));
	//
	//
	//Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	//Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("statistics@7detalei.ru");
	//Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	//Письмо.Тема 			 = "Отчет по Чатам";
	//Письмо.Дата              = ТекущаяДата();
	//Письмо.ЕстьВложения      = Ложь;
	//Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
	//Письмо.КодировкаПисьма   = "koi8-r";
	//Письмо.ЗаголовокПисьма   = "Отчет по Чатам";
	//Письмо.ОтправительАдресЭлектроннойПочты =  "statistics@7detalei.ru";
	//Письмо.Кому              = ЕмейлКлиентаКонстантин;
	//Письмо.КомуПредставление = "Администрация";
	//Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
	//Письмо.ТекстПисьма       = "Отчет по Чатам";
	//Письмо.ПроверитьЗаполнение();
	//Письмо.ЕстьВложения = Истина;
	//
	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = ЕмейлКлиентаКонстантин;
	//Получатели.Представление 	     = "Константин Николаевич";
	//
	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = ЕмейлКлиентаАнтон;
	//Получатели.Представление 	     = "Антон Михайлович";
	//
	//Получатели = Письмо.КомуТЧ.Добавить();
	//Получатели.АдресЭлектроннойПочты = "r_yakovlev@outlook.com";
	//Получатели.Представление 	     = "Руслан Александрович";
	//
	//ТекстИзФайла = Новый ТекстовыйДокумент;
	//ТекстИзФайла.Прочитать("F:\2.htm");                          
	//Текст = ТекстИзФайла.ПолучитьТекст();

	//Текст = СтрЗаменить(Текст,"2_files","F:\2_files");
	//Текст = СтрЗаменить(Текст,"SIZE=7","SIZE=3");

	//Письмо.ТекстПисьма =Текст;
	//Письмо.ОтправитьПисьмо();

КонецПроцедуры
#КонецОбласти

#Область РегламентныеЗадания
Процедура АвторассылкаВыгрузкаПрайсов() Экспорт 
	
	ЗапросПоАктивнымНастройкам = новый Запрос;
	ЗапросПоАктивнымНастройкам.Текст =  "ВЫБРАТЬ
	                                    |	НастрокиВыгрузки.Ссылка
	                                    |ИЗ
	                                    |	Справочник.НастрокиВыгрузки КАК НастрокиВыгрузки
	                                    |ГДЕ
	                                    |	НастрокиВыгрузки.Активность
	                                    |	И НЕ НастрокиВыгрузки.ПометкаУдаления
	                                    |	И НастрокиВыгрузки.Сохранять = 2
	                                    |	И НастрокиВыгрузки.ВыгружатьПоРасписанию";
	РезультатЗапроса = ЗапросПоАктивнымНастройкам.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата из РезультатЗапроса цикл
		НастройкаВыгрузки = СтрокаРезультата.Ссылка;
		
		Для каждого ВремяВыгрузки из НастройкаВыгрузки.РасписаниеВыгрузки цикл
			Если ВремяВыгрузки.Время-дата("00010101000000")>ТекущаяДата()-НачалоДня(ТекущаяДата())-60*2.5 и ВремяВыгрузки.Время-дата("00010101000000")<ТекущаяДата()-НачалоДня(ТекущаяДата())+60*2.5  Тогда 
				Обработка = Обработки.ВыгрузкаПрайса.Создать();
				НастройкаВыгрузкиСсылка =НастройкаВыгрузки; 
				Обработка.НастройкаВыгрузки = НастройкаВыгрузки;
				ЗаполнитьЗначенияСвойств(Обработка,НастройкаВыгрузки);
				Обработка.НастройкаВыгрузки = НастройкаВыгрузкиСсылка;
				Обработка.Выгрузить(Ложь);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВосстановленеПароля() Экспорт 
ЗапросПоПисьмам = новый запрос;
ЗапросПоПисьмам.Текст = "ВЫБРАТЬ
                        |	ВложенныйЗапрос.Письмо,
                        |	ВложенныйЗапрос.ПисьмоИзРегистра
                        |ИЗ
                        |	(ВЫБРАТЬ
                        |		ЭлектронноеПисьмо.Ссылка КАК Письмо,
                        |		ЛогЗапросовНаВосстановлениеПароля.Письмо КАК ПисьмоИзРегистра
                        |	ИЗ
                        |		Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
                        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛогЗапросовНаВосстановлениеПароля КАК ЛогЗапросовНаВосстановлениеПароля
                        |			ПО (ЛогЗапросовНаВосстановлениеПароля.Письмо = ЭлектронноеПисьмо.Ссылка)
                        |	ГДЕ
                        |		НЕ ЭлектронноеПисьмо.ПометкаУдаления
                        |		И ЭлектронноеПисьмо.Тема ПОДОБНО ""%Восстановление пароля 7 Деталей%"") КАК ВложенныйЗапрос
                        |ГДЕ
                        |	ВложенныйЗапрос.ПисьмоИзРегистра ЕСТЬ NULL ";
РезультатЗапроса = ЗапросПоПисьмам.Выполнить().Выгрузить();

Для каждого СтрокаТаблицы из РезультатЗапроса цикл	
	Письмо = СтрокаТаблицы.Письмо;
	ТестПисьма = Письмо.ТекстПисьма;
	ТестПисьма = СтрЗаменить(ТестПисьма,"%",Символы.ПС);
	НомерТелефонаСтрока = СтрПолучитьСтроку(ТестПисьма,3);
	НомерТелефона 	    = ИзвлечьДанныеИзСтроки(НомерТелефонаСтрока);
	
	ЗапросПоПаролю = новый Запрос;
	ЗапросПоПаролю.Текст = "ВЫБРАТЬ
	                       |	СайтПользователи.Пароль,
	                       |	СайтПользователи.ЭлектроннаяПочта
	                       |ИЗ
	                       |	Справочник.СайтПользователи КАК СайтПользователи
	                       |ГДЕ
	                       |	СайтПользователи.КонтактныйТелефон = &КонтактныйТелефон";
	ЗапросПоПаролю.УстановитьПараметр("КонтактныйТелефон",СокрЛП(НомерТелефонаСтрока));						   						   	
	РузльтатЗапросаПоПаролю = ЗапросПоПаролю.Выполнить().Выгрузить();
	
	Если РузльтатЗапросаПоПаролю.Количество() Тогда 
		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Ваш пароль доступа на сайт 7Деталей:"+РузльтатЗапросаПоПаролю[0].Пароль,НомерТелефонаСтрока);
		
		
		ЕмейлКлиента  = РузльтатЗапросаПоПаролю[0].ЭлектроннаяПочта;
		
		Письмо1 = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
		Письмо1.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("robot@7detalei.ru");
		Письмо1.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
		Письмо1.Тема 			 = "Восстановление пароля. Интернет магазин ""7detalei.ru""";
		Письмо1.Дата              = ТекущаяДата();
		Письмо1.ЕстьВложения      = Ложь;
		Письмо1.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
		Письмо1.КодировкаПисьма   = "koi8-r";
		Письмо1.ЗаголовокПисьма   = "Восстановление пароля. Интернет магазин ""7detalei.ru""";
		Письмо1.ОтправительАдресЭлектроннойПочты =  "robot@7detalei.ru";
		Письмо1.Кому              = ЕмейлКлиента;
		Письмо1.КомуПредставление = "";
		Письмо1.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
		Письмо1.ТекстПисьма       = "";
		Письмо1.ПроверитьЗаполнение();
		
		Получатели = Письмо1.КомуТЧ.Добавить();
		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
		Получатели.Представление 	     = "Уважаемый клиент";
		
		ТекстШаблона = ПолучитьОбщийМакет("МакетВостановлениеПароля").ПолучитьТекст();
		ТекстШаблона = СтрЗаменить(ТекстШаблона,"#Пароль",РузльтатЗапросаПоПаролю[0].Пароль);
		ТекстПисьма = ТекстШаблона ; 	
		
		Письмо1.ТекстПисьма = ТекстПисьма;
		Письмо1.Записать();
		Письмо1.ОтправитьПисьмо(); 

		
		Менеджер = РегистрыСведений.ЛогЗапросовНаВосстановлениеПароля.СоздатьМенеджерЗаписи();
		Менеджер.Активность        = Истина;
		Менеджер.ОтправленноСМС    = Истина;
		Менеджер.ОтправленноПисьмо = Ложь;
		Менеджер.Письмо            = Письмо;
		Менеджер.Записать(Истина);
	КонецЕсли;
	
КонецЦикла;
					
КонецПроцедуры

Процедура СД_ОбработатьНоменклатуруПослеСменыКроссГруппы() Экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка,
	               |	КластерыАналогов.ГруппаКроссов,
	               |	Номенклатура.ГруппаКроссов КАК ГруппаКроссовНоменклатура,
	               |	Номенклатура.ГруппаКроссов.Наименование КАК ГруппаКроссовРегистр
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КластерыАналогов КАК КластерыАналогов
	               |		ПО (КластерыАналогов.Аналог = Номенклатура.Ссылка)
	               |ГДЕ
	               |	Номенклатура.ГруппаКроссов.Наименование ЕСТЬ NULL
				   |	И НЕ Номенклатура.Ссылка В ИЕРАРХИИ (&Ссылка)
	               |	И НЕ Номенклатура.ЭтоГруппа
	               |	И Номенклатура.ВидНоменклатуры.Наименование = ""Товар""
				   // + 54721 ДДГ 19 окт 2022
				   // чтобы избежать постоянной перезаписи номенклатуры без кросс-группы
				   |	И НЕ (КластерыАналогов.ГруппаКроссов IS NULL
				   |		И Номенклатура.ГруппаКроссов = ЗНАЧЕНИЕ(Справочник.СайтГруппыКроссов.ПустаяСсылка)
				   |	)
				   // - 54721 ДДГ 19 окт 2022
				   |";
	Запрос.УстановитьПараметр("Ссылка", Справочники.Номенклатура.НайтиПоНаименованию("Хозяйственно расходные товары"));
	
	РезультатЗапроса = запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() цикл
		ОБ = РезультатЗапроса.Ссылка.получитьОбъект();
		Об.ГруппаКроссов = РезультатЗапроса.ГруппаКроссов;
		Об.Записать();		
	КонецЦикла;
КонецПроцедуры

Процедура УдалитьНеккоректныеГруппаыКросов() Экспорт 
	//ЗапросПоНекорректнымГруппам = новый Запрос;
	//ЗапросПоНекорректнымГруппам.Текст = "ВЫБРАТЬ
	//|	СайтГруппыКроссов.Ссылка
	//|ИЗ
	//|	Справочник.СайтГруппыКроссов КАК СайтГруппыКроссов
	//|ГДЕ
	//|	СайтГруппыКроссов.Наименование ПОДОБНО &Наименование";
	//ЗапросПоНекорректнымГруппам.УстановитьПараметр("Наименование","<основная номенклатура не указана>");
	//
	//Выборка = ЗапросПоНекорректнымГруппам.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() цикл
	//	об = Выборка.ссылка.получитьОбъект();
	//	Если об.Модели.количество()=0 и об.Узлы.количество()=0 и об.Бренды.количество()=0 Тогда 
	//		об.ПометкаУдаления  = Истина;
	//		об.записать();
	//	КонецЕсли;
	//КонецЦикла;

	ЗапросПоПустымГруппамКроссов = новый запрос;
	ЗапросПоПустымГруппамКроссов.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ГруппаКроссов
		|ИЗ
		|	(ВЫБРАТЬ
		|		СайтГруппыКроссов.Ссылка КАК ГруппаКроссов,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КластерыАналогов.ГруппаКроссов) КАК КоличествоВГруппе
		|	ИЗ
		|		Справочник.СайтГруппыКроссов КАК СайтГруппыКроссов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КластерыАналогов КАК КластерыАналогов
		|			ПО (КластерыАналогов.ГруппаКроссов = СайтГруппыКроссов.Ссылка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СайтГруппыКроссов.Ссылка) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.КоличествоВГруппе = 0";

	РезультатЗапроса = ЗапросПоПустымГруппамКроссов.Выполнить().Выгрузить();

	Для Каждого СтрокаЗапроса из РезультатЗапроса цикл

		ГруппаОБ = СтрокаЗапроса.ГруппаКроссов.ПолучитьОбъект();

		// + 54721 ДДГ 19 окт 2022
		Если ЗначениеЗаполнено(ЗначениеЗаполнено(ГруппаОБ.Номенклатура))
		   И НЕ ЗначениеЗаполнено(ГруппаОБ.Номенклатура.Бренд)
		Тогда
			// пропускаем временные кросс-группы, у которых основная номенклатура без бренда
			// - на такое невозможно сделать корректную запись в кластер аналогов
			Продолжить;
		КонецЕсли;
		// - 54721 ДДГ 19 окт 2022

		Попытка
			ГруппаОБ.Удалить();
		Исключение
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область ДействияСобытия
//Работа с запросами
Функция ПолучитьДиалог(Запрос) Экспорт
	
	Если не Запрос.ФиксацияПереговоров и не Запрос.видОперации = Перечисления.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос Тогда 
		ЗапросПоПисьмам = новый запрос;
		ЗапросПоПисьмам.Текст =  "ВЫБРАТЬ
		                         |	ЭлектронноеПисьмо.Ссылка КАК Ссылка
		                         |ИЗ
		                         |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
		                         |ГДЕ
		                         |	ЭлектронноеПисьмо.Тема ПОДОБНО &Тема СПЕЦСИМВОЛ ""\""
		                         |
		                         |УПОРЯДОЧИТЬ ПО
		                         |	ЭлектронноеПисьмо.Дата УБЫВ";
		ЗапросПоПисьмам.УстановитьПараметр("Тема","%\["+Запрос.Номер+"\]%");
		
		РезультатЗапросаПоПисьмам =ЗапросПоПисьмам.Выполнить().Выгрузить() ;
		Текст = "";
		
		Для Каждого Письмо из РезультатЗапросаПоПисьмам цикл
			Если Письмо.ссылка.статусПисьма = Перечисления.СтатусыПисем.Отправленное Тогда 
				//Письмо отправленное нами
				Если Письмо.ссылка.Кому = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Запрос.Контрагент) или Письмо.ссылка.Кому = "kostin1978@gmail.com" Тогда  
					
					ТекстТекущегоПисьма = Письмо.Ссылка.ТекстПисьма;
					ТекстТекущегоПисьма = "<HTML><BODY>" + ТекстТекущегоПисьма;
					ТекстТекущегоПисьма = ИзвлечьТекстИзHTML(ТекстТекущегоПисьма);
										
					ПозицияСимвола = Найти(ТекстТекущегоПисьма,"История переписки");
					Если не ПозицияСимвола = 0 Тогда 
						ТекстТекущегоПисьма = Лев(ТекстТекущегоПисьма,Найти(ТекстТекущегоПисьма,"История переписки")-1); 
					КонецЕсли;
					Текст = Текст + "<b><br><font  size=2px;>"+Письмо.ссылка.Дата + " "+?(Письмо.ссылка.Ответственный = Справочники.Пользователи.ПустаяСсылка(),Запрос.Ответственный,Письмо.Ссылка.Ответственный)+"</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background: #ffa07a; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial; margin-right: 40px;"">"+СтрЗаменить(ТекстТекущегоПисьма,Символы.ПС,"<br>") +"</div>";
				КонецЕсли;
				
			Иначе
				
				ОтправительПисьма = ?(СокрЛП(ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Запрос.Контрагент)) = СокрЛП(Письмо.ссылка.ОтправительАдресЭлектроннойПочты),Запрос.Контрагент,Письмо.ссылка.ОтправительИмя );
				
				Если Запрос.ВидОперации = Перечисления.ВидыОперацийЗапросыНаДетали.ЗапросНаДетальКонстантину Тогда 
					ТекстТекущегоПисьма = Письмо.Ссылка.ТекстПисьма;
					Если Найти(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"From") <> 0 Тогда
						ТекстТекущегоПисьма = Лев(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),Найти(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"From")-1);
					ИначеЕсли Найти(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"От") <>0 Тогда 
						ТекстТекущегоПисьма = Лев(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),Найти(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"От")-1);

					иначе

						ТекстТекущегоПисьма = Лев(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),Найти(ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"Запрос на запчасть:")-1);
					
						
					КонецЕсли;
					Текст = Текст + "<b><br><font  size=2px; margin-left: 40px;>"+Письмо.ссылка.Дата + " "+ОтправительПисьма+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background:  #7FFFD4; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial;  margin-left: 40px;"">"+СтрЗаменить(ТекстТекущегоПисьма,Символы.ПС,"<br>")+"<br>"+"</div>";
				ИначеЕсли Письмо.ссылка.ОтправительАдресЭлектроннойПочты = "zokazi.lv@gmail.com" Тогда 
					ТекстТекущегоПисьма = Письмо.Ссылка.ТекстПисьма;

					ТекстТекущегоПисьма = Лев(ry_ОбщиеПроцедуры.ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),Найти(ry_ОбщиеПроцедуры.ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"пользователь")-25);
					
					Если ТекстТекущегоПисьма = "" Тогда 
						ТекстТекущегоПисьма = Письмо.Ссылка.ТекстПисьма;

						ТекстТекущегоПисьма = Лев(ry_ОбщиеПроцедуры.ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),Найти(ry_ОбщиеПроцедуры.ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"Отправлено")-26);
						
						Если ТекстТекущегоПисьма = "" Тогда 
							ТекстТекущегоПисьма = Письмо.Ссылка.ТекстПисьма;

							ТекстТекущегоПисьма = Лев(ry_ОбщиеПроцедуры.ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),Найти(ry_ОбщиеПроцедуры.ИзвлечьТекстИзHTML(ТекстТекущегоПисьма),"No:")-1);
							
						КонецЕсли;
					КонецЕсли;
					
					Текст = Текст + "<b><br><font  size=2px; margin-left: 40px;>"+Письмо.ссылка.Дата + " "+ОтправительПисьма+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background:  #7FFFD4; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial;  margin-left: 40px;"">"+СтрЗаменить(ТекстТекущегоПисьма,Символы.ПС,"<br>")+"<br>"+"</div>";
					
				Иначе
					
					ТекстТекущегоПисьма = Письмо.Ссылка.ТекстПисьма;
					ТекстТекущегоПисьма = ИзвлечьТекстИзHTML(ТекстТекущегоПисьма);
					
					Текст = Текст + "<b><br><font  size=2px; margin-left: 40px;>"+Письмо.ссылка.Дата + " "+ОтправительПисьма+":</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background:  #7FFFD4; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial;  margin-left: 40px;"">"+СтрЗаменить(ТекстТекущегоПисьма,Символы.ПС,"<br>")+"<br>"+"</div>";	
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	ИначеЕсли Запрос.видОперации = Перечисления.ВидыОперацийЗапросыНаДетали.ОтложенныйСпрос Тогда 
	Текст = "<b><br><font  size=2px;>Мы:</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background: #ffa07a; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial; margin-right: 40px;"">"+ запрос.СодержаниеОтложенногоСпроса +"<br>";
		
	ИначеЕсли Запрос.видОперации = Перечисления.ВидыОперацийЗапросыНаДетали.ФиксацияПереговоров Тогда 		
		Если СокрЛП(запрос.СодержаниеФиксацииПереговоров) = "" Тогда 				
			Для Каждого строка из Запрос.Переговоры Цикл 
				
				Текст = ""+ Текст + "<b><br><font  size=2px;>Мы:</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background: #ffa07a; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial; margin-right: 40px;"">" + СтрЗаменить(строка.ТекстЗаписи,Символы.ПС,"<br>") +"</div>";
				
			КонецЦикла;
		Иначе
			Текст = "<b><br><font  size=2px;>Мы:</font></b><br>"+"<div style=""border: 1px solid  #B0E0E6; background: #ffa07a; padding: 5px; border-radius: 50px; font-size: 12px; font-family: Arial; margin-right: 40px;"">"+ запрос.СодержаниеФиксацииПереговоров +"<br>";
		КонецЕсли;
		
	КонецЕсли;
	Возврат Текст;				
КонецФункции

Процедура ЗафиксироватьОбращениеСАутпоста() Экспорт
	
	#Если Клиент Тогда
	ОткрытьФорму("Документ.ЗапросНаДеталь.Форма.ФормаВыбораАутпоста");
	#КонецЕсли
		
КонецПроцедуры

Процедура ПриПриемкеТовара(Комплектация) Экспорт 
	
	Для каждого СтрокаТовары из Комплектация.СоставКомплекта цикл
		//Нужно найти номенклатуру в заказе поставщику, который является основанием	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаПоляПодразделениеПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если не РольДоступна("ПолныеПрава") Тогда 	
		Попытка
		Если Источник.Метаданные().Реквизиты.Найти("Подразделение")<> Неопределено Тогда 
			Если не ЗначениеЗаполнено(Источник.Подразделение) и не Источник.Ответственный.сайт  Тогда 
				Сообщить("Поле ""Подразделение"" не заполненно. Запись документа невозможна.");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	//Источник.Метаданные.
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура РазобратьКомплекты() Экспорт
	
	ПараметрыОтбора = Новый Структура("Наименование", "Разваливаем комплект если осталась одна запчасть");	
	ФонЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ПараметрыОтбора);
	
	Если НЕ ФонЗадания.Количество() =0 Тогда 
		Параметры = Новый Массив;
		Параметры.Добавить();
		
		ФоновыеЗадания.Выполнить("АсинхронныеОбработчики.ПроверитьНаКомплектИРазобрать", 
		Параметры, Новый УникальныйИдентификатор, "Разваливаем комплект если осталась одна запчасть");  
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеРегистрацииДанныхПоУзлу(Узел,Объект) Экспорт
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Объект);  
КонецПроцедуры 
#КонецОбласти

#Область УтилитыСтроковыеФункции
Функция ИзвлечьТекстИзHTML(Знач ИсходныйТекст) Экспорт
 Результат = "";
 
 Текст = НРег(ИсходныйТекст);
 Текст = СтрЗаменить(Текст,"<br>","%Пе%");
 
 //ИсходныйТекст = НРег(ИсходныйТекст);
 //ИсходныйТекст = СтрЗаменить(ИсходныйТекст,"<br>","%ПереносСтроки%");

 // отрезаем все что не body
 Позиция = Найти(Текст, "<body");
 Если Позиция > 0 Тогда
  Текст = Сред(Текст, Позиция + 5);
  ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 5);
  Позиция = Найти(Текст, ">");
  Если Позиция > 0 Тогда
   Текст = Сред(Текст, Позиция + 1);
   ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
  КонецЕсли;
 КонецЕсли;
 
 Позиция = Найти(Текст, "</body>");
 Если Позиция > 0 Тогда
  Текст = Лев(Текст, Позиция - 1);
  ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1);
 КонецЕсли;
 
 // вырезаем скрипты
 Позиция = Найти(Текст, "<script");
 Пока Позиция > 0 Цикл
  ПозицияЗакрывающегоТега = Найти(Текст, "</script>");
  Если ПозицияЗакрывающегоТега = 0 Тогда
   // Не найден закрывающий тег - вырезаем оставшийся текст.
   ПозицияЗакрывающегоТега = СтрДлина(Текст);
  КонецЕсли;
  Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 9);
  ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 9);
  Позиция = Найти(Текст, "<script");
 КонецЦикла;
 
 // вырезаем стили
 Позиция = Найти(Текст, "<style");
 Пока Позиция > 0 Цикл
  ПозицияЗакрывающегоТега = Найти(Текст, "</style>");
  Если ПозицияЗакрывающегоТега = 0 Тогда
   // Не найден закрывающий тег - вырезаем оставшийся текст.
   ПозицияЗакрывающегоТега = СтрДлина(Текст);
  КонецЕсли;
  Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 8);
  ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 8);
  Позиция = Найти(Текст, "<style");
 КонецЦикла;
 

 // вырезаем все теги 
 Позиция = Найти(Текст, "<");
 Пока Позиция > 0 Цикл
  Результат = Результат + Лев(ИсходныйТекст, Позиция-1);
  Текст = Сред(Текст, Позиция + 1);
  ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
  Позиция = Найти(Текст, ">");
  Если Позиция > 0 Тогда
   Текст = Сред(Текст, Позиция + 1);
   ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
  КонецЕсли;
  Позиция = Найти(Текст, "<");
 КонецЦикла;
 Результат = Результат + ИсходныйТекст;
 МассивСтрок = РазложитьСтрокуВМассивПодстрок(Результат, Символы.ПС, Истина, Истина);
 Возврат СтрЗаменить(СокрЛП(СтрокаИзМассиваПодстрок(МассивСтрок, Символы.ПС)),"%ПереносСтроки%",Символы.ПС);
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
 
 Результат = Новый Массив;
 
 // Для обеспечения обратной совместимости.
 Если ПропускатьПустыеСтроки = Неопределено Тогда
  ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
  Если ПустаяСтрока(Строка) Тогда 
   Если Разделитель = " " Тогда
    Результат.Добавить("");
   КонецЕсли;
   Возврат Результат;
  КонецЕсли;
 КонецЕсли;
 //
 
 Позиция = Найти(Строка, Разделитель);
 Пока Позиция > 0 Цикл
  Подстрока = Лев(Строка, Позиция - 1);
  Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
   Если СокращатьНепечатаемыеСимволы Тогда
    Результат.Добавить(СокрЛП(Подстрока));
   Иначе
    Результат.Добавить(Подстрока);
   КонецЕсли;
  КонецЕсли;
  Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
  Позиция = Найти(Строка, Разделитель);
 КонецЦикла;
 
 Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
  Если СокращатьНепечатаемыеСимволы Тогда
   Результат.Добавить(СокрЛП(Строка));
  Иначе
   Результат.Добавить(Строка);
  КонецЕсли;
 КонецЕсли;
 
 Возврат Результат;
 
КонецФункции

Функция СтрокаИзМассиваПодстрок(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь) Экспорт
 
 Результат = "";
 
 Для Индекс = 0 По Массив.ВГраница() Цикл
  Подстрока = Массив[Индекс];
  
  Если СокращатьНепечатаемыеСимволы Тогда
   Подстрока = СокрЛП(Подстрока);
  КонецЕсли;
  
  Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
   Подстрока = Строка(Подстрока);
  КонецЕсли;
  
  Если Индекс > 0 Тогда
   Результат = Результат + Разделитель;
  КонецЕсли;
  
  Результат = Результат + Подстрока;
 КонецЦикла;
 
 Возврат Результат;
 
КонецФункции

Функция ПеревестиНаТранслит(знач Строка) Экспорт 
Строка = СтрЗаменить(Строка," ","-");
Строка = СтрЗаменить(Строка,"А","A");
Строка = СтрЗаменить(Строка,"Б","B");
Строка = СтрЗаменить(Строка,"В","V");
Строка = СтрЗаменить(Строка,"Г","G");
Строка = СтрЗаменить(Строка,"Д","D");
Строка = СтрЗаменить(Строка,"Е","E");
Строка = СтрЗаменить(Строка,"Ё","YO");
Строка = СтрЗаменить(Строка,"Ж","ZH");
Строка = СтрЗаменить(Строка,"З","Z");
Строка = СтрЗаменить(Строка,"И","I");
Строка = СтрЗаменить(Строка,"Й","Y");
Строка = СтрЗаменить(Строка,"К","K");
Строка = СтрЗаменить(Строка,"Л","L");
Строка = СтрЗаменить(Строка,"М","M");
Строка = СтрЗаменить(Строка,"Н","N");
Строка = СтрЗаменить(Строка,"О","O");
Строка = СтрЗаменить(Строка,"П","P");
Строка = СтрЗаменить(Строка,"Р","R");
Строка = СтрЗаменить(Строка,"С","S");
Строка = СтрЗаменить(Строка,"Т","T");
Строка = СтрЗаменить(Строка,"У","U");
Строка = СтрЗаменить(Строка,"Ф","F");
Строка = СтрЗаменить(Строка,"Х","H");
Строка = СтрЗаменить(Строка,"Ц","C");
Строка = СтрЗаменить(Строка,"Ч","CH");
Строка = СтрЗаменить(Строка,"Ш","SH");
Строка = СтрЗаменить(Строка,"Щ","SH");
Строка = СтрЗаменить(Строка,"Ъ","");
Строка = СтрЗаменить(Строка,"Ы","Y");
Строка = СтрЗаменить(Строка,"Ь","");
Строка = СтрЗаменить(Строка,"Э","E");
Строка = СтрЗаменить(Строка,"Ю","YU");
Строка = СтрЗаменить(Строка,"Я","YA");
Строка = СтрЗаменить(Строка,"-","_");
Возврат Строка;
КонецФункции

Функция ЗаменитьЗапретныеСимволиURL(СтрокаЗНЧ, СимволЗамены = "_") Экспорт
	Если СтрокаЗНЧ = "" Тогда 
		Возврат "";
	КонецЕсли;
	
	URL = СтрокаЗНЧ;
	Пока Истина Цикл 
		Если Найти(URL, "__") Тогда 
			URL = СтрЗаменить(URL,"__", "");
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	URL = СтрЗаменить(URL,Символы.НПП,СимволЗамены); //Неразрывный пробел
	URL = СтрЗаменить(URL,"-",СимволЗамены);
	URL = СтрЗаменить(URL,"+",СимволЗамены);
	URL = СтрЗаменить(URL,"*",СимволЗамены);
	URL = СтрЗаменить(URL,"=",СимволЗамены);
	URL = СтрЗаменить(URL,")",СимволЗамены);
	URL = СтрЗаменить(URL,"(",СимволЗамены);
	URL = СтрЗаменить(URL,"?",СимволЗамены);
	URL = СтрЗаменить(URL,"&",СимволЗамены);
	URL = СтрЗаменить(URL,":",СимволЗамены);
	URL = СтрЗаменить(URL,"^",СимволЗамены);
	URL = СтрЗаменить(URL,"%",СимволЗамены);
	URL = СтрЗаменить(URL,"$",СимволЗамены);
	URL = СтрЗаменить(URL,";",СимволЗамены);
	URL = СтрЗаменить(URL,"#",СимволЗамены);
	URL = СтрЗаменить(URL,"№",СимволЗамены);
	URL = СтрЗаменить(URL,"""",СимволЗамены);
	URL = СтрЗаменить(URL,"@",СимволЗамены);
	URL = СтрЗаменить(URL,"!",СимволЗамены);
	URL = СтрЗаменить(URL,"`",СимволЗамены);
	URL = СтрЗаменить(URL,"~",СимволЗамены);
	URL = СтрЗаменить(URL,".",СимволЗамены);
	URL = СтрЗаменить(URL,",",СимволЗамены);
	URL = СтрЗаменить(URL,"/",СимволЗамены);
	URL = СтрЗаменить(URL,"\",СимволЗамены);
	URL = СтрЗаменить(URL,"|",СимволЗамены);
	URL = СтрЗаменить(URL,"__",СимволЗамены);
	URL = СтрЗаменить(URL," ",СимволЗамены);
	URL = СтрЗаменить(URL,"[",СимволЗамены);
	URL = СтрЗаменить(URL,"]",СимволЗамены);
	URL = СтрЗаменить(URL,"_-_",СимволЗамены);
	URL = СтрЗаменить(URL,"Ü", "u");
	URL = СтрЗаменить(URL,"ö", "o");
	URL = СтрЗаменить(URL,"Ö", "o");
	URL = СтрЗаменить(URL,"ü", "u");
	URL = СтрЗаменить(URL,"ï", "i");
	URL = СтрЗаменить(URL,"ø", "o");
	URL = СтрЗаменить(URL,"ò", "o");
	
	Если Лев(URL, 1) = "_" Тогда 
		URL = Прав(URL, СтрДлина(URL) -1);
	КонецЕсли;
	Если Прав(URL, 1) = "_" Тогда 
		URL = Лев(URL, СтрДлина(URL) -1);
	КонецЕсли;
	
	// + Климентьев 21.09.2020
	Пока Истина Цикл 
		Если Найти(URL, "__") Тогда 
			URL = СтрЗаменить(URL,"__", "_");
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Пока Истина Цикл 
		Если Найти(URL, "/_") Тогда 
			URL = СтрЗаменить(URL,"/_", "/");
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Пока Истина Цикл 
		Если Найти(URL, "_/") Тогда 
			URL = СтрЗаменить(URL,"_/", "/");
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// - Климентьев 21.09.2020
	
	Возврат URL;
	
КонецФункции

Функция ИзвлечьДанныеИзСтроки(Строка)
	Строка = СтрЗаменить(Строка,"|",Символы.ПС);	
	Строка = СтрПолучитьСтроку(Строка,2);
	
	Возврат Строка;
КонецФункции
	
Функция ПолучитьСлучайныйКод(Длина) Экспорт 
	
	СтрокаВозврата = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата()),".",""),":","")," ",""));
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	СлучЧисло = ГСЧ.СлучайноеЧисло(1, 9);
	
	СтрокаВозврата = Цел(СтрокаВозврата/СлучЧисло);
	СтрокаВозврата = Прав(СтрЗаменить(СтрокаВозврата,Символы.НПП,""),5);
	Возврат СтрокаВозврата;
		
КонецФункции
#КонецОбласти

Функция ПреобразоватьТаблицуЗначенийВМассив(тзДанные) Экспорт
    
    мсДанные = Новый Массив;
        
    // Запишем в массив
    Для Каждого СтрокаТЗ Из тзДанные Цикл
        
        стСтрокаТаблицы = Новый Структура;
        Для Каждого ИмяКолонки Из тзДанные.Колонки Цикл
            стСтрокаТаблицы.Вставить(ИмяКолонки.Имя, СтрокаТЗ[ИмяКолонки.Имя]);
        КонецЦикла;
        
        мсДанные.Добавить(стСтрокаТаблицы);
        
    КонецЦикла;
    
    Возврат мсДанные;
    
КонецФункции

//// Функция преобразует Массив из структур в ТаблицуЗначений.
////
Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт
    
    тзДанные = Новый ТаблицаЗначений;
    
    Для Каждого ЭлементМассива Из мсДанные Цикл
        // Рисуем колонки для таблицы
        Если тзДанные.Колонки.Количество() = 0 Тогда
            Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
            КонецЦикла;
        КонецЕсли;
        
        // Добавляем данные в таблицу
        НоваяСтрока = тзДанные.Добавить();
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
        КонецЦикла;
    КонецЦикла;
    
    Возврат тзДанные;
    
КонецФункции // ПреобразоватьМассивВТаблицуЗначений()

#Область ТестДрайв

Функция ЭтоЗаказТестДрайв(ЗаказПокупателя) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = (ЗаказПокупателя.СтатусИМ = Перечисления.СтатусыЗаказаИМ.ТестДрайв);
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ТестДрайв", Метаданные.Документы.ЗаказПокупателя) Тогда
		Попытка
			Результат = Результат Или ЗаказПокупателя["ТестДрайв"];
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПризнакТестДрайв(ЗаказПокупателя, ЗначениеПризнака = Истина) Экспорт
	
	Если НЕ ОбщегоНазначения.ЕстьРеквизитДокумента("ТестДрайв", Метаданные.Документы.ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗаказПокупателя["ТестДрайв"] = ЗначениеПризнака;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСкладТестДрайв() Экспорт
	
	Склад = Справочники.Склады.НайтиПоНаименованию("Тест-драйв", Истина);
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Склад = Справочники.Склады.НайтиПоНаименованию("Тест драйв", Истина);
	КонецЕсли;
	
	Возврат Склад;
	
КонецФункции

Процедура ПроверитьПросроченныеЗаказыТестДрайв() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен
	|	И ЗаказПокупателя.Дата <= &ДатаПросрочки
	|	И ЗаказПокупателя.СтатусИМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказаИМ.ТестДрайв)";
	Запрос.УстановитьПараметр("ДатаПросрочки", НачалоДня(ТекущаяДата()) - 20 * 24 * 60 * 60);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоздатьЗадачуИПисьмоТестДрайв(Выборка.Ссылка, "Прострочений термін заявки тест-драйв");
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЗадачуИПисьмоТестДрайв(ЗаказПокупателя, ТекстОповещения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиПользователя.Ссылка
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.Объект = &ЗаказПокупателя
	|	И ЗадачиПользователя.Наименование = &Наименование";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Наименование", ТекстОповещения);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЗадачаОб = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	ЗадачаОб.Дата = ТекущаяДата();
	ЗадачаОб.Объект = ЗаказПокупателя;
	ЗадачаОб.Оповещение = Истина;
	ЗадачаОб.СрокОповещения = ТекущаяДата();
	ЗадачаОб.Наименование = ТекстОповещения;
	ЗадачаОб.Описание = ТекстОповещения + ". Замовлення " + ЗаказПокупателя.Номер + ", order id " + ЗаказПокупателя.OrderID;
	ЗадачаОб.Записать();
	
	ОтправитьПисьмоТестДрайв(ТекстОповещения, ЗадачаОб.Описание);
	
КонецПроцедуры

Процедура ОтправитьПисьмоТестДрайв(ТемаПисьма, ТекстПисьма) Экспорт
	
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень");
	Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	Письмо.Дата = ТекущаяДата();
	Письмо.ЕстьВложения = Ложь;
	Письмо.ЗаголовокПисьма = ТемаПисьма;
	Письмо.Тема = ТемаПисьма;
	Письмо.Кому = "v.ivanov@vechir.ua; s.pichugin@vechir.ua";
	Письмо.КомуПредставление = Письмо.Кому;
	Письмо.ТекстПисьма = ТекстПисьма;
	
	Получатель = Письмо.КомуТЧ.Добавить();
	Получатель.АдресЭлектроннойПочты = "v.ivanov@vechir.ua";
	Получатель.Представление = "v.ivanov@vechir.ua";
	
	Получатель = Письмо.КомуТЧ.Добавить();
	Получатель.АдресЭлектроннойПочты = "s.pichugin@vechir.ua";
	Получатель.Представление = "s.pichugin@vechir.ua";
	
	Письмо.Записать();
	Письмо.ОтправитьПисьмо();
	
КонецПроцедуры

Функция СоздатьПеремещениеТестДрайв(ЗаказПокупателя, СкладОтправитель, СкладПолучатель, Комментарий = "") Экспорт
	
	Если НЕ ЭтоЗаказТестДрайв(ЗаказПокупателя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СкладОтправитель) Или НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		ВызватьИсключение "Не заполнен склад отправитель или склад получатель для тест-драйв перемещения.";
	КонецЕсли;
	
	Перемещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Перемещение, глЗначениеПеременной("глТекущийПользователь"));
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Перемещение, глЗначениеПеременной("глТекущийПользователь"));
	Перемещение.Дата = ТекущаяДата();
	Перемещение.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
	Перемещение.СкладОтправитель = СкладОтправитель;
	Перемещение.СкладПолучатель = СкладПолучатель;
	Перемещение.Организация = ЗаказПокупателя.Организация;
	Перемещение.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	Перемещение.Комментарий = Комментарий;
	
	Для Каждого СтрокаЗаказа Из ЗаказПокупателя.Товары Цикл
		СтрокаПеремещения = Перемещение.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПеремещения, СтрокаЗаказа);
		СтрокаПеремещения.Качество = Справочники.Качество.Новый;
	КонецЦикла;
	
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Перемещение.Ссылка;
	
КонецФункции

Функция ТестДрайвВстановлено(ЗаказПокупателя) Экспорт
	
	СкладТестДрайв = ПолучитьСкладТестДрайв();
	Возврат СоздатьПеремещениеТестДрайв(
		ЗаказПокупателя,
		ЗаказПокупателя.СкладГруппа,
		СкладТестДрайв,
		"Тест-драйв. Встановлено за замовленням " + ЗаказПокупателя.Номер);
	
КонецФункции

Функция ТестДрайвОтказ(ЗаказПокупателя, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	СкладТестДрайв = ПолучитьСкладТестДрайв();
	СкладСИ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойСклад");
	
	Возврат СоздатьПеремещениеТестДрайв(
		ЗаказПокупателя,
		СкладТестДрайв,
		СкладСИ,
		"Тест-драйв. Відмова за замовленням " + ЗаказПокупателя.Номер);
	
КонецФункции

Процедура ПодготовитьЗаказКСписаниюСоСкладаТестДрайв(ЗаказПокупателяОбъект) Экспорт
	
	СкладТестДрайв = ПолучитьСкладТестДрайв();
	Если НЕ ЗначениеЗаполнено(СкладТестДрайв) Тогда
		ВызватьИсключение "Не найден склад Тест-драйв.";
	КонецЕсли;
	
	ЗаказПокупателяОбъект.СкладГруппа = СкладТестДрайв;
	Для Каждого СтрокаТовары Из ЗаказПокупателяОбъект.Товары Цикл
		СтрокаТовары.Размещение = СкладТестДрайв;
	КонецЦикла;
	
КонецПроцедуры

Процедура СписатьТоварыТестДрайвПоОплаченномуЗаказу(ЗаказПокупателя, ПринудительноТестДрайв = Ложь) Экспорт
	
	Если НЕ ПринудительноТестДрайв И НЕ ЭтоЗаказТестДрайв(ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказОб = ЗаказПокупателя.ПолучитьОбъект();
	ПодготовитьЗаказКСписаниюСоСкладаТестДрайв(ЗаказОб);
	ЗаказОб.СтатусИМ = Перечисления.СтатусыЗаказаИМ.Завершен;
	ЗаказОб.ДополнительныеСвойства.Вставить("БезКонтроляДатыЗапрета");
	ЗаказОб.Записать(РежимЗаписиДокумента.Проведение);
	
	Документы.РеализацияТоваровУслуг.ВыполнитьПродажуПоЗаказу(
		ЗаказОб.Ссылка,
		Справочники.ВидыОплатЧекаККМ.Сайт,
		Перечисления.ТипыЧеков.ЗачетПредоплаты,
		Ложь,
		Истина,
		Ложь,
		Истина);
	
КонецПроцедуры

Процедура ТестДрайвПринятьОплату(ЗаказПокупателя) Экспорт
	
	СписатьТоварыТестДрайвПоОплаченномуЗаказу(ЗаказПокупателя, Истина);
	
КонецПроцедуры

#КонецОбласти







