Перем мУчетДенежныхСредствПоОбособленнымПодразделениям Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		Если НЕ ЭтоГруппа И Не ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
			Сообщить(НСтр("ru='Не указана валюта денежных средств.';uk='Не вказана валюта грошових коштів.'"),СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа И Не ЗначениеЗаполнено(Владелец) Тогда
			Сообщить(НСтр("ru='Не указана организация.';uk='Не зазначена організація.'"),СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ЭтоГруппа 
		   И НЕ ЭтоНовый() 
		   И ВалютаДенежныхСредств <> Ссылка.ВалютаДенежныхСредств 
		   И ПолныеПрава.Кассы_СуществуютСсылки(Ссылка) Тогда

			Сообщить(НСтр("ru='Существуют документы, проведенные по кассе ""';uk='Існують документи, проведені по касі ""'") + Наименование + НСтр("ru='""."
"Реквизит ""Валюта денежных средств"" не может быть изменен, элемент не записан.';uk='""."
"Реквізит ""Валюта грошових коштів"" не може бути змінений, елемент не записаний.'"), 
			         СтатусСообщения.Важное);

			Отказ = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух");

	БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
	ЕстьАналитикаПоОбособленнымПодразделениям = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);

	мУчетДенежныхСредствПоОбособленнымПодразделениям = Ложь;
	Если мУчетнаяПолитикаБУ.Количество() > 0 Тогда	
		мУчетДенежныхСредствПоОбособленнымПодразделениям = ЕстьАналитикаПоОбособленнымПодразделениям И мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям;
	КонецЕсли;
	
КонецПроцедуры
