
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		
		Если ЭтоГруппа И НЕ ЗначениеЗаполнено(НайтиГруппу(Наименование)) Тогда
			
			СпрГр = Справочники.Склады.СоздатьГруппу();
			СпрГр.Наименование = "Склади " + Наименование;
			СпрГр.Записать();
		
		КонецЕсли;
		
		Если НЕ ЭтоГруппа И ЗначениеЗаполнено(Родитель) Тогда
			
			НайденнаяГруппа = НайтиГруппу(Родитель);
			
			Если ЗначениеЗаполнено(НайденнаяГруппа) Тогда
				СпрОб = Справочники.Склады.СоздатьЭлемент();
				СпрОб.Родитель = НайденнаяГруппа;
				СпрОб.ВидСклада = Перечисления.ВидыСкладов.Оптовый;
				СпрОб.Наименование = Наименование;
				СпрОб.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		//Дандали В. 21.08.2025 +
		Если НЕ ЭтоГруппа Тогда
			ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
			СписокПолучателей = Новый СписокЗначений;
			СписокПолучателей.Добавить("y.volchenkov@vechir.ua");//y.volchenkov@vechir.ua
			ТекстПисьма = "Створено проект " + Наименование;
			
			СтрПисьма = Новый Структура;
			СтрПисьма.Вставить("ОтправленоФоном", Истина);
			СтрПисьма.Вставить("Тело", ТекстПисьма);
			СтрПисьма.Вставить("Тема", "Новий проект");
			СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
			СтрПисьма.Вставить("Кому", СписокПолучателей);
			СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
			СтрПисьмо.Письмо.ОтправитьПисьмо(, ПользовательОтправкиПоПочте);
		КонецЕсли;
		//Дандали В. 21.08.2025 -
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиГруппу(Родитель) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	НЕ Склады.ПометкаУдаления
		|	И Склады.Наименование = &Наименование
		|	И Склады.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Наименование", "Склади " + Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЕсли;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	ЭлементСклад = Справочники.Склады.НайтиПоНаименованию(Наименование);
	Если ЭлементСклад.Пустая() Тогда 
		ЭлементСклад 				= Справочники.Склады.СоздатьЭлемент();
		ЭлементСклад.ВидСклада 		= Перечисления.ВидыСкладов.Оптовый;
		ЭлементСклад.Родитель		= Справочники.Склады.НайтиПоКоду(Родитель.Код,Истина);
		ЭлементСклад.Наименование 	= Наименование;
		ЭлементСклад.Записать();
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(РуководительПроекта) Тогда 
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГруппыИсполнителейЗадач.Ссылка
		               |ИЗ
		               |	Справочник.ГруппыИсполнителейЗадач КАК ГруппыИсполнителейЗадач
		               |ГДЕ
		               |	ГруппыИсполнителейЗадач.РольИсполнителя = &РольИсполнителя
		               |	И ГруппыИсполнителейЗадач.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации";
		Запрос.УстановитьПараметр("РольИсполнителя",Справочники.РолиИсполнителей.анРуководительПроекта);
		Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",Ссылка);
		
		РезультатЗапроса = запрос.Выполнить().Выгрузить();
		
		Если не РезультатЗапроса.Количество() Тогда 
			Элемент = Справочники.ГруппыИсполнителейЗадач.СоздатьЭлемент();
			Элемент.РольИсполнителя         = Справочники.РолиИсполнителей.анРуководительПроекта;
			Элемент.ОсновнойОбъектАдресации = Ссылка;
			Элемент.Наименование = строка(""+Справочники.РолиИсполнителей.анРуководительПроекта+" ,"+Ссылка);
			Элемент.Записать();
			
			Элемент = Элемент.Ссылка;
		Иначе
			Элемент = РезультатЗапроса[0].ссылка;
		КонецЕсли;
		
		НаборЗаписей 							= РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОсновнойОбъектАдресации.установить(Ссылка);
		НаборЗаписей.Отбор.РольИсполнителя.установить(Справочники.РолиИсполнителей.анРуководительПроекта);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
		МенежерЗаписей = РегистрыСведений.ИсполнителиЗадач.СоздатьМенеджерЗаписи();
		МенежерЗаписей.Активность	 			= Истина;
		МенежерЗаписей.ГруппаИсполнителейЗадач 	= Элемент;
		МенежерЗаписей.Исполнитель 				= РуководительПроекта;
		МенежерЗаписей.ОсновнойОбъектАдресации  = Ссылка;
		МенежерЗаписей.РольИсполнителя 			= Справочники.РолиИсполнителей.анРуководительПроекта; 
		МенежерЗаписей.Записать(Истина);	
	КонецЕсли;

КонецПроцедуры
