Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// получение данных по частным предпринимателям за квартал
//
Процедура ЗаполнитьЧП(ВариантЗаполнения = "ПоВзаиморасчетам") Экспорт

	Запрос = Новый Запрос;
	
	Если ВариантЗаполнения = "ПоОплате"  Тогда
		ТекстЗапроса = "                                                                                        
		|ВЫБРАТЬ
		|	ОстакиОбороты.Контрагент	КАК Контрагент,
		|	СУММА(ОстакиОбороты.УдержНДФЛ)  КАК УдержНДФЛ,
		|	СУММА(ОстакиОбороты.УдержВС)  КАК УдержВС,
		|	СУММА(ВЫБОР	КОГДА (ОстакиОбороты.ОбДт > ОстакиОбороты.ОбКт) ТОГДА ОстакиОбороты.ОбДт - ОстакиОбороты.ОбКт ИНАЧЕ 0 КОНЕЦ
		|		)  КАК НачисленоДохода
		|	
		|	ИЗ(
		|		ВЫБРАТЬ
		|			Хозрасчетный.Контрагент	КАК Контрагент,
		|			Хозрасчетный.Договор	КАК Договор,
		|			СУММА(Хозрасчетный.УдержНДФЛ)  КАК УдержНДФЛ,
		|			СУММА(Хозрасчетный.УдержВС)  КАК УдержВС,
		|			СУММА(Хозрасчетный.ОбКт)  КАК ОбКт,
		|			СУММА(Хозрасчетный.ОбДт)  КАК ОбДт
		|		ИЗ (
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет6411)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержНДФЛ,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет642)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержВС,
		|					ХозрасчетныйОбороты.СуммаОборотДт  КАК ОбДт,
		|					ХозрасчетныйОбороты.СуммаОборотКт  КАК ОбКт
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
		|
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|					И (ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СписокКорСчетов) или ХозрасчетныйОбороты.КорСчет в (&Счет6411) или ХозрасчетныйОбороты.КорСчет в (&Счет642))
		|		  ) КАК Хозрасчетный
		|
		|		СГРУППИРОВАТЬ ПО 
		|			Хозрасчетный.Контрагент,
		|			Хозрасчетный.Договор
		|	) КАК ОстакиОбороты	
		|
		|ГДЕ
		|	ОстакиОбороты.обДт > 0 ИЛИ ОстакиОбороты.ОбКт > 0
		|
		|СГРУППИРОВАТЬ ПО 
		|	ОстакиОбороты.Контрагент    
		|   
		|";
		
// н ЛИВ
	ИначеЕсли ВариантЗаполнения = "ПоПриходнымНакладным" Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ЗакупкиОбороты.Контрагент,
		               |	СУММА(ЗакупкиОбороты.СтоимостьОборот) КАК НачисленоДохода,
		               |	СУММА(0) КАК УдержНДФЛ,
		               |	СУММА(0) КАК УдержВС
		               |ИЗ
		               |	РегистрНакопления.Закупки.Обороты(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Регистратор,
		               |			Контрагент.ЮрФизЛицо = &ЧП
		               |				И Организация = &парамОрганизация) КАК ЗакупкиОбороты
		               |ГДЕ
		               |	ЗакупкиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		               |	И ЗакупкиОбороты.Регистратор.ОтражатьВБухгалтерскомУчете = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗакупкиОбороты.Контрагент";
// к ЛИВ

	Иначе
		ТекстЗапроса = "                                                                                        
		|ВЫБРАТЬ
		|	ОстакиОбороты.Контрагент	КАК Контрагент,
		|	СУММА(ОстакиОбороты.УдержНДФЛ)  КАК УдержНДФЛ,
		|	СУММА(ОстакиОбороты.УдержВС)  КАК УдержВС,
		|	СУММА(ВЫБОР	КОГДА (ОстакиОбороты.ОбКт -ОстакиОбороты.ОстДт + ВЫБОР	КОГДА ОстакиОбороты.Возврат < 0 ТОГДА ОстакиОбороты.Возврат ИНАЧЕ 0 КОНЕЦ )
		|	> (ОстакиОбороты.обДт - ОстакиОбороты.ОстКт - ВЫБОР	КОГДА ОстакиОбороты.Возврат > 0 ТОГДА ОстакиОбороты.Возврат ИНАЧЕ 0 КОНЕЦ)
		|			ТОГДА (ОстакиОбороты.ОбКт-ОстакиОбороты.ОстДт  + ВЫБОР	КОГДА ОстакиОбороты.Возврат < 0 ТОГДА ОстакиОбороты.Возврат ИНАЧЕ 0 КОНЕЦ)  // отнимаем возвраты товаром
		|			ИНАЧЕ (ОстакиОбороты.обДт -ОстакиОбороты.ОстКт - ВЫБОР	КОГДА ОстакиОбороты.Возврат > 0 ТОГДА ОстакиОбороты.Возврат ИНАЧЕ 0 КОНЕЦ)  // отнимаем возвраты деньгами  
		|		КОНЕЦ)  КАК НачисленоДохода
		|	
		|	ИЗ(
		
		|		ВЫБРАТЬ
		|			Хозрасчетный.Контрагент	КАК Контрагент,
		|			Хозрасчетный.Договор	КАК Договор,
		|			СУММА(Хозрасчетный.УдержНДФЛ)  КАК УдержНДФЛ,
		|			СУММА(Хозрасчетный.УдержВС)  КАК УдержВС,
		|			СУММА(Хозрасчетный.ОстКт)  КАК ОстКт,
		|			СУММА(Хозрасчетный.ОстДт)  КАК ОстДт,
		|			СУММА(Хозрасчетный.ОбКт)  КАК ОбКт,
		|			СУММА(Хозрасчетный.ОбДт)  КАК ОбДт,
		|			СУММА(Хозрасчетный.Возврат)  КАК Возврат
		|		ИЗ (
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|	               	0                         		КАК УдержНДФЛ,
		|	               	0                         		КАК УдержВС,
		|					ХозрасчетныйОбороты.СуммаОстатокДт  КАК ОстДт,
		|					ХозрасчетныйОбороты.СуммаОстатокКт  КАК ОстКт,
		|					0  КАК ОбДт,
		|					0  КАК ОбКт,
		|					0  КАК Возврат
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &парамОрганизация) КАК ХозрасчетныйОбороты
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|               //авансы
		|				ОБЪЕДИНИТЬ ВСЕ
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет6411)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержНДФЛ,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет642)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержВС,
		|					0  КАК ОстДт,
		|					0  КАК ОстКт,
		|					ХозрасчетныйОбороты.СуммаОборотДт  КАК ОбДт,
		|					0  КАК ОбКт,
		|					0  КАК Возврат
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетовАвансы), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
		|
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|               //возврат аванса
		|				ОБЪЕДИНИТЬ ВСЕ
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|					0  КАК УдержНДФЛ,
		|					0  КАК УдержВС,
		|					0  КАК ОстДт,
		|					0  КАК ОстКт,
		|					0  КАК ОбДт,
		|					0  КАК ОбКт,
		|					ХозрасчетныйОбороты.СуммаОборотКт  КАК Возврат
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетовАвансы) ИЛИ Счет В ИЕРАРХИИ (&СписокСчетовПоставщики), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
		|
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|                  И ХозрасчетныйОбороты.КорСчет в иерархии (&СписокКорСчетов)
		|               //Поставка
		|				ОБЪЕДИНИТЬ ВСЕ
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет6411)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержНДФЛ,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет642)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержВС,
		|					0  КАК ОстДт,
		|					0  КАК ОстКт,
		|					0  КАК ОбДт,
		|					ХозрасчетныйОбороты.СуммаОборотКт  КАК ОбКт,
		|					0  КАК Возврат
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетовПоставщики), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
		|
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|				  И ХозрасчетныйОбороты.КорСчет НЕ в (&СписокСчетовАвансы)
		|				  И ХозрасчетныйОбороты.КорСчет НЕ в (&СписокСчетовПоставщики)
		|				  И ХозрасчетныйОбороты.КорСчет НЕ в иерархии (&СписокКорСчетов)
		|               //оплата
		|				ОБЪЕДИНИТЬ ВСЕ
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет6411)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержНДФЛ,
		|					ВЫБОР КОГДА ХозрасчетныйОбороты.КорСчет в (&Счет642)
		|	               			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|	               			ИНАЧЕ 0 КОНЕЦ                         КАК УдержВС,
		|					0  КАК ОстДт,
		|					0  КАК ОстКт,
		|					ХозрасчетныйОбороты.СуммаОборотДт  КАК ОбДт,
		|					0  КАК ОбКт,
		|					0  КАК Возврат
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетовПоставщики), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
		|
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|				  И ХозрасчетныйОбороты.КорСчет  в иерархии (&СписокКорСчетов)
		|               //возврат поставки
		|				ОБЪЕДИНИТЬ ВСЕ
		|				ВЫБРАТЬ
		|					ХозрасчетныйОбороты.Субконто1	КАК Контрагент,
		|					ХозрасчетныйОбороты.Субконто2	КАК Договор,
		|					0  КАК УдержНДФЛ,
		|					0  КАК УдержВС,
		|					0  КАК ОстДт,
		|					0  КАК ОстКт,
		|					0  КАК ОбДт,
		|					0  КАК ОбКт,
		|					-ХозрасчетныйОбороты.СуммаОборотДт КАК Возврат
		|					
		|				ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ДЕНЬ, Счет В ИЕРАРХИИ (&СписокСчетовПоставщики), , Организация = &парамОрганизация, , ) КАК ХозрасчетныйОбороты
		|
		|				ГДЕ ХозрасчетныйОбороты.Субконто1.ЮрФизЛицо = &ЧП
		|				  И (ХозрасчетныйОбороты.КорСчет не в  (&СписокСчетовАвансы))
		|				  И (ХозрасчетныйОбороты.КорСчет не в иерархии (&СписокКорСчетов))
		|				  И (ХозрасчетныйОбороты.КорСчет не в (&СписокСчетовПоставщики))
		|				  И (ХозрасчетныйОбороты.КорСчет не в (&Счет6411))
		|				  И (ХозрасчетныйОбороты.КорСчет не в (&Счет642))
		|		  ) КАК Хозрасчетный
		|
		|		СГРУППИРОВАТЬ ПО 
		|			Хозрасчетный.Контрагент,
		|			Хозрасчетный.Договор	
		|	) КАК ОстакиОбороты	
		|
		|ГДЕ
		|	(ВЫБОР	КОГДА (ОстакиОбороты.ОбКт-ОстакиОбороты.ОстДт) > (ОстакиОбороты.обДт -ОстакиОбороты.ОстКт)
		|			ТОГДА (ОстакиОбороты.ОбКт-ОстакиОбороты.ОстДт)
		|			ИНАЧЕ (ОстакиОбороты.обДт -ОстакиОбороты.ОстКт)
		|		КОНЕЦ) > 0
		|
		|СГРУППИРОВАТЬ ПО 
		|	ОстакиОбороты.Контрагент    
		|   
		|";
    КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	                                
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Если ПериодРегистрации >= ПроведениеРасчетов.ДатаИзмененияСхемыУчетаВС() Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации) );
	Иначе	
		Запрос.УстановитьПараметр("НачалоПериода", Началоквартала(ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(ПериодРегистрации) );
	КонецЕсли;	
	Запрос.УстановитьПараметр("ЧП", Перечисления.ЮрФизЛицо.ФизЛицо);
	
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками);				//631
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУчастникамиПФГ);				//633
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторамиВНациональнойВалюте);	//6851
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте);	//3711
	
	СписокСчетовБанкКасса = Новый СписокЗначений;
	СписокСчетовБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.Касса);			//301
	СписокСчетовБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.СчетаВБанках);	//311
	СписокСчетовБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте);	//3721
	
	СписокСчетовАвансы = Новый СписокЗначений;
	СписокСчетовАвансы.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте);	//3711
	
	СписокСчетовПоставщики = Новый СписокЗначений;
	СписокСчетовПоставщики.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками);				//631
	СписокСчетовПоставщики.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУчастникамиПФГ);				//633
	СписокСчетовПоставщики.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторамиВНациональнойВалюте);	//6851
	
	Запрос.УстановитьПараметр("СписокСчетов"	, СписокСчетов);
	Запрос.УстановитьПараметр("Счет6411"		, ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ);
	Запрос.УстановитьПараметр("Счет642"			, ПланыСчетов.Хозрасчетный.РасчетыПоОбязательнымПлатежам);
	Запрос.УстановитьПараметр("СписокКорСчетов"	, СписокСчетовБанкКасса);
	Запрос.УстановитьПараметр("СписокСчетовАвансы"	, СписокСчетовАвансы);
    Запрос.УстановитьПараметр("СписокСчетовПоставщики"	, СписокСчетовПоставщики);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИНН = Выборка.Контрагент.КодПоЕДРПОУ;
		Если ИНН = Неопределено Тогда
			
			Сообщить (НСтр("ru='Внимание! Для контрагента - ЧП  ';uk='Увага! Для контрагента - ПП  '") + Выборка.Контрагент + НСтр("ru=' не заполнен идентификационный номер (реквизит ДРФО в справочнике Контрагенты). Информация о нем не включается в ведомость!';uk=' не заповнений ідентифікаційний номер (реквізит ДРФО в довіднику Контрагенти). Інформація про нього не включається у відомість!'"));
			
		КонецЕсли;
		
		// сначала информацию в ТЧ Контрагенты
		ТекСтрока = Контрагенты.Добавить();
		ТекСтрока.Контрагент = Выборка.Контрагент;
			
		ТекСтрока = НДФЛ.Добавить();
			
		ТекСтрока.Контрагент = Выборка.Контрагент;
		ТекСтрока.ВидДохода = Справочники.ВидыДоходовНДФЛ.Код42;
			
		ТекСтрока.Доход = Выборка.НачисленоДохода;
		ТекСтрока.Налог = Выборка.УдержНДФЛ;
		
		Если ЗначениеЗаполнено(Выборка.УдержВС)  Тогда
			ТекСтрокаВС = НДФЛ.Добавить();
			ТекСтрокаВС.Контрагент = Выборка.Контрагент;
			ТекСтрокаВС.Доход = Выборка.НачисленоДохода;
			ТекСтрокаВС.Налог = Выборка.УдержВС;
			Если ПериодРегистрации >= ПроведениеРасчетов.ДатаИзмененияСхемыУчетаВС() Тогда	
				ТекСтрокаВС.ВидДохода = Справочники.ВидыДоходовНДФЛ.Код42.ОблагаетсяВоеннымСбором2021;
			Иначе
				ТекСтрокаВС.ВидДохода = Справочники.ВидыДоходовНДФЛ.ВоенныйСбор;
			КонецЕсли;	
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьЧП()

Процедура ЗаполнитьАлименты() Экспорт

	Запрос = Новый Запрос;
	
	Если ПериодРегистрации >= ПроведениеРасчетов.ДатаИзмененияСхемыУчетаВС() Тогда
		ТекстПериод = "МЕСЯЦ";
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Иначе
		ТекстПериод = "КВАРТАЛ";
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоКвартала(ПериодРегистрации));
	КонецЕсли;
    	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Удержания.ДокументОснование.Получатель	КАК Контрагент,
	|	СУММА( Удержания.Результат ) КАК НачисленоДохода
	|ИЗ РегистрРасчета.Удержания КАК Удержания
	|
	|ГДЕ НАЧАЛОПЕРИОДА( Удержания.ПериодРегистрации, "+ТекстПериод+") = &ПериодРегистрации
	|И Удержания.Организация = &парамОрганизация
	|И Удержания.ВидРасчета в (&СписокАлименты)
	|
	|СГРУППИРОВАТЬ ПО
	|	Удержания.ДокументОснование.Получатель
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	СписокАлименты = Новый СписокЗначений;
	СписокАлименты.Добавить(ПланыВидовРасчета.Удержания.АлиментыПроцентом);
	СписокАлименты.Добавить(ПланыВидовРасчета.Удержания.АлиментыПроцентомДоПредела);
	СписокАлименты.Добавить(ПланыВидовРасчета.Удержания.АлиментыФиксированнойСуммой);
	СписокАлименты.Добавить(ПланыВидовРасчета.Удержания.АлиментыФиксированнойСуммойДоПредела);
	СписокАлименты.Добавить(ПланыВидовРасчета.Удержания.ИндексацияАлиментов);
	Запрос.УстановитьПараметр("СписокАлименты", СписокАлименты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИНН = Выборка.Контрагент.КодПоЕДРПОУ;
		Если ИНН = Неопределено Тогда
			Сообщить (НСтр("ru='Внимание! Для контрагента - получателя алиментов  ';uk='Увага! Для контрагента - отримувача аліментів '") + Выборка.Контрагент + НСтр("ru=' не заполнен идентификационный номер (реквизит ЕДРПОУ в справочнике Контрагенты). Информация о нем не включается в ведомость!';uk=' не заповнений ідентифікаційний номер (реквізит ЄДРПОУ в довіднику Контрагенти). Інформація про нього не включається у відомість!'"));
		КонецЕсли;
		
		ТекСтрока = Контрагенты.Добавить();
		ТекСтрока.Контрагент = Выборка.Контрагент;
			
		ТекСтрока = НДФЛ.Добавить();
		ТекСтрока.Контрагент = Выборка.Контрагент;
		ТекСтрока.ВидДохода = Справочники.ВидыДоходовНДФЛ.Код29;
		ТекСтрока.Доход = Выборка.НачисленоДохода;
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьАлименты()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,   
	|	ПериодРегистрации,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоНДФЛ(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

	// Описание текста запроса:
	// 1. Выборка "ТЧНДФЛ": 
	//		Выбираются строки документа.  
    //
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧНДФЛ.НомерСтроки КАК НомерСтроки,
	               |	ТЧНДФЛ.Контрагент,
	               |	ТЧНДФЛ.ВидДохода,
	               |	ТЧНДФЛ.Доход,
	               |	ТЧНДФЛ.Налог
	               |ИЗ
	               |	Документ." + Метаданные().Имя + ".НДФЛ КАК ТЧНДФЛ
	               |
	               |ГДЕ
	               |	ТЧНДФЛ.Ссылка = &ДокументСсылка";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не указана организация, для которой ведется учет!';uk='Не зазначена організація, для якої ведеться облік!'"), Отказ);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не заполнен период регистрации!';uk='Не заповнений період реєстрації!'"), Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиНДФЛ(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табл. части ""Работники организации"": ';uk='У рядку номер ""%1"" табл. частини ""Працівники організації"": '"), СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));

	// Контрагент
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Контрагент) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбран контрагент!';uk='не обраний контрагент!'"), Отказ);
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Контрагент.КодПоЕДРПОУ) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='у контрагента не заполнен  код по ДРФО!';uk='у контрагента не заповнений код ДРФО!'"), Отказ);
	КонецЕсли;
	
	// ВидДохода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидДохода) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан вид дохода!';uk='не зазначений вид доходу!'"), Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()


Процедура ДобавитьСтрокуВзаиморасчетыПоНДФЛ(ВыборкаПоШапкеДокумента, ТекСтрокаНДФЛ, КурсУУ, ВидДвижения)
	
	//Движения по регистру "ВзаиморасчетыПоНДФЛ"
	Если ТекСтрокаНДФЛ.Доход = 0
		И ТекСтрокаНДФЛ.Налог = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыПоНДФЛ.Добавить();
	
	// Свойства
	Движение.ВидДвижения	= ВидДвижения;
	Движение.Период			= Дата;
	
	// Измерения
	Движение.ПериодВзаиморасчетов	= ВыборкаПоШапкеДокумента.ПериодРегистрации;
	Движение.ВидСтавки				= Перечисления.ВидыСтавокНДФЛ.Основная;
	Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник		= ТекСтрокаНДФЛ.Контрагент;
	Движение.ДоходНДФЛ		= ТекСтрокаНДФЛ.ВидДохода;
	
	// Ресурсы
	Движение.Доход = ТекСтрокаНДФЛ.Доход;
	Движение.Налог = ТекСтрокаНДФЛ.Налог;
	Движение.НалогУпр = ?(КурсУУ=0, 0, ТекСтрокаНДФЛ.Налог/КурсУУ);

КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке(Режим).Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
		
		Если НЕ Отказ Тогда
			
			КурсУУ = 0;
			Если ОтражатьВУпрУчете Тогда		
				мСтруктураКурса = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Валюта", Константы.ВалютаУправленческогоУчета.Получить()));
				КурсУУ = ?(мСтруктураКурса.Кратность<>0, мСтруктураКурса.Курс/мСтруктураКурса.Кратность, 0);
			КонецЕсли;
			
			// выполним выборку по табличной части документа
			РезультатЗапросаПоНДФЛ = СформироватьЗапросПоНДФЛ(Режим);
			ВыборкаСтрокЗапроса = РезультатЗапросаПоНДФЛ.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаСтрокЗапроса.Следующий() Цикл
				
				ПроверитьЗаполнениеСтрокиНДФЛ(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса , Отказ);
				Если НЕ Отказ Тогда
					
					ДобавитьСтрокуВзаиморасчетыПоНДФЛ(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса, КурсУУ, ВидДвиженияНакопления.Приход);
					Если ВыборкаСтрокЗапроса.Налог = 0 Тогда
						ДобавитьСтрокуВзаиморасчетыПоНДФЛ(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса, КурсУУ, ВидДвиженияНакопления.Расход);
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла;					
			
			Движения.ВзаиморасчетыПоНДФЛ.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

