
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходование КАК Заявка,
	                |	-1 * СУММА(ДенежныеСредстваКВыплатеОстатки.СуммаОстаток) КАК Сумма,
	                |	СУММА(ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходование.СуммаДокумента) КАК СуммаЗаявки
	                |ИЗ
	                |	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки КАК ДенежныеСредстваКВыплатеОстатки
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходование";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Заявки.Загрузить(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	Закрыть(ПолучитьАдресВХранилище());
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Заявки.Выгрузить(),новый УникальныйИдентификатор);	
КонецФункции
