


Процедура ЗагрузкаТоваровEco(Параметр) Экспорт
	
	Url = "ecoflowukraine.com";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	HTTPЗапрос = Новый HTTPЗапрос("/content/export/fa6f2714aec9e6fe42ac7d7ce4bda288.xml",Заголовки);
	
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	//мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;
	КонецЕсли; 
	
	Структура = ПолучитьСтруктуруИзХМЛ(Ответ.ПолучитьТелоКакСтроку());
	
	Категории = Структура.yml_catalog.shop.categories.category;
	
	Для каждого  Категория Из Категории Цикл
		
		ИдКатегории = Категория.___Атрибуты_.id;
		НаименованиеКатегории = Категория.___Текст_;
		
		Если Категория.___Атрибуты_.Свойство("parentid") Тогда
			ИдРодитель = Категория.___Атрибуты_.parentid;
		Иначе
			ИдРодитель = "";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИдРодитель) Тогда
			//КорневаяПапка = Справочники.im_НоменклатураПоставщиков.НайтиПоНаименованию("ecoflowukraine");	
			КорневаяПапка = im_Поставщики_DCLINK_ПолучитьГруппуКатегориюИнтернетМагазина("Ecoflow_Api", Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow, Истина); 
		Иначе
			КорневаяПапка = im_Поставщики_Ecoflow_ПолучитьГруппуКатегориюИнтернетМагазина(ИдРодитель, Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow, Истина);	
		КонецЕсли;
		
		СсылкаНаКатегорию     = im_Поставщики_Ecoflow_ПолучитьГруппуКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow, Истина);
		
		Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
			КатегорияСправочник = Справочники.im_НоменклатураПоставщиков.СоздатьГруппу();
			КатегорияСправочник.ID = ИдКатегории;
			КатегорияСправочник.Наименование = НаименованиеКатегории;
			КатегорияСправочник.Родитель     = КорневаяПапка;
			КатегорияСправочник.Поставщик    = Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow;
			КатегорияСправочник.Записать();
		Иначе
			КатегорияСправочник					= СсылкаНаКатегорию.ПолучитьОбъект();
			КатегорияСправочник.ID				= ИдКатегории;
			КатегорияСправочник.Наименование	= НаименованиеКатегории;
			КатегорияСправочник.Родитель		= КорневаяПапка;
			КатегорияСправочник.Поставщик		= Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow;
			КатегорияСправочник.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Товары = Структура.yml_catalog.shop.offers.offer;
	Сч = 0;
	
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаПромо", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	Для каждого  Товар Из Товары Цикл
		
		//НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.VIATEC.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", ПолучитьКатегориюИнтернетМагазина(Товар.category_id.___Текст_,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC)));
		ИдКатегории = Товар.categoryId.___Текст_;
		//ИдТовара = Товар.id.___Текст;
		ИдТовара = "";
		Если Товар.param.Количество() > 0  Тогда
			Если ТипЗнч(Товар.param) = Тип("Массив") Тогда 
				Для Каждого Элемент Из Товар.param Цикл
					Если Элемент.___Атрибуты_.name = "Штрихкод" Тогда
						Артикул = Элемент.___Текст_;
						Прервать;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
		
		Если Не ЗначениеЗаполнено(Артикул) Тогда
			Продолжить;	
		КонецЕсли;
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_Ecoflow_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow)));
		
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
			
			Если НастройкиКатегории[0].использовать Тогда 
				
				Попытка
					
					НоменклатурыПоставщика = im_Поставщики_Ecoflow_ПолучитьТоварИнтернетМагазина_ПоАртикулу(Артикул, Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow);
					
					Если НоменклатурыПоставщика.Пустая() Тогда
						НоменклатурыПоставщика = im_Поставщики_Ecoflow_СоздатьОбновитьТоварEcoflow(ИдТовара, Товар, Неопределено, Артикул);
					Иначе						
						im_Поставщики_Ecoflow_СоздатьОбновитьТоварEcoflow(ИдТовара, Товар, НоменклатурыПоставщика, Артикул);
					КонецЕсли;
					
					СтрокаЦен = ТаблицаЦен.Добавить();
					СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
					СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
					СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
					СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
					СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
					Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
						//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
					КонецЕсли;
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow);	
// к ЛИВ	
	
	
	// Url = "ecoflowukraine.com";	
	//Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	//
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type","application/json"); 
	//
	//
	//
	//HTTPЗапрос = Новый HTTPЗапрос("/content/export/fa6f2714aec9e6fe42ac7d7ce4bda288.xml",Заголовки);
	//
	//Ответ 	= Соединение.Получить(HTTPЗапрос);	
	////мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	//
	//
	//
	//Если Ответ.КодСостояния <> 200 Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	//ТаблицаЦенОстатков = Новый ТаблицаЗначений;
	//ТаблицаЦенОстатков.Колонки.Добавить("Номенклатура");
	//ТаблицаЦенОстатков.Колонки.Добавить("Цена");
	//ТаблицаЦенОстатков.Колонки.Добавить("ЦенаДилер");
	//ТаблицаОстатков = Новый ТаблицаЗначений;
	//ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	//ТаблицаОстатков.Колонки.Добавить("Остаток");
	//
	//Структура = ПолучитьСтруктуруИзХМЛ(Ответ.ПолучитьТелоКакСтроку());
	////ЧтениеXML=Новый ЧтениеXML;
	////ЧтениеXML.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	////ЧтениеXML.ПерейтиКСодержимому();
	////
	////Имя=ЧтениеXML.Имя;
	////ОбъектXDTO=ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,ФабрикаXDTO.Тип(ЧтениеXML.URIПространстваИмен,Имя));
	//Категории = Структура.yml_catalog.shop.categories.category;
	//
	//Для каждого  Категория Из Категории Цикл
	//	
	//	
	//	//СвойстваКатегории = Категория.Свойства();
	//	
	//	Если Не Категория.___Атрибуты_.Свойство("parentId")  Тогда
	//		КорневаяПапка = Справочники.Номенклатура.НайтиПоНаименованию("ecoflowukraine");	
	//		
	//	Иначе
	//		КорневаяПапка = Справочники.Номенклатура.НайтиПоРеквизиту("EcoIdCategory",Категория.___Атрибуты_.parentid)	
	//		
	//	КонецЕсли;
	//	
	//	ИдКатегории = Категория.___Атрибуты_.id;
	//	НаименованиеКатегории = Категория.___Текст_;
	//	СсылкаНаКатегорию = Справочники.Номенклатура.НайтиПоРеквизиту("EcoIdCategory",ИдКатегории);
	//	Если СсылкаНаКатегорию.Пустая() Тогда
	//		ОбКатегории = Справочники.Номенклатура.СоздатьГруппу();
	//		ОбКатегории.EcoIdCategory = ИдКатегории;
	//		ОбКатегории.Наименование   = НаименованиеКатегории;
	//		//ОбКатегории.НаименованиеПолное   = НаименованиеКатегории;
	//		ОбКатегории.Наименование_ru   = НаименованиеКатегории;
	//		ОбКатегории.Наименование_en   = НаименованиеКатегории;
	//		ОбКатегории.Родитель		  = КорневаяПапка;
	//		ОбКатегории.Записать();
	//		
	//	Иначе
	//		
	//		//Если  СсылкаНаКатегорию.Родитель <> КорневаяПапка Тогда
	//		//	
	//		//	ОбКатегории = СсылкаНаКатегорию.ПолучитьОбъект();
	//		//	ОбКатегории.Родитель = КорневаяПапка;
	//		//	ОбКатегории.Записать();
	//		//	
	//		//КонецЕсли;
	//	КонецЕсли;
	//	
	//	
	//КонецЦикла;
	//
	//Товары = Структура.yml_catalog.shop.offers.offer;
	//Для каждого  Товар Из Товары Цикл
	//	ИдНоменклатуры = Товар.___Атрибуты_.id;
	//	СпрСсылкаНоменклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("EcoID",ИдНоменклатуры);
	//	
	//	
	//	Если СпрСсылкаНоменклатуры.Пустая() Тогда
	//		
	//		ОбНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	//		ОбНоменклатура.EcoID = ИдНоменклатуры;
	//		Если Товар.name.Свойство("___Текст_") Тогда 
	//			Наименование = Товар.name.___Текст_;
	//			
	//		Иначе
	//			Наименование = Товар.url.___Текст_;
	//			
	//		КонецЕсли;
	//		ОбНоменклатура.Наименование = Наименование;
	//		ОбНоменклатура.Наименование_ru = Наименование;
	//		ОбНоменклатура.Наименование_en =    "";
	//		ОбНоменклатура.БазоваяЕдиницаИзмерения =  Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("шт.");
	//		ОбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");
	//		ОбНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоРеквизиту("EcoIdCategory",Товар.categoryId.___Текст_);
	//		Если Товар.description.Свойство("___Текст_") Тогда
	//			ОбНоменклатура.ДополнительноеОписаниеНоменклатуры  =Товар.description.___Текст_;
	//		КонецЕсли;
	//		
	//		
	//		
	//		ОбНоменклатура.Записать();
	//		
	//		НовЕдиница 				= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	//		НовЕдиница.Наименование = "шт";
	//		НовЕдиница.Владелец 	= ОбНоменклатура.Ссылка;
	//		НовЕдиница.Коэффициент  = 1;
	//		НовЕдиница.ЕдиницаПоКлассификатору = ОбНоменклатура.БазоваяЕдиницаИзмерения;
	//		НовЕдиница.Записать();
	//		
	//		ОбНоменклатура.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
	//		ОбНоменклатура.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;
	//		
	//		
	//		ОбНоменклатура.Записать();
	//		
	//		
	//	Иначе
	//		
	//		НоваяСтрокаЦенОстатков = ТаблицаЦенОстатков.Добавить();
	//		НоваяСтрокаЦенОстатков.Номенклатура = СпрСсылкаНоменклатуры;
	//		НоваяСтрокаЦенОстатков.Цена = Число(Товар.price.___Текст_);			
	//		ЗначениеСвойствОбъектов = Товар.param;
	//		
	//		ЕСли ТипЗнч(ЗначениеСвойствОбъектов) = тип("Структура") Тогда
	//			ЗначениеСвойствОбъектов = Новый Массив;
	//			ЗначениеСвойствОбъектов.Добавить(Товар.param);
	//		КонецЕсли;
	//		Для Каждого Свств из ЗначениеСвойствОбъектов Цикл 		
	//			Если Свств.___Атрибуты_.name = "Наявність" Тогда
	//				НоваяСтрока = ТаблицаОстатков.Добавить();
	//				НоваяСтрока.Номенклатура = СпрСсылкаНоменклатуры;
	//				Если Свств.___Текст_ = "В наявності" Тогда
	//					
	//					НоваяСтрока.Остаток =50;
	//					
	//				Иначе
	//					НоваяСтрока.Остаток =0;
	//				КонецЕсли;
	//				
	//			ИначеЕсли Свств.___Атрибуты_.name = "Дилерська ціна" Тогда	
	//				НоваяСтрокаЦенОстатков.ЦенаДилер = Число(Свств.___Текст_);
	//				Продолжить;
	//				
	//			КонецЕсли;
	//		КонецЦикла;
	//		Продолжить;
	//		//ОбНоменклатура = СпрСсылкаНоменклатуры.ПолучитьОбъект();
	//		//ОбНоменклатура.Наименование = Товар.name.___Текст_;
	//		//ОбНоменклатура.Наименование_ru = Товар.name.___Текст_;
	//		//ОбНоменклатура.Наименование_en =    "";
	//		//ОбНоменклатура.ДополнительноеОписаниеНоменклатуры  =Товар.description.___Текст_;;
	//		//ОбНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоРеквизиту("EcoIdCategory",Товар.categoryId.___Текст_);	
	//		//			
	//		////ОбНоменклатура.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
	//		////ОбНоменклатура.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;
	//		
	//		//ОбНоменклатура.Записать();
	//		
	//	КонецЕсли;
	//	
	//	ДопСвойства = Обработки.ЗначенияСвойствОбъекта.Создать();
	//	ДопСвойства.ОбъектОтбораЗначений = ОбНоменклатура.Ссылка;
	//	ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
	//	
	//	ЗначениеСвойствОбъектов = Товар.param;
	//	ЕСли ТипЗнч(ЗначениеСвойствОбъектов) = тип("Структура") Тогда
	//		ЗначениеСвойствОбъектов = Новый Массив;
	//		ЗначениеСвойствОбъектов.Добавить(Товар.param);
	//	КонецЕсли;
	//	ЦенаДиллер = 0;
	//	Для Каждого Свств из ЗначениеСвойствОбъектов Цикл 
	//		
	//		Если Свств.___Атрибуты_.name = "Штрихкод" Тогда
	//			
	//			
	//			
	//			ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	//			
	//			ТекЗапись.Владелец         = ОбНоменклатура.Ссылка;
	//			ТекЗапись.ЕдиницаИзмерения = ОбНоменклатура.ЕдиницаХраненияОстатков;
	//			ТекЗапись.ТипШтрихкода     = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	//			ТекЗапись.Качество         = Справочники.Качество.Новый;
	//			ТекЗапись.Штрихкод         = Свств.___Текст_;
	//			
	//			Попытка
	//				ТекЗапись.Записать();
	//			Исключение
	//			КонецПопытки;
	//			
	//			Продолжить;	
	//			
	//		ИначеЕсли Свств.___Атрибуты_.name = "Наявність" Тогда
	//			НоваяСтрока = ТаблицаОстатков.Добавить();
	//			НоваяСтрока.Номенклатура = ОбНоменклатура.Ссылка;
	//			Если Свств.___Текст_ = "В наявності" Тогда
	//				
	//				НоваяСтрока.Остаток =50;
	//				
	//			Иначе
	//				НоваяСтрока.Остаток =0;
	//			КонецЕсли;
	//		ИначеЕсли Свств.___Атрибуты_.name = "Дилерська ціна" Тогда	
	//			ЦенаДиллер = Число(Свств.___Текст_);
	//			Продолжить;
	//			
	//		КонецЕсли;
	//		СтрПоиска = Новый Структура;
	//		СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(Свств.___Атрибуты_.name)); 
	//		СтрПоиска.Вставить("ПометкаУдаления", Ложь);
	//		
	//		НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
	//		
	//		Если НайденныеСтроки.Количество() > 0 Тогда
	//			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свств.___Текст_,,,НайденныеСтроки[0].Свойство);
	//			Если Значение.Пустая() Тогда
	//				ЗначениеСвойств = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
	//				ЗначениеСвойств.Наименование =  Свств.___Текст_;
	//				ЗначениеСвойств.Наименование_en =  Свств.___Текст_;
	//				ЗначениеСвойств.Наименование_ru =  Свств.___Текст_;
	//				ЗначениеСвойств.Владелец =  НайденныеСтроки[0].Свойство;
	//				ЗначениеСвойств.Записать();
	//				
	//			Иначе
	//				ЗначениеСвойств = Значение;
	//				
	//			КонецЕсли;
	//			НайденныеСтроки[0].Значение = ЗначениеСвойств.Ссылка;	
	//			
	//		Иначе
	//			
	//			НовСвойство 					= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
	//			НовСвойство.Наименование 		= Свств.___Атрибуты_.name;
	//			НовСвойство.Наименование_en 	= Свств.___Атрибуты_.name;
	//			НовСвойство.Наименование_ru 	= Свств.___Атрибуты_.name;
	//			НовСвойство.НазначениеСвойства 	= ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
	//			//НовСвойство.ТипЗначения			= ;;
	//			НовСвойство.Записать();
	//			
	//			СтрПоиска = Новый Структура;
	//			СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(Свств.___Атрибуты_.name));
	//			СтрПоиска.Вставить("ПометкаУдаления", Ложь);
	//			
	//			ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
	//			
	//			НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
	//			
	//			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свств.___Атрибуты_.name,,,НайденныеСтроки[0].Свойство);
	//			Если Значение.Пустая() Тогда
	//				ЗначениеСвойств = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
	//				ЗначениеСвойств.Наименование =  Свств.___Текст_;
	//				ЗначениеСвойств.Наименование_en =  Свств.___Текст_;
	//				ЗначениеСвойств.Наименование_ru =  Свств.___Текст_;
	//				ЗначениеСвойств.Владелец =  НовСвойство.Ссылка;
	//				ЗначениеСвойств.Записать();
	//				
	//			Иначе
	//				ЗначениеСвойств = Значение;
	//			КонецЕсли;
	//			
	//			Если НайденныеСтроки.Количество() > 0 Тогда
	//				НайденныеСтроки[0].Значение = ЗначениеСвойств;	
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//		
	//	КонецЦикла;
	//	
	//	ДопСвойства.ЗаписатьЗначенияСвойств();
	//	КартинкиСписок =  Товар.picture; 
	//	Если Товар.Свойство("picture") Тогда
	//		Если ТипЗнч(КартинкиСписок) = тип("Структура") Тогда
	//			
	//			КартинкиСписок = Новый массив;
	//			КартинкиСписок.Добавить(Товар.picture);
	//			
	//			
	//		КонецЕсли;
	//		
	//		ЭтоПерваяКартика = Истина;
	//		
	//		Для Каждого Картинка из КартинкиСписок  Цикл
	//			
	//			ДлинаУрл = СтрДлина(Картинка.___Текст_);	
	//			ГлавнаяЧастьУрл = Найти(Картинка.___Текст_,"/content");
	//			
	//			ВторичнаяЧастьУрл = Прав(Картинка.___Текст_,ДлинаУрл-ГлавнаяЧастьУрл);
	//			
	//			
	//			Url = "ecoflowukraine.com";	
	//			Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	//			
	//			Заголовки = Новый Соответствие;
	//			Заголовки.Вставить("Content-Type","application/json"); 
	//			
	//			ДоТочки =  СтрЗаменить(Картинка.___Текст_,".jpeg","");
	//			ДоТочки =  СтрЗаменить(ДоТочки,".jpg","");
	//			ДоТочки =  СтрЗаменить(ДоТочки,".png","");
	//			УбратьПапки = СтрЗаменить(ДоТочки,"https://www.ecoflowukraine.com/content/images/","");
	//			ПоследняяПапка = Найти(УбратьПапки,"/");
	//			ИдФайла = Лев(УбратьПапки,ПоследняяПапка);
	//			
	//			ИмяФайла = ИдФайла	 ;
	//			HTTPЗапрос = Новый HTTPЗапрос(ВторичнаяЧастьУрл,Заголовки);
	//			
	//			Ответ 	= Соединение.Получить(HTTPЗапрос);	
	//			//мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	//			Фото =  Ответ.ПолучитьТелоКакДвоичныеДанные() ;
	//			
	//			
	//			Если Ответ.КодСостояния <> 200 Тогда
	//				Возврат;
	//			КонецЕсли; 
	//			ХранилищеДопИнфо = ПолучитьКартинку(ОбНоменклатура.Ссылка,""+ИмяФайла + "Загружен с сайта Eco");
	//			Если ХранилищеДопИнфо <> Неопределено Тогда 
	//				ОбНоменклатура.ОсновноеИзображение = ХранилищеДопИнфо;
	//				ОбНоменклатура.Записать();	
	//			Иначе
	//				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	//				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
	//				
	//				
	//				
	//				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
	//				НовыйОбъект.Объект = ОбНоменклатура.Ссылка;
	//				НовыйОбъект.ИмяФайла = ""+ИмяФайла + "Загружен с сайта Eco";
	//				НовыйОбъект.Записать(); 
	//				Если ЭтоПерваяКартика Тогда
	//					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
	//					ОбНоменклатура.Записать();
	//					ЭтоПерваяКартика= Ложь;
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//	НоваяСтрока = ТаблицаЦенОстатков.Добавить();
	//	НоваяСтрока.Номенклатура = ОбНоменклатура.Ссылка;
	//	НоваяСтрока.Цена = Число(Товар.price.___Текст_);
	//	НоваяСтрока.ЦенаДилер = ЦенаДиллер;
	//	//НоваяСтрока.Количество = Число(Остаток);
	//	
	//	
	//	
	//КонецЦикла;
	//
	///// ЦЕНІ РРЦ
	//
	//ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("РРЦ", Истина);
	//Если Не ЗначениеЗаполнено(ТипЦены) Тогда
	//	Возврат;
	//КонецЕсли;
	//ЦеныНоменклатуры = Новый Массив;
	//ЦеныНоменклатуры.Добавить(ТипЦены);
	//ИндексСтрокиТаблицыЦен = 0;
	//
	//ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	//ДокументОбъект.Дата = ТекущаяДата();
	//ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	//НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
	//НовСтрТипЦен.ТипЦен = ТипЦены;
	//ИндексСтрокиТаблицыЦен = 0;
	//
	//Для Каждого стр Из ТаблицаЦенОстатков Цикл
	//	
	//	Для Каждого ТипЦенНоменклатуры Из ЦеныНоменклатуры Цикл
	//		
	//		Если  Число(стр.Цена) = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		СтрокаТовары = ДокументОбъект.Товары.Добавить();
	//		СтрокаТовары.Номенклатура = стр.Номенклатура;
	//		СтрокаТовары.ТипЦен = ТипЦенНоменклатуры;
	//		СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
	//		СтрокаТовары.Цена = стр.Цена;
	//		СтрокаТовары.Валюта = ТипЦенНоменклатуры.ВалютаЦены;
	//		СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
	//		СтрокаТовары.ПроцентСкидкиНаценки = ТипЦенНоменклатуры.ПроцентСкидкиНаценки;
	//		СтрокаТовары.СпособРасчетаЦены = ТипЦенНоменклатуры.СпособРасчетаЦены;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла; 
	//
	//
	//ДокументОбъект.Комментарий = "Цені РРЦ Eco";
	////ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	//
	//
	//
	//
	////// Дилер цена 
	//
	//ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Дилерская цена", Истина);
	//Если Не ЗначениеЗаполнено(ТипЦены) Тогда
	//	Возврат;
	//КонецЕсли;
	//ЦеныНоменклатуры = Новый Массив;
	//ЦеныНоменклатуры.Добавить(ТипЦены);
	//ИндексСтрокиТаблицыЦен = 0;
	//
	//ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	//ДокументОбъект.Дата = ТекущаяДата();
	//ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	//НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
	//НовСтрТипЦен.ТипЦен = ТипЦены;
	//ИндексСтрокиТаблицыЦен = 0;
	//
	//Для Каждого стр Из ТаблицаЦенОстатков Цикл
	//	
	//	Для Каждого ТипЦенНоменклатуры Из ЦеныНоменклатуры Цикл
	//		
	//		Если Стр.ЦенаДилер = Неопределено Тогда
	//			Продолжить;
	//			
	//		КонецЕсли;
	//		
	//		Если  Число(стр.ЦенаДилер) = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		СтрокаТовары = ДокументОбъект.Товары.Добавить();
	//		СтрокаТовары.Номенклатура = стр.Номенклатура;
	//		СтрокаТовары.ТипЦен = ТипЦенНоменклатуры;
	//		СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
	//		СтрокаТовары.Цена = стр.ЦенаДилер;
	//		СтрокаТовары.Валюта = ТипЦенНоменклатуры.ВалютаЦены;
	//		СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
	//		СтрокаТовары.ПроцентСкидкиНаценки = ТипЦенНоменклатуры.ПроцентСкидкиНаценки;
	//		СтрокаТовары.СпособРасчетаЦены = ТипЦенНоменклатуры.СпособРасчетаЦены;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла; 
	//
	//
	//ДокументОбъект.Комментарий = "Цені дилера Eco";
	////ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	//
	//
	//
	//Для Каждого СтрТовар из ТаблицаОстатков  ЦИКЛ 
	//	
	//	Запись = РегистрыСведений.ТоварыНаСкладахПоставщиков.СоздатьМенеджерЗаписи();
	//	Запись.Период = ТекущаяДата();
	//	Запись.Номенклатура =  СтрТовар.Номенклатура;
	//	ЗАпись.Количество = СтрТовар.Остаток;
	//	Запись.Записать();
	//	
	//КонецЦикла;
КонецПроцедуры



#Область ХМЛ
Процедура ДобавитьЭлементЗаписиХМЛ(ЗаписьХМЛ, ИмяТэга, СодержимоеТэга) Экспорт
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента(ИмяТэга);
	ЗаписьХМЛ.ЗаписатьТекст(СодержимоеТэга);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
КонецПроцедуры

Функция ПолучитьСтруктуруИзХМЛ(ТекстХМЛ) Экспорт
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(ТекстХМЛ);
	
	СтруктураХМЛ = Новый Структура;
	
	РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, СтруктураХМЛ);
	
	ЧтениеХМЛ.Закрыть();
	
	Возврат СтруктураХМЛ;
	
КонецФункции

Процедура РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, ТекущийЭлемент) Экспорт
	
	СтруктураАтрибутов = Новый Структура;
	
	ТекущийЭлемент.Вставить("___Атрибуты_", СтруктураАтрибутов);
	
	Пока ЧтениеХМЛ.ПрочитатьАтрибут() Цикл
		СтруктураАтрибутов.Вставить(ЧтениеХМЛ.Имя, ЧтениеХМЛ.Значение);
	КонецЦикла;
	
	Пока ЧтениеХМЛ.Прочитать()
		И ЧтениеХМЛ.ТипУзла <> ТипУзлаXML.КонецЭлемента
		Цикл
		
		Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяЭлемента   = ЧтениеХМЛ.Имя;
			НовыйЭлемент  = Новый Структура;
			СтарыйЭлемент = ИзвлечьСвойствоИзСтруктуры(ТекущийЭлемент, ИмяЭлемента);
			
			Если СтарыйЭлемент = Неопределено Тогда
				ТекущийЭлемент.Вставить(ИмяЭлемента, НовыйЭлемент);
			ИначеЕсли ТипЗнч(СтарыйЭлемент) = Тип("Массив") Тогда
				СтарыйЭлемент.Добавить(НовыйЭлемент);
			Иначе
				МассивЭлементов = Новый Массив;
				МассивЭлементов.Добавить(СтарыйЭлемент);
				МассивЭлементов.Добавить(НовыйЭлемент);
				ТекущийЭлемент.Вставить(ИмяЭлемента, МассивЭлементов);
			КонецЕсли;
			
			РекурсивноПолучитьСтруктуруИзХМЛ(ЧтениеХМЛ, НовыйЭлемент);
			
		ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ТекущийЭлемент.Вставить("___Текст_", ЧтениеХМЛ.Значение);
			
			//ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			//Возврат;
			
		КонецЕсли ;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИзвлечьСвойствоИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено, ЗаполнитьПоУмолчаниюЕслиПусто = Ложь) Экспорт
	
	ЗначениеСвойства = ЗначениеПоУмолчанию;
	
	Если ИсходнаяСтруктура.Свойство(ИмяСвойства) Тогда
		ЗначениеСвойства = ИсходнаяСтруктура[ИмяСвойства];
	КонецЕсли;
	
	Если ЗаполнитьПоУмолчаниюЕслиПусто И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ЗначениеСвойства = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Функция ИзвлечьТекстЗначенияКлючаСтруктурыХМЛ(ЭлементСтруктурыХМЛ, ИмяКлюча) Экспорт
	
	ЗначениеКлюча = Неопределено;
	
	СтруктураКлюча = ИзвлечьСвойствоИзСтруктуры(ЭлементСтруктурыХМЛ, ИмяКлюча);
	
	Если ТипЗнч(СтруктураКлюча) <> Тип("Структура") Тогда
		Возврат ЗначениеКлюча;
	КонецЕсли;
	
	ЗначениеКлюча = ИзвлечьСвойствоИзСтруктуры(СтруктураКлюча, "___Текст_");
	
	Возврат ЗначениеКлюча;
	
КонецФункции
#КонецОбласти



функция ПолучитьКартинку(Номенклатура,ИмяФайла)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Объект
	|	И ХранилищеДополнительнойИнформации.ИмяФайла ПОДОБНО &ИмяФайла";
	
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка
	КонецЦикла;
	
	Возврат Неопределено
	
	
	
КонецФункции

Функция ПолучитьСвойствоНоменклатуры(ИмяСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Наименование = &Наименование
	|	И НЕ СвойстваОбъектов.ПометкаУдаления
	|	И СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	Запрос.УстановитьПараметр("Наименование", ИмяСвойства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено	
	
КонецФункции

Функция получитьимякатегории(id)
	
	
	Если id="1092" ТОгда Возврат "Продукти"
	ИначеЕсли id="1093"  ТОгда Возврат "Портативні зарядні станції"
	ИначеЕсли id="1171"  ТОгда Возврат "DELTA серія"
	ИначеЕсли id="1098"  ТОгда Возврат "Лінійка DELTA"
	ИначеЕсли id="1133"  ТОгда Возврат "Лінійка DELTA 2"
	ИначеЕсли id="1172"  ТОгда Возврат "RIVER серія"
	ИначеЕсли id="1134"  ТОгда Возврат "Лінійка RIVER 2"
	ИначеЕсли id="1102"  ТОгда Возврат "Лінійка RIVER"
	ИначеЕсли id="1153"  ТОгда Возврат "Системи енергонезалежності PowerStream"
	ИначеЕсли id="1154"  ТОгда Возврат "Комплекти PowerStream"
	ИначеЕсли id="1155"  ТОгда Возврат "Продукти PowerStream"
	ИначеЕсли id="1156"  ТОгда Возврат "Аксесуари PowerStream"
	ИначеЕсли id="1109"  ТОгда Возврат "Сонячні панелі"
	ИначеЕсли id="1162"  ТОгда Возврат "Портативні сонячні панелі"
	ИначеЕсли id="1138"  ТОгда Возврат "Гнучкі сонячні панелі"
	ИначеЕсли id="1137"  ТОгда Возврат "Стаціонарні сонячні панелі "
	ИначеЕсли id="1120"  ТОгда Возврат "Cистеми енергонезалежності Power Kit"
	ИначеЕсли id="1121"  ТОгда Возврат "Комплекти Power Kit"
	ИначеЕсли id="1122"  ТОгда Возврат "Продукти Power Kit"
	ИначеЕсли id="1123"  ТОгда Возврат "Аксесуари Power Kit"
	ИначеЕсли id="1124"  ТОгда Возврат "Сонячні панелі"
	ИначеЕсли id="1094"  ТОгда Возврат "Аксесуари"
	ИначеЕсли id="1105"  ТОгда Возврат "Кейси та сумки"
	ИначеЕсли id="1106"  ТОгда Возврат "Кабелі"
	ИначеЕсли id="1107"  ТОгда Возврат "Додаткові батареї"
	ИначеЕсли id="1108"  ТОгда Возврат "Інше"
	ИначеЕсли id="1147"  ТОгда Возврат "Розумні пристрої"
	ИначеЕсли id="1141"  ТОгда Возврат "Генератори"
	ИначеЕсли id="1148"  ТОгда Возврат "Кондиціонери"
	ИначеЕсли id="1149"  ТОгда Возврат "Холодильник"
	ИначеЕсли id="1150"  ТОгда Возврат "Газонокосарка"
	ИначеЕсли id="1151"  ТОгда Возврат "Smart Home Panel"
	ИначеЕсли id="1117"  ТОгда Возврат "Комплекти"
	ИначеЕсли id="1125"  ТОгда Возврат "Зарядні станції і додаткові батареї"
	ИначеЕсли id="1126"  ТОгда Возврат "Зарядні станції і сонячні панелі"
	ИначеЕсли id="1140"  ТОгда Возврат "Комплекти Power Kit"
	ИначеЕсли id="1127"  ТОгда Возврат "Інше"
	ИначеЕсли id="1157"  ТОгда Возврат "Система енергонезалежності PowerOcean"
	ИначеЕсли id="1158"  ТОгда Возврат "Комплекти PowerOcean"
	ИначеЕсли id="1159"  ТОгда Возврат "Продукти PowerOcean"
	ИначеЕсли id="1160"  ТОгда Возврат "Аксесуари PowerOcean"
	ИначеЕсли id="1170"   ТОгда Возврат "Відновлена техніка"
	КонецЕсли	
КонецФункции


Функция ПолучитьТокен()
	
	Токен = "";
	Период = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеЗагрузкиDeps.Token,
	|	ДанныеЗагрузкиDeps.section,
	|	ДанныеЗагрузкиDeps.task,
	|	ДанныеЗагрузкиDeps.ДатаОтправкиЗапроса КАК Период,
	|	ДанныеЗагрузкиDeps.ТелоЗапроса,
	|	ДанныеЗагрузкиDeps.ТелоОтвета
	|ИЗ
	|	РегистрСведений.ДанныеЗагрузкиDeps КАК ДанныеЗагрузкиDeps
	|ГДЕ
	|	ДанныеЗагрузкиDeps.section = &section
	|	И ДанныеЗагрузкиDeps.task = &task
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("task","open");
	Запрос.УстановитьПараметр("section","connection");
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Токен = ВыборкаДетальныеЗаписи.Token;
		Период = ВыборкаДетальныеЗаписи.Период;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Токен) И ЗначениеЗаполнено(Период) Тогда
		
		Если (ТекущаяДата()-(60*60))< Период Тогда
			
			Возврат Токен;
			
		КонецЕсли;
	КонецЕсли; 
	
	
	Url = "deps.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Basic YS5rb3JuaXRza2FAdmVjaGlyLnVhOjEyMzQ1Njc4OTA="); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=connection&task=open",Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Токен;
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	Токен = Результат.result;
	Если ЗначениеЗаполнено(Токен) И Результат.status = "ok"  Тогда
		
		ЗаписатьДанныеВРегистрСведений(Токен,"connection","open","",мОтвет);	
	КонецЕсли;
	Возврат Токен
	
	
	
	
	
	
	
КонецФункции


Процедура ЗаписатьДанныеВРегистрСведений(Токен,Секция,Задача,ТелоЗапроса,ТелоОтвета)
	
	
	Запись = РегистрыСведений.ДанныеЗагрузкиDeps.СоздатьМенеджерЗаписи();
	Запись.section = Секция;
	Запись.task = задача;
	Запись.Token = Токен;
	Запись.ТелоЗапроса = ТелоЗапроса;
	Запись.ТелоОтвета =ТелоОтвета ;
	Запись.ДатаОтправкиЗапроса = ТекущаяДата();
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗагрузкаТоваровDeps(Параметр) Экспорт
	
	Токен = im_Поставщики_Deps_ПолучитьТокен(); 
	СоотвествиеЗАгруженных= Новый Соответствие;
	
	Категории = im_Поставщики_Deps_ПолучитьКатегории(Токен);
	
	//----------Загрузка категорий	
	Для Инд = 1 По 2 Цикл 
		Для каждого стрДанные Из Категории Цикл
			
			ИдКатегории           = стрДанные.id;
			НаименованиеКатегории = стрДанные.name;
			ИдРодитель            = стрДанные.parent_id;
			
			Если стрДанные.parent_id = "0" Тогда
				КорневаяПапка = im_Поставщики_Deps_ПолучитьГруппуКатегориюИнтернетМагазина("Deps_Api", Справочники.im_ПоставщикиИнтернетМагазина.Deps, Истина); 
			Иначе
				КорневаяПапка = im_Поставщики_Deps_ПолучитьГруппуКатегориюИнтернетМагазина(ИдРодитель, Справочники.im_ПоставщикиИнтернетМагазина.Deps, Истина);	
			КонецЕсли;
			
			СсылкаНаКатегорию     = im_Поставщики_Deps_ПолучитьГруппуКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Deps, Истина);
			//
			//Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
			//	КатегорияСправочник = Справочники.im_НоменклатураПоставщиков.СоздатьГруппу();
			//	КатегорияСправочник.ID = ИдКатегории;
			//	КатегорияСправочник.Наименование = НаименованиеКатегории;
			//	КатегорияСправочник.Родитель     = КорневаяПапка;
			//	КатегорияСправочник.Поставщик    = Справочники.im_ПоставщикиИнтернетМагазина.Deps;
			//	//КатегорияСправочник.Записать();
			//Иначе
			//	КатегорияСправочник					= СсылкаНаКатегорию.ПолучитьОбъект();
			//	КатегорияСправочник.ID				= ИдКатегории;
			//	КатегорияСправочник.Наименование	= НаименованиеКатегории;
			//	КатегорияСправочник.Родитель		= КорневаяПапка;
			//	КатегорияСправочник.Поставщик		= Справочники.im_ПоставщикиИнтернетМагазина.Deps;
			//	//КатегорияСправочник.Записать();
			//КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаПромо", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	ТаблицаОстатков = новый ТаблицаЗначений;
	ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	ТаблицаОстатков.Колонки.Добавить("Остаток");
	
	
	Для Каждого Категория Из Категории Цикл 
		ИдКатегории = Категория.id; 
		//ИдКатегории = "385";
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.Deps.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_Deps_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Deps)));
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 				
			Если НастройкиКатегории[0].использовать Тогда 
				im_Поставщики_Deps_ЗагрузитьНоменклатуру(СоотвествиеЗАгруженных, Токен, ИдКатегории, 0, 50,ТаблицаЦен,ТаблицаОстатков);				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	СоздатьУстановкуЦен(ТаблицаЦен, Справочники.im_ПоставщикиИнтернетМагазина.Deps);
	ОбновитьОстатки(ТаблицаОстатков, Справочники.im_ПоставщикиИнтернетМагазина.Deps);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.Deps);	
// к ЛИВ

КонецПроцедуры

функция СделатьЗапросПокатегориям (Токен,ТекущиеКолвоЭлементов = Неопределено,лимитСтарт= Неопределено,Ид)
	Url = "deps.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=search&limit="+ТекущиеКолвоЭлементов+"&category_id="+Ид+"&args[limitstart]="+лимитСтарт,Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтветНомен 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтветНомен);
	РезультатНомен = ПрочитатьJSON(ЧтениеJSON,Истина);
	
	Возврат  РезультатНомен
	
	
КонецФункции

Процедура ЗагрузитьЦеныDeps() Экспорт
	Токен = ПолучитьТокен();
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		
		///////////////////Получим группі номенклатурі
		
		//ЗагрузитьКатегории(Токен);
		Возврат;
		
		
	КонецЕсли;
	
	ТаблицаЦенОстатков = Новый ТаблицаЗначений;
	ТаблицаЦенОстатков.Колонки.Добавить("Номенклатура");
	ТаблицаЦенОстатков.Колонки.Добавить("Количество");
	ТаблицаЦенОстатков.Колонки.Добавить("Цена");
	ТаблицаЦенОстатков.Колонки.Добавить("ЦенаДилер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.DepsId
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Ссылка",Справочники.Номенклатура.НайтиПоНаименованию("Deps"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИдНоменклатуры = ВыборкаДетальныеЗаписи.DepsId;
		Url = "deps.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		Заголовки.Вставить("Authorization","Bearer "+Токен); 
		
		HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=item&args[id]="+СтрЗаменить(Строка(ИдНоменклатуры),символы.НПП,""),Заголовки);
		
		Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат;
		КонецЕсли; 
		
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
		
		
		Если  Результат.Получить("status") = "ok"   Тогда
			//ЗаписатьДанныеВРегистрСведений(Токен,"product","item","",мОтвет);	
		КонецЕсли; 
		ИнфоНомен = Результат.Получить("result");
		
		СтруктураНоменклатуры = ИнфоНомен.Получить("product");
		
		Остаток = СтруктураНоменклатуры.Получить("product_quantity");
		Если Остаток =Неопределено Тогда
			Остаток =0;
		КонецЕсли;
		Цена    = СтруктураНоменклатуры.Получить("retail_price");
		ЦенаДилер = СтруктураНоменклатуры.Получить("product_price");
		НоваяСтрока = ТаблицаЦенОстатков.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Цена = Число(Цена);
		НоваяСтрока.Количество = Число(Остаток);
		НоваяСтрока.ЦенаДилер = Число(ЦенаДилер);
		
	КонецЦикла;
	
	ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("РРЦ", Истина);
	Если Не ЗначениеЗаполнено(ТипЦены) Тогда
		Возврат;
	КонецЕсли;
	ЦеныНоменклатуры = Новый Массив;
	ЦеныНоменклатуры.Добавить(ТипЦены);
	ИндексСтрокиТаблицыЦен = 0;
	
	ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
	НовСтрТипЦен.ТипЦен = ТипЦены;
	ИндексСтрокиТаблицыЦен = 0;
	
	Для Каждого стр Из ТаблицаЦенОстатков Цикл
		
		Для Каждого ТипЦенНоменклатуры Из ЦеныНоменклатуры Цикл
			
			Если  Число(стр.Цена) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТовары = ДокументОбъект.Товары.Добавить();
			СтрокаТовары.Номенклатура = стр.Номенклатура;
			СтрокаТовары.ТипЦен = ТипЦенНоменклатуры;
			СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
			СтрокаТовары.Цена = стр.Цена;
			СтрокаТовары.Валюта = ТипЦенНоменклатуры.ВалютаЦены;
			СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
			СтрокаТовары.ПроцентСкидкиНаценки = ТипЦенНоменклатуры.ПроцентСкидкиНаценки;
			СтрокаТовары.СпособРасчетаЦены = ТипЦенНоменклатуры.СпособРасчетаЦены;
			
		КонецЦикла;
		
	КонецЦикла;
	ДокументОбъект.Комментарий = "Цені РРЦ deps";
	//ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	
	ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Дилерская цена", Истина);
	Если Не ЗначениеЗаполнено(ТипЦены) Тогда
		Возврат;
	КонецЕсли;
	ЦеныНоменклатуры = Новый Массив;
	ЦеныНоменклатуры.Добавить(ТипЦены);
	ИндексСтрокиТаблицыЦен = 0;
	
	ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
	НовСтрТипЦен.ТипЦен = ТипЦены;
	ИндексСтрокиТаблицыЦен = 0;
	
	Для Каждого стр Из ТаблицаЦенОстатков Цикл
		
		Для Каждого ТипЦенНоменклатуры Из ЦеныНоменклатуры Цикл
			
			Если  Число(стр.ЦенаДилер) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТовары = ДокументОбъект.Товары.Добавить();
			СтрокаТовары.Номенклатура = стр.Номенклатура;
			СтрокаТовары.ТипЦен = ТипЦенНоменклатуры;
			СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
			СтрокаТовары.Цена = стр.ЦенаДилер;
			СтрокаТовары.Валюта = ТипЦенНоменклатуры.ВалютаЦены;
			СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
			СтрокаТовары.ПроцентСкидкиНаценки = ТипЦенНоменклатуры.ПроцентСкидкиНаценки;
			СтрокаТовары.СпособРасчетаЦены = ТипЦенНоменклатуры.СпособРасчетаЦены;
			
		КонецЦикла;
		
	КонецЦикла;
	ДокументОбъект.Комментарий = "Цені дилерская deps";
	//ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	
	Для Каждого СтрТовар из ТаблицаЦенОстатков  ЦИКЛ 
		Если СтрТовар.Количество > 0 Тогда
			Запись = РегистрыСведений.ТоварыНаСкладахПоставщиков.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДата();
			Запись.Номенклатура =  СтрТовар.Номенклатура;
			ЗАпись.Количество = СтрТовар.Количество;
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры


Процедура ЗагрузитьНоменклатуру(СоотвествиеЗАгруженных,Токен,ИдКатегории,лимитСтарт= Неопределено,Лимит = Неопределено)
	
	
	
	
	
	РезультатНомен = СделатьЗапросПокатегориям(Токен,Лимит,лимитСтарт,ИдКатегории);
	СоотвествиеКатегорий = РезультатНомен.Получить("result");	
	Пагинация = СоотвествиеКатегорий.Получить("pagination");
	
	
	
	Тотал = Число(Пагинация.Получить("total"));	
	ЛимитСтарт = Число(Пагинация.Получить("limitstart"));
	Если Тотал >= (Лимит+ЛимитСтарт) Тогда
		ЗагрузитьНоменклатуру(Токен,ИдКатегории,Лимит+ЛимитСтарт,Лимит);
	КонецЕсли;
	
	
	
	
	
	МассивПродуктов = СоотвествиеКатегорий.Получить("products");
	
	Для Каждого СтрНомен из МассивПродуктов Цикл
		
		
		ИдНоменклатуры = СтрНомен.Получить("product_id");
		
		УжеЗагруженна = СоотвествиеЗАгруженных.Получить(СтрЗаменить(Строка(ИдНоменклатуры)," ",""));
		Если УжеЗагруженна <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		
		Url = "deps.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		Заголовки.Вставить("Authorization","Bearer "+Токен); 
		
		HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=item&args[id]="+СтрЗаменить(Строка(ИдНоменклатуры),Символы.НПП,""),Заголовки);
		
		Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат;
		КонецЕсли; 
		
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
		
		
		Если  Результат.Получить("status") = "ok"   Тогда
			//ЗаписатьДанныеВРегистрСведений(Токен,"product","item","",мОтвет);	
		КонецЕсли; 
		ИнфоНомен = Результат.Получить("result");
		
		СтруктураНоменклатуры = ИнфоНомен.Получить("product");
		
		
		
		
		СпрСсылкаНоменклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("DepsId",СтрЗаменить(Строка(ИдНоменклатуры)," ",""));
		
		
		Если СпрСсылкаНоменклатуры.Пустая() Тогда
			
			ОбНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			ОбНоменклатура.DepsId = СтрЗаменить(Строка(ИдНоменклатуры)," ","");
			ОбНоменклатура.Наименование = СтруктураНоменклатуры.Получить("name_uk-UA");
			ОбНоменклатура.Наименование_ru = СтруктураНоменклатуры.Получить("name_ru-UA");
			ОбНоменклатура.Наименование_en =    "";
			ОбНоменклатура.БазоваяЕдиницаИзмерения =  Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("шт.");
			ОбНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");
			ОбНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоРеквизиту("DepsIdCategory",СтрЗаменить(Строка(СтрНомен.Получить("category_id")),Символы.НПП,""));	
			ОбНоменклатура.ДополнительноеОписаниеНоменклатуры  =СтруктураНоменклатуры.Получить("full_description_uk-UA");
			ОбНоменклатура.ДополнительноеОписаниеНоменклатуры_ru =  СтруктураНоменклатуры.Получить("full_description_ru-UA");
			ОбНоменклатура.ДополнительноеОписаниеНоменклатуры_en = СтруктураНоменклатуры.Получить("full_description_en-GB");
			
			ОбНоменклатура.Записать();
			
			НовЕдиница 				= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			НовЕдиница.Наименование = "шт";
			НовЕдиница.Владелец 	= ОбНоменклатура.Ссылка;
			НовЕдиница.Коэффициент  = 1;
			НовЕдиница.ЕдиницаПоКлассификатору = ОбНоменклатура.БазоваяЕдиницаИзмерения;
			НовЕдиница.Записать();
			
			ОбНоменклатура.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
			ОбНоменклатура.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;
			
			
			ОбНоменклатура.Записать();
			
			
		Иначе
			Продолжить;				
		КонецЕсли;
		
		ДопСвойства = Обработки.ЗначенияСвойствОбъекта.Создать();
		ДопСвойства.ОбъектОтбораЗначений = ОбНоменклатура.Ссылка;
		ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
		
		ЗначениеСвойствОбъектов = СтрНомен.Получить("extra_field");
		Для Каждого Свств из ЗначениеСвойствОбъектов Цикл 
			
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(Свств.Значение.Получить("name"))); 
			СтрПоиска.Вставить("ПометкаУдаления", Ложь);
			
			НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свств.Значение.Получить("value"),,,НайденныеСтроки[0].Свойство);
				Если Значение.Пустая() Тогда
					ЗначениеСвойств = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
					ЗначениеСвойств.Наименование =  Свств.Значение.Получить("value");
					ЗначениеСвойств.Наименование_en =  Свств.Значение.Получить("value");
					ЗначениеСвойств.Наименование_ru =  Свств.Значение.Получить("value");
					ЗначениеСвойств.Владелец =  НайденныеСтроки[0].Свойство;
					ЗначениеСвойств.Записать();
					
				Иначе
					ЗначениеСвойств = Значение;
					
				КонецЕсли;
				НайденныеСтроки[0].Значение = ЗначениеСвойств.Ссылка;	
				
			Иначе
				
				НовСвойство 					= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
				НовСвойство.Наименование 		= Свств.Значение.Получить("name");
				НовСвойство.Наименование_en 	= Свств.Значение.Получить("name");
				НовСвойство.Наименование_ru 	= Свств.Значение.Получить("name");
				НовСвойство.НазначениеСвойства 	= ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
				//НовСвойство.ТипЗначения			= ;;
				НовСвойство.Записать();
				
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(Свств.Значение.Получить("name")));
				СтрПоиска.Вставить("ПометкаУдаления", Ложь);
				
				ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
				
				НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
				
				Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свств.Значение.Получить("name"),,,НайденныеСтроки[0].Свойство);
				Если Значение.Пустая() Тогда
					ЗначениеСвойств = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
					ЗначениеСвойств.Наименование =  Свств.Значение.Получить("value");
					ЗначениеСвойств.Наименование_en =  Свств.Значение.Получить("value");
					ЗначениеСвойств.Наименование_ru =  Свств.Значение.Получить("value");
					ЗначениеСвойств.Владелец =  НовСвойство.Ссылка;
					ЗначениеСвойств.Записать();
					
				Иначе
					ЗначениеСвойств = Значение;
				КонецЕсли;
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденныеСтроки[0].Значение = ЗначениеСвойств;	
				КонецЕсли;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		ДопСвойства.ЗаписатьЗначенияСвойств();
		Url = "deps.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		Картинки = ИнфоНомен.Получить("images");
		
		Если Картинки.Количество() Тогда
			ИмяФайла = Картинки[0].Получить("image_thumb");
			HTTPЗапрос = Новый HTTPЗапрос("/components/com_jshopping/files/img_products/"+ИмяФайла,Заголовки);
			
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			//мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			Фото =  Ответ.ПолучитьТелоКакДвоичныеДанные() ;
			
			
			Если Ответ.КодСостояния <> 200 Тогда
				Возврат;
			КонецЕсли; 
			ХранилищеДопИнфо = ПолучитьКартинку(ОбНоменклатура.Ссылка,""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта депс");
			Если ХранилищеДопИнфо <> Неопределено Тогда 
				ОбНоменклатура.ОсновноеИзображение = ХранилищеДопИнфо;
				ОбНоменклатура.Записать();	
			Иначе
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				
				
				
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла = ""+ СтрЗаменить(ИмяФайла,".jpg","") + "Загружен с сайта депс";
				НовыйОбъект.Записать();
				ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
				ОбНоменклатура.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
		
		СоотвествиеЗАгруженных.Вставить(СтрЗаменить(Строка(ИдНоменклатуры)," ",""));
	КонецЦикла;
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
КонецПроцедуры


Процедура ЗагрузкаТоваровВиатек(Параметр) Экспорт
	ЗагрузкаКаталогаВиатек("product_info_uk");
КонецПроцедуры

Процедура ЗагрузкаКаталогаВиатек(Каталог) Экспорт
	
	Url = "viatec.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	HTTPЗапрос = Новый HTTPЗапрос("/files/"+Каталог+".xml",Заголовки);
	Ответ 	   = Соединение.Получить(HTTPЗапрос);
	Структура  = ПолучитьСтруктуруИзХМЛ(Ответ.ПолучитьТелоКакСтроку());
	//----------------------------------------------------------------------------------------------------------------------//
	Товары = Структура.sitedata.products.product;
	Сч = 0;
	
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаПромо", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	ТаблицаОстатков = новый ТаблицаЗначений;
	ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	ТаблицаОстатков.Колонки.Добавить("Остаток");
	
	Для каждого  Товар Из Товары Цикл
		
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.VIATEC.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", ПолучитьКатегориюИнтернетМагазина(Товар.category_id.___Текст_,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC)));
		
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
			
			
			Если НастройкиКатегории[0].использовать Тогда 
				
				Попытка
					НоменклатурыПоставщика = ПолучитьНоменклатуруИнтернетМагазина(Товар.id.___Текст_,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC,Ложь);
					
					Если НоменклатурыПоставщика.Пустая() Тогда
						НоменклатурыПоставщика = СоздатьОбновитьТоварViatec(Товар.id.___Текст_,Товар,Неопределено);
					Иначе						
						СоздатьОбновитьТоварViatec(Товар.id.___Текст_,Товар,НоменклатурыПоставщика);
					КонецЕсли;
					Если НоменклатурыПоставщика.Количество >0 и ЗначениеЗаполнено(НоменклатурыПоставщика.Номенклатура) Тогда 
						СтрокаЦен = ТаблицаЦен.Добавить();
						СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
						СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура)=0,НоменклатурыПоставщика.РРЦ,ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
						СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
						СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
						СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
						Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
							//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
						КонецЕсли;

					КонецЕсли;
					СтрокаОстатков = ТаблицаОстатков.Добавить();
					СтрокаОстатков.Номенклатура = НоменклатурыПоставщика.ссылка;
					СтрокаОстатков.Остаток      = НоменклатурыПоставщика.Количество;
					
					
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC);
	ОбновитьОстатки(ТаблицаОстатков,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.VIATEC);	
// к ЛИВ
	
КонецПроцедуры

Функция НужноУстанавливатьЦену(НоменклатураПоставщика,ТекущийДокумент)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	НАЧАЛОПЕРИОДА(ЦеныНоменклатурыСрезПоследних.Регистратор.Дата, ДЕНЬ) КАК ДатаУстановки
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ТипЦен.Код = ""000000005""
	|				И Номенклатура = &Номенклатура и Регистратор <> &Регистратор) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура",НоменклатураПоставщика.Номенклатура);
	Запрос.УстановитьПараметр("Регистратор",ТекущийДокумент);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Цена = РезультатЗапроса[0].цена;
		Дата = РезультатЗапроса[0].ДатаУстановки;
		
		Если Дата <> началоДня(ТекущаяДата()) Тогда 
			
			Возврат Истина;
			
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Процедура СоздатьУстановкуЦен(ТаблицаЦен,Поставщик)
	
	ТипЦенРРЦ           = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Интернет-магазин");
	
	ДокументУставнокаЦен = НайтиДокументУстановкиЦен(НачалоДня(ТекущаяДата()),ТипЦенРРЦ,Поставщик);
	
	Если ЗначениеЗаполнено(НайтиДокументУстановкиЦен(НачалоДня(ТекущаяДата()),ТипЦенРРЦ,Поставщик)) Тогда 
		ДокументОбъект = ДокументУставнокаЦен.ПолучитьОбъект();
		ДокументОбъект.Товары.Очистить();
	Иначе
		
		ДокументОбъект      = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДата();
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
		НовСтрТипЦен.ТипЦен = ТипЦенРРЦ;
		
	КонецЕсли;	
	ИндексСтрокиТаблицыЦен = 0;
	
// н ЛИВ
	ТЗЦеныМин = ОбработатьЦеныВыбратьМинимальную(ТаблицаЦен);
// к ЛИВ
	
	Для Каждого Строка из ТаблицаЦен Цикл 
		
		Если  (Число(Строка.ЦенаРРЦ) = 0 или Не ЗначениеЗаполнено(Строка.Номенклатура.Номенклатура))   Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Строка.Номенклатура.Номенклатура));
		Если не НайденныеСтроки.количество() Тогда 
			СтрокаТовары = ДокументОбъект.Товары.Добавить();
			СтрокаТовары.Номенклатура           = Строка.Номенклатура.Номенклатура;
			СтрокаТовары.ТипЦен                 = ТипЦенРРЦ;
			СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
// н ЛИВ			
			//СтрокаТовары.Цена                   = Окр(Строка.ЦенаРРЦ+0.5,0,РежимОкругления.Окр15как20)-1;
			Если Строка.Фиксированная Тогда
				
				СтрокаТовары.Цена                   = Окр(Строка.ЦенаРРЦ+0.5,0,РежимОкругления.Окр15как20)-1;
				
			Иначе
				
				НайденнаяСтрока = ТЗЦеныМин.Найти(Строка.Номенклатура.Номенклатура, "Номенклатура");		
			    Если НайденнаяСтрока <> Неопределено Тогда
					//СтрокаТовары.Цена                   = НайденнаяСтрока.ЦенаМин;
					СтрокаТовары.Цена                   = Окр(НайденнаяСтрока.ЦенаМин+0.5,0,РежимОкругления.Окр15как20)-1;	
				Иначе	
					СтрокаТовары.Цена                   = Окр(Строка.ЦенаРРЦ+0.5,0,РежимОкругления.Окр15как20)-1;	
				КонецЕсли;
			
			КонецЕсли;
// к ЛИВ			
			СтрокаТовары.Валюта                 = ТипЦенРРЦ.ВалютаЦены;
			СтрокаТовары.ЕдиницаИзмерения       = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
			СтрокаТовары.ПроцентСкидкиНаценки   = ТипЦенРРЦ.ПроцентСкидкиНаценки;
			СтрокаТовары.СпособРасчетаЦены      = ТипЦенРРЦ.СпособРасчетаЦены;
		КонецЕсли;
	КонецЦикла;
	ДокументОбъект.Товары.Свернуть("Номенклатура,ТипЦен,ИндексСтрокиТаблицыЦен,Цена,Валюта,ЕдиницаИзмерения,ПроцентСкидкиНаценки,СпособРасчетаЦены");
	ДокументОбъект.Комментарий = "#Встановлення ціни "+ ТипЦенРРЦ +" "+Поставщик +"";
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;
	
	ТипЦенДилер         = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000008");
	ДокументУставнокаЦен = НайтиДокументУстановкиЦен(НачалоДня(ТекущаяДата()),ТипЦенДилер,Поставщик);
	Если ЗначениеЗаполнено(ДокументУставнокаЦен) Тогда 
		ДокументОбъект = ДокументУставнокаЦен.ПолучитьОбъект();
		ДокументОбъект.Товары.Очистить();
		
	Иначе
		
		ДокументОбъект      = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		ДокументОбъект.Дата = НачалоДня(ТекущаяДата());
		НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
		НовСтрТипЦен.ТипЦен = ТипЦенДилер;
		ИндексСтрокиТаблицыЦен = 0;
		
	КонецЕсли;	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	
	
	Для Каждого Строка из ТаблицаЦен Цикл 
		
		Если  Число(Строка.ЦенаДиллер) = 0 или Не ЗначениеЗаполнено(Строка.Номенклатура.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовары = ДокументОбъект.Товары.Добавить();
		СтрокаТовары.Номенклатура           = Строка.Номенклатура.Номенклатура;
		СтрокаТовары.ТипЦен                 = ТипЦенДилер;
		СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
		СтрокаТовары.Цена                   = Строка.ЦенаДиллер;
		СтрокаТовары.Валюта                 = ТипЦенДилер.ВалютаЦены;
		СтрокаТовары.ЕдиницаИзмерения       = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
		СтрокаТовары.ПроцентСкидкиНаценки   = ТипЦенДилер.ПроцентСкидкиНаценки;
		СтрокаТовары.СпособРасчетаЦены      = ТипЦенДилер.СпособРасчетаЦены;
	КонецЦикла;
	ДокументОбъект.Товары.Свернуть("Номенклатура,ТипЦен,ИндексСтрокиТаблицыЦен,Цена,Валюта,ЕдиницаИзмерения,ПроцентСкидкиНаценки,СпособРасчетаЦены");
	ДокументОбъект.Комментарий = "#Встановлення ціни " +  ТипЦенДилер+ " " +Поставщик +"";
	Если ДокументОбъект.Товары.Количество() Тогда 
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// н ЛИВ
Функция ОбработатьЦеныВыбратьМинимальную(ТаблицаЦен)

	ОтборНоменклатураПоставщиков = ТаблицаЦен.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_НоменклатураПоставщиков.Номенклатура
	               |ИЗ
	               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |ГДЕ
	               |	im_НоменклатураПоставщиков.Ссылка В (&ОтборНоменклатураПоставщиков)";
	
	Запрос.УстановитьПараметр("ОтборНоменклатураПоставщиков", ОтборНоменклатураПоставщиков);
	
	НоменклатураОтбор = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");

	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_НоменклатураПоставщиков.Ссылка
	               |ПОМЕСТИТЬ Ном
	               |ИЗ
	               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |ГДЕ
	               |	im_НоменклатураПоставщиков.Номенклатура В(&НоменклатураОтбор)
	               |	И im_НоменклатураПоставщиков.ПометкаУдаления = ЛОЖЬ
	               |	И im_НоменклатураПоставщиков.ДатаОбновления > &ДатаОбновления
	               |	И im_НоменклатураПоставщиков.РРЦ <> 0
	               |	И im_НоменклатураПоставщиков.Количество <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	im_НоменклатураПоставщиков.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Ном.Ссылка.Номенклатура КАК Номенклатура,
	               |	МИНИМУМ(Ном.Ссылка.РРЦ) КАК ЦенаМин
	               |ИЗ
	               |	Ном КАК Ном
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Ном.Ссылка.Номенклатура";
	
	Запрос.УстановитьПараметр("НоменклатураОтбор", НоменклатураОтбор);
	Запрос.УстановитьПараметр("ДатаОбновления", ТекущаяДата() - 60*60*24*1);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
	
КонецФункции

// к ЛИВ

Процедура ОбновитьОстатки(ТаблицаОстатков,Поставщик)
	
	Для Каждого СтрТовар из ТаблицаОстатков  ЦИКЛ 
		Если ЗначениеЗаполнено(СтрТовар.Номенклатура.Номенклатура) Тогда 
			Запись              = РегистрыСведений.ТоварыНаСкладахПоставщиков.СоздатьМенеджерЗаписи();
			Запись.Период       = ТекущаяДата();
			Запись.Номенклатура = СтрТовар.Номенклатура.Номенклатура;
			ЗАпись.Количество   = СтрТовар.Остаток;
			Запись.Записать();
			
			//ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.ОбменССайтомТоварами.НайтиПоКоду("T2"),СтрТовар.Номенклатура.Номенклатура);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьОстатокТовара(Номенклатура)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНаСкладахПоставщиковСрезПоследних.Количество
	|ИЗ
	|	РегистрСведений.ТоварыНаСкладахПоставщиков.СрезПоследних(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахПоставщиковСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		
		Возврат	РезультатЗапроса[0].Количество;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
КонецФункции

Функция ЦенаФиксированная(Номенклатура)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ТипЦен.Код = ""000000010""
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция НайтиДокументУстановкиЦен(Дата,ТипЦен,Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УстановкаЦенНоменклатуры.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УстановкаЦенНоменклатуры.ТипыЦен.ТипЦен = &ТипЦен
	|	И УстановкаЦенНоменклатуры.Комментарий ПОДОБНО &Комментарий";
	Запрос.УстановитьПараметр("НачалоПериода",Дата);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	Запрос.УстановитьПараметр("Комментарий","#Встановлення ціни " +  ТипЦен+ " " +Поставщик +"");
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].ссылка;
	Иначе
		Возврат Документы.УстановкаЦенНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьКатегорииViatec(структура,каталог)
	Категории = Структура.sitedata.categories.category;
	Сч = 0;
	
	Для каждого  Категория Из Категории Цикл
		//сч = сч+1;
		//Если сч > 10 Тогда 
		//	Продолжить;	
		//КонецЕсли;
		//
		
		
		//СвойстваКатегории = Категория.Свойства();
		
		Если Не Категория.Свойство("parent_Id")  Тогда
			КорневаяПапка = Справочники.Номенклатура.НайтиПоНаименованию(Каталог);	
			
		Иначе
			КорневаяПапка = Справочники.Номенклатура.НайтиПоРеквизиту("ViaTekIdCategory",""+Каталог+"_"+Категория.parent_id.___Текст_)	
			
		КонецЕсли;
		
		ИдКатегории = ""+Каталог+"_"+Категория.id.___Текст_;
		НаименованиеКатегории = Категория.title.___Текст_;
		СсылкаНаКатегорию = Справочники.Номенклатура.НайтиПоРеквизиту("ViaTekIdCategory",ИдКатегории);
		Если СсылкаНаКатегорию.Пустая() Тогда
			ОбКатегории = Справочники.Номенклатура.СоздатьГруппу();
			ОбКатегории.ViaTekIdCategory = ИдКатегории;
			ОбКатегории.Наименование   = НаименованиеКатегории;
			//ОбКатегории.НаименованиеПолное   = НаименованиеКатегории;
			ОбКатегории.Наименование_ru   = НаименованиеКатегории;
			ОбКатегории.Наименование_en   = НаименованиеКатегории;
			ОбКатегории.Родитель		  = КорневаяПапка;
			ОбКатегории.Записать();
			
		Иначе
			
			Если  СсылкаНаКатегорию.Родитель <> КорневаяПапка Тогда
				
				ОбКатегории = СсылкаНаКатегорию.ПолучитьОбъект();
				ОбКатегории.Родитель = КорневаяПапка;
				ОбКатегории.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСвойстаТовараViatec(ОбНоменклатура,товар,ТаблицаОстатков)
	ДопСвойства = Обработки.ЗначенияСвойствОбъекта.Создать();
	ДопСвойства.ОбъектОтбораЗначений = ОбНоменклатура.Ссылка;
	ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
	
	Если Товар.properties.Свойство("property") Тогда
		
		ЗначениеСвойствОбъектов = Товар.properties.property; 
		
		Если  ТипЗнч(ЗначениеСвойствОбъектов) = Тип("Структура") Тогда
			
			ЗначениеСвойствОбъектов = Новый Массив; 
			ЗначениеСвойствОбъектов.Добавить(Товар.properties.property);
			
		КонецЕсли;	
		Для Каждого Свств из ЗначениеСвойствОбъектов Цикл 
			
			Если Свств.name.___Текст_ = "Штрихкод" Тогда
				
				
				
				ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
				
				ТекЗапись.Владелец         = ОбНоменклатура.Ссылка;
				ТекЗапись.ЕдиницаИзмерения = ОбНоменклатура.ЕдиницаХраненияОстатков;
				ТекЗапись.ТипШтрихкода     = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
				ТекЗапись.Качество         = Справочники.Качество.Новый;
				ТекЗапись.Штрихкод         = Свств.value.___Текст_;
				
				Попытка
					ТекЗапись.Записать();
				Исключение
				КонецПопытки;
				
				Продолжить;	
				
			ИначеЕсли Свств.name.___Текст_ = "Наявність" Тогда
				НоваяСтрока = ТаблицаОстатков.Добавить();
				НоваяСтрока.Номенклатура = ОбНоменклатура.Ссылка;
				Если Свств.name.___Текст_ = "В наявності" Тогда
					
					НоваяСтрока.Остаток =50;
					
				Иначе
					НоваяСтрока.Остаток =0;
				КонецЕсли;
				
				
				
			КонецЕсли;
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(Свств.name.___Текст_)); 
			СтрПоиска.Вставить("ПометкаУдаления", Ложь);
			
			НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свств.value.___Текст_,,,НайденныеСтроки[0].Свойство);
				Если Значение.Пустая() Тогда
					ЗначениеСвойств = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
					ЗначениеСвойств.Наименование =  Свств.value.___Текст_;
					ЗначениеСвойств.Наименование_en = Свств.value.___Текст_;
					ЗначениеСвойств.Наименование_ru =  Свств.value.___Текст_;
					ЗначениеСвойств.Владелец =  НайденныеСтроки[0].Свойство;
					ЗначениеСвойств.Записать();
					
				Иначе
					ЗначениеСвойств = Значение;
					
				КонецЕсли;
				НайденныеСтроки[0].Значение = ЗначениеСвойств.Ссылка;	
				
			Иначе
				
				НовСвойство 					= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
				НовСвойство.Наименование 		= Свств.name.___Текст_;
				НовСвойство.Наименование_en 	= Свств.name.___Текст_;
				НовСвойство.Наименование_ru 	= Свств.name.___Текст_;
				НовСвойство.НазначениеСвойства 	= ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
				//НовСвойство.ТипЗначения			= ;;
				НовСвойство.Записать();
				
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(Свств.name.___Текст_));
				СтрПоиска.Вставить("ПометкаУдаления", Ложь);
				
				ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
				
				НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
				Попытка
					Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свств.name.___Текст_,,,НайденныеСтроки[0].Свойство);
					
					Если Значение.Пустая() Тогда
						ЗначениеСвойств = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
						ЗначениеСвойств.Наименование =  Свств.value.___Текст_;
						ЗначениеСвойств.Наименование_en =  Свств.value.___Текст_;
						ЗначениеСвойств.Наименование_ru =  Свств.value.___Текст_;
						ЗначениеСвойств.Владелец =  НовСвойство.Ссылка;
						ЗначениеСвойств.Записать();
						
					Иначе
						ЗначениеСвойств = Значение;
					КонецЕсли;
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						НайденныеСтроки[0].Значение = ЗначениеСвойств;	
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			
		КонецЦикла;
		
		ДопСвойства.ЗаписатьЗначенияСвойств();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКартинкиТовараViatec(ОбНоменклатура,Товар)
	КартинкиСписок =  Товар.image; 
	Если Товар.Свойство("image") Тогда
		Если ТипЗнч(КартинкиСписок) = тип("Структура") Тогда
			
			КартинкиСписок = Новый массив;
			КартинкиСписок.Добавить(Товар.image.___Текст_);
			
			
		КонецЕсли;
		
		ЭтоПерваяКартика = Истина;
		
		Для Каждого Картинка из КартинкиСписок  Цикл
			
			ДлинаУрл = СтрДлина(Картинка);	
			ГлавнаяЧастьУрл = Найти(Картинка,"/content");
			
			ВторичнаяЧастьУрл = Стрзаменить(Картинка,"https://viatec.ua/","");
			
			
			Url = "viatec.ua";	
			Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type","application/json"); 
			
			
			
			ИмяФайла = Товар.model.___Текст_;
			HTTPЗапрос = Новый HTTPЗапрос(ВторичнаяЧастьУрл,Заголовки);
			
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			//мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			Фото =  Ответ.ПолучитьТелоКакДвоичныеДанные() ;
			
			
			Если Ответ.КодСостояния <> 200 Тогда
				Возврат;
			КонецЕсли; 
			ХранилищеДопИнфо = ПолучитьКартинку(ОбНоменклатура.Ссылка,""+ИмяФайла + "Загружен с сайта ViaTek");
			Если ХранилищеДопИнфо <> Неопределено Тогда 
				//	ОбНоменклатура.ОсновноеИзображение = ХранилищеДопИнфо;
				//	ОбНоменклатура.Записать();	
			Иначе
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				
				
				
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(Фото), Новый СжатиеДанных);
				НовыйОбъект.Объект = ОбНоменклатура.Ссылка;
				НовыйОбъект.ИмяФайла = ""+ИмяФайла + "Загружен с сайта ViaTek";
				НовыйОбъект.Записать(); 
				Если ЭтоПерваяКартика Тогда
					ОбНоменклатура.ОсновноеИзображение = НовыйОбъект.Ссылка;
					ОбНоменклатура.Записать();
					ЭтоПерваяКартика= Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьОбновитьТоварViatec(ID,Товар,ТоварССылка)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	ОбНоменклатура.ID                = ID;
	ОбНоменклатура.Артикул           = Товар.code.___Текст_;
	ОбНоменклатура.Наименование      = Товар.title.___Текст_+" "+Товар.model.___Текст_;
	ОбНоменклатура.Категория         = ПолучитьКатегориюИнтернетМагазина(Товар.category_id.___Текст_,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC);
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.VIATEC;
	ОбНоменклатура.Бренд             = ?(Товар.brand.Свойство("___Текст_"),Товар.brand.___Текст_,"");
	ОбНоменклатура.Родитель          = ПолучитьНоменклатуруИнтернетМагазина(Товар.category_id.___Текст_,Справочники.im_ПоставщикиИнтернетМагазина.VIATEC,Истина);
	ОбНоменклатура.URL	             = Товар.url.___Текст_;
	ОбНоменклатура.Количество        = ?(Товар.stock.___Текст_ = "no",0,100);
	ОбНоменклатура.РРЦ               = Товар.price_uah.___Текст_;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
	ОбНоменклатура.Модель            = Товар.model.___Текст_;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	
	Попытка
		ОбНоменклатура.Изображениия.Очистить();
		СтрокаКартинки= ОбНоменклатура.Изображениия.Добавить();
		СтрокаКартинки.URL = Товар.image.___Текст_;
	Исключение
	КонецПопытки;
	
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура; 
КонецФункции

Процедура СоздатьУстановкуЦенViatec(ТаблицаЦенОстатков)
	
	ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("РРЦ", Истина);
	Если Не ЗначениеЗаполнено(ТипЦены) Тогда
		Возврат;
	КонецЕсли;
	ЦеныНоменклатуры = Новый Массив;
	ЦеныНоменклатуры.Добавить(ТипЦены);
	ИндексСтрокиТаблицыЦен = 0;
	
	ДокументОбъект      = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	НовСтрТипЦен 		= ДокументОбъект.ТипыЦен.Добавить();
	НовСтрТипЦен.ТипЦен = ТипЦены;
	ИндексСтрокиТаблицыЦен = 0;
	
	Для Каждого стр Из ТаблицаЦенОстатков Цикл
		
		Для Каждого ТипЦенНоменклатуры Из ЦеныНоменклатуры Цикл
			
			Если  Число(стр.Цена) = 0 или стр.ЦенаУстановлена Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТовары = ДокументОбъект.Товары.Добавить();
			СтрокаТовары.Номенклатура           = стр.Номенклатура;
			СтрокаТовары.ТипЦен                 = ТипЦенНоменклатуры;
			СтрокаТовары.ИндексСтрокиТаблицыЦен = ИндексСтрокиТаблицыЦен;
			СтрокаТовары.Цена                   = стр.Цена;
			СтрокаТовары.Валюта                 = ТипЦенНоменклатуры.ВалютаЦены;
			СтрокаТовары.ЕдиницаИзмерения       = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
			СтрокаТовары.ПроцентСкидкиНаценки   = ТипЦенНоменклатуры.ПроцентСкидкиНаценки;
			СтрокаТовары.СпособРасчетаЦены      = ТипЦенНоменклатуры.СпособРасчетаЦены;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	
	ДокументОбъект.Комментарий = "Цены РРЦ Viatec";
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузкаТоваровМТИ(Параметр) Экспорт
	Url = "products.mti.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("/api/?action=getCatalog&key=Sqceh4xB9PvL",Заголовки);
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;
	КонецЕсли; 
	
	Структура = ПолучитьСтруктуруИзХМЛ(Ответ.ПолучитьТелоКакСтроку());
	Категории = Структура.root.categorieslist.category;
	ТЗКатегории = Новый ТаблицаЗначений;
	ТЗКатегории.Колонки.Добавить("categoryID");

// н Категории
	КатегорииОтборЗагрузка = im_Поставщики_МТИ_ПолучитьКатегориДляТоваровСКодом(Справочники.im_ПоставщикиИнтернетМагазина.МТИ);
// к Категории
	
	Для каждого  Категория Из Категории Цикл
		//
		ИдКатегории = Категория.___Атрибуты_.id;
		НаименованиеКатегории = Категория.___Текст_;

		Если Категория.___Атрибуты_.Свойство("parentid") Тогда
			ИдРодитель = Категория.___Атрибуты_.parentid;
		Иначе
			ИдРодитель = "";
		КонецЕсли;
		
// н Категории
		Если КатегорииОтборЗагрузка.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		НайтиКатегорию = КатегорииОтборЗагрузка.Найти(ИдКатегории, "КатегорияIDКатегории");
		Если НайтиКатегорию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
// к Категории
		
		Если Не ЗначениеЗаполнено(ИдРодитель) ИЛИ ИдРодитель = "0" Тогда
			//КорневаяПапка = Справочники.im_НоменклатураПоставщиков.НайтиПоНаименованию("МТИ");	
			КорневаяПапка = im_Поставщики_МТИ_ПолучитьГруппуКатегориюИнтернетМагазина("МТИ_Api", Справочники.im_ПоставщикиИнтернетМагазина.МТИ, Истина); 
		Иначе
			КорневаяПапка = im_Поставщики_МТИ_ПолучитьГруппуКатегориюИнтернетМагазина(ИдРодитель, Справочники.im_ПоставщикиИнтернетМагазина.МТИ, Истина);	
		КонецЕсли;

		СсылкаНаКатегорию     = im_Поставщики_МТИ_ПолучитьГруппуКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.МТИ, Истина);
		
		Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
			КатегорияСправочник = Справочники.im_НоменклатураПоставщиков.СоздатьГруппу();
			КатегорияСправочник.ID = ИдКатегории;
			КатегорияСправочник.Наименование = НаименованиеКатегории;
			КатегорияСправочник.Родитель     = КорневаяПапка;
			КатегорияСправочник.Поставщик    = Справочники.im_ПоставщикиИнтернетМагазина.МТИ;
			КатегорияСправочник.Записать();
		Иначе
			КатегорияСправочник					= СсылкаНаКатегорию.ПолучитьОбъект();
			КатегорияСправочник.ID				= ИдКатегории;
			КатегорияСправочник.Наименование	= НаименованиеКатегории;
			КатегорияСправочник.Родитель		= КорневаяПапка;
			КатегорияСправочник.Поставщик		= Справочники.im_ПоставщикиИнтернетМагазина.МТИ;
			КатегорияСправочник.Записать();

		КонецЕсли;

		Если ЗначениеЗаполнено(ИдКатегории) Тогда
			НовСтр 				= ТЗКатегории.Добавить();
			НовСтр.categoryID 	= ИдКатегории;
		КонецЕсли;	
			
	КонецЦикла;
	
	КатегорииОтбор = im_Поставщики_МТИ_ПолучитьКатегориДляТоваров(Справочники.im_ПоставщикиИнтернетМагазина.МТИ);
	ТЗТоварыЦеныОстатки = im_Поставщики_МТИ_ПолучитьЦеныИОстатки();
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Наименование");
	Товары.Колонки.Добавить("Артикул");
	Товары.Колонки.Добавить("ID");
	Товары.Колонки.Добавить("Бренд");
	Товары.Колонки.Добавить("Категория");
	Товары.Колонки.Добавить("URL");
	Товары.Колонки.Добавить("ДилерскаяЦена");
	Товары.Колонки.Добавить("РРЦ");
	Товары.Колонки.Добавить("ПромоЦена");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("Модель");
	Товары.Колонки.Добавить("АкционнаяЦена");
	Товары.Колонки.Добавить("ДатаНачалаАкции");
	Товары.Колонки.Добавить("ДатаОкончанияАкции");
	Товары.Колонки.Добавить("Штрихкод");
	Товары.Колонки.Добавить("Картинка");
	Товары.Колонки.Добавить("Картинки");
	
	Для Каждого стрКатегория Из КатегорииОтбор Цикл
		
		Url = "products.mti.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		Заголовки = Новый Соответствие;
		HTTPЗапрос = Новый HTTPЗапрос("/api/?action=loadContent&key=Sqceh4xB9PvL&cat_id="+стрКатегория.Категория.IDКатегории, Заголовки);
		Ответ 	= Соединение.Получить(HTTPЗапрос);	
		Если Ответ.КодСостояния <> 200 Тогда
			Продолжить;
		КонецЕсли; 
		
		Попытка
			Структура = ПолучитьСтруктуруИзХМЛ(Ответ.ПолучитьТелоКакСтроку());
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если Структура.root.productslist.Свойство("product") И ТипЗнч(Структура.root.productslist.product) = Тип("Массив") Тогда 
			
			Для Каждого стр Из Структура.root.productslist.product Цикл
				
				Картинки = Новый Массив;
				Если стр.Свойство("___Атрибуты_") Тогда
					
					Если стр.___Атрибуты_.Свойство("id") Тогда 
						
						нстр = Товары.Добавить();
						нстр.ID = стр.___Атрибуты_.id;
						нстр.Наименование = ".";
						нстр.Категория = im_Поставщики_МТИ_ПолучитьКатегориюИнтернетМагазина(стрКатегория.Категория.IDКатегории, Справочники.im_ПоставщикиИнтернетМагазина.МТИ);
						////нстр.Категория = im_Поставщики_МТИ_ПолучитьКатегориюИнтернетМагазина("1686", Справочники.im_ПоставщикиИнтернетМагазина.МТИ);
						нстр.Картинки = Картинки;
						
						Если стр.Свойство("param") И ТипЗнч(стр.param) = Тип("Массив") Тогда
							
							Для Каждого стрМас Из стр.param Цикл
								
								Если стрМас.___Атрибуты_.Свойство("code") Тогда 
									
									//Если стрМас.___Атрибуты_.code = "name" Тогда	
									Если стрМас.___Атрибуты_.code = "preview_text" Тогда	
										         
										Если стрМас.Свойство("___Текст_") Тогда
											нстр.Наименование = стрМас.___Текст_;
										КонецЕсли;
										
									ИначеЕсли стрМас.___Атрибуты_.code = "brand_id" Тогда	
										
										Если стрМас.Свойство("___Атрибуты_") И стрМас.___Атрибуты_.Свойство("id") Тогда
											нстр.Артикул = стрМас.___Атрибуты_.id;
										КонецЕсли;
										Если стрМас.Свойство("___Текст_") Тогда
											нстр.Бренд = стрМас.___Текст_;
										КонецЕсли;
										
									ИначеЕсли стрМас.___Атрибуты_.code = "model" Тогда	
										
										Если стрМас.Свойство("___Текст_") Тогда
											нстр.Модель = стрМас.___Текст_;
										КонецЕсли;
										
									ИначеЕсли стрМас.___Атрибуты_.code = "barcode" Тогда	
										
										Если стрМас.Свойство("___Текст_") Тогда
											нстр.Штрихкод = стрМас.___Текст_;
										КонецЕсли;
										
									ИначеЕсли стрМас.___Атрибуты_.code = "detail_picture" Тогда	
										
										Если стрМас.Свойство("___Текст_") Тогда
											нстр.Картинка = стрМас.___Текст_;
										КонецЕсли;
										
									ИначеЕсли стрМас.___Атрибуты_.code = "more_photo" Тогда	
										
										Если стрМас.Свойство("___Текст_") Тогда
											Картинки.Добавить(стрМас.___Текст_);
											нстр.Картинки = Картинки;
										КонецЕсли;
										
									КонецЕсли;	
								
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;
						
					    НайтисЦенуОстаток = ТЗТоварыЦеныОстатки.Найти(нстр.ID, "idsupplier");
						Если НайтисЦенуОстаток <> Неопределено Тогда
							нстр.РРЦ = НайтисЦенуОстаток.РРЦ;
							нстр.ДилерскаяЦена = НайтисЦенуОстаток.ДилерскаяЦена;
							нстр.Количество = НайтисЦенуОстаток.Количество;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла;	
	
	Сч = 0;
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаПромо", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	Для каждого  Товар Из Товары Цикл
		
		ИдКатегории = Товар.Категория.IDКатегории;
		ИдТовара = "";
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.МТИ.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_МТИ_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.МТИ)));
		
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
			
			Если НастройкиКатегории[0].использовать Тогда 
				
				Попытка
					
					НоменклатурыПоставщика = ПолучитьНоменклатуруИнтернетМагазина(Товар.ID, Справочники.im_ПоставщикиИнтернетМагазина.МТИ, Ложь);
					
					Если НоменклатурыПоставщика.Пустая() Тогда
						НоменклатурыПоставщика = im_Поставщики_МТИ_СоздатьОбновитьТоварМТИ(ИдТовара, Товар, Неопределено);
					Иначе						
						im_Поставщики_МТИ_СоздатьОбновитьТоварМТИ(ИдТовара, Товар, НоменклатурыПоставщика);
					КонецЕсли;
					
					СтрокаЦен = ТаблицаЦен.Добавить();
					СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
					СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
					СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
					СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
					Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
						//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
					КонецЕсли;

					//СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
					
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.МТИ);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.МТИ);	
// к ЛИВ

КонецПроцедуры

Функция im_Поставщики_МТИ_ПолучитьЦеныИОстатки()
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	СтрокаДата = Строка(текущаядата());
	СтрокаДляОбработки = СтрокаДата + "PRICE502679F5A8B4EE-37E0-41FC-A139-0BF1AC7EE185";
	//Хеширование.Добавить("14.02.2025 11:36:45PRICE502679F5A8B4EE-37E0-41FC-A139-0BF1AC7EE185");
	Хеширование.Добавить(СтрокаДляОбработки);
	Хеш = Хеширование.ХешСумма;
	Хеш64 = Base64Строка(Хеш);	
	Url = "api.mti.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/xml"); 
	HTTPЗапрос = Новый HTTPЗапрос("",Заголовки);
	ТекстОтправки = "<?xml version=""1.0"" encoding=""UTF-8""?><request><type>PRICE</type><time>"+СтрокаДата+"</time><company>502679</company><signature>"+Хеш64+"</signature><params><store_id>W600</store_id></params> </request>";
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстОтправки);
	Ответ 	= Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	СтрокаТекст = Ответ.ПолучитьТелоКакСтроку();
	Структура = ПолучитьСтруктуруИзХМЛ(СтрокаТекст);	
	//Структура1 = Ответ.ПолучитьТелоКакСтроку();	
	ТЗТоварыЦены = Новый ТаблицаЗначений;
	ТЗТоварыЦены.Колонки.Добавить("idsupplier");
	ТЗТоварыЦены.Колонки.Добавить("Наименование");
	ТЗТоварыЦены.Колонки.Добавить("ДилерскаяЦена");
	ТЗТоварыЦены.Колонки.Добавить("Количество");
	ТЗТоварыЦены.Колонки.Добавить("РРЦ");
	ТЗТоварыЦены.Колонки.Добавить("ПромоЦена");
	ТЗТоварыЦены.Колонки.Добавить("АкционнаяЦена");
	ТЗТоварыЦены.Колонки.Добавить("Штрихкод");
		
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство("response") И Структура.response.Свойство("result") И Структура.response.result.Свойство("productgroup") И ТипЗнч(Структура.response.result.productgroup) = Тип("Массив") Тогда 
		Для Каждого стрСтруктуры Из Структура.response.result.productgroup Цикл
			Если стрСтруктуры.Свойство("products") И стрСтруктуры.products.Свойство("product") И ТипЗнч(стрСтруктуры.products.product) = Тип("Массив") Тогда
				Для Каждого стр Из стрСтруктуры.products.product Цикл
					Id = "";
					Если стр.Свойство("idsupplier") Тогда
						Если стр.idsupplier.Свойство("___Текст_") Тогда 
							Id = стр.idsupplier.___Текст_;
						КонецЕсли;
					КонецЕсли;
					Если Id = "" Тогда
						Продолжить;
					КонецЕсли;	
					нстр = ТЗТоварыЦены.Добавить();
					нстр.idsupplier = Id;
					нстр.Количество = 0;
					Если стр.Свойство("rrp") Тогда
						Если стр.rrp.Свойство("___Текст_") Тогда 
							нстр.РРЦ = стр.rrp.___Текст_;
						КонецЕсли;
					КонецЕсли;
					Если стр.Свойство("price_uah_fdp") Тогда
						Если стр.price_uah_fdp.Свойство("___Текст_") Тогда 
							нстр.ДилерскаяЦена = стр.price_uah_fdp.___Текст_;
						КонецЕсли;
					КонецЕсли;
					//Если стр.Свойство("barcode") Тогда
					//	Если стр.barcode.Свойство("___Текст_") Тогда 
					//		нстр.Штрихкод = стр.barcode.___Текст_;
					//	КонецЕсли;
					//КонецЕсли;
					Если стр.Свойство("prodname") Тогда
						Если стр.prodname.Свойство("___Текст_") Тогда 
							нстр.Наименование = стр.prodname.___Текст_;
						КонецЕсли;
					КонецЕсли;
					Если стр.Свойство("store") Тогда
						Если стр.store.Свойство("___Текст_") Тогда 
							Если стр.store.___Текст_ = "50 і більше" Тогда
								нстр.Количество = 50;
							ИначеЕсли стр.store.___Текст_ = "50 и более" Тогда
								нстр.Количество = 50;
							ИначеЕсли стр.store.___Текст_ = "10 і більше" Тогда
								нстр.Количество = 10;
							ИначеЕсли стр.store.___Текст_ = "10 и более" Тогда
								нстр.Количество = 10;
							ИначеЕсли стр.store.___Текст_ = "0" 
								ИЛИ стр.store.___Текст_ = "1" 
								ИЛИ стр.store.___Текст_ = "2" 
								ИЛИ стр.store.___Текст_ = "3" 
								ИЛИ стр.store.___Текст_ = "4" 
								ИЛИ стр.store.___Текст_ = "5" 
								ИЛИ стр.store.___Текст_ = "6" 
								ИЛИ стр.store.___Текст_ = "7" 
								ИЛИ стр.store.___Текст_ = "8" 
								ИЛИ стр.store.___Текст_ = "9" Тогда
								нстр.Количество = Число(стр.store.___Текст_);
							ИначеЕсли стр.store.___Текст_ = "-" Тогда
								нстр.Количество = 0;
							ИначеЕсли стр.store.___Текст_ = "" Тогда
								нстр.Количество = 0;
							Иначе
								нстр.Количество = 0;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					// price_uah
					// rrp
					// rrp_control
					// price_usd
					// price_uah_fdp
					// price_uah_order
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ТЗТоварыЦены;
		
КонецФункции

Функция im_Поставщики_МТИ_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_МТИ_ПолучитьИспользованиеКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	//|ИЗ
	//|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	//|ГДЕ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	//|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	//Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	//Запрос.УстановитьПараметр("Поставщик",Поставщик);
	//
	//результатЗапроса = запрос.Выполнить().Выгрузить();
	//
	//Если результатЗапроса.Количество() Тогда 
	//	Возврат результатЗапроса[0].ссылка; 
	//КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_МТИ_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_НоменклатураПоставщиков.Ссылка
	               |ИЗ
	               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |ГДЕ
	               |	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	               |	И im_НоменклатураПоставщиков.ID = &IDКатегории
	               |	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_МТИ_СоздатьОбновитьТоварМТИ(ID, Товар, ТоварССылка)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	ОбНоменклатура.ID                = Товар.ID;
	ОбНоменклатура.Артикул           = Товар.Артикул;
	ОбНоменклатура.Наименование      = Товар.Наименование;
	ОбНоменклатура.Категория         = Товар.Категория;
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.МТИ;
	ОбНоменклатура.Бренд             = Товар.Бренд;
	ОбНоменклатура.Родитель          = im_Поставщики_МТИ_ПолучитьГруппуКатегориюИнтернетМагазина(Товар.Категория.IDКатегории, Справочники.im_ПоставщикиИнтернетМагазина.МТИ, Истина);
	ОбНоменклатура.URL	             = "";
	
	Если ЗначениеЗаполнено(Товар.Картинка) Или Товар.Картинки.Количество() > 0 Тогда
		ОбНоменклатура.Изображениия.Очистить();
		Если ЗначениеЗаполнено(Товар.Картинка) Тогда
			ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
			ОбКартинка.URL = Товар.Картинка;
		КонецЕсли;
		Если Товар.Картинки.Количество() > 0 Тогда
			Для Каждого стр Из Товар.Картинки Цикл 
				ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
				ОбКартинка.URL = стр;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ОбНоменклатура.Количество        = Товар.Количество;
	ОбНоменклатура.РРЦ               = Товар.РРЦ;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
	ОбНоменклатура.ДилерскаяЦена     = Товар.ДилерскаяЦена;
	ОбНоменклатура.Модель            = Товар.Модель;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции

Функция im_Поставщики_МТИ_ПолучитьКатегориДляТоваров(Поставщик)

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Категории.Категория
	               |ИЗ
	               |	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	               |ГДЕ
	               |	НЕ Категории.Категория В
	               |				(ВЫБРАТЬ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	               |				ИЗ
	               |					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	               |				ГДЕ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	               |	И Категории.Использовать = ИСТИНА
	               |	И Категории.Категория.Поставщик = &Поставщик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;

КонецФункции

Функция im_Поставщики_МТИ_ПолучитьКатегориДляТоваровСКодом(Поставщик)

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Категории.Категория,
	               |	Категории.Категория.IDКатегории
	               |ИЗ
	               |	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	               |ГДЕ
	               |	НЕ Категории.Категория В
	               |				(ВЫБРАТЬ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	               |				ИЗ
	               |					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	               |				ГДЕ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	               |	И Категории.Использовать = ИСТИНА
	               |	И Категории.Категория.Поставщик = &Поставщик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;

КонецФункции




Функция ПолучитьКатегориюИнтернетМагазина(IDКатегории,Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНоменклатуруИнтернетМагазина(ID,Поставщик,ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &ID
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("ID",ID);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	Иначе
		Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция im_Поставщики_DCLINK_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &IDКатегории
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",Строка(IDКатегории));
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_DCLINK_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_DCLINK_НайтиКатегориюПоID(Name = Неопределено, Id)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииCerebro.Ссылка
	|ИЗ
	|	Справочник.КатегорииCerebro КАК КатегорииCerebro
	|ГДЕ
	|	НЕ КатегорииCerebro.ПометкаУдаления
	|	И КатегорииCerebro.ID = &ID"
	+?(Name = Неопределено, "", Символы.ПС+ "И КатегорииCerebro.Наименование = &name");
	
	Запрос.УстановитьПараметр("ID", Id);
	Запрос.УстановитьПараметр("name", Name);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура im_Поставщики_DCLINK_СоздатьГруппы(Name, Id)
	
	НовКатегория 				= Справочники.КатегорииCerebro.СоздатьЭлемент();
	НовКатегория.ID 			= Id;
	НовКатегория.Наименование 	= Name;
	НовКатегория.Записать();
	
КонецПроцедуры

Процедура im_Поставщики_DCLINK_Таймаут()
	
	//таймаут	
	ДатаКон = ТекущаяДата() + 0.5;//пауза 2 сек
	Пока ТекущаяДата() < ДатаКон Цикл 
		
	КонецЦикла;	
	
КонецПроцедуры

Функция im_Поставщики_DCLINK_ПолучитьТоварИнтернетМагазина(ИдТовара, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &ИдТовара
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = Ложь";
	
	Запрос.УстановитьПараметр("ИдТовара", ИдТовара);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_DCLINK_СоздатьОбновитьТовар(ID, Товар, ТоварССылка, Артикул, ИдентификаторСессии,ТаблицаПоставщиков, БезНал)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	ОбНоменклатура.ID                = ID;
	ОбНоменклатура.Артикул           = Артикул;
	ОбНоменклатура.Наименование      = Товар.name;
	ОбНоменклатура.Категория         = im_Поставщики_DCLINK_ПолучитьКатегориюИнтернетМагазина(Товар.categoryId, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK;
	//ОбНоменклатура.Бренд           = "";
	ОбНоменклатура.Родитель          = im_Поставщики_DCLINK_ПолучитьГруппуКатегориюИнтернетМагазина(СтрЗаменить(Товар.categoryId,Символы.НПП,""), Справочники.im_ПоставщикиИнтернетМагазина.DCLINK, Истина);
	ОбНоменклатура.Категория         = im_Поставщики_DCLINK_ПолучитьКатегориюИнтернетМагазина(СтрЗаменить(Товар.categoryId,Символы.НПП,""), Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	ОбНоменклатура.РРЦ               = Товар.retail_price_uah;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
	ОбНоменклатура.ДилерскаяЦена     = Товар.price_uah;
	ОбНоменклатура.Модель            = Артикул;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	ОбНоменклатура.Количество        = ?(Товар.available.Количество()>0,100,0);
	
	Если Не БезНал Тогда
		ОбНоменклатура.Количество = 0;
	КонецЕсли;
	
	МассивБрендов = ТаблицаПоставщиков.НайтиСтроки(Новый структура("vendorID", Товар.vendorid));
	
	Если МассивБрендов.Количество() Тогда 
		ОбНоменклатура.Бренд         = МассивБрендов[0].name;
	Иначе
		ОбНоменклатура.Бренд         = "";
	КонецЕсли;
	
	//ОбНоменклатура.Бренд             = ТаблицаПоставщиков.НайтиСтроки(Новый структура("vendorID", Товар.vendorid));
	ОбНоменклатура.Изображениия.Очистить();
	Картинки = ПолучитьКартинкиТовараDCLINK(ID,ИдентификаторСессии);
	
	Для Каждого Строка из Картинки цикл  
		Если Строка.full_image <> "" Тогда  
			СтрокаКартинка = ОбНоменклатура.Изображениия.Добавить();
			СтрокаКартинка.URL = Строка.full_image;
		КонецЕсли;
	КонецЦикла;
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции


Функция im_Поставщики_DCLINK_GetBnPrices()
	
	Url = "api.dclink.com.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("/api/GetBnPrices", Заголовки);
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Cerebro");
	
	Username  = СтрПодключение.Логин;
	Password = СтрПодключение.Пароль;
	firm = "east";
	
	ТелоЗапросаСтрока = 
	"login=" + Username + 
	"&password=" + Password +
	"&firm=" + firm;
	
	HTTPЗапрос.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	// Отправляем
	Товары_BnPrice = Новый ТаблицаЗначений;	
	Товары_BnPrice.Колонки.Добавить("Код");
	
	Попытка
		Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("Нет ответа при соединении с DCLink BnPrice", ,,,,);
		Иначе
			Структура  = ПолучитьСтруктуруИзХМЛ(Ответ.ПолучитьТелоКакСтроку());
			
			Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство("Pricelist") И ТипЗнч(Структура.Pricelist) = Тип("Структура") Тогда 
				
				Если Структура.Pricelist.Свойство("Product") И ТипЗнч(Структура.Pricelist.Product) = Тип("Массив") Тогда 
					
					Для Каждого стр Из Структура.Pricelist.Product Цикл	
						
						Если стр.Свойство("ItemCode") И ТипЗнч(стр.ItemCode) = Тип("Структура") И стр.ItemCode.Свойство("___Текст_") Тогда 
							
							КодТовара = стр.ItemCode.___Текст_;
							нстр = Товары_BnPrice.Добавить();
							нстр.Код = КодТовара;
							
						КонецЕсли;	
					КонецЦикла;	
					
				КонецЕсли;	
				
			КонецЕсли; 
		КонецЕсли; 
		
		Товары_BnPrice.Свернуть("Код");

	Исключение
	КонецПопытки;
	
	Возврат Товары_BnPrice;
	
КонецФункции



Функция im_Поставщики_Ecoflow_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Ecoflow_ПолучитьИспользованиеКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	//|ИЗ
	//|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	//|ГДЕ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	//|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	//Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	//Запрос.УстановитьПараметр("Поставщик",Поставщик);
	//
	//результатЗапроса = запрос.Выполнить().Выгрузить();
	//
	//Если результатЗапроса.Количество() Тогда 
	//	Возврат результатЗапроса[0].ссылка; 
	//КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Ecoflow_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &IDКатегории
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Ecoflow_ПолучитьТоварИнтернетМагазина_ПоАртикулу(Артикул, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.Артикул = &Артикул
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = Ложь";
	
	Запрос.УстановитьПараметр("Артикул",Артикул);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Ecoflow_СоздатьОбновитьТоварEcoflow(ID, Товар, ТоварССылка, Артикул)
	
	Если Товар.name.Свойство("___Текст_") Тогда
		
		Если ЗначениеЗаполнено(ТоварССылка) Тогда 
			ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
		Иначе
			ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
		КонецЕсли;
		
		ОбНоменклатура.ID                = Товар.___Атрибуты_.id;
		ОбНоменклатура.Артикул           = Артикул;
		ОбНоменклатура.Наименование      = Товар.name.___Текст_;
		ОбНоменклатура.Категория         = im_Поставщики_Ecoflow_ПолучитьКатегориюИнтернетМагазина(Товар.categoryId.___Текст_, Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow);
		ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow;
		//ОбНоменклатура.Бренд             = ?(Товар.brand.Свойство("___Текст_"),Товар.brand.___Текст_,"");
		ОбНоменклатура.Родитель          = im_Поставщики_Ecoflow_ПолучитьГруппуКатегориюИнтернетМагазина(Товар.categoryId.___Текст_, Справочники.im_ПоставщикиИнтернетМагазина.Ecoflow, Истина);
		ОбНоменклатура.URL	             = Товар.url.___Текст_;
		
		Если Товар.param.Количество() > 0  Тогда	
			Для Каждого Элемент Из Товар.param Цикл 
				Если Элемент.___Атрибуты_.name = "Наявність" Тогда
					Если Элемент.___Текст_ = "В наявності" Тогда
						ОбНоменклатура.Количество = 100;
					Иначе	
						ОбНоменклатура.Количество = 0;
					КонецЕсли;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;		
		
		Если Товар.picture.количество() Тогда 
			ОбНоменклатура.Изображениия.Очистить();
			Для каждого Картинка из Товар.picture Цикл 
				ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
				ОбКартинка.URL = Картинка.___Текст_;
			КонецЦикла;
		КонецЕсли;
		//ОбНоменклатура.Количество        = ?(Товар.stock.___Текст_ = "no",0,100);
		ОбНоменклатура.РРЦ               = Товар.price.___Текст_;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
		ОбНоменклатура.Модель            = Товар.vendorCode.___Текст_;
		ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
		
		ОбНоменклатура.Записать();
		
		Возврат ОбНоменклатура;
		
	КонецЕсли;
	
	Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	
КонецФункции


//--------------------------------------Deps-------------------------------------------------------------//
Функция im_Поставщики_Deps_ПолучитьТокен()
	
	Токен = "";
	Период = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеЗагрузкиDeps.Token,
	|	ДанныеЗагрузкиDeps.section,
	|	ДанныеЗагрузкиDeps.task,
	|	ДанныеЗагрузкиDeps.ДатаОтправкиЗапроса КАК Период,
	|	ДанныеЗагрузкиDeps.ТелоЗапроса,
	|	ДанныеЗагрузкиDeps.ТелоОтвета
	|ИЗ
	|	РегистрСведений.ДанныеЗагрузкиDeps КАК ДанныеЗагрузкиDeps
	|ГДЕ
	|	ДанныеЗагрузкиDeps.section = &section
	|	И ДанныеЗагрузкиDeps.task = &task
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("task","open");
	Запрос.УстановитьПараметр("section","connection");
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Токен = ВыборкаДетальныеЗаписи.Token;
		Период = ВыборкаДетальныеЗаписи.Период;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Токен) И ЗначениеЗаполнено(Период) Тогда
		
		Если (ТекущаяДата()-(60*60))< Период Тогда
			
			Возврат Токен;
			
		КонецЕсли;
	КонецЕсли; 
	
	Url = "deps.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Basic YS5rb3JuaXRza2FAdmVjaGlyLnVhOjEyMzQ1Njc4OTA="); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=connection&task=open",Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Токен;
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	Токен = Результат.result;
	Если ЗначениеЗаполнено(Токен) И Результат.status = "ok"  Тогда
		
		ЗаписатьДанныеВРегистрСведений(Токен,"connection","open","",мОтвет);	
	КонецЕсли;
	
	Возврат Токен
	
КонецФункции

Функция im_Поставщики_Deps_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &IDКатегории
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Deps_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Deps_НайтиКатегориюПоID(Name = Неопределено, Id)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииCerebro.Ссылка
	|ИЗ
	|	Справочник.КатегорииCerebro КАК КатегорииCerebro
	|ГДЕ
	|	НЕ КатегорииCerebro.ПометкаУдаления
	|	И КатегорииCerebro.ID = &ID"
	+?(Name = Неопределено, "", Символы.ПС+ "И КатегорииCerebro.Наименование = &name");
	
	Запрос.УстановитьПараметр("ID", Id);
	Запрос.УстановитьПараметр("name", Name);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция im_Поставщики_Deps_ПолучитьТоварИнтернетМагазина(ИдТовара, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &ИдТовара
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = Ложь";
	
	Запрос.УстановитьПараметр("ИдТовара", ИдТовара);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_НоменклатураПоставщиков.ПустаяСсылка();
	
КонецФункции

Процедура im_Поставщики_Deps_ЗагрузитьНоменклатуру(СоотвествиеЗАгруженных, Токен, ИдКатегории, ЛимитСтарт = Неопределено, Лимит = Неопределено,ТаблицаЦен,ТаблицаОстатков)
	
	Url = "deps.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=search&limit="+ СтрЗаменить(Строка(Лимит),Символы.НПП,"") +"&limitstart="+ СтрЗаменить(Строка(ЛимитСтарт),Символы.НПП,"") +"&args[categories][]="+СтрЗаменить(Строка(ИдКатегории),Символы.НПП,""),Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
	
	СоотвествиеКатегорий = Результат.Получить("result");
	
	Пагинация = СоотвествиеКатегорий.Получить("pagination");
	
	Тотал = Число(Пагинация.Получить("total"));	
	Лимит = Тотал;
	Пока Тотал >= 0 Цикл
		
		Url = "deps.ua";	
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json"); 
		Заголовки.Вставить("Authorization","Bearer "+Токен); 
		
		HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=search&limit="+ СтрЗаменить(Строка(Лимит),Символы.НПП,"") +"&limitstart="+ СтрЗаменить(Строка(ЛимитСтарт),Символы.НПП,"") +"&args[categories][]="+СтрЗаменить(Строка(ИдКатегории),Символы.НПП,""),Заголовки);
		
		Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат;
		КонецЕсли; 
		
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
		
		СоотвествиеКатегорий = Результат.Получить("result");
		Пагинация = СоотвествиеКатегорий.Получить("pagination");
		
		МассивПродуктов = СоотвествиеКатегорий.Получить("products");
		
		Сч = 0;
		МассивМодификаций = Новый Массив;
		
		Для Каждого Товар из МассивПродуктов Цикл
			МассивМодификаций.Очистить();
			Если Товар.Получить("hasAttributes") Тогда 
				
				Url = "deps.ua";	
				Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
				
				Заголовки = Новый Соответствие;
				Заголовки.Вставить("Content-Type","application/json"); 
				Заголовки.Вставить("Authorization","Bearer "+Токен); 
				
				HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=item&args[id]="+СтрЗаменить(Строка(Товар.Получить("product_id")), Символы.НПП, ""),Заголовки);
				
				Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
				мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
				
				Если Ответ.КодСостояния <> 200 Тогда
					Возврат;
				КонецЕсли; 
				
				ЧтениеJSON = Новый ЧтениеJSON;                    
				ЧтениеJSON.УстановитьСтроку(мОтвет);
				Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
				
				СоответствиеМодификация = Результат.Получить("result").Получить("product").Получить("product_attribute_datas").Получить("attributeValues");
				
				
				Для Каждого ЭлементСоответствия из СоответствиеМодификация  цикл
					МассивМодификаций = ЭлементСоответствия.Значение;
					Прервать;
				КонецЦикла;;
			КонецЕсли;
			
			ИдНоменклатуры = Товар.Получить("product_id");			
			
			ИдКатегории = СтрЗаменить(Строка(Товар.Получить("category_id")), Символы.НПП, "");
			ИдТовара = СтрЗаменить(Строка(Товар.Получить("product_id")), Символы.НПП, "");
			Артикул = Товар.Получить("manufacturer_code");
			
			НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.Deps.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_Deps_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Deps)));
			
			Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
				
				Если НастройкиКатегории[0].использовать Тогда 
					
					Попытка
						
						Если МассивМодификаций.количество() Тогда 
							
							Для Каждого Модификация из МассивМодификаций Цикл 
								ИдТовара  = СтрЗаменить(Строка(Товар.Получить("product_id")), Символы.НПП, "")+"_"+СтрЗаменить(Модификация.Получить("val_id"),Символы.НПП,"");
								НоменклатурыПоставщика = im_Поставщики_Deps_ПолучитьТоварИнтернетМагазина(ИдТовара, Справочники.im_ПоставщикиИнтернетМагазина.Deps);	
								
								Если НоменклатурыПоставщика.Пустая() Тогда
									НоменклатурыПоставщика = im_Поставщики_Deps_СоздатьОбновитьТовар(ИдТовара, Товар, Неопределено, Артикул,Модификация);
								Иначе						
									im_Поставщики_Deps_СоздатьОбновитьТовар(ИдТовара, Товар, НоменклатурыПоставщика, Артикул,Модификация);
								КонецЕсли;
								
								СтрокаЦен = ТаблицаЦен.Добавить();
								СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
								СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
								СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
								СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
								СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
								Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
									//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
								КонецЕсли;
								
								СтрокаОстатков = ТаблицаОстатков.Добавить();
								СтрокаОстатков.Номенклатура = НоменклатурыПоставщика.ссылка;
								СтрокаОстатков.Остаток      = НоменклатурыПоставщика.Количество;
								
								
								
							КонецЦикла;
							
						Иначе
							
							НоменклатурыПоставщика = im_Поставщики_Deps_ПолучитьТоварИнтернетМагазина(ИдТовара, Справочники.im_ПоставщикиИнтернетМагазина.Deps);
							
							Если НоменклатурыПоставщика.Пустая() Тогда
								НоменклатурыПоставщика = im_Поставщики_Deps_СоздатьОбновитьТовар(ИдТовара, Товар, Неопределено, Артикул);
							Иначе						
								im_Поставщики_Deps_СоздатьОбновитьТовар(ИдТовара, Товар, НоменклатурыПоставщика, Артикул);
							КонецЕсли;
							
							СтрокаЦен = ТаблицаЦен.Добавить();
							СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
							СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
							СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
							СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
							СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
							
							СтрокаОстатков = ТаблицаОстатков.Добавить();
							СтрокаОстатков.Номенклатура = НоменклатурыПоставщика.ссылка;
							СтрокаОстатков.Остаток      = НоменклатурыПоставщика.Количество;
						КонецЕсли;
					Исключение
						Сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Тотал = Тотал - Лимит;
		ЛимитСтарт = ЛимитСтарт + Лимит;
		
	КонецЦикла;
	
КонецПроцедуры

функция im_Поставщики_Deps_СделатьЗапросПокатегориям(Токен, ТекущиеКолвоЭлементов = Неопределено, лимитСтарт = Неопределено, Ид)
	
	Url = "deps.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=product&task=search&limit="+ТекущиеКолвоЭлементов+"&category_id="+Ид+"&args[limitstart]="+лимитСтарт,Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтветНомен 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Новый Массив;	
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтветНомен);
	РезультатНомен = ПрочитатьJSON(ЧтениеJSON,Истина);
	
	Возврат  РезультатНомен
	
КонецФункции

функция im_Поставщики_Deps_ПолучитьКатегории(Токен)
	
	Url = "deps.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/index.php?option=com_jshopping&controller=addon_api&section=category&task=tree", Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтветНомен 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Новый Массив;	
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтветНомен);
	РезультатКатегории = Новый ТаблицаЗначений;
	РезультатКатегории.Колонки.Добавить("id");
	РезультатКатегории.Колонки.Добавить("name");
	РезультатКатегории.Колонки.Добавить("parent_id");
	ЗначениеУзла = "";
	Пока ЧтениеJSON.Прочитать() Цикл
		
		ТипЗначения = ЧтениеJSON.ТипТекущегоЗначения;
		
		Если ТипЗначения = ТипЗначенияJSON.НачалоОбъекта Тогда
			
			Если ЗначениеЗаполнено(ЗначениеУзла)  //возвращает не правильный json. тут должен быть массив, а возвращает как новый объект { }
				И ЗначениеУзла <> "available" 
				И ЗначениеУзла <> "result" 
				И ЗначениеУзла <> "stocks_expected" 
				Тогда
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = ТипЗначенияJSON.НачалоМассива Тогда
		ИначеЕсли ТипЗначения = ТипЗначенияJSON.ИмяСвойства
			ИЛИ ТипЗначения = ТипЗначенияJSON.Строка
			ИЛИ ТипЗначения = ТипЗначенияJSON.Число
			ИЛИ ТипЗначения = ТипЗначенияJSON.Булево
			ИЛИ ТипЗначения = ТипЗначенияJSON.Null Тогда
			
			Значение = ЧтениеJSON.ТекущееЗначение;
			
			Если ЗначениеУзла = "id" Тогда
				НовСтр = РезультатКатегории.Добавить();
				НовСтр.id = СтрЗаменить(Строка(Значение), Символы.НПП, "");
			ИначеЕсли ЗначениеУзла = "name" Тогда
				НовСтр.name = Значение;
			ИначеЕсли ЗначениеУзла = "parent_id" Тогда
				НовСтр.parent_id = СтрЗаменить(Строка(Значение), Символы.НПП, "");
			КонецЕсли;
			
			ЗначениеУзла = ЧтениеJSON.ТекущееЗначение;
			
		КонецЕсли;			
		
	КонецЦикла;
	
	ЧтениеJSON.Закрыть();
	
	Возврат  РезультатКатегории;
	
КонецФункции

Функция im_Поставщики_Deps_СоздатьОбновитьТовар(ID, Товар, ТоварССылка, Артикул,Модификация = Неопределено)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Модификация) Тогда 
		ОбНоменклатура.ID                = ID;
		ОбНоменклатура.Артикул           = Модификация.Получить("ean");
		ОбНоменклатура.Наименование      = Модификация.Получить("value_name");
		ОбНоменклатура.Категория         = im_Поставщики_Deps_ПолучитьКатегориюИнтернетМагазина(СтрЗаменить(Строка(Товар.Получить("category_id")), Символы.НПП, ""), Справочники.im_ПоставщикиИнтернетМагазина.Deps);
		ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.Deps;
		ОбНоменклатура.Бренд             = Товар.Получить("manufacturer").Получить("name");
		ОбНоменклатура.Родитель          = im_Поставщики_Deps_ПолучитьГруппуКатегориюИнтернетМагазина(СтрЗаменить(Строка(Товар.Получить("category_id")), Символы.НПП, ""), Справочники.im_ПоставщикиИнтернетМагазина.Deps, Истина);
		ОбНоменклатура.URL	             = Товар.Получить("manufacturer").Получить("manufacturer_url");       
		ОбНоменклатура.Количество        = ?(Модификация.Получить("custom_status")="В наявності",100,?(Модификация.Получить("custom_status")="Закінчується",50,0));
		ОбНоменклатура.РРЦ               = Модификация.Получить("retail_price");
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
		ОбНоменклатура.ДилерскаяЦена     = Модификация.Получить("price");
		//ОбНоменклатура.ПромоЦена         = "";
		ОбНоменклатура.Модель            = Артикул;
		ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
		
		Если Товар.Получить("image")<>"" Тогда 
			ОбНоменклатура.Изображениия.Очистить();
			
			ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
			ОбКартинка.URL = СтрЗаменить(Товар.Получить("image"),"thumb_","full_");
			
		КонецЕсли;
		
	Иначе
		ОбНоменклатура.ID                = ID;
		ОбНоменклатура.Артикул           = Товар.Получить("product_ean");
		ОбНоменклатура.Наименование      = Товар.Получить("name");
		ОбНоменклатура.Категория         = im_Поставщики_Deps_ПолучитьКатегориюИнтернетМагазина(СтрЗаменить(Строка(Товар.Получить("category_id")), Символы.НПП, ""), Справочники.im_ПоставщикиИнтернетМагазина.Deps);
		ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.Deps;
		ОбНоменклатура.Бренд             = Товар.Получить("manufacturer").Получить("name");
		ОбНоменклатура.Родитель          = im_Поставщики_Deps_ПолучитьГруппуКатегориюИнтернетМагазина(СтрЗаменить(Строка(Товар.Получить("category_id")), Символы.НПП, ""), Справочники.im_ПоставщикиИнтернетМагазина.Deps, Истина);
		ОбНоменклатура.URL	             = Товар.Получить("manufacturer").Получить("manufacturer_url");       
		ОбНоменклатура.Количество        = ?(Товар.Получить("product_quantity")="В наявності",100,?(Товар.Получить("product_quantity")="Закінчується",50,0));
		ОбНоменклатура.РРЦ               = Товар.Получить("retail_price");
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
		ОбНоменклатура.ДилерскаяЦена     = Товар.Получить("product_price");
		//ОбНоменклатура.ПромоЦена         = "";
		ОбНоменклатура.Модель            = Артикул;
		ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
		
		Если Товар.Получить("image")<>"" Тогда 
			ОбНоменклатура.Изображениия.Очистить();
			
			ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
			ОбКартинка.URL = СтрЗаменить(Товар.Получить("image"),"thumb_","full_");
			
		КонецЕсли;
	КонецЕсли;
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции

Процедура ЗагрузкаТоваровDCLINK(Параметр) Экспорт
	im_Поставщики_DCLINK_ЗагрузкаТоваровDCLINK();
КонецПроцедуры

Функция  ПолучитьКартинкиТовараDCLINK(IDТовара,IDСессии)
	
	Url = "cerebro.dclink.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	
	ВремКаталог = КаталогВременныхФайлов();
	имяФайлаОтправки = ВремКаталог + "test.txt";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("/product_pictures/"+IDТовара+"/"+ IDСессии, Заголовки);
	
	HTTPЗапрос.УстановитьИмяФайлаТела(имяФайлаОтправки);
	
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	im_Поставщики_DCLINK_Таймаут();
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Сообщить("Ошибка");
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Попытка
		МассивКартинок = СтруктураОтвета.result;
		Возврат СтруктураОтвета.result;
		
	Исключение
		Возврат новый Массив;
	КонецПопытки;
	
	
	
КонецФункции
//-----------DCLINK


Функция ПреобразованиеМассивВТаблицуЗначений(Массив)

   ТЗ = Новый ТаблицаЗначений;

   Для Каждого СтрокаМассива Из Массив Цикл

       Если ТЗ.Колонки.Количество() = 0 Тогда
           Для Каждого ЭлементМассива Из СтрокаМассива Цикл
               ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
           КонецЦикла;
       КонецЕсли;

       НоваяСтрока = ТЗ.Добавить();
       Для Каждого ЭлементМассива Из СтрокаМассива Цикл
           НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
       КонецЦикла;

   КонецЦикла;

   Возврат ТЗ;

КонецФункции

Процедура im_Поставщики_DCLINK_ЗагрузкаТоваровDCLINK() Экспорт 
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Cerebro");
	
	Url    = СтрПодключение.Адрес;
	ИдентификаторСессии = im_Поставщики_DCLINK_ПолучитьИдентификаторСесии();

	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	
	HTTPЗапрос = Новый HTTPЗапрос("/vendors//"+ ИдентификаторСессии, Заголовки);
	
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
		ИдентификаторСессии = im_Поставщики_DCLINK_ПолучитьИдентификаторСесии();
	КонецЕсли;
	
	ЗначениеУзла = "";
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
	СтруктураПоставщиков = ПрочитатьJSON(ЧтениеJSON);
	
	ТаблицаПоставщиков = ПреобразованиеМассивВТаблицуЗначений(СтруктураПоставщиков.result);
	
	
	
	
	
	ТаблицаОстатков = новый ТаблицаЗначений;
	ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	ТаблицаОстатков.Колонки.Добавить("Остаток");
	
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаПромо", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	тзКатегории = ПолучитьВсеКатегории(Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	
// н
	Товары_BnPrices = im_Поставщики_DCLINK_GetBnPrices();
// к
	
	Для Каждого Категория из тзКатегории Цикл
		ИдентификаторСессии = im_Поставщики_DCLINK_ПолучитьИдентификаторСесии();
		НастройкиКатегории   = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория",Категория.Категория ));
		
		Если НастройкиКатегории[0].использовать Тогда 
			im_Поставщики_DCLINK_Таймаут();
			
			HTTPЗапрос = Новый HTTPЗапрос("/products/" + Категория.categoryID + "/" + ИдентификаторСессии+ "?lang=ua", Заголовки);
			
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			
			мОтвет = СтрЗаменить(мОтвет,"""67"":","""Склад67"":");
			мОтвет = СтрЗаменить(мОтвет,"""382"":","""Склад382"":");
			мОтвет = СтрЗаменить(мОтвет,"""1001"":","""Склад1001"":");
			мОтвет = СтрЗаменить(мОтвет,"""1000"":","""Склад1000"":");
			мОтвет = СтрЗаменить(мОтвет,"""396"":","""Склад396"":");
			мОтвет = СтрЗаменить(мОтвет,"""382"":","""Склад382"":");
			мОтвет = СтрЗаменить(мОтвет,"""396"":","""Склад396"":");
			мОтвет = СтрЗаменить(мОтвет,"""203"":","""Склад203"":");
			
			
			
			Если Ответ.КодСостояния <> 200 Тогда
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);				
			КонецЕсли;
			
			ЗначениеУзла = "";
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
			Структура = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если Структура.Свойство("result") Тогда 
				
// н
				БезНал = Ложь;
// к
				
				Для каждого  Товар Из Структура.result.list Цикл
					
					ИдКатегории = СтрЗаменить(Товар.categoryID,Символы.НПП,"");
					ИдТовара    = СтрЗаменить(Товар.productID,Символы.НПП,"");
					Артикул     = СтрЗаменить(Товар.articul,Символы.НПП,"");
// н
					НайтиБезНал = Товары_BnPrices.Найти(ИдТовара, "Код");
					Если НайтиБезНал <> Неопределено Тогда 
						БезНал = Истина;
					КонецЕсли;
// к
					
					НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_DCLINK_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK)));
					
					Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
						
						Если НастройкиКатегории[0].использовать Тогда 
							
							Попытка
								
								НоменклатурыПоставщика = im_Поставщики_DCLINK_ПолучитьТоварИнтернетМагазина(ИдТовара, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
								
								Если НоменклатурыПоставщика.Пустая() Тогда
									НоменклатурыПоставщика = im_Поставщики_DCLINK_СоздатьОбновитьТовар(ИдТовара, Товар, Неопределено, Артикул,ИдентификаторСессии,ТаблицаПоставщиков, БезНал);
								Иначе						
									im_Поставщики_DCLINK_СоздатьОбновитьТовар(ИдТовара, Товар, НоменклатурыПоставщика, Артикул,ИдентификаторСессии,ТаблицаПоставщиков, БезНал);
								КонецЕсли;
								
								СтрокаЦен = ТаблицаЦен.Добавить();
								СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
								СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
								СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
								СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
								СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
								Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
									СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
								КонецЕсли;
								
								СтрокаОстаток = ТаблицаОстатков.Добавить();
								СтрокаОстаток.Номенклатура = НоменклатурыПоставщика.ссылка; 
								СтрокаОстаток.Остаток = НоменклатурыПоставщика.количество;
								
							Исключение
								ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
				ИдентификаторСессии = im_Поставщики_DCLINK_ПолучитьИдентификаторСесии();
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	

	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	ОбновитьОстатки(ТаблицаОстатков,Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	         |	im_НоменклатураПоставщиков.Ссылка
	         |ИЗ
	         |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	         |ГДЕ
	         |	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	         |	И im_НоменклатураПоставщиков.ДатаОбновления < &ДатаОбновления";
	Запрос.УстановитьПараметр("Поставщик",Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	Запрос.УстановитьПараметр("ДатаОбновления",ТекущаяДата()-24*60*60);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
			
	ТаблицаОстатков = новый ТаблицаЗначений;
	ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	ТаблицаОстатков.Колонки.Добавить("Остаток");

	ТаблицаОстатков.Очистить();
	Для Каждого Строка из РезультатЗапроса Цикл 
		НоменклатураПоставщикаОб 				= Строка.Ссылка.ПолучитьОбъект();
		НоменклатураПоставщикаОб.Количество 	= 0;
		НоменклатураПоставщикаОб.ДатаОбновления = ТекущаяДата();
		НоменклатураПоставщикаОб.Записать();
		
		Если ЗначениеЗаполнено(Строка.ссылка.Номенклатура) Тогда 
			
			СтрокаТаблОстатков = ТаблицаОстатков.Добавить();
			СтрокаТаблОстатков.Номенклатура = Строка.ссылка;
			СтрокаТаблОстатков.Остаток      = 0;
			
		КонецЕсли;

	КонецЦикла;
	ОбновитьОстатки(ТаблицаОстатков,Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);

	
	
	
КонецПроцедуры

Процедура im_Поставщики_DCLINK_ИзмененныеТоварыDCLINK() Экспорт 
	
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Cerebro");
	
	Url    = СтрПодключение.Адрес;
	Логин  = СтрПодключение.Логин;
	Пароль = СтрПодключение.Пароль;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(Пароль);
	
	Пароль     = СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""); 
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	стрАунтефикация = Новый Структура; 
	стрАунтефикация.Вставить("login", Логин);
	стрАунтефикация.Вставить("password", Пароль);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();  
	ЗаписатьJSON(ЗаписьJSON, стрАунтефикация);            
	стрJSON = ЗаписьJSON.Закрыть();
	
	ВремКаталог = КаталогВременныхФайлов();
	
	ФайлОтправки = Новый ЗаписьТекста(ВремКаталог + "test.txt", КодировкаТекста.ANSI);
	ФайлОтправки.Записать(стрJSON);
	ФайлОтправки.Закрыть();
	
	//Размер файла
	имяФайлаОтправки = ВремКаталог + "test.txt"; // файл с отсылаемыми для обработки данными
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("/auth", Заголовки);
	
	HTTPЗапрос.УстановитьИмяФайлаТела(имяФайлаОтправки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "не удалось прочитать JSON");
		ЧтениеJSON.Закрыть();
		Возврат;
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Если Ответ.КодСостояния = 200 Тогда
		ИдентификаторСессии = СтруктураОтвета.result;
	Иначе
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
	КонецЕсли;
	
		Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	
	HTTPЗапрос = Новый HTTPЗапрос("/vendors//"+ ИдентификаторСессии, Заголовки);
	
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
		
	КонецЕсли;
	
	ЗначениеУзла = "";
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
	СтруктураПоставщиков = ПрочитатьJSON(ЧтениеJSON);

	
	
	
	//////
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	
	HTTPЗапрос = Новый HTTPЗапрос("/modified_products//"+ ИдентификаторСессии, Заголовки);
	
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);	
	КонецЕсли;
	
	ЗначениеУзла = "";
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
	СтруктураТоваров = ПрочитатьJSON(ЧтениеJSON);
	
	
	ТаблицаОстатков = новый ТаблицаЗначений;
	ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	ТаблицаОстатков.Колонки.Добавить("Остаток");
	
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаПромо", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
// н
	Товары_BnPrices = im_Поставщики_DCLINK_GetBnPrices();
	БезНал = Ложь;
// к
	
	Для каждого СтрокаТовар из СтруктураТоваров.result.productIDs Цикл 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json");
		
		HTTPЗапрос = Новый HTTPЗапрос("/product/"+СтрЗаменить(СтрокаТовар,Символы.НПП,"")+"/"+ ИдентификаторСессии, Заголовки);
		
		Ответ 	= Соединение.Получить(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			
		мОтвет = СтрЗаменить(мОтвет,"""67"":","""Склад67"":");
		мОтвет = СтрЗаменить(мОтвет,"""382"":","""Склад382"":");
		мОтвет = СтрЗаменить(мОтвет,"""1001"":","""Склад1001"":");
		мОтвет = СтрЗаменить(мОтвет,"""1000"":","""Склад1000"":");
		мОтвет = СтрЗаменить(мОтвет,"""396"":","""Склад396"":");
		мОтвет = СтрЗаменить(мОтвет,"""382"":","""Склад382"":");
		мОтвет = СтрЗаменить(мОтвет,"""396"":","""Склад396"":");
		мОтвет = СтрЗаменить(мОтвет,"""203"":","""Склад203"":");
		Если Ответ.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
			Продолжить;
		КонецЕсли;
		
		ЗначениеУзла = "";
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
		СтруктураПродукта = ПрочитатьJSON(ЧтениеJSON);
		
		Если СтруктураПродукта.status = 1 Тогда 
			
				ИдКатегории = СтрЗаменить(СтруктураПродукта.result.categoryID,Символы.НПП,"");
				ИдТовара    = СтрЗаменить(СтруктураПродукта.result.productID,Символы.НПП,"");
				Артикул     = СтрЗаменить(СтруктураПродукта.result.artikul,Символы.НПП,"");
				
// н
				НайтиБезНал = Товары_BnPrices.Найти(ИдТовара, "Код");
				Если НайтиБезНал <> Неопределено Тогда 
					БезНал = Истина;
				КонецЕсли;
// к
				
				НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_DCLINK_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK)));
				
				Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
					
					Если НастройкиКатегории[0].использовать Тогда 
						
						Попытка
							
							НоменклатурыПоставщика = im_Поставщики_DCLINK_ПолучитьТоварИнтернетМагазина(ИдТовара, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
							
							Если НоменклатурыПоставщика.Пустая() Тогда
								НоменклатурыПоставщика = im_Поставщики_DCLINK_СоздатьОбновитьТовар(ИдТовара, СтруктураПродукта.result, Неопределено, Артикул,ИдентификаторСессии,СтруктураПоставщиков, БезНал);
							Иначе						
								im_Поставщики_DCLINK_СоздатьОбновитьТовар(ИдТовара, СтруктураПродукта.result, НоменклатурыПоставщика, Артикул,ИдентификаторСессии,СтруктураПоставщиков, БезНал);
							КонецЕсли;
							
							СтрокаЦен = ТаблицаЦен.Добавить();
							СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
							СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
							СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
							СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
							СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
							
							СтрокаОстаток = ТаблицаОстатков.Добавить();
							СтрокаОстаток.Номенклатура = НоменклатурыПоставщика.ссылка; 
							СтрокаОстаток.Остаток = НоменклатурыПоставщика.количество;
							
						Исключение
							Сообщить(ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
					
		КонецЕсли;

		
		
		
		//https://cerebro.dclink.ua/product/50416/vm0e2wnomocqddwnba0dalbt2q
		
		
	КонецЦикла;
	////
	
	
	
	
	//ТаблицаОстатков = новый ТаблицаЗначений;
	//ТаблицаОстатков.Колонки.Добавить("Номенклатура");
	//ТаблицаОстатков.Колонки.Добавить("Остаток");
	//
	//ТаблицаЦен = новый ТаблицаЗначений;
	//ТаблицаЦен.Колонки.Добавить("Номенклатура");
	//ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ");
	//ТаблицаЦен.Колонки.Добавить("ЦенаДиллер");
	//ТаблицаЦен.Колонки.Добавить("ЦенаПромо");
	//
	////-----------------Загрузка товаров
	//
	//Товары = Новый ТаблицаЗначений;
	//Товары.Колонки.Добавить("name");
	//Товары.Колонки.Добавить("productID");
	//Товары.Колонки.Добавить("articul");
	//Товары.Колонки.Добавить("vendorID");
	//Товары.Колонки.Добавить("categoryID");
	//Товары.Колонки.Добавить("product_code");
	//Товары.Колонки.Добавить("is_price_cut");
	//Товары.Колонки.Добавить("price");
	//Товары.Колонки.Добавить("price_uah");
	//Товары.Колонки.Добавить("recommendable_price");
	//Товары.Колонки.Добавить("retail_price_uah");
	//Товары.Колонки.Добавить("available");
	//Товары.Колонки.Добавить("full_image");
	//
	//
	//
	//
	//Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	//
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type","application/json");
	//
	//тзКатегории = ПолучитьВсеКатегории(Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	//
	//
	//Для Каждого Категория из тзКатегории Цикл
	//	НастройкиКатегории   = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория",Категория.Категория ));
	//	
	//	Если НастройкиКатегории[0].использовать Тогда 
	//		im_Поставщики_DCLINK_Таймаут();
	//		
	//		HTTPЗапрос = Новый HTTPЗапрос("/products/" + Категория.categoryID + "/" + ИдентификаторСессии+ "?lang=ua", Заголовки);
	//		
	//		Ответ 	= Соединение.Получить(HTTPЗапрос);	
	//		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	//		
	//		мОтвет = СтрЗаменить(мОтвет,"""67"":","""Склад67"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""382"":","""Склад382"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""1001"":","""Склад1001"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""1000"":","""Склад1000"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""396"":","""Склад396"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""382"":","""Склад382"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""396"":","""Склад396"":");
	//		мОтвет = СтрЗаменить(мОтвет,"""203"":","""Склад203"":");
	//		
	//		
	//		
	//		Если Ответ.КодСостояния <> 200 Тогда
	//			ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ЗначениеУзла = "";
	//		
	//		ЧтениеJSON = Новый ЧтениеJSON;
	//		ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
	//		Структура = ПрочитатьJSON(ЧтениеJSON);
	//		ЧтениеJSON.Закрыть();
	//		
	//		
	//		
	//		Для каждого  Товар Из Структура.result.list Цикл
	//			
	//			ИдКатегории = СтрЗаменить(Товар.categoryID,Символы.НПП,"");
	//			ИдТовара    = СтрЗаменить(Товар.productID,Символы.НПП,"");
	//			Артикул     = СтрЗаменить(Товар.articul,Символы.НПП,"");
	//			
	//			НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.DCLINK.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_DCLINK_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK)));
	//			
	//			Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
	//				
	//				Если НастройкиКатегории[0].использовать Тогда 
	//					
	//					Попытка
	//						
	//						НоменклатурыПоставщика = im_Поставщики_DCLINK_ПолучитьТоварИнтернетМагазина(ИдТовара, Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	//						
	//						Если НоменклатурыПоставщика.Пустая() Тогда
	//							НоменклатурыПоставщика = im_Поставщики_DCLINK_СоздатьОбновитьТовар(ИдТовара, Товар, Неопределено, Артикул,ИдентификаторСессии,СтруктураПоставщиков);
	//						Иначе						
	//							im_Поставщики_DCLINK_СоздатьОбновитьТовар(ИдТовара, Товар, НоменклатурыПоставщика, Артикул,ИдентификаторСессии,СтруктураПоставщиков);
	//						КонецЕсли;
	//						
	//						СтрокаЦен = ТаблицаЦен.Добавить();
	//						СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
	//						СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
	//						СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
	//						СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
	//						
	//						СтрокаОстаток = ТаблицаОстатков.Добавить();
	//						СтрокаОстаток.Номенклатура = НоменклатурыПоставщика.ссылка; 
	//						СтрокаОстаток.Остаток = НоменклатурыПоставщика.количество;
	//						
	//					Исключение
	//						Сообщить(ОписаниеОшибки());
	//					КонецПопытки;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
			
			
	//	КонецЕсли;
	//КонецЦикла;	
	//
	
	
	
	
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	ОбновитьОстатки(ТаблицаОстатков,Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);	
// к ЛИВ
	
КонецПроцедуры


Функция ПолучитьВсеКатегории(Поставщик)
	//
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_КатегорииПоставщиковИнтернетМагазина.Родитель
	               |ПОМЕСТИТЬ ПерваяТаблица
	               |ИЗ
	               |	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	im_КатегорииПоставщиковИнтернетМагазина.Ссылка КАК Категория,
	               |	im_КатегорииПоставщиковИнтернетМагазина.IDКатегории КАК categoryID
	               |ПОМЕСТИТЬ Таблица2
	               |ИЗ
	               |	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	               |ГДЕ
	               |	НЕ im_КатегорииПоставщиковИнтернетМагазина.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ПерваяТаблица.Родитель
	               |				ИЗ
	               |					ПерваяТаблица КАК ПерваяТаблица)
	               |	И im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория КАК Категория,
	               |	im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.IDКатегории КАК categoryID
	               |ИЗ
	               |	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	               |ГДЕ
	               |	im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка.Ссылка = &Поставщик
	               |	И im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Использовать
	               |	И im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория В
	               |			(ВЫБРАТЬ
	               |				Таблица2.Категория
	               |			ИЗ
	               |				Таблица2 КАК Таблица2)";
	
	
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	im_НоменклатураПоставщиков.Категория КАК Категория,
	//               |	im_НоменклатураПоставщиков.Категория.IDКатегории КАК categoryID
	//               |ИЗ
	//               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	//               |ГДЕ
	//               |	im_НоменклатураПоставщиков.Бренд = """"
	//               |	И im_НоменклатураПоставщиков.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция im_Поставщики_DCLINK_ПолучитьИдентификаторСесии()
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Cerebro");
	
	Url    = СтрПодключение.Адрес;
	Логин  = СтрПодключение.Логин;
	Пароль = СтрПодключение.Пароль;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(Пароль);
	
	Пароль     = СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""); 
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	стрАунтефикация = Новый Структура; 
	стрАунтефикация.Вставить("login", Логин);
	стрАунтефикация.Вставить("password", Пароль);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();  
	ЗаписатьJSON(ЗаписьJSON, стрАунтефикация);            
	стрJSON = ЗаписьJSON.Закрыть();
	
	ВремКаталог = КаталогВременныхФайлов();
	
	ФайлОтправки = Новый ЗаписьТекста(ВремКаталог + "test.txt", КодировкаТекста.ANSI);
	ФайлОтправки.Записать(стрJSON);
	ФайлОтправки.Закрыть();
	
	//Размер файла
	имяФайлаОтправки = ВремКаталог + "test.txt"; // файл с отсылаемыми для обработки данными
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("/auth", Заголовки);
	
	HTTPЗапрос.УстановитьИмяФайлаТела(имяФайлаОтправки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "не удалось прочитать JSON");
		ЧтениеJSON.Закрыть();
		Возврат "";
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Если Ответ.КодСостояния = 200 Тогда
		ИдентификаторСессии = СтруктураОтвета.result;
	Иначе
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
	КонецЕсли;
	
	Возврат ИдентификаторСессии;
КонецФункции// к ЛИВ

Процедура ЗагрузкаТоваровRenklod(Параметр) Экспорт
		
	Url = "b2b.renklod.com.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("/uk/inner/cabinet/download/B9QRYN81XDZGSYCF",Заголовки);
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;
	КонецЕсли; 
	
	//Файл = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Попытка
		Файл = Ответ.ПолучитьТелоКакДвоичныеДанные();
		КаталогДляРаспаковки = КаталогВременныхФайлов();
	    ИмяФайла = "Renklod.zip";
		ПолноеИмяФайла = КаталогДляРаспаковки + ИмяФайла;
		Файл.Записать(ПолноеИмяФайла);
	Исключение
		Возврат;
	КонецПопытки;	
	
	
	ФайлХМЛ = im_Поставщики_Renklod_РаспаковатьZipФайл(ПолноеИмяФайла);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлХМЛ);
	XDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	ТЗКатегории = Новый ТаблицаЗначений;
	ТЗКатегории.Колонки.Добавить("categoryID");
	ТЗКатегории.Колонки.Добавить("parentId");
	ТЗКатегории.Колонки.Добавить("name");

	Для Каждого Категория Из XDTO.shop.categories.category Цикл
		нстр = ТЗКатегории.Добавить();
		Для Каждого стр Из Категория.Свойства() Цикл
		    Если стр.Имя = "id" Тогда
				нстр.categoryID = Категория.id;
			КонецЕсли;
		    Если стр.Имя = "parentId" Тогда
				нстр.parentId = Категория.parentId;
			КонецЕсли;
			нстр.name = Категория.Последовательность().ПолучитьТекст(0);
		КонецЦикла;
	КонецЦикла;	
	
// н Категории
	КатегорииОтборЗагрузка = im_Поставщики_Renklod_ПолучитьКатегориДляТоваровСКодом(Справочники.im_ПоставщикиИнтернетМагазина.Renklod);
// к Категории
	
	Для каждого  Категория Из ТЗКатегории Цикл
		
		ИдКатегории = Категория.categoryID;
		НаименованиеКатегории = Категория.name;

		Если ЗначениеЗаполнено(Категория.parentid) Тогда
			ИдРодитель = Категория.parentid;
		Иначе
			ИдРодитель = "";
		КонецЕсли;
		
// н Категории
		Если КатегорииОтборЗагрузка.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		НайтиКатегорию = КатегорииОтборЗагрузка.Найти(ИдКатегории, "КатегорияIDКатегории");
		Если НайтиКатегорию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
// к Категории
		
		Если Не ЗначениеЗаполнено(ИдРодитель) Тогда
			//КорневаяПапка = Справочники.im_НоменклатураПоставщиков.НайтиПоНаименованию("Renklod");	
			КорневаяПапка = im_Поставщики_Renklod_ПолучитьГруппуКатегориюИнтернетМагазина("Renklod_Api", Справочники.im_ПоставщикиИнтернетМагазина.Renklod, Истина); 
		Иначе
			КорневаяПапка = im_Поставщики_Renklod_ПолучитьГруппуКатегориюИнтернетМагазина(ИдРодитель, Справочники.im_ПоставщикиИнтернетМагазина.Renklod, Истина);	
		КонецЕсли;

		СсылкаНаКатегорию     = im_Поставщики_Renklod_ПолучитьГруппуКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Renklod, Истина);
		
		Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
			КатегорияСправочник = Справочники.im_НоменклатураПоставщиков.СоздатьГруппу();
			КатегорияСправочник.ID = ИдКатегории;
			КатегорияСправочник.Наименование = НаименованиеКатегории;
			КатегорияСправочник.Родитель     = КорневаяПапка;
			КатегорияСправочник.Поставщик    = Справочники.im_ПоставщикиИнтернетМагазина.Renklod;
			КатегорияСправочник.Записать();
		Иначе
			КатегорияСправочник					= СсылкаНаКатегорию.ПолучитьОбъект();
			КатегорияСправочник.ID				= ИдКатегории;
			КатегорияСправочник.Наименование	= НаименованиеКатегории;
			КатегорияСправочник.Родитель		= КорневаяПапка;
			КатегорияСправочник.Поставщик		= Справочники.im_ПоставщикиИнтернетМагазина.Renklod;
			КатегорияСправочник.Записать();

		КонецЕсли;

	КонецЦикла;
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Наименование");
	Товары.Колонки.Добавить("Артикул");
	Товары.Колонки.Добавить("ID");
	Товары.Колонки.Добавить("Бренд");
	Товары.Колонки.Добавить("Категория");
	Товары.Колонки.Добавить("URL");
	Товары.Колонки.Добавить("ДилерскаяЦена");
	Товары.Колонки.Добавить("РРЦ");
	Товары.Колонки.Добавить("ПромоЦена");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("Модель");
	Товары.Колонки.Добавить("АкционнаяЦена");
	Товары.Колонки.Добавить("ДатаНачалаАкции");
	Товары.Колонки.Добавить("ДатаОкончанияАкции");
	Товары.Колонки.Добавить("Штрихкод");
	Товары.Колонки.Добавить("Картинки");	
	Товары.Колонки.Добавить("Картинка");
	
	Для Каждого Товар Из XDTO.shop.offers.offer Цикл
		нстр = Товары.Добавить();
		нстр.Количество = 0;
		масКартинки = Новый Массив;
		нстр.Картинки = масКартинки;
		Для Каждого стр Из Товар.Свойства() Цикл
			Если стр.Имя = "id" Тогда
				нстр.ID = Товар.id;
			КонецЕсли;
			Если стр.Имя = "available" Тогда
				Если Товар.available = "" ИЛИ Товар.available = "0" Тогда
					нстр.Количество = 0;
				ИначеЕсли Товар.available = ">10" Тогда	
					нстр.Количество = 10;
				иначе	
					нстр.Количество = Товар.available;
				КонецЕсли;	
			КонецЕсли;
			Если стр.Имя = "categoryId" Тогда
				нстр.Категория = im_Поставщики_Renklod_ПолучитьКатегориюИнтернетМагазина(Товар.categoryID, Справочники.im_ПоставщикиИнтернетМагазина.Renklod);
			КонецЕсли;
			Если стр.Имя = "vendorCode" Тогда
				нстр.Артикул = Товар.vendorCode;
			КонецЕсли;
			Если стр.Имя = "name" Тогда
				нстр.Наименование = Товар.name;
				нстр.Модель = Товар.name;
			КонецЕсли;
			Если стр.Имя = "vendor" Тогда
				нстр.Бренд = Товар.vendor;
			КонецЕсли;
			Если стр.Имя = "price" Тогда
				нстр.РРЦ = Товар.price.Последовательность().ПолучитьТекст(0);
			КонецЕсли;
			Если стр.Имя = "picture" Тогда
				Если ТипЗнч(Товар.picture) = Тип("СписокXDTO") Тогда
					Для Каждого стрКартинок Из Товар.picture Цикл
						нстр.Картинки.Добавить(стрКартинок);
					КонецЦикла;	
				Иначе
					нстр.Картинки.Добавить(Товар.picture);
				КонецЕсли;
			КонецЕсли;
			Если стр.Имя = "wholesalePrice" Тогда
				нстр.ДилерскаяЦена = Товар.wholesalePrice.Последовательность().ПолучитьТекст(0)
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	Сч = 0;
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	//ТаблицаЦен.Колонки.Добавить("ЦенаПромо");
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	Для каждого  Товар Из Товары Цикл
		
		Если ЗначениеЗаполнено(Товар.Категория) Тогда  
			ИдКатегории = Товар.Категория.IDКатегории;
		Иначе	
			Продолжить;
		КонецЕсли;	
		ИдТовара = "";
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.Renklod.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_Renklod_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Renklod)));
		
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
			
			Если НастройкиКатегории[0].использовать Тогда 
				
				Попытка
					
					НоменклатурыПоставщика = ПолучитьНоменклатуруИнтернетМагазина(Товар.ID, Справочники.im_ПоставщикиИнтернетМагазина.Renklod, Ложь);
					
					Если НоменклатурыПоставщика.Пустая() Тогда
						НоменклатурыПоставщика = im_Поставщики_Renklod_СоздатьОбновитьТоварRenklod(ИдТовара, Товар, Неопределено);
					Иначе						
						im_Поставщики_Renklod_СоздатьОбновитьТоварRenklod(ИдТовара, Товар, НоменклатурыПоставщика);
					КонецЕсли;
					
					СтрокаЦен = ТаблицаЦен.Добавить();
					СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
					СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
					СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
					СтрокаЦен.ЦенаДиллер   = НоменклатурыПоставщика.ДилерскаяЦена;
					Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
						//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
					КонецЕсли;

					//СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
					
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.Renklod);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.Renklod);	
// к ЛИВ
	
КонецПроцедуры

Функция im_Поставщики_Renklod_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Renklod_ПолучитьИспользованиеКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	//|ИЗ
	//|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	//|ГДЕ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	//|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	//Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	//Запрос.УстановитьПараметр("Поставщик",Поставщик);
	//
	//результатЗапроса = запрос.Выполнить().Выгрузить();
	//
	//Если результатЗапроса.Количество() Тогда 
	//	Возврат результатЗапроса[0].ссылка; 
	//КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Renklod_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_НоменклатураПоставщиков.Ссылка
	               |ИЗ
	               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |ГДЕ
	               |	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	               |	И im_НоменклатураПоставщиков.ID = &IDКатегории
	               |	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Renklod_СоздатьОбновитьТоварRenklod(ID, Товар, ТоварССылка)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	ОбНоменклатура.ID                = Товар.ID;
	ОбНоменклатура.Артикул           = Товар.Артикул;
	ОбНоменклатура.Наименование      = Товар.Наименование;
	ОбНоменклатура.Категория         = Товар.Категория;
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.Renklod;
	ОбНоменклатура.Бренд             = Товар.Бренд;
	ОбНоменклатура.Родитель          = im_Поставщики_Renklod_ПолучитьГруппуКатегориюИнтернетМагазина(Товар.Категория.IDКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Renklod, Истина);
	ОбНоменклатура.URL	             = "";
	
	//Если ЗначениеЗаполнено(Товар.Картинка) Тогда
	//	ОбНоменклатура.Изображениия.Очистить();
	//	ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
	//	ОбКартинка.URL = Товар.Картинка;
	//КонецЕсли;
	
	ОбНоменклатура.Изображениия.Очистить();
	Если Товар.Картинки.Количество() > 0 Тогда
		Для каждого Картинка из Товар.Картинки Цикл 
			ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
			ОбКартинка.URL = Картинка;
		КонецЦикла;
	//Иначе
	//	Если ЗначениеЗаполнено(Товар.Картинка) Тогда
	//		ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
	//		ОбКартинка.URL = Товар.Картинка;
	//	КонецЕсли;		
	КонецЕсли;
	
	ОбНоменклатура.Количество        = Товар.Количество;
	ОбНоменклатура.ДилерскаяЦена     = Товар.ДилерскаяЦена;
	ОбНоменклатура.РРЦ               = Товар.РРЦ;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
	ОбНоменклатура.Модель            = Товар.Модель;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции


Функция im_Поставщики_Renklod_РаспаковатьZipФайл(ИмяФайлаДляРаспаковки)
	
	КаталогДляРаспаковки = КаталогВременныхФайлов();
	
	ИмяРаспакованногоФайла = "";
	
	Попытка
		
		//Архиватор = Новый ЧтениеZipФайла(ИмяФайлаДляРаспаковки, ПарольДляРаспаковкиФайлаОбмена);
		Архиватор = Новый ЧтениеZipФайла(ИмяФайлаДляРаспаковки, "");
		
		Если Архиватор.Элементы.Количество() > 0 Тогда
			
			Архиватор.Извлечь(Архиватор.Элементы[0], КаталогДляРаспаковки, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ИмяРаспакованногоФайла = im_Поставщики_Renklod_ПолучитьИмяФайлаОбмена(КаталогДляРаспаковки, Архиватор.Элементы[0].Имя);
			
		Иначе
			
			ИмяРаспакованногоФайла = "";	
			
		КонецЕсли;

		Архиватор.Закрыть();
	
	Исключение
		
		Возврат "";
							
	КонецПопытки;
	
	Возврат ИмяРаспакованногоФайла;
		
КонецФункции

Функция im_Поставщики_Renklod_ПолучитьИмяФайлаОбмена(ИмяКаталога, ИмяФайла) 

	Если Не ПустаяСтрока(ИмяФайла) Тогда
		
		Возврат ИмяКаталога + ?(Прав(ИмяКаталога, 1) = "\", "", "\") + ИмяФайла;	
		
	Иначе
		
		Возврат ИмяКаталога;
		
	КонецЕсли;

КонецФункции

Функция im_Поставщики_Renklod_ПолучитьКатегориДляТоваровСКодом(Поставщик)

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Категории.Категория,
	               |	Категории.Категория.IDКатегории
	               |ИЗ
	               |	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	               |ГДЕ
	               |	НЕ Категории.Категория В
	               |				(ВЫБРАТЬ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	               |				ИЗ
	               |					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	               |				ГДЕ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	               |	И Категории.Использовать = ИСТИНА
	               |	И Категории.Категория.Поставщик = &Поставщик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;

КонецФункции




Процедура ЗагрузкаТоваровERC(Параметр) Экспорт
	Url = "connect.erc.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json"); 
	HTTPЗапрос = Новый HTTPЗапрос("/connectservice/api/SpecPrice/GetCategories",Заголовки);
	ТекстОтправки = "{""Email"":""vs@vechir.ua"", ""Pass"": ""44700"", ""lang"": ""ua-uk""}";
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстОтправки);
	Ответ 	= Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);;	
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;
	КонецЕсли; 
	
	мОтвет = Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
	
	ТЗКатегории = Новый ТаблицаЗначений;
	ТЗКатегории.Колонки.Добавить("categoryName");
	ТЗКатегории.Колонки.Добавить("categoryID");
	ТЗКатегории.Колонки.Добавить("parentid");
	ТЗКатегории.Колонки.Добавить("Quantity");
	
	
	Для Каждого стр Из Результат.Получить("Data") Цикл
		
		нстр  = ТЗКатегории.Добавить();
		нстр.categoryName = стр.Получить("Name");
		нстр.categoryID = стр.Получить("ID");
		нстр.Quantity = СтрЧислоВхождений(стр.Получить("ID"), ".");
		нстр.parentid = "";
		Если СтрЧислоВхождений(нстр.categoryID, ".") > 0 Тогда
			СтрПоиска = нстр.categoryID;
			ДлинаСтроки = СтрДлина(СтрПоиска);
			Если ДлинаСтроки > 2 Тогда
				СтрПоиска = Лев(СтрПоиска, ДлинаСтроки - 3);
				нстр.parentid = СтрПоиска;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	ТЗКатегории.Сортировать("Quantity");
	
// н Категории
	КатегорииОтборЗагрузка = im_Поставщики_ERC_ПолучитьКатегориДляТоваровСКодом(Справочники.im_ПоставщикиИнтернетМагазина.ERC);
// к Категории

	Для каждого  Категория Из ТЗКатегории Цикл
		
		ИдКатегории = Категория.categoryID;
		НаименованиеКатегории = Категория.categoryName;

		Если ЗначениеЗаполнено(Категория.parentid) Тогда
			ИдРодитель = Категория.parentid;
		Иначе
			ИдРодитель = "";
		КонецЕсли;
		
// н Категории
		Если КатегорииОтборЗагрузка.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		НайтиКатегорию = КатегорииОтборЗагрузка.Найти(ИдКатегории, "КатегорияIDКатегории");
		Если НайтиКатегорию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
// к Категории
		
		Если Не ЗначениеЗаполнено(ИдРодитель) Тогда
			КорневаяПапка = im_Поставщики_ERC_ПолучитьГруппуКатегориюИнтернетМагазина("ERC_Api", Справочники.im_ПоставщикиИнтернетМагазина.ERC, Истина); 
		Иначе
			КорневаяПапка = im_Поставщики_ERC_ПолучитьГруппуКатегориюИнтернетМагазина(ИдРодитель, Справочники.im_ПоставщикиИнтернетМагазина.ERC, Истина);	
		КонецЕсли;

		СсылкаНаКатегорию     = im_Поставщики_ERC_ПолучитьГруппуКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.ERC, Истина);
		
		Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
			КатегорияСправочник = Справочники.im_НоменклатураПоставщиков.СоздатьГруппу();
			КатегорияСправочник.ID = ИдКатегории;
			КатегорияСправочник.Наименование = НаименованиеКатегории;
			КатегорияСправочник.Родитель     = КорневаяПапка;
			КатегорияСправочник.Поставщик    = Справочники.im_ПоставщикиИнтернетМагазина.ERC;
			КатегорияСправочник.Записать();
		Иначе
			КатегорияСправочник					= СсылкаНаКатегорию.ПолучитьОбъект();
			КатегорияСправочник.ID				= ИдКатегории;
			КатегорияСправочник.Наименование	= НаименованиеКатегории;
			КатегорияСправочник.Родитель		= КорневаяПапка;
			КатегорияСправочник.Поставщик		= Справочники.im_ПоставщикиИнтернетМагазина.ERC;
			КатегорияСправочник.Записать();

		КонецЕсли;

	КонецЦикла;
	
	Категории = im_Поставщики_ERC_ПолучитьКатегориДляТоваров(Справочники.im_ПоставщикиИнтернетМагазина.ERC);
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Наименование");
	Товары.Колонки.Добавить("Артикул");
	Товары.Колонки.Добавить("ID");
	Товары.Колонки.Добавить("Бренд");
	Товары.Колонки.Добавить("Категория");
	Товары.Колонки.Добавить("URL");
	Товары.Колонки.Добавить("ДилерскаяЦена");
	Товары.Колонки.Добавить("РРЦ");
	Товары.Колонки.Добавить("ПромоЦена");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("Модель");
	Товары.Колонки.Добавить("АкционнаяЦена");
	Товары.Колонки.Добавить("ДатаНачалаАкции");
	Товары.Колонки.Добавить("ДатаОкончанияАкции");
	Товары.Колонки.Добавить("Штрихкод");
	Товары.Колонки.Добавить("Картинка");
	Товары.Колонки.Добавить("ТоварПоставщика");
	
	Для Каждого Категория Из Категории Цикл
		
		Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json"); 
		HTTPЗапрос = Новый HTTPЗапрос("/connectservice/api/SpecPrice/DoExport",Заголовки);
		ИдКатегории = Категория.Категория.IDКатегории;
		ТекстОтправки = "{""Email"":""vs@vechir.ua"", ""Pass"": ""44700"", ""IsJson"": ""true"", ""Infotype"": 6, ""CategoryId"": """+ИдКатегории+""", ""lang"": ""ua-uk""}";
		HTTPЗапрос.УстановитьТелоИзСтроки(ТекстОтправки);
		Ответ 	= Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);;	
		
		Если Ответ.КодСостояния <> 200 Тогда
			Продолжить;
		КонецЕсли; 
		
		мОтвет = Ответ.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
			
		
		Для Каждого стр Из Результат Цикл
			
			нстр = Товары.Добавить();
			нстр.Наименование = стр.Получить("gname");
			нстр.Артикул = стр.Получить("code");
			нстр.ID = стр.Получить("code");
			нстр.Бренд = стр.Получить("vendor");
			нстр.Категория = im_Поставщики_ERC_ПолучитьКатегориюИнтернетМагазина(стр.Получить("subCategoryId"), Справочники.im_ПоставщикиИнтернетМагазина.ERC);
			нстр.URL = "";
			нстр.ДилерскаяЦена = "";
			нстр.РРЦ = стр.Получить("RRP_UAH");
			нстр.ПромоЦена = 0;
			нстр.Модель = стр.Получить("code");
			нстр.АкционнаяЦена = "";
			нстр.ДатаНачалаАкции = "";
			нстр.ДатаОкончанияАкции = "";
			нстр.Штрихкод = "";
			нстр.Картинка = стр.Получить("pic");
			нстр.Количество = 0;
			
			Если ТипЗнч(стр.Получить("whs")) = Тип("Массив") Тогда
				Для Каждого стрСклад Из стр.Получить("whs") Цикл
					стрКоличество = стрСклад.Получить("q"); 
					Если стрКоличество <> "0" Тогда
						Если СтрДлина(стрКоличество) > 1 И Лев(стрКоличество, 1) = ">" Тогда 
							Попытка
								нстр.Количество = нстр.Количество + Число(Прав(стрКоличество, СтрДлина(стрКоличество)-1));
							Исключение
							КонецПопытки;
						Иначе 	
							Попытка
								нстр.Количество = нстр.Количество + Число(стрКоличество);
							Исключение
							КонецПопытки;
						КонецЕсли;	
					КонецЕсли;
			    КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Сч = 0;
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	//ТаблицаЦен.Колонки.Добавить("ЦенаПромо");
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	Токен = im_Поставщики_ERC_ПолучитьТокен();
	
// н ЛИВ
	Товары.Свернуть("Наименование,Артикул,ID,Бренд,Категория,URL,ДилерскаяЦена,РРЦ,ПромоЦена,Количество,Модель,АкционнаяЦена,ДатаНачалаАкции,ДатаОкончанияАкции,Штрихкод,Картинка,ТоварПоставщика");
// к ЛИВ

	Для каждого  Товар Из Товары Цикл
		
		ИдКатегории = Товар.Категория.IDКатегории;
		ИдТовара = "";
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.ERC.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_ERC_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.ERC)));
		
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
			
			Если НастройкиКатегории[0].использовать Тогда 
				
				Попытка
					
					НоменклатурыПоставщика = ПолучитьНоменклатуруИнтернетМагазина(Товар.ID, Справочники.im_ПоставщикиИнтернетМагазина.ERC, Ложь);
					
					Если НоменклатурыПоставщика.Пустая() Тогда
// н ЛИВ
						НоменклатурыПоставщика = im_Поставщики_ERC_СоздатьОбновитьТоварERC(ИдТовара, Товар, Неопределено, Токен);
// к ЛИВ
					Иначе						
// н ЛИВ
						im_Поставщики_ERC_СоздатьОбновитьТоварERC(ИдТовара, Товар, НоменклатурыПоставщика, Токен);
// к ЛИВ
					КонецЕсли;
// н ЛИВ
					Товар.ТоварПоставщика = НоменклатурыПоставщика;
// к ЛИВ
					СтрокаЦен = ТаблицаЦен.Добавить();
					СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
					СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
					СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
					СтрокаЦен.ЦенаДиллер   = 0;
					////СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
					Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
									//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
								КонецЕсли;
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.ERC);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.ERC);	
// к ЛИВ

	////Токен = im_Поставщики_ERC_ПолучитьТокен();

	////Для каждого  Товар Из Товары Цикл
	////	
	////	
	////	ИдКатегории = Товар.Категория.IDКатегории;
	////	ИдТовара = "";
	////	НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.ERC.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_ERC_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.ERC)));
	////	
	////	Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
	////		
	////		Если НастройкиКатегории[0].использовать Тогда 
	////			
	////			Попытка
	////				
	////				Если ЗначениеЗаполнено(Товар.ТоварПоставщика) Тогда
	////					НоменклатурыПоставщика = Товар.ТоварПоставщика;
	////					Если НоменклатурыПоставщика.ДатаДобавления + 10*60*60 <> НоменклатурыПоставщика.ДатаОбновления Тогда
	////						Если НоменклатурыПоставщика.Пустая() Тогда
	////							НоменклатурыПоставщика = im_Поставщики_ERC_СоздатьОбновитьТоварERC(ИдТовара, Товар, Неопределено, Токен);
	////						Иначе						
	////							im_Поставщики_ERC_СоздатьОбновитьТоварERC(ИдТовара, Товар, НоменклатурыПоставщика, Токен);
	////						КонецЕсли;
	////					КонецЕсли;
	////				КонецЕсли;
	////				
	////			Исключение
	////				Сообщить(ОписаниеОшибки());
	////			КонецПопытки;
	////		КонецЕсли;
	////	КонецЕсли;
	////КонецЦикла;

КонецПроцедуры

Функция im_Поставщики_ERC_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_ERC_ПолучитьИспользованиеКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	//|ИЗ
	//|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	//|ГДЕ
	//|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	//|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	//Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	//Запрос.УстановитьПараметр("Поставщик",Поставщик);
	//
	//результатЗапроса = запрос.Выполнить().Выгрузить();
	//
	//Если результатЗапроса.Количество() Тогда 
	//	Возврат результатЗапроса[0].ссылка; 
	//КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_ERC_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	im_НоменклатураПоставщиков.Ссылка
	               |ИЗ
	               |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |ГДЕ
	               |	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	               |	И im_НоменклатураПоставщиков.ID = &IDКатегории
	               |	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_ERC_СоздатьОбновитьТоварERC(ID, Товар, ТоварССылка, Токен)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
		
		// Картинки
		Картинки = Новый Массив;
		Артикул = Товар.Артикул;
		Страниц = 1;
	    НомерСтраницы = 1;
		
		Если ЗначениеЗаполнено(Токен) Тогда 
		      im_Поставщики_ERC_ПолучитьКартинки(Токен, НомерСтраницы, Страниц, Артикул, Картинки);
		КонецЕсли;
		
		ОбНоменклатура.Изображениия.Очистить();
		Если Картинки.Количество() > 0 Тогда
			Для каждого Картинка из Картинки Цикл 
				ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
				ОбКартинка.URL = Картинка;
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(Товар.Картинка) Тогда
				ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
				ОбКартинка.URL = Товар.Картинка;
			КонецЕсли;		
		КонецЕсли;
	
	КонецЕсли;
	
	ОбНоменклатура.ID                = Товар.ID;
	ОбНоменклатура.Артикул           = Товар.Артикул;
	ОбНоменклатура.Наименование      = Товар.Наименование;
	ОбНоменклатура.Категория         = Товар.Категория;
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.ERC;
	ОбНоменклатура.Бренд             = Товар.Бренд;
	ОбНоменклатура.Родитель          = im_Поставщики_ERC_ПолучитьГруппуКатегориюИнтернетМагазина(Товар.Категория.IDКатегории, Справочники.im_ПоставщикиИнтернетМагазина.ERC, Истина);
	ОбНоменклатура.URL	             = "";
	//ОбНоменклатура.Изображениия.Очистить();
	
	////// Картинки
	////Картинки = Новый Массив;
	////Артикул = ОбНоменклатура.Артикул;
	////Страниц = 1;
	////НомерСтраницы = 1;
	////
	////Если ЗначениеЗаполнено(Токен) Тогда 
	////      im_Поставщики_ERC_ПолучитьКартинки(Токен, НомерСтраницы, Страниц, Артикул, Картинки);
	////КонецЕсли;
	////
	////ОбНоменклатура.Изображениия.Очистить();
	////Если Картинки.Количество() > 0 Тогда
	////	Для каждого Картинка из Картинки Цикл 
	////		ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
	////		ОбКартинка.URL = Картинка;
	////	КонецЦикла;
	////Иначе
	////	Если ЗначениеЗаполнено(Товар.Картинка) Тогда
	////		ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
	////		ОбКартинка.URL = Товар.Картинка;
	////	КонецЕсли;		
	////КонецЕсли;

	ОбНоменклатура.Количество        = Товар.Количество;
	ОбНоменклатура.РРЦ               = Товар.РРЦ;
////// н ЛИВ
////	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
////	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
////	//КонецЕсли;
////// к ЛИВ
	ОбНоменклатура.Модель            = Товар.Модель;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции

Функция im_Поставщики_ERC_СоздатьОбновитьТоварERC_БезКартинок(ID, Товар, ТоварССылка, Токен)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	ОбНоменклатура.ID                = Товар.ID;
	ОбНоменклатура.Артикул           = Товар.Артикул;
	ОбНоменклатура.Наименование      = Товар.Наименование;
	ОбНоменклатура.Категория         = Товар.Категория;
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.ERC;
	ОбНоменклатура.Бренд             = Товар.Бренд;
	ОбНоменклатура.Родитель          = im_Поставщики_ERC_ПолучитьГруппуКатегориюИнтернетМагазина(Товар.Категория.IDКатегории, Справочники.im_ПоставщикиИнтернетМагазина.ERC, Истина);
	ОбНоменклатура.URL	             = "";
	//ОбНоменклатура.Изображениия.Очистить();
	
	// Картинки
	Картинки = Новый Массив;
	Артикул = ОбНоменклатура.Артикул;
	Страниц = 1;
    НомерСтраницы = 1;
	
// н ЛИВ	
	////Если ЗначениеЗаполнено(Токен) Тогда 
	////      im_Поставщики_ERC_ПолучитьКартинки(Токен, НомерСтраницы, Страниц, Артикул, Картинки);
	////КонецЕсли;
	////
	////ОбНоменклатура.Изображениия.Очистить();
	////Если Картинки.Количество() > 0 Тогда
	////	Для каждого Картинка из Картинки Цикл 
	////		ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
	////		ОбКартинка.URL = Картинка;
	////	КонецЦикла;
	////Иначе
	////	Если ЗначениеЗаполнено(Товар.Картинка) Тогда
	////		ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
	////		ОбКартинка.URL = Товар.Картинка;
	////	КонецЕсли;		
	////КонецЕсли;
// к ЛИВ

	ОбНоменклатура.Количество        = Товар.Количество;
	ОбНоменклатура.РРЦ               = Товар.РРЦ;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
	ОбНоменклатура.Модель            = Товар.Модель;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции

Функция im_Поставщики_ERC_ПолучитьКатегориДляТоваров(Поставщик)

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Категории.Категория
	               |ИЗ
	               |	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	               |ГДЕ
	               |	НЕ Категории.Категория В
	               |				(ВЫБРАТЬ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	               |				ИЗ
	               |					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	               |				ГДЕ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	               |	И Категории.Использовать = ИСТИНА
	               |	И Категории.Категория.Поставщик = &Поставщик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;

КонецФункции

Функция im_Поставщики_ERC_ПолучитьКатегориДляТоваровСКодом(Поставщик)

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Категории.Категория,
	               |	Категории.Категория.IDКатегории
	               |ИЗ
	               |	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	               |ГДЕ
	               |	НЕ Категории.Категория В
	               |				(ВЫБРАТЬ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	               |				ИЗ
	               |					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	               |				ГДЕ
	               |					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	               |	И Категории.Использовать = ИСТИНА
	               |	И Категории.Категория.Поставщик = &Поставщик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;

КонецФункции

Процедура im_Поставщики_ERC_ПолучитьКартинки(Токен, НомерСтраницы, Страниц, Артикул, Картинки)
	
	Url = "api.erc.ua";
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json"); 
	Заголовки.Вставить("X-AUTH-TOKEN", Токен); 
		
	HTTPЗапрос = Новый HTTPЗапрос("/v1/ware/images/sku/"+Артикул+"?page="+Строка(НомерСтраницы), Заголовки);
	Попытка
		Ответ 	= Соединение.Получить(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат;
		КонецЕсли; 
		
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON,Истина);

		Если ТипЗнч(Результат) = Тип("Соответствие") Тогда 
			
			pagination = Результат.Получить("pagination");
			Если pagination <> Неопределено Тогда 
				
				Тотал = pagination.Получить("total");
				ЛимитНаСтранице = pagination.Получить("limit");
				Если ЛимитНаСтранице > 0 Тогда
					
					Если Тотал / ЛимитНаСтранице = Цел(Тотал / ЛимитНаСтранице) Тогда
						Страниц = Тотал / ЛимитНаСтранице;
					Иначе
					    Страниц = Цел(Тотал / ЛимитНаСтранице) + 1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			content = Результат.Получить("content");
			Если content <> Неопределено И ТипЗнч(content) = Тип("Массив")  Тогда 
				Для Каждого стр Из content Цикл
					Картинки.Добавить(стр.Получить("src"));
				КонецЦикла;
			КонецЕсли;							
			
		КонецЕсли;	
		
		Если НомерСтраницы < Страниц Тогда
			НомерСтраницы = НомерСтраницы + 1;
			im_Поставщики_ERC_ПолучитьКартинки(Токен, НомерСтраницы, Страниц, Артикул, Картинки);
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

Функция im_Поставщики_ERC_ПолучитьТокен()
	
	Токен = "";
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("ERC");
	Логин  = СтрПодключение.Логин;
	Пароль = СтрПодключение.Пароль;
	Url = "api.erc.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("/v1/auth", Заголовки);
	Username = Логин;
	Password = Пароль;
		
	ВремГраница = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ТелоЗапроса = Новый ТекстовыйДокумент();
	ТелоЗапроса.РазделительСтрок = Символы.CR + Символы.LF;
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""username"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Username);

	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""password"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Password);
		
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница + "--");

	ТелоЗапросаСтрока = ТелоЗапроса.ПолучитьТекст();
	
	HTTPЗапрос.Заголовки["Content-Type"] = "multipart/form-data; boundary=" + ВремГраница;
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

    // Отправляем
	Попытка
		Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			//Возврат Токен;
		КонецЕсли; 
		
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON);
		
		Если Результат.Свойство("token") Тогда
			Токен = Результат.token;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Токен;
	
КонецФункции	

Процедура im_Поставщики_ПроверкаНепришедшихТоваров(Поставщик)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	         |	im_НоменклатураПоставщиков.Ссылка
	         |ИЗ
	         |	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	         |ГДЕ
	         |	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	         |	И im_НоменклатураПоставщиков.ДатаОбновления < &ДатаОбновления";
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("ДатаОбновления", ТекущаяДата()-24*60*60);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
	Для Каждого Строка из РезультатЗапроса Цикл 
		
		НоменклатураПоставщикаОб 				= Строка.Ссылка.ПолучитьОбъект();
		НоменклатураПоставщикаОб.Количество 	= 0;
		НоменклатураПоставщикаОб.ДатаОбновления = ТекущаяДата();
		Попытка
			НоменклатураПоставщикаОб.Записать();
		Исключение
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры
//--------------Yugcontract

Процедура ЗагрузкаТоваровYugcontract(Параметр) Экспорт 
	
	Url = "b2b.yugcontract.ua";
	Токен = im_Поставщики_Yugcontract_ПолучитьТокен();
	ТЗКатегории = im_Поставщики_Yugcontract_ПолучитьКатегории(Токен);
	
	// н Категории
	КатегорииОтборЗагрузка = im_Поставщики_Yugcontract_ПолучитьКатегориДляТоваровСКодом(Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract);
	// к Категории
	
	//////	Для каждого Категория Из ТЗКатегории Цикл
	//////		
	//////		ИдКатегории = Категория.categoryID;
	//////		НаименованиеКатегории = Категория.name;
	
	//////		Если ЗначениеЗаполнено(Категория.parentid) Тогда
	//////			ИдРодитель = Категория.parentid;
	//////		Иначе
	//////			ИдРодитель = "";
	//////		КонецЕсли;
	//////		
	//////// н Категории
	//////		Если КатегорииОтборЗагрузка.Количество() = 0 Тогда 
	//////			Продолжить;
	//////		КонецЕсли;
	//////		НайтиКатегорию = КатегорииОтборЗагрузка.Найти(ИдКатегории, "КатегорияIDКатегории");
	//////		Если НайтиКатегорию = Неопределено Тогда
	//////			Продолжить;
	//////		КонецЕсли;
	//////// к Категории
	//////		
	//////		Если Не ЗначениеЗаполнено(ИдРодитель) ИЛИ ИдРодитель = "0"  Тогда
	//////			//КорневаяПапка = Справочники.im_НоменклатураПоставщиков.НайтиПоНаименованию("Yugcontract");	
	//////			КорневаяПапка = im_Поставщики_Yugcontract_ПолучитьГруппуКатегориюИнтернетМагазина("Yugcontract_Api", Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract, Истина); 
	//////		Иначе
	//////			КорневаяПапка = im_Поставщики_Yugcontract_ПолучитьГруппуКатегориюИнтернетМагазина(ИдРодитель, Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract, Истина);	
	//////		КонецЕсли;
	
	//////		СсылкаНаКатегорию     = im_Поставщики_Yugcontract_ПолучитьГруппуКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract, Истина);
	//////		
	//////		Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
	//////			КатегорияСправочник = Справочники.im_НоменклатураПоставщиков.СоздатьГруппу();
	//////			КатегорияСправочник.ID = ИдКатегории;
	//////			КатегорияСправочник.Наименование = НаименованиеКатегории;
	//////			КатегорияСправочник.Родитель     = КорневаяПапка;
	//////			КатегорияСправочник.Поставщик    = Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract;
	//////			КатегорияСправочник.Записать();
	//////		Иначе
	//////			КатегорияСправочник					= СсылкаНаКатегорию.ПолучитьОбъект();
	//////			КатегорияСправочник.ID				= ИдКатегории;
	//////			КатегорияСправочник.Наименование	= НаименованиеКатегории;
	//////			КатегорияСправочник.Родитель		= КорневаяПапка;
	//////			КатегорияСправочник.Поставщик		= Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract;
	//////			КатегорияСправочник.Записать();
	
	//////		КонецЕсли;
	
	//////	КонецЦикла;	
	
	Категории = im_Поставщики_Yugcontract_ПолучитьКатегориДляТоваров(Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract);
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Наименование");
	Товары.Колонки.Добавить("Артикул");
	Товары.Колонки.Добавить("ID");
	Товары.Колонки.Добавить("Бренд");
	Товары.Колонки.Добавить("Категория");
	Товары.Колонки.Добавить("URL");
	Товары.Колонки.Добавить("ДилерскаяЦена");
	Товары.Колонки.Добавить("РРЦ");
	Товары.Колонки.Добавить("ПромоЦена");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("Модель");
	Товары.Колонки.Добавить("АкционнаяЦена");
	Товары.Колонки.Добавить("ДатаНачалаАкции");
	Товары.Колонки.Добавить("ДатаОкончанияАкции");
	Товары.Колонки.Добавить("Штрихкод");
	Товары.Колонки.Добавить("Картинка");
	Товары.Колонки.Добавить("Картинки", Новый ОписаниеТипов("Массив"));
	
	строкаМассив = "";
	Для Каждого элемент Из Категории Цикл
		Если строкаМассив <> "" Тогда
			строкаМассив = строкаМассив + "," + элемент.IDКатегории;
		Иначе	
			строкаМассив = строкаМассив + элемент.IDКатегории;
		КонецЕсли;
	КонецЦикла;	
	
// 1 н
	ТекстОтправки = "{""cats"":["+строкаМассив+"], ""lang"": ""UA"", ""description_photo"": 0}";
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/catalog/get-content-goods", Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстОтправки, КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	Ответ 	= Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	мОтветНомен 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;	
	КонецЕсли; 
	
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтветНомен);
	ЗначениеУзла = "";
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда 
		status = Результат.Получить("status");
		content = Результат.Получить("content");
		Если (status <> Неопределено) И (content <> Неопределено) Тогда 
			Если status = "ok" Тогда
				Если ТипЗнч(content) = Тип("Соответствие") Тогда
					goods = content.Получить("goods");
					Если ТипЗнч(goods) = Тип("Массив") Тогда	
						Для Каждого стр Из goods Цикл
							нстр = Товары.Добавить();
							нстр.Наименование = стр.Получить("name");
							нстр.Артикул = стр.Получить("artikul");
							нстр.ID = СтрЗаменить(Строка(стр.Получить("id")), Символы.НПП, "");
							нстр.Бренд = стр.Получить("brand");
							нстр.Категория = im_Поставщики_Yugcontract_ПолучитьКатегориюИнтернетМагазина(Строка(СтрЗаменить(стр.Получить("categoryId"),Символы.НПП,"")), Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract);
							нстр.URL = 0;
							нстр.ДилерскаяЦена = 0;
							нстр.РРЦ = 0;
							нстр.ПромоЦена = 0;
							нстр.Модель = "";
							нстр.АкционнаяЦена = "";
							нстр.ДатаНачалаАкции = "";
							нстр.ДатаОкончанияАкции = "";
							нстр.Штрихкод = "";
							нстр.Картинка = "";
							нстр.Количество = 0;
							pictures = стр.Получить("pictures");
							Если ТипЗнч(pictures) = Тип("Массив") Тогда
								Для Каждого стрКартинок Из pictures Цикл
									нстр.Картинки.Добавить(стрКартинок);
								КонецЦикла;	
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	ЧтениеJSON.Закрыть();
// 1к
// 2н
	Токен = im_Поставщики_Yugcontract_ПолучитьТокен();
	ТекстОтправки = "{""cats"":["+строкаМассив+"], ""format"": ""json"", ""type"": ""regular"", ""ext_cols"": [], ""type_prod"": []}";
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/catalog/get-price", Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстОтправки, КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	Ответ 	= Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	мОтветНомен 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;	
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтветНомен);
	ЗначениеУзла = "";
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда 
		status = Результат.Получить("status");
		content = Результат.Получить("content");
		Если (status <> Неопределено) И (content <> Неопределено) Тогда 
			Если status = "ok" Тогда
				Если ТипЗнч(content) = Тип("Соответствие") Тогда
					Если ТипЗнч(content) = Тип("Соответствие") Тогда
						data = content.Получить("data");
						Если ТипЗнч(data) = Тип("Соответствие") Тогда
							rests = data.Получить("rests");
							Если ТипЗнч(rests) = Тип("Соответствие") Тогда
								product = rests.Получить("product");
								Если ТипЗнч(product) = Тип("Массив") Тогда	
									Для Каждого стр Из product Цикл
										
										Ид = СтрЗаменить(Строка(стр.Получить("id")), Символы.НПП, "");
										Если Не ЗначениеЗаполнено(Ид) Тогда
											Продолжить;
										КонецЕсли;
										НайденнаяСтрока = Товары.Найти(Ид, "ID");
										Если НайденнаяСтрока <> Неопределено Тогда 
											
											НайденнаяСтрока.ДилерскаяЦена = Строка(стр.Получить("price"));
											НайденнаяСтрока.РРЦ = Строка(стр.Получить("rrp"));
											НайденнаяСтрока.Количество = Строка(стр.Получить("qty_main"));
											
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;				
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЧтениеJSON.Закрыть();
// 2к
	Сч = 0;
	ТаблицаЦен = новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.im_НоменклатураПоставщиков"));
	ТаблицаЦен.Колонки.Добавить("ЦенаРРЦ", Новый ОписаниеТипов("Число"));
	ТаблицаЦен.Колонки.Добавить("ЦенаДиллер", Новый ОписаниеТипов("Число"));
	//ТаблицаЦен.Підписки на подіїКолонки.Добавить("ЦенаПромо");
	ТаблицаЦен.Колонки.Добавить("Фиксированная", Новый ОписаниеТипов("Булево"));
	
	Для каждого  Товар Из Товары Цикл
		
		ИдКатегории = Товар.Категория.IDКатегории;
		ИдТовара = Товар.ID;
		НастройкиКатегории = Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract.КатегорииПоставщиков.НайтиСтроки(новый Структура("Категория", im_Поставщики_Yugcontract_ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract)));
		Если ЗначениеЗаполнено(НастройкиКатегории) Тогда 
			
			Если НастройкиКатегории[0].использовать Тогда 
				
				Попытка
					
					НоменклатурыПоставщика = ПолучитьНоменклатуруИнтернетМагазина(Товар.ID, Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract, Ложь);
					
					Если НоменклатурыПоставщика.Пустая() Тогда
						НоменклатурыПоставщика = im_Поставщики_Yugcontract_СоздатьОбновитьТоварYugcontract(ИдТовара, Товар, Неопределено);
					Иначе						
						im_Поставщики_Yugcontract_СоздатьОбновитьТоварYugcontract(ИдТовара, Товар, НоменклатурыПоставщика);
					КонецЕсли;
					
					СтрокаЦен = ТаблицаЦен.Добавить();
					СтрокаЦен.Номенклатура = НоменклатурыПоставщика.ссылка;
					СтрокаЦен.ЦенаРРЦ      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, НоменклатурыПоставщика.РРЦ, ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура));
					СтрокаЦен.Фиксированная      = ?(ЦенаФиксированная(СтрокаЦен.Номенклатура.Номенклатура) = 0, Ложь, Истина);
					СтрокаЦен.ЦенаДиллер   = 0;
					////СтрокаЦен.ЦенаПромо    = НоменклатурыПоставщика.ПромоЦена;
					Если СтрокаЦен.ЦенаДиллер>=СтрокаЦен.ЦенаРРЦ Тогда 
						//СтрокаЦен.ЦенаРРЦ = Окр(СтрокаЦен.ЦенаДиллер+СтрокаЦен.ЦенаДиллер/100*5,0,РежимОкругления.Окр15как20);
					КонецЕсли;
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьУстановкуЦен(ТаблицаЦен,Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract);
// н ЛИВ
	im_Поставщики_ПроверкаНепришедшихТоваров(Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract);	
// к ЛИВ
	
КонецПроцедуры

Функция im_Поставщики_Yugcontract_ПолучитьКатегории(Токен)
	
	Url = "b2b.yugcontract.ua";
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json"); 
	Заголовки.Вставить("Authorization","Bearer "+Токен); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/catalog/get-categories", Заголовки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтветНомен 	= Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Новый Массив;	
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;                    
	ЧтениеJSON.УстановитьСтроку(мОтветНомен);
	РезультатКатегории = Новый ТаблицаЗначений;
	РезультатКатегории.Колонки.Добавить("categoryID", Новый ОписаниеТипов("Строка"));
	РезультатКатегории.Колонки.Добавить("name");
	РезультатКатегории.Колонки.Добавить("parentid", Новый ОписаниеТипов("Строка"));
	ЗначениеУзла = "";
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда 
		status = Результат.Получить("status");
		content = Результат.Получить("content");
		Если (status <> Неопределено) И (content <> Неопределено) Тогда 
			Если status = "ok" Тогда
				Если ТипЗнч(content) = Тип("Массив") Тогда	
					Для Каждого стр Из content Цикл
						нстр = РезультатКатегории.Добавить();
						нстр.categoryID = СтрЗаменить(стр.Получить("id"), Символы.НПП, "");
						нстр.name = стр.Получить("name");
						нстр.parentid = СтрЗаменить(стр.Получить("parent_id"), Символы.НПП, "");
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	ЧтениеJSON.Закрыть();
	
	//Для каждого  Категория Из РезультатКатегории Цикл
	//	
	//	ИдКатегории = Категория.categoryID;
	//	НаименованиеКатегории = Категория.name;
	
	//	Если ЗначениеЗаполнено(Категория.parentid) Тогда
	//		ИдРодитель = Категория.parentid;
	//	Иначе
	//		ИдРодитель = "";
	//	КонецЕсли;	
	//	
	//	Если ИдРодитель = "0" ИЛИ ИдРодитель = "" Тогда
	//		КорневаяПапка = Справочники.im_КатегорииПоставщиковИнтернетМагазина.НайтиПоНаименованию("Yugcontract");	
	//	Иначе
	//		КорневаяПапка = ПолучитьКатегориюИнтернетМагазина(ИдРодитель, Ссылка);	
	//	КонецЕсли;
	
	//	СсылкаНаКатегорию     = ПолучитьКатегориюИнтернетМагазина(ИдКатегории, Ссылка);
	//	
	//	Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
	//		КатегорияСправочник = Справочники.im_КатегорииПоставщиковИнтернетМагазина.СоздатьЭлемент();
	//		КатегорияСправочник.IDКатегории  = ИдКатегории;
	//		КатегорияСправочник.Наименование = НаименованиеКатегории;
	//		КатегорияСправочник.Родитель     = КорневаяПапка;
	//		КатегорияСправочник.Поставщик    = Ссылка;
	//		КатегорияСправочник.Записать();
	//	Иначе
	//		КатегорияСправочник = СсылкаНаКатегорию.ПолучитьОбъект();
	//		КатегорияСправочник.IDКатегории  = ИдКатегории;
	//		КатегорияСправочник.Наименование = НаименованиеКатегории;
	//		КатегорияСправочник.Родитель     = КорневаяПапка;
	//		КатегорияСправочник.Поставщик    = Ссылка;
	//		КатегорияСправочник.Записать();
	
	//	КонецЕсли;
	//КонецЦикла;	
	
	Возврат РезультатКатегории;
	
КонецФункции

Функция im_Поставщики_Yugcontract_ПолучитьТокен()
	
	Токен = "";
	Url = "vstore.net.ua";	
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/yug/token", Заголовки);
	token = ПланыОбмена.Website.НайтиПоНаименованию("vstore.net.ua", Истина).Токен;
	
	ВремГраница = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ТелоЗапроса = Новый ТекстовыйДокумент();
	ТелоЗапроса.РазделительСтрок = Символы.CR + Символы.LF;
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""token"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(token);
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница + "--");
	
	ТелоЗапросаСтрока = ТелоЗапроса.ПолучитьТекст();
	
	HTTPЗапрос.Заголовки["Content-Type"] = "multipart/form-data; boundary=" + ВремГраница;
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	// Отправляем
	Попытка
		Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			//Возврат Токен;
		КонецЕсли; 
		
		ЧтениеJSON = Новый ЧтениеJSON;                    
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON);
		
		Если Результат.Свойство("status") И Результат.status = "ok" И ТипЗнч(Результат.content) = Тип("Структура") Тогда
			Токен = Результат.content.authToken;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Токен;
	
КонецФункции

Функция im_Поставщики_Yugcontract_ПолучитьКатегориДляТоваров(Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Категории.Категория
	|ИЗ
	|	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	|ГДЕ
	|	НЕ Категории.Категория В
	|				(ВЫБРАТЬ
	|					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	|				ИЗ
	|					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	|				ГДЕ
	|					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	|	И Категории.Использовать = ИСТИНА
	|	И Категории.Категория.Поставщик = &Поставщик
	|
	|СГРУППИРОВАТЬ ПО
	|	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса.ВыгрузитьКолонку("Категория"); 
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

Функция im_Поставщики_Yugcontract_ПолучитьКатегориДляТоваровСКодом(Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Категории.Категория,
	|	Категории.Категория.IDКатегории
	|ИЗ
	|	Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК Категории
	|ГДЕ
	|	НЕ Категории.Категория В
	|				(ВЫБРАТЬ
	|					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Категория.Родитель
	|				ИЗ
	|					Справочник.im_ПоставщикиИнтернетМагазина.КатегорииПоставщиков КАК im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков
	|				ГДЕ
	|					im_ПоставщикиИнтернетМагазинаКатегорииПоставщиков.Ссылка = &Поставщик)
	|	И Категории.Использовать = ИСТИНА
	|	И Категории.Категория.Поставщик = &Поставщик
	|
	|СГРУППИРОВАТЬ ПО
	|	Категории.Категория";
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;
	
КонецФункции

Функция im_Поставщики_Yugcontract_ПолучитьКатегориюИнтернетМагазина(IDКатегории, Поставщик)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_КатегорииПоставщиковИнтернетМагазина.Ссылка
	|ИЗ
	|	Справочник.im_КатегорииПоставщиковИнтернетМагазина КАК im_КатегорииПоставщиковИнтернетМагазина
	|ГДЕ
	|	im_КатегорииПоставщиковИнтернетМагазина.Поставщик = &Поставщик
	|	И im_КатегорииПоставщиковИнтернетМагазина.IDКатегории = &IDКатегории";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

Функция im_Поставщики_Yugcontract_СоздатьОбновитьТоварYugcontract(ID, Товар, ТоварССылка)
	
	Если ЗначениеЗаполнено(ТоварССылка) Тогда 
		ОбНоменклатура = ТоварССылка.ПолучитьОбъект();
	Иначе
		ОбНоменклатура                   = Справочники.im_НоменклатураПоставщиков.СоздатьЭлемент();	
	КонецЕсли;
	
	ОбНоменклатура.ID                = Товар.ID;
	ОбНоменклатура.Артикул           = Товар.Артикул;
	ОбНоменклатура.Наименование      = Товар.Наименование;
	ОбНоменклатура.Категория         = Товар.Категория;
	ОбНоменклатура.Поставщик         = Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract;
	ОбНоменклатура.Бренд             = Товар.Бренд;
	ОбНоменклатура.Родитель          = im_Поставщики_Yugcontract_ПолучитьГруппуКатегориюИнтернетМагазина(Товар.Категория.IDКатегории, Справочники.im_ПоставщикиИнтернетМагазина.Yugcontract, Истина);
	ОбНоменклатура.URL	             = "";
	
	Если ЗначениеЗаполнено(Товар.Картинка) Или Товар.Картинки.Количество() > 0 Тогда
		ОбНоменклатура.Изображениия.Очистить();
		Если ЗначениеЗаполнено(Товар.Картинка) Тогда
			ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
			ОбКартинка.URL = Товар.Картинка;
		КонецЕсли;
		Если Товар.Картинки.Количество() > 0 Тогда
			Для Каждого стр Из Товар.Картинки Цикл 
				ОбКартинка = ОбНоменклатура.Изображениия.Добавить();
				ОбКартинка.URL = стр;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ОбНоменклатура.Количество        = Товар.Количество;
	ОбНоменклатура.ДилерскаяЦена     = Товар.ДилерскаяЦена;
	ОбНоменклатура.РРЦ               = Товар.РРЦ;
// н ЛИВ
	//Если ОбНоменклатура.РРЦ <> Цел(ОбНоменклатура.РРЦ) Тогда
	//	ОбНоменклатура.РРЦ               = Окр(ОбНоменклатура.РРЦ + 0.5 , 0,0);
	//КонецЕсли;
// к ЛИВ
	ОбНоменклатура.Модель            = Товар.Артикул;
	ОбНоменклатура.ДатаОбновления    = ТекущаяДата();
	
	ОбНоменклатура.Записать();
	
	Возврат ОбНоменклатура;
	
КонецФункции

Функция im_Поставщики_Yugcontract_ПолучитьГруппуКатегориюИнтернетМагазина(IDКатегории, Поставщик, ЭтоГруппа)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	im_НоменклатураПоставщиков.Ссылка
	|ИЗ
	|	Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	|ГДЕ
	|	im_НоменклатураПоставщиков.Поставщик = &Поставщик
	|	И im_НоменклатураПоставщиков.ID = &IDКатегории
	|	И im_НоменклатураПоставщиков.ЭтоГруппа = &ЭтоГруппа";
	Запрос.УстановитьПараметр("IDКатегории",IDКатегории);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	результатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если результатЗапроса.Количество() Тогда 
		Возврат результатЗапроса[0].ссылка; 
	КонецЕсли;
	
	Возврат Справочники.im_КатегорииПоставщиковИнтернетМагазина.ПустаяСсылка();
	
КонецФункции

//---------------Ruijie

Процедура ОбменRuijie() Экспорт 
	
	//ДанныеНавыгрузку = ПолучитьДанныеПоСериям_Ruijie();
	//
	//Если ДанныеНавыгрузку.Количество() > 0 Тогда 
	//	
	//	Путь = "/service/api/open/v1/group?depth=BUILDING&access_token=" + КодироватьURL(ПолучитьТокен_Ruijie());
	//			
	//	Путь = ПолучитьТокен_Ruijie();		
	//			
	////	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Ruijie");
	////
	////	Url    = СтрПодключение.Адрес;
	////	Логин  = СтрПодключение.Логин;
	////	Пароль = СтрПодключение.Пароль;
	//	
	//			
	//	Для Каждого стр Из ДанныеНавыгрузку Цикл
	//		
	//		// соединение (хост отдельно!)
	//		Соединение = Новый HTTPСоединение(
	//		    "cloud-eu.ruijienetworks.com",
	//		    443,
	//		    , , , ,
	//		    Новый ЗащищенноеСоединениеOpenSSL
	//		);

	//		// GET-запрос
	//		HTTPЗапрос = Новый HTTPЗапрос(Путь);
	//		
	//		Данные = Новый Структура;
	//		Данные.Вставить("pGroupId", 8906165);
	//		Данные.Вставить("name", "test_groupaaa");
	//		Данные.Вставить("type", "BUILDING");
	//		Данные.Вставить("timezone", "Asia/Shanghai");
	//		Данные.Вставить("description", "This is a test group");
	//		Данные.Вставить("latitude", 26.056812);
	//		Данные.Вставить("businessType", "ENET");
	//		Данные.Вставить("longitude", 119.198453);

	//		СтрокаJSON = ЗаписатьJSON(Данные);			
	//		
	//		HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);

	//		
	//		
	//		// проверка
	//		Если HTTPОтвет.КодСостояния < 200 Или HTTPОтвет.КодСостояния >= 300 Тогда
	//		    ВызватьИсключение "Ошибка HTTP: "
	//		        + Строка(HTTPОтвет.КодСостояния)
	//		        + ". Ответ: "
	//		        + ЛевБезопасно(HTTPОтвет.ПолучитьТелоКакСтроку(), 1000);
	//		КонецЕсли;

	//		// читаем JSON
	//		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	//		
	//		ЧтениеJSON = Новый ЧтениеJSON;                    
	//		ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	//		ОтветJSON = ПрочитатьJSON(ЧтениеJSON);
	//		
	//		
	//	КонецЦикла;
	//
	//КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьДанныеПоСериям_Ruijie()
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменСRuijie.ЗаказПокупателя,
	               |	ОбменСRuijie.Номенклатура,
	               |	ОбменСRuijie.ХарактеристикаНоменклатуры,
	               |	ОбменСRuijie.СерияНоменклатуры,
	               |	ОбменСRuijie.ППК
	               |ИЗ
	               |	РегистрСведений.ОбменСRuijie КАК ОбменСRuijie
	               |ГДЕ
	               |	ОбменСRuijie.Выгружен = ЛОЖЬ";
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса; 
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;
	
КонецФункции	

Функция ЛевБезопасно(СтрокаЗначение, Длина)
	
	СтрокаЗначение = Строка(СтрокаЗначение);
	
	Если СтрДлина(СтрокаЗначение) <= Длина Тогда
		Возврат СтрокаЗначение;
	КонецЕсли;
	
	Возврат Лев(СтрокаЗначение, Длина);
	
КонецФункции

Функция ПолучитьСвойствоJSON(JSON, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	
	Если JSON = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ЗначениеСвойства = ЗначениеПоУмолчанию;
	
	Если ТипЗнч(JSON) = Тип("Структура") Тогда
		
		Если JSON.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
			Возврат ЗначениеСвойства;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(JSON) = Тип("Соответствие") Тогда
		
		Если JSON.Получить(ИмяСвойства) <> Неопределено Тогда
			Возврат JSON.Получить(ИмяСвойства);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция КодироватьURL(Строка)

	//Результат = "";

	//Для каждого Символ Из Строка Цикл
	//    Если Символ = " " Тогда
	//        Результат = Результат + "%20";
	//    ИначеЕсли Символ = "+" Тогда
	//        Результат = Результат + "%2B";
	//    Иначе
	//        Результат = Результат + Символ;
	//    КонецЕсли;
	//КонецЦикла;

	//Возврат Результат;
    Если Строка = Неопределено Тогда
        Возврат "";
    КонецЕсли;

    Результат = "";

    Для Индекс = 1 По СтрДлина(Строка) Цикл
        
        Символ = Сред(Строка, Индекс, 1);
        
        Если Символ = " " Тогда
            Результат = Результат + "%20";
        ИначеЕсли Символ = "+" Тогда
            Результат = Результат + "%2B";
        Иначе
            Результат = Результат + Символ;
        КонецЕсли;

    КонецЦикла;

    Возврат Результат;
	
КонецФункции

Функция ПолучитьТокен_Ruijie()
	
//	{"appid" : "open105c4206b630",
//"secret" : "2d98ad2b751f457a8e09ed436bd4a796"}			
	Токен = "oV1H0i1L3v1oq4u7H4i6N4i4oxyNSybj";

	Возврат Токен;
	
КонецФункции	