
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Товары = Параметры.Товары;

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	Номенклатура.Ссылка КАК Категория,
|	0 КАК НомерКартинки,
|	Номенклатура.Ссылка.ЭтоГруппа КАК ЭтоГруппа
|ИЗ
|	Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|	Номенклатура.Ссылка В ИЕРАРХИИ(&КаталогИМ)
|ИТОГИ ПО
|	Категория ИЕРАРХИЯ
|АВТОУПОРЯДОЧИВАНИЕ";
Запрос.УстановитьПараметр("КаталогИМ", Константы.КатологТоваровИнтернетМагазина.Получить());

РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

// Для фильтрации используем метод НайтиСтроки
СтруктураОтбора = Новый Структура;
СтруктураОтбора.Вставить("ЭтоГруппа", Истина);
//Сообщить(ТипЗнч(РезультатЗапроса));
//РезультатЗапроса = РезультатЗапроса.НайтиСтроки(СтруктураОтбора);

КоллекцияЭлементовДерева = ДеревоКатегорий.ПолучитьЭлементы();
КоллекцияЭлементовДерева.Очистить();
УровеньГруппировки = 1;
МассивКатегорий = новый Массив;

ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, РезультатЗапроса, УровеньГруппировки,МассивКатегорий);

КонецПроцедуры

Процедура ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, ДеревоЗначений,УровеньГруппировки,МассивКатегорий) Экспорт
	
	//МассивКатегорий.Добавить(Константы.КатологТоваровИнтернетМагазина.Получить());
	
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Если (Константы.КатологТоваровИнтернетМагазина.Получить() = строка.Категория И
			УровеньГруппировки=2) или Строка.ЭтоГруппа = ложь или МассивКатегорий.Найти(строка.Категория) <>  Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		ЭлементДерева = КоллекцияЭлементовДерева.Добавить();
		
		ЗаполнитьЗначенияСвойств(ЭлементДерева, Строка);
		МассивКатегорий.Добавить(строка.Категория);

		Если Строка.Строки.Количество() > 0 Тогда
			
			ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементДерева.ПолучитьЭлементы(), Строка,УровеньГруппировки+1,МассивКатегорий);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//Ответ = Вопрос("Вы уверены что хотите заменить категорию у выбранных товаров?",РежимДиалогаВопрос.ДаНетОтмена);
	
	Если Истина Тогда 
		
		Для Каждого строкаТовары из Товары Цикл 
			
			Об = строкаТовары.Значение.ПолучитьОбъект();
			Об.Родитель = Элементы.ДеревоКатегорий.ТекущиеДанные.Категория;
			Об.записать();
			
			Если ТипЗнч(Об) = Тип("СправочникОбъект.Номенклатура")
				И НЕ Об.ЭтоГруппа
				И ЗначениеЗаполнено(Об.Бренд) 
				И Об.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004") //Товары
				И НЕ Об.НеПоказыватьНаСайте Тогда
				
				МодульРегламентныхЗаданий.ЗарегистрироватьНаВыгрузкуАпи(Об.Ссылка);
			КонецЕсли;
			
			//Сообщить("У номенклатуры " +строкаТовары+ " установлена категория "+Элементы.ДеревоКатегорий.ТекущиеДанные.Категория);
			
		КонецЦикла;
		
	КонецЕсли;

	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийКатегорияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//Сообщить(ВыбранноеЗначение);
КонецПроцедуры
