
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#Если МобильноеПриложениеКлиент Тогда
	НачатьРедактированиеЭлемента();
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОВыборе(Количество);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОповеститьОВыборе(Количество);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьКоличество(Команда)
	Количество = Количество - 1;
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКоличество(Команда)
	Количество = Количество + 1;
КонецПроцедуры

