
&НаСервере
Процедура СоздатьДокументыНаСервере()
	Для каждого Строка из Объект.ЗаявкиНаРасходованиеДС цикл
		Если Строка.использовать Тогда  
			Если не ЗначениеЗаполнено(Строка.Документ) Тогда 
				Если Объект.ФормаОплаты = Перечисления.ВидыДенежныхСредств.Наличные Тогда 
					
					ЗаявкаОб        = Строка.Заявка.ПолучитьОбъект();
					ЗаявкаОб.Статус = ?(ЗаявкаОб.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена,ЗаявкаОб.Статус,Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
					ЗаявкаОб.записать();
					
					Документ        = Документы.УпрРасходныйКассовыйОрдер.СоздатьДокумент(); 
					Документ.Заполнить(Строка.Заявка); 
					Документ.Касса  = Строка.Заявка.БанковскийСчетКасса;
					Документ.Комментарий = ЗаявкаОб.Комментарий; 
					Документ.СуммаДокумента = Строка.СуммаКОплате;
					Документ.СчетКасса = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301");
					Если Документ.РасшифровкаПлатежа.Количество() =1 Тогда 
						Документ.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = Строка.СуммаКОплате;
						Документ.РасшифровкаПлатежа[0].СуммаПлатежа        = Строка.СуммаКОплате;
						
					Иначе
						СуммаКОплате =Строка.СуммаКОплате;
						Для Каждого СтрокаРасшифровки из Документ.РасшифровкаПлатежа Цикл 
							Если СтрокаРасшифровки.СуммаПлатежа<=СуммаКОплате Тогда  
								СтрокаРасшифровки.СуммаВзаиморасчетов = СтрокаРасшифровки.СуммаПлатежа;
								СтрокаРасшифровки.СуммаПлатежа        = СтрокаРасшифровки.СуммаПлатежа;
								
								СуммаКОплате = СуммаКОплате - СтрокаРасшифровки.СуммаПлатежа;
							Иначе
								СтрокаРасшифровки.СуммаВзаиморасчетов = СуммаКОплате;
								СтрокаРасшифровки.СуммаПлатежа        = СуммаКОплате;
								
								СуммаКОплате = СуммаКОплате - СтрокаРасшифровки.СуммаПлатежа;	
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
					
					Документ.Дата   = ТекущаяДата();
					Документ.Записать();
					Строка.Документ = Документ.Ссылка;           

					
				ИначеЕсли Объект.ФормаОплаты = Перечисления.ВидыДенежныхСредств.Безналичные Тогда 
					
					ЗаявкаОб        = Строка.Заявка.ПолучитьОбъект();
					ЗаявкаОб.Статус = ?(ЗаявкаОб.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена,ЗаявкаОб.Статус,Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
					ЗаявкаОб.записать();
					
					Документ       			    = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
					Документ.Заполнить(Строка.Заявка);
					Документ.СуммаДокумента     = Строка.СуммаКОплате;
					Документ.НазначениеПлатежа  = ЗаявкаОб.Комментарий;
					Документ.Комментарий        = ЗаявкаОб.Комментарий;
					Документ.СуммаДокумента     = Строка.СуммаКОплате;
					Если Документ.РасшифровкаПлатежа.Количество() =1 Тогда 
						Документ.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = Строка.СуммаКОплате;
						Документ.РасшифровкаПлатежа[0].СуммаПлатежа        = Строка.СуммаКОплате;
						Документ.РасшифровкаПлатежа[0].СтавкаНДС		   = Перечисления.СтавкиНДС.НДС20;
						Документ.РасшифровкаПлатежа[0].СуммаНДС			   = Документ.РасшифровкаПлатежа[0].СуммаПлатежа/6;

					Иначе
						СуммаКОплате =Строка.СуммаКОплате;
						Для Каждого СтрокаРасшифровки из Документ.РасшифровкаПлатежа Цикл 
							Если СтрокаРасшифровки.СуммаПлатежа<=СуммаКОплате Тогда  
								СтрокаРасшифровки.СуммаВзаиморасчетов = СтрокаРасшифровки.СуммаПлатежа;
								СтрокаРасшифровки.СуммаПлатежа        = СтрокаРасшифровки.СуммаПлатежа;
								
								СуммаКОплате = СуммаКОплате - СтрокаРасшифровки.СуммаПлатежа;
							Иначе
								СтрокаРасшифровки.СуммаВзаиморасчетов = СуммаКОплате;
								СтрокаРасшифровки.СуммаПлатежа        = СуммаКОплате;
								
								СуммаКОплате = СуммаКОплате - СтрокаРасшифровки.СуммаПлатежа;	
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
					
					Документ.Дата   = ТекущаяДата();
					
					Если Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику Тогда 
						Если Документ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
							Для Каждого СтрокаДок Из Документ.РасшифровкаПлатежа Цикл 
								СтрокаДок.СчетУчетаРасчетовСКонтрагентом  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("631");
								СтрокаДок.СчетУчетаРасчетовПоАвансам      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("631");
								СтрокаДок.СчетУчетаНДС 				      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6442");	  
								СтрокаДок.СчетУчетаНДСПодтвержденный 	  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6441");
								СтрокаДок.СтавкаНДС						  = Перечисления.СтавкиНДС.НДС20;
								СтрокаДок.СуммаНДС						  = СтрокаДок.СуммаПлатежа/6;

							КонецЦикла;
						Иначе
							Для Каждого СтрокаДок Из Документ.РасшифровкаПлатежа Цикл 
								СтрокаДок.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("632");
								СтрокаДок.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("632");
								СтрокаДок.СчетУчетаНДС 				  	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6442");	  
								СтрокаДок.СчетУчетаНДСПодтвержденный 	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6441"); 
								СтрокаДок.СтавкаНДС 					 = Перечисления.СтавкиНДС.НДС20;
								СтрокаДок.СуммаНДС						 = СтрокаДок.СуммаПлатежа/6;
							КонецЦикла;
						КонецЕсли;
	
					ИначеЕсли Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю Тогда 
						
						Если Документ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
							Для Каждого СтрокаДок Из Документ.РасшифровкаПлатежа Цикл 
								СтрокаДок.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("361");
								СтрокаДок.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("361");
								СтрокаДок.СчетУчетаНДС 				  	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");	  
								СтрокаДок.СчетУчетаНДСПодтвержденный 	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
								СтрокаДок.СтавкаНДС 					 = Перечисления.СтавкиНДС.НДС20;
								СтрокаДок.СуммаНДС						 = СтрокаДок.СуммаПлатежа/6;
							КонецЦикла;
						Иначе
							Для Каждого СтрокаДок Из Документ.РасшифровкаПлатежа Цикл 
								СтрокаДок.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("362");
								СтрокаДок.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("362");
								СтрокаДок.СчетУчетаНДС 				  	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");	  
								СтрокаДок.СчетУчетаНДСПодтвержденный 	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
								СтрокаДок.СтавкаНДС 				     = Перечисления.СтавкиНДС.НДС20;
								СтрокаДок.СуммаНДС						 = СтрокаДок.СуммаПлатежа/6;

							КонецЦикла;
						КонецЕсли;
					
					КонецЕсли;	
					Документ.Записать();
					Строка.Документ = Документ.Ссылка;           
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Записать();
КонецПроцедуры



&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере(); 
	
	Для Каждого Строка из Объект.ЗаявкиНаРасходованиеДС Цикл 
		Если строка.Использовать Тогда 
			ФормаДокумента = строка.Документ.ПолучитьФорму();
			ФормаДокумента.Открыть();
			ФормаДокумента.ДозаполнитьДанные();
			ФормаДокумента.Обновить();;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеДСЗаявкаПриИзменении(Элемент)
	Элементы.ЗаявкиНаРасходованиеДС.ТекущиеДанные.суммаДокумента = ПолучитьСуммуЗаявки(Элементы.ЗаявкиНаРасходованиеДС.ТекущиеДанные.Заявка);
КонецПроцедуры

&НаСервере
Функция  ПолучитьСуммуЗаявки(ЗаявкаНаРасходованиеДС) 
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаНаРасходованиеДС,"СуммаДокумента");
	
КонецФункции

&НаКлиенте
Процедура ЗаявкиНаРасходованиеДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗаявкиНаРасходованиеДСПлатежноеПоручение" Тогда 
		ПоказатьЗначение(,Элементы.ЗаявкиНаРасходованиеДС.ТекущиеДанные.ПлатежноеПоручение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
	
КонецПроцедуры


&НаСервере
Процедура ПодобратьЗаявкиНаСервере()
	
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьЗаявки(Команда)
	
	ОткрытьФорму("Документ.РеестрПлатежей.Форма.ФормаПодбораЗаявки",,,,,,Новый ОписаниеОповещения("ОбработатьПодборЗаявок",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьПодборЗаявок(Результат,Параметры) Экспорт 
	ОбработатьПодборЗаявокНаСервере(Результат);	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборЗаявокНаСервере(Адрес)
	
	ТаблицаЗаявок = ПолучитьИзВременногоХранилища(Адрес);
	
	Для Каждого СтрокаЗаявка из ТаблицаЗаявок Цикл  
		Если СтрокаЗаявка.Использовать Тогда  
			СтрокаТЧ = Объект.ЗаявкиНаРасходованиеДС.Добавить();
			СтрокаТЧ.Заявка         = СтрокаЗаявка.Заявка;
			СтрокаТЧ.СуммаДокумента = СтрокаЗаявка.Заявка.СуммаДокумента;
			СтрокаТЧ.СуммаКОплате   = СтрокаЗаявка.Заявка.СуммаДокумента;
			СтрокаТЧ.Проект   	    = СтрокаЗаявка.Заявка.РасшифровкаПлатежа[0].Проект;
			СтрокаТЧ.СтатьяДДС		= СтрокаЗаявка.Заявка.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;

			СтрокаТЧ.ОплаченоРанее  = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиДС(ФормаОплаты)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВложенныйЗапрос.БанковскийСчетКасса КАК БанковскийСчетКасса,
	               |	ВложенныйЗапрос.Валюта КАК Валюта,
	               |	ВложенныйЗапрос.ОстаткиДС КАК ОстаткиДС,
	               |	ВложенныйЗапрос.ВидОплаты КАК ВидОплаты,
	               |	РеестрПлатежейЗаявкиНаРасходованиеДС.СуммаКОплате КАК СуммаЗаявок,
	               |	ВложенныйЗапрос.БанковскийСчетКасса.Владелец КАК Организация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетКасса,
	               |		БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств КАК Валюта,
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК ОстаткиДС,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.безналичные) КАК ВидОплаты
	               |	ИЗ
	               |		Справочник.БанковскиеСчета КАК БанковскиеСчетаОрганизаций
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(, ) КАК ДенежныеСредстваОстатки
	               |			ПО (ДенежныеСредстваОстатки.БанковскийСчетКасса = БанковскиеСчетаОрганизаций.Ссылка)
	               |	ГДЕ
	               |		БанковскиеСчетаОрганизаций.Ссылка ССЫЛКА Справочник.БанковскиеСчета
	               |		И БанковскиеСчетаОрганизаций.Владелец ССЫЛКА Справочник.Организации) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрПлатежей.ЗаявкиНаРасходованиеДС КАК РеестрПлатежейЗаявкиНаРасходованиеДС
	               |		ПО ВложенныйЗапрос.БанковскийСчетКасса = РеестрПлатежейЗаявкиНаРасходованиеДС.Заявка.БанковскийСчетКасса
	               |			И (РеестрПлатежейЗаявкиНаРасходованиеДС.Ссылка = &Реестр)
	               |ГДЕ
	               |	&ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.безНаличные)
	               |	И ВложенныйЗапрос.ОстаткиДС <> 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.БанковскийСчетКасса,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.ОстаткиДС,
	               |	ВложенныйЗапрос.ВидОплаты,
	               |	РеестрПлатежейЗаявкиНаРасходованиеДС.СуммаКОплате,
	               |	ВложенныйЗапрос.БанковскийСчетКасса.Владелец
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Кассы.Ссылка КАК БанковскийСчетКасса,
	               |		Кассы.ВалютаДенежныхСредств КАК Валюта,
	               |		ЕСТЬNULL(ДенежныеСредстваНаличныеОстатки.СуммаОстаток, 0) КАК ОстаткиДС,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Наличные) КАК ВидОплаты
	               |	ИЗ
	               |		Справочник.Кассы КАК Кассы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(, ) КАК ДенежныеСредстваНаличныеОстатки
	               |			ПО Кассы.Ссылка = ДенежныеСредстваНаличныеОстатки.БанковскийСчетКасса
	               |	ГДЕ
	               |		Кассы.Ссылка ССЫЛКА Справочник.Кассы) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрПлатежей.ЗаявкиНаРасходованиеДС КАК РеестрПлатежейЗаявкиНаРасходованиеДС
	               |		ПО ВложенныйЗапрос.БанковскийСчетКасса = РеестрПлатежейЗаявкиНаРасходованиеДС.Заявка.БанковскийСчетКасса
	               |			И (РеестрПлатежейЗаявкиНаРасходованиеДС.Ссылка = &Реестр)
	               |ГДЕ
	               |	&ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Наличные)
	               |	И ВложенныйЗапрос.ОстаткиДС <> 0";
	Запрос.УстановитьПараметр("Реестр",Объект.Ссылка);
	Запрос.УстановитьПараметр("ФормаОплаты",ФормаОплаты);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	ДоступныеДенежныеСредства.Загрузить(РезультатЗапроса);
КонецФункции

&НаКлиенте
Процедура НаСогласование(Команда)
	УспешныйЗапуск = ЗапуститьВРаботуНаСервере(Объект.Ссылка);
	Если УспешныйЗапуск Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реестр № "+Объект.Номер+" успешно отправлена на согласование!");	
		Элементы.ФормаНаСогласование.Доступность = Ложь;
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры         


&НаСервере 
Функция ЗапуститьВРаботуНаСервере(Заявка)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СогласованиеРеестраНаОплату.Ссылка
	|ИЗ
	|	БизнесПроцесс.СогласованиеРеестраНаОплату КАК СогласованиеРеестраНаОплату
	|ГДЕ
	|	НЕ СогласованиеРеестраНаОплату.Завершен
	|	И СогласованиеРеестраНаОплату.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет",Заявка); 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процесс согласования уже запущен"); 
		
	ИначеЕсли Заявка.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Согласована
		или Заявка.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Отклонена Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процесс согласования уже пройден"); 
		
		
	Иначе
		
		БизнесПроцесс = БизнесПроцессы.СогласованиеРеестраНаОплату.СоздатьБизнесПроцесс();
		БизнесПроцесс.Заполнить(Объект.Ссылка); 
		БизнесПроцесс.Дата = Объект.Ссылка.Дата;
		БизнесПроцесс.Записать();
		БизнесПроцесс.Старт(); 
		
		Объект.Статус = Перечисления.СтатусыРеестраНаОплатуДС.НаСогалсовании;
		
		Возврат истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ПриЧтенииСозданииНаСервере();
		Если Параметры.Свойство("Основание") Тогда
			Основание = Параметры.Основание;
		КонецЕсли;  
		
		Объект.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Черновик;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаявкиНаРасходованиеДССуммаКОплатеПриИзменении(Элемент)
	//Записать();
	ПолучитьОстаткиДС(Объект.ФормаОплаты);
КонецПроцедуры


&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере();
	СогласованиеДоступноНаКлиенте();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере()
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю КАК ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.Предмет = &Предмет
	|	И НЕ ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.Выполнена";
	Запрос.УстановитьПараметр("Предмет",Объект.Ссылка);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Об = РезультатЗапроса[0].Ссылка.получитьОбъект();
		
		СогласованиеОбъект = Об.БизнесПроцесс.ПолучитьОбъект();
		СогласованиеОбъект.ДобавитьРезультатСогласования(
		Об.ТочкаМаршрута,
		ПараметрыСеанса.ТекущийПользователь,Перечисления.РезультатыСогласования.Согласовано,
		Об.РезультатВыполнения,
		Об.ДатаИсполнения);
		
		СогласованиеОбъект.Записать();
		БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(РезультатЗапроса[0].Ссылка);
		
	КонецЕсли;
	
	СогласованиеДоступноНаНаСервере();
	
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНоСервере();
	СогласованиеДоступноНаКлиенте();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНоСервере() 
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю КАК ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.Предмет = &Предмет
	|	И НЕ ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.Выполнена";
	Запрос.УстановитьПараметр("Предмет",Объект.Ссылка);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Об = РезультатЗапроса[0].Ссылка.получитьОбъект();
		
		СогласованиеОбъект = Об.БизнесПроцесс.ПолучитьОбъект();
		СогласованиеОбъект.ДобавитьРезультатСогласования(
		Об.ТочкаМаршрута,
		ПараметрыСеанса.ТекущийПользователь,Перечисления.РезультатыСогласования.НеСогласовано,
		Об.РезультатВыполнения,
		Об.ДатаИсполнения);
		
		СогласованиеОбъект.Записать();
		БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(РезультатЗапроса[0].Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеДоступноНаКлиенте()
	
	СогласованиеДоступно = СогласованиеДоступноНаНаСервере();
	
	Если СогласованиеДоступно Тогда 	
		Элементы.ФормаОтклонить.Доступность = Истина; 
		Элементы.ФормаСогласовать.Доступность = Истина;
		
	Иначе
		
		Элементы.ФормаОтклонить.Доступность = Ложь; 
		Элементы.ФормаСогласовать.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СогласованиеДоступноНаНаСервере()
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю КАК ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.Предмет = &Предмет
	|	И НЕ ЗадачаЗадачаИсполнителяЗадачиПоИсполнителю.Выполнена";
	Запрос.УстановитьПараметр("Предмет",Объект.Ссылка);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество();
	
КонецФункции


&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого Строка из Объект.ЗаявкиНаРасходованиеДС Цикл 
		строка.Использовать = Истина;		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка из Объект.ЗаявкиНаРасходованиеДС Цикл 
		строка.Использовать = Ложь;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	ПолучитьОстаткиДС(Объект.ФормаОплаты);
	Если Объект.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Черновик Тогда 
		
		Элементы.ФормаНаСогласование.Доступность = Истина;
		Элементы.ЗаявкиНаРасходованиеДСПодобратьЗаявки.Доступность = Истина;
		
	иначе
		Элементы.ФормаНаСогласование.Доступность = Ложь;
		Элементы.ЗаявкиНаРасходованиеДСПодобратьЗаявки.Доступность = Ложь;
		
	КонецЕсли;
	
	Если Объект.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Согласована Тогда 
		Элементы.ЗаявкиНаРасходованиеДССоздатьДокументы.Доступность = Истина;
	иначе
		Элементы.ЗаявкиНаРасходованиеДССоздатьДокументы.Доступность = Ложь;	
	КонецЕсли;
	
	СогласованиеДоступноНаКлиенте();
	
КонецПроцедуры