
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка
	   И НЕ ЭтоГруппа 
	   И НЕ ЭтоНовый() 
	   И (    ВидСклада <> Ссылка.ВидСклада
	      ИЛИ СуммовойУчет <> Ссылка.СуммовойУчет)
	   И ЭтотОбъект.СуществуютСсылки() Тогда

		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Существуют документы, в которых выбран склад ""';uk='Існують документи, в яких обраний склад ""'") + Наименование + НСтр("ru='""."
"Реквизиты ""Вид склада"" и ""Суммовой учет"" не могут быть изменены, элемент не записан.';uk='""."
"Реквізити ""Вид складу"" і ""Сумовий облік"" не можуть бути змінені, елемент не записаний.'"));

		Отказ = Истина;
	КонецЕсли;

	// не дадим записать розничный склад или НТТ без указания типа цен
	Если НЕ ОбменДанными.Загрузка
	   И Не ЭтоГруппа
	   И (ВидСклада = Перечисления.ВидыСкладов.Розничный Или ВидСклада = Перечисления.ВидыСкладов.НТТ)
	   И НЕ ЗначениеЗаполнено(ТипЦенРозничнойТорговли) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Для склада вида ""';uk='Для складу виду ""'")+ВидСклада+НСтр("ru='"" необходимо указать тип цен розничной торговли,"
"элемент не записан.';uk='"" необхідно вказати тип цін роздрібної торгівлі,"
"елемент не записаний.'"));

		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ОбменДанными.Загрузка Тогда
	КонецЕсли;

КонецПроцедуры

// Обработчик события ПриЗаписи
//
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет, существуют ли движения по складу.
// Если есть - менять реквизит "Вид склада" нельзя.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт

	Запрос = Новый Запрос();

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыНаСкладах.Регистратор КАК Документ
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Склад = &Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыНаСкладах.Регистратор КАК Документ
	|ИЗ
	|	РегистрНакопления.ТоварыВРознице КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Склад = &Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыНаСкладах.Регистратор КАК Документ
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТВПродажныхЦенах КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Склад = &Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВНТТ.Регистратор
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТ КАК ТоварыВНТТ
	|ГДЕ
	|	ТоварыВНТТ.Склад = &Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХозрасчетныйОбороты.Счет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|		,
	|		,
	|		,
	|		,
	|		,
	|		Субконто1 = &Склад
	|		    ИЛИ Субконто2 = &Склад
	|		    ИЛИ Субконто3 = &Склад,
	|		,
	|		) КАК ХозрасчетныйОбороты"; 
	
	Запрос.УстановитьПараметр("Склад", Ссылка);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции
