Перем глСерверТО Экспорт;
Перем мКлиентOnline;

Перем глОбщиеЗначения Экспорт;

Перем глЗапрашиватьПодтверждениеПриЗакрытии Экспорт;

Перем АдресРесурсовОбозревателя Экспорт; // В переменной содержится значение 
										 // адреса ресурса данной конфигурации
Перем ФормаОповещенияЗадачОткрыта Экспорт;

Перем глУчетнаяПолитикаПоПерсоналуОрганизации Экспорт;

Перем ФормаОжиданияКурсов;

Перем глМенеджерЗвит1С Экспорт;


Перем глСерверПРРО Экспорт;

// Функция возвращает объект для взаимодействия с торговым оборудованием.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  <ОбработкаОбъект> - Объект для взаимодействия с торговым оборудованием.
//
Функция ПолучитьСерверПРРО() Экспорт

	Если глСерверПРРО = Неопределено Тогда
		глСерверПРРО = ВебЧекПРРОСервер.СоздатьОбъектПРРО();
	КонецЕсли;

	Возврат глСерверПРРО;

КонецФункции // ПолучитьСерверТО()


Процедура ПередНачаломРаботыСистемы(Отказ)
	
	УправлениеПользователями.ПроверитьВозможностьРаботыПользователя(Отказ);	
	
КонецПроцедуры

// Функция возвращает объект для взаимодействия с торговым оборудованием.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  <ОбработкаОбъект> - Объект для взаимодействия с торговым оборудованием.
//
Функция ПолучитьСерверТО() Экспорт

	Если глСерверТО = Неопределено Тогда
		глСерверТО = Обработки.ТОСервер.Создать();
	КонецЕсли;

	Возврат глСерверТО;

КонецФункции // ПолучитьСерверТО()

Процедура ПриНачалеРаботыСистемы()

	ЗаголовокСистемы = Константы.ЗаголовокСистемы.Получить();
	Если НЕ Пустаястрока(ЗаголовокСистемы) Тогда
		УстановитьЗаголовокСистемы(ЗаголовокСистемы);
	КонецЕсли; 	
	
	КонтрольВерсииПлатформы.ПроверитьВерсиюПлатформы();
	
	ФормаОповещенияЗадачОткрыта = Ложь;
	ОпределитьИнтерфейс();

	мТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ПервыйЗапуск = (Константы.НомерВерсииКонфигурации.Получить()="");
	Если ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы() Тогда
		Возврат;
	КонецЕсли;	

	// отработка параметров запуска системы
	Если ОбработатьПараметрыЗапуска(ПараметрЗапуска) Тогда
		Возврат;
	КонецЕсли;
	
	// Выполнить проверку разницы времени с сервером приложения
	Если НЕ ПроверкаРазницыВремениКлиент.ВыполнитьПроверку() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСеанса.ВыводитьСлужебнуюИнформацию = Ложь;
	Если НЕ ПустаяСтрока(ПараметрЗапуска) Тогда
		Если ПараметрЗапуска = "ВыводитьСлужебнуюИнформацию" Тогда
			ПараметрыСеанса.ВыводитьСлужебнуюИнформацию = Истина;
		КонецЕсли;
	КонецЕсли;

	УправлениеСоединениямиИБ.УстановитьКонтрольРежимаЗавершенияРаботыПользователей();
	
	СформироватьОтчеты();
	ПроверитьПодключениеОбработчикаОжидания();
	
	// Проверка заполнения констант валют учетов
	Если НЕ ЗначениеЗаполнено(глЗначениеПеременной("ВалютаРегламентированногоУчета")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнена константа валюты регламентированного учета!';uk='Не заповнена константа валюти регламентованого обліку!'"));
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(глЗначениеПеременной("ВалютаУправленческогоУчета")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнена константа валюты управленческого учета!';uk='Не заповнена константа валюти управлінського обліку!'"));
	КонецЕсли;

	// Открытие встроенного почтового клиента при запуске системы, если это задано в настройках
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "АвтооткрытиеЭлектроннойПочтыПриЗапускеПрограммы") = Истина
	   И Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() 
	   И (Не ПервыйЗапуск) Тогда
		Обработки.МенеджерКонтактов.ПолучитьФорму().Открыть();
	КонецЕсли; 


	ВключенИнтерфейсКассира = Ложь;
	ЗапускИнтерфейсаКассира(мТекущийПользователь, ВключенИнтерфейсКассира);

	ЭтоФайловаяИБ = ОпределитьЭтаИнформационнаяБазаФайловая();
		
	Если ЭтоФайловаяИБ Тогда
					
		ПользовательДляВыполненияРеглЗаданий = Константы.ПользовательДляВыполненияРегламентныхЗаданийВФайловомВарианте.Получить();
		
		Если мТекущийПользователь = ПользовательДляВыполненияРеглЗаданий Тогда
			
			// с интервалом секунд вызываем процедуру работы с регламентными заданиями
			ПоддержкаРегламентныхЗаданиеДляФайловойВерсии();
			
			ПодключитьОбработчикОжидания("ПоддержкаРегламентныхЗаданиеДляФайловойВерсии", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));
			
			ИнтервалДляОпроса = Константы.ИнтервалДляОпросаРегламентныхЗаданийВФайловомВарианте.Получить();
			
			Если ИнтервалДляОпроса = Неопределено
				ИЛИ ИнтервалДляОпроса = 0 Тогда
				
				ИнтервалДляОпроса = 60;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// автообмен данными
	Если глЗначениеПеременной("глОбработкаАвтоОбменДанными") <> Неопределено Тогда
		
		// подключим обработчик обменов данными
		ПодключитьОбработчикОжидания("ПроверкаОбменаДанными", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));
			
	КонецЕсли;
	
	// Если интерфейс кассира включен - панель не нужна.
	
	 //a3b. Dasha. 09.04.2021 14:52 +++
	НашаПанель = Ложь;
	Если РольДоступна(Метаданные.Роли.Комірник) Или РольДоступна(Метаданные.Роли.МенеджерЗПостачання) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Если ПользовательИБ <> Неопределено И ПользовательИБ.ОсновнойИнтерфейс <> Неопределено 
			И ПользовательИБ.ОсновнойИнтерфейс.Имя = "УпрКаси" Тогда
			Иначе
			 //a3b. Dasha. 09.04.2021 14:52 +++
			 ФормаПанели = Обработки.ПанельФункцийНикитин.ПолучитьФорму();
			//a3b. Dasha. 09.04.2021 14:52 ---
			ФормаПанели.Открыть();
			НашаПанель = Истина;
		Конецесли;
	КонецЕсли;
	//a3b. Dasha. 09.04.2021 14:52 ---

	Если НЕ ВключенИнтерфейсКассира И НЕ НашаПанель Тогда
		ОткрытьПанельФункций = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ОткрыватьПриЗапускеПанельФункций");
		
		Если Ложь 
		 Или ПервыйЗапуск Тогда
			ФормаПанели = Обработки.ПанельФункций.ПолучитьФорму();
			ФормаПанели.ПервыйЗапуск = ПервыйЗапуск;
			ФормаПанели.Открыть();
		КонецЕсли;		
	КонецЕсли;

	// Открытие Быстрого освоения
	ПоказыватьБыстроеОсвоение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ПоказыватьБыстроеОсвоениеПриНачалеРаботыСистемы");
	Если ПоказыватьБыстроеОсвоение 
	   И (Не ПервыйЗапуск) Тогда
		Обработки.БыстроеОсвоение.ПолучитьФорму().Открыть();
	КонецЕсли;	
	
	// Открытие списка задач
	ПоказыватьСписокЗадач = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ПоказыватьСписокЗадачПриЗапуске");
	Если ПоказыватьСписокЗадач
	   И (Не ПервыйЗапуск) Тогда
		РаботаСДиалогами.ОткрытьЗадачиТекущегоПользователя();
	КонецЕсли;	
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "АвтооткрытиеФормыРабочегоМестаМенеджераПоПродажамПриЗапускеПрограммы") = Истина 
	   И (Не ПервыйЗапуск) Тогда
		Обработки.РабочееМестоМенеджераПоПродажам.ПолучитьФорму().Открыть();
	КонецЕсли;
	
	ПоказыватьФормуДополнительнойИнформации = ВосстановитьЗначение("ПоказСтартовойФормыДополнительнойИнформации");
	ПоказыватьФормуДополнительнойИнформации = ?(ПоказыватьФормуДополнительнойИнформации = Неопределено, Истина, ПоказыватьФормуДополнительнойИнформации);
	Если ПоказыватьФормуДополнительнойИнформации 
	   И (Не ПервыйЗапуск) Тогда
		Форма = Обработки.ДополнительнаяИнформация.ПолучитьФорму("ФормаРабочийСтол");
		Форма.Открыть();
	КонецЕсли;	
	
	// Начнем проверку динамического обновления конфигурации
	НачатьПроверкуДинамическогоОбновленияИБ();
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ЗагружатьАктуальныеКурсыВалютПриЗапускеСистемы") Тогда
		
		// Автоматическая загрузка курсов валют
		ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
		Настройки 		  = ЗначениеКонстанты.Получить();
		ЗагружатьЕжедневно = Ложь;	
		Если Настройки <> Неопределено Тогда
			Попытка
				ЗагружатьЕжедневно = Настройки.ЗагружатьЕжедневно;
			Исключение
			КонецПопытки;	
		КонецЕсли;
		
		Попытка
			Если ЗагружатьЕжедневно Тогда
				
				ОбработкаЗагрузкаКурсов = Обработки.ЗагрузкаКурсовВалют.Создать();
				Если НЕ ОбработкаЗагрузкаКурсов.КодДоступаАктуален() Тогда
					ФормаОжиданияКурсов = ОбработкаЗагрузкаКурсов.ПолучитьФорму("ФормаОжидания");
					ФормаОжиданияКурсов.Открыть();
					ПодключитьОбработчикОжидания("ОбработчикЗагрузкаКурсов", 20, Истина);
				Иначе
					ОбработкаЗагрузкаКурсов.ЗагрузитьКурсыПоНастройкам();
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЕсли; 
	
	Если ПолучитьСерверТО().ПолучитьСписокУстройств(
	   Перечисления.ВидыТорговогоОборудования.ККМOnLine).Количество() > 0 Тогда
		мКлиентOnline = Обработки.ТОКлиентККМOnline.Создать();
		мКлиентOnline.НачатьРаботу();
	КонецЕсли;
	
	НормативноСправочныйИнформационныйСервисСервер.ПослеНачалаРаботыСистемы();	
	
	Если Не ПервыйЗапуск Тогда
		ОткрытьПутеводительПоДемобазе();
	КонецЕсли;
	
	// Форма помощника обновления конфигурации выводится поверх остальных окон.
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		ОбработкаОбновлениеКонфигурации = Обработки.ОбновлениеКонфигурации.Создать();
		ОбработкаОбновлениеКонфигурации.ПроверитьНаличиеОбновлений();
	КонецЕсли;
	
	//++Яковлев Руслан
	
	Если РольДоступна(Метаданные.Роли.ФинансистЦФО) Тогда
		ФормаПанели = Обработки.РаботаСЗаявками.ПолучитьФорму();
		ФормаПанели.Открыть();
	КонецЕсли;
	
	
	Если РольДоступна(Метаданные.Роли.ИспользованиеОбработкиРаботаСЗаказами) Тогда
		ФормаПанели = Обработки.РабочееМестоРаботыСЗаказами.ПолучитьФорму();
		ФормаПанели.Открыть();
	КонецЕсли;

	//-- Яковлев Руслан
	
	//Дандали В. 11.03.2024 +
	Если РольДоступна(Метаданные.Роли.Комірник) 
		И УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.НайтиПоНаименованию("Рабочий стол кладовщика"), Ложь)[0].Значение Тогда
		ФормаОбработки = Обработки.РабочийСтолКладовщика.ПолучитьФорму();
		ФормаОбработки.Открыть();
	КонецЕсли;
	//Дандали В. 11.03.2024 +
	
	//Дандали В. 31.07.2024 +
	ПараметрыСеанса.МаксимальныйСрокПроведенияРеализаций = Константы.МаксимальныйСрокПроведенияРеализаций.Получить();
	//Дандали В. 31.07.2024 -
	
	//Дандали В. 21.10.2024 +
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиПользователей.Значение КАК ФормаПриСтарте
		               |ИЗ
		               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		               |ГДЕ
		               |	НастройкиПользователей.Пользователь = &Пользователь
		               |	И НастройкиПользователей.Настройка = &Настройка
		               |	И НастройкиПользователей.Значение <> """"";
		Запрос.УстановитьПараметр("Пользователь",глЗначениеПеременной("глТекущийПользователь"));
		Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.НайтиПоНаименованию("Открыть форму при старте"));
		
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ФормаПриСтарте = Выборка.ФормаПриСтарте;
			СоответствиеЗначенийСМетаданными = Новый Соответствие;
			СоответствиеЗначенийСМетаданными.Вставить("Журнали документів"	, "ЖурналыДокументов");
			СоответствиеЗначенийСМетаданными.Вставить("Журналы документов"	, "ЖурналыДокументов");
			СоответствиеЗначенийСМетаданными.Вставить("Справочники"			, "Справочники");
			СоответствиеЗначенийСМетаданными.Вставить("Довідники"			, "Справочники");
			СоответствиеЗначенийСМетаданными.Вставить("Документы"			, "Документы");
			СоответствиеЗначенийСМетаданными.Вставить("Документи"			, "Документы");
				
			Попытка
				МассСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФормаПриСтарте, " ");
				Если МассСтрок.Найти("Журнали") <> Неопределено ИЛИ МассСтрок.Найти("Журналы") <> Неопределено Тогда
					ЖурналыДокументов[МассСтрок[2]].ПолучитьФорму().Открыть();
				КонецЕсли;
				
				Если МассСтрок.Найти("Документи") <> Неопределено ИЛИ МассСтрок.Найти("Документы") <> Неопределено Тогда
					Документы[МассСтрок[1]].ПолучитьФормуСписка().Открыть();	
				КонецЕсли;
				
				Если МассСтрок.Найти("Довідники") <> Неопределено ИЛИ МассСтрок.Найти("Справочники") <> Неопределено Тогда
					Справочники[МассСтрок[1]].ПолучитьФормуСписка().Открыть();	
				КонецЕсли;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	//Дандали В. 21.10.2024 -
	
	
	глПодключитьМенеджерЗвит1С(Ложь);
		
КонецПроцедуры // ПриНачалеРаботыСистемы()

Процедура ОпределитьИнтерфейс()
	//a3b. Dasha. 28.07.2022 14:08 +++
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ <> Неопределено И ПользовательИБ.ОсновнойИнтерфейс <> Неопределено 
		И ПользовательИБ.ОсновнойИнтерфейс.Имя = "УпрКаси" Тогда
		Для каждого ТекИнтерфейс Из ГлавныйИнтерфейс  Цикл
			ТекИнтерфейс.Переключаемый = Ложь;
			ТекИнтерфейс.Видимость = Ложь;
		КонецЦикла;
		УпрКаси = ГлавныйИнтерфейс.УпрКаси;
		УпрКаси.Переключаемый = Истина;
		УпрКаси.Видимость = Истина;
		Обработки.УпрДенежныеСредства.ПолучитьФорму("ФормаИнтерфейс").Открыть();
	КонецЕсли;
	//a3b. Dasha. 28.07.2022 14:08 ---
КонецПроцедуры 

// функция вызова формы путеводителя
Процедура ОткрытьПутеводительПоДемобазе()

   Возврат; 
   
   Запрос = Новый Запрос();
   Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				  |	ВнешниеОбработки.Ссылка КАК Путеводитель
				  |ИЗ
				  |	Справочник.ВнешниеОбработки КАК ВнешниеОбработки
				  |ГДЕ
				  |	ВнешниеОбработки.ВидОбработки = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхВнешнихОбработок.Обработка)
				  |	И ВнешниеОбработки.Наименование = ""Путеводитель по демо-базе""
				  |	И ВнешниеОбработки.ЭтоГруппа = ЛОЖЬ";
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И Не ВосстановитьЗначение("ПутеводительПоДемоБазе_ПоказыватьПриСтарте") = Ложь Тогда
		
			Путеводитель = Выборка.Путеводитель;	
			
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = Путеводитель.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			
			Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
			
			Если Не Форма = Неопределено Тогда
				Форма.Открыть();
			Иначе
				ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
			КонецЕсли;
			
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработчикЗагрузкаКурсов() Экспорт
	
	Если НЕ ФормаОжиданияКурсов = Неопределено Тогда
		Если ФормаОжиданияКурсов.Открыта() Тогда
			ФормаОжиданияКурсов.Закрыть();
			ФормаОжиданияКурсов = Неопределено;
			#Если Клиент Тогда
				ЗапуститьПриложение("http://finance.ua/ru/price/~/1c");
			#КонецЕсли	
			ОбработкаЗагрузкаКурсов = Обработки.ЗагрузкаКурсовВалют.Создать();
			ОбработкаЗагрузкаКурсов.ЗагрузитьКурсыПоНастройкам();
		КонецЕсли; 
		ФормаОжиданияКурсов = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	Если глЗапрашиватьПодтверждениеПриЗакрытии <> Ложь Тогда
		ЗапрашиватьПотверждение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),
	    													  "ЗапрашиватьПодтверждениеПриЗакрытии");
		Если ЗапрашиватьПотверждение Тогда
			Ответ = Вопрос(НСтр("ru='Завершить работу с программой?';uk='Завершити роботу із програмою?'"), РежимДиалогаВопрос.ДаНет);
			Отказ = (Ответ = КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;

	Если НЕ Отказ Тогда
		
		// отдельно получаем настройки для которых нужно выполнить обмен при выходе из программы
		ПроцедурыОбменаДанными.ВыполнитьОбменПриЗавершенииРаботыПрограммы(глЗначениеПеременной("глОбработкаАвтоОбменДанными"));
			
	КонецЕсли;	
	
	// Показ финальной дополнительной информации
	Форма = Обработки.ДополнительнаяИнформация.Создать();
	Форма.ВыполнитьДействие(); 
	
	Если Не Отказ И глМенеджерЗвит1С <> Неопределено Тогда
		глМенеджерЗвит1С.ЗавершитьЗвит1С(Отказ);
	КонецЕсли;

КонецПроцедуры

// процедура служит для поддержки работы регламентных заданий в файловой версии
Процедура ПоддержкаРегламентныхЗаданиеДляФайловойВерсии() Экспорт
	
	ВыполнитьОбработкуЗаданий();
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

	// Показ финальной дополнительной информации
	Форма = Обработки.ДополнительнаяИнформация.Создать();
	Форма.ВыполнитьДействие();
	
КонецПроцедуры

// Процедура выполняет запуск отчетов, у которых установлен
// признак "Формировать при входе в систему"
//
Процедура СформироватьОтчеты()

	ВыбраннаяНастройка = ВосстановитьЗначение( "ОбработкаРапортРуководителю_Настройки");
	Если Не ВыбраннаяНастройка = Неопределено Тогда

		Параметры = Неопределено;
		Если ВыбраннаяНастройка.Свойство("_ДанныеФормы", Параметры) Тогда
			АвтоЗапуск = Неопределено;
			Параметры.Свойство("ФормироватьПриСтартеСистемы", АвтоЗапуск);
			Если Не АвтоЗапуск = Неопределено И АвтоЗапуск Тогда
				НовыйОтчет = Отчеты.РапортРуководителю.Создать();
				НовыйОтчетФорма = НовыйОтчет.ПолучитьФорму("ФормаГлавная");
				НовыйОтчетФорма.НачальноеЗначениеВыбора = Истина;
				НовыйОтчетФорма.Открыть();
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Эта процедура отлавливает данные от сканера штрихкода и ККМ,
// когда не открыта ни одна из форм, использующих сканер и ККМ в своей работе.
// Так же обрабатываются события FREDO Звіт
//
Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	Если Источник = "Zvit1C" Тогда
		// Событие от FREDO Звіт
					  
		// Актуализируем глМенеджерЗвит1С, если был подключен как внешний
		Если Не глПодключитьМенеджерЗвит1С() Тогда
			Возврат;
		КонецЕсли;

		глМенеджерЗвит1С.ОбработкаВнешнегоСобытияЗвит1С(Источник, Событие, Данные);	
		
	Иначе
		// Событие от торгового оборудования
		Если мКлиентOnline <> Неопределено Тогда
			мКлиентOnline.ВнешнееСобытие(Источник, Событие, Данные);
		КонецЕсли;

		ПолучитьСерверТО().ЗавершитьОбработкуВнешнегоСобытия(Источник, Событие, Данные);
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура проверяет и при необходимости подключает обработчик ожидания
// на запуск процедуры ПроверитьНапоминания()
//
// Параметры:
//  Нет.
//
Процедура ПроверитьПодключениеОбработчикаОжидания(ПроверятьДеньРождения = Ложь) Экспорт

	ИнтервалПроверкиНапоминанийВСекундах = Константы.ИнтервалПроверкиНапоминанийВСекундах.Получить();
	
		Если глЗначениеПеременной("глТекущийПользователь") <> Неопределено
		 И ТипЗнч(глЗначениеПеременной("глТекущийПользователь")) = Тип("СправочникСсылка.Пользователи")
		 И НЕ глЗначениеПеременной("глТекущийПользователь").Пустая()
		 И ИнтервалПроверкиНапоминанийВСекундах > 0 Тогда
		 
		ПодключитьОбработчикОжидания("ПроверитьНапоминания", ИнтервалПроверкиНапоминанийВСекундах);

		УправлениеКонтактами.ПроверитьНапоминанияПользователя(глЗначениеПеременной("глТекущийПользователь"));

	Иначе

		ОтключитьОбработчикОжидания("ПроверитьНапоминания");

	КонецЕсли; 

КонецПроцедуры

// Процедура проверяет Напоминания
//
Процедура ПроверитьНапоминания() Экспорт

	УправлениеКонтактами.ПроверитьНапоминанияПользователя(глЗначениеПеременной("глТекущийПользователь"));

КонецПроцедуры

// Проверяет необходимость открытия формы "РегистрацияПродаж" документа "ЧекККМ.
//
Процедура ЗапускИнтерфейсаКассира(мТекущийПользователь, ВключенИнтерфейсКассира)
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();

	Если ПользовательИБ <> Неопределено
	   И ПользовательИБ.ОсновнойИнтерфейс <> Неопределено
	   И ПользовательИБ.ОсновнойИнтерфейс.Имя = "ИнтерфейсКассира" Тогда //Задействуем интерфейс кассира

		ВключенИнтерфейсКассира = Истина;
		Администратор = Ложь;
		Кассир = Ложь;

		Для каждого ТекИнтерфейс Из ГлавныйИнтерфейс Цикл
			ТекИнтерфейс.Переключаемый = Ложь;
			ТекИнтерфейс.Видимость     = Ложь;
		КонецЦикла;
		ИнтерфейсКассира = ГлавныйИнтерфейс.ИнтерфейсКассира;
		ИнтерфейсКассира.Переключаемый = Истина;
		ИнтерфейсКассира.Видимость     = Истина;

		Если РольДоступна("АдминистраторККМ") Тогда //Администратор

			Администратор = Истина;

		ИначеЕсли РольДоступна("ОператорККМ") Тогда //Кассир

			Кассир = Истина;

		КонецЕсли;

		Отказ = Ложь;
		Причина = "";
		КассаККМ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ОсновнаяКассаККМ");
		Если КассаККМ = Справочники.КассыККМ.ПустаяСсылка() Тогда
			Предупреждение(НСтр("ru='Для пользователя ""';uk='Для користувача ""'")+ мТекущийПользователь +НСтр("ru='"" не выбрана касса по умолчанию!';uk='"" не обрана каса по умовчанню!'"));
			Отказ = Истина;
			Причина = НСтр("ru='Не выбрана касса по умолчанию';uk='Не обрана каса по умовчанню'");
		КонецЕсли;

		Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ОсновнойСклад");
		Если Склад = Неопределено
		 Или Склад = Справочники.Склады.ПустаяСсылка() Тогда
			Предупреждение(НСтр("ru='Для пользователя ""';uk='Для користувача ""'")+ мТекущийПользователь +НСтр("ru='"" не выбран склад по умолчанию!';uk='"" не обрано склад за замовчуванням!'"));
			Отказ = Истина;
			Причина = НСтр("ru='Не выбран склад по умолчанию';uk='Не обраний склад по умовчанню'");
		КонецЕсли;
		ФР = Неопределено;

		Если Не Отказ Тогда
			МассивФР = ПолучитьСерверТО().ПолучитьСписокУстройств(Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор, КассаККМ);

			Если МассивФР.Количество() <> 0 Тогда
			Иначе
				Предупреждение(НСтр("ru='У кассы: ""';uk='У каси: ""'") + КассаККМ + НСтр("ru='"", для компьютера: ""';uk='"", для комп''ютера: ""'") + ПолучитьСерверТО().ПолучитьИмяКомпьютераТО() + НСтр("ru='"", фискальный регистратор не установлен!';uk='"", фіскальний реєстратор не встановлений!'"));
				Отказ = Истина;
				Причина = НСтр("ru='У кассы не установлен ФР';uk='Біля каси не встановлений ФР'");
			КонецЕсли;
		КонецЕсли;

		Если Не Отказ Тогда

			Документы.ЧекККМ.СоздатьДокумент().ПолучитьФорму("ФормаРегистрацииПродаж",).Открыть();

		ИначеЕсли Администратор Тогда

			Предупреждение(НСтр("ru='Зайдите с правами администратора кассы.';uk='Зайдіть з правами адміністратора каси.'"));
			Если Причина = НСтр("ru='ФР не подключен';uk='ФР не підключений'") 
			 Или Причина = НСтр("ru='ТО не подключено';uk='ТО не підключено'") 
			 Или Причина = НСтр("ru='У кассы не установлен ФР';uk='Біля каси не встановлений ФР'") Тогда
				ФормаПодключенияОборудования = Обработки.ТОНастройка.ПолучитьФорму();
				ФормаПодключенияОборудования.Открыть();
			КонецЕсли;
			ЗавершитьРаботуСистемы();

		ИначеЕсли Кассир Тогда

			Если Причина = НСтр("ru='ФР не подключен';uk='ФР не підключений'") 
			 Или Причина = НСтр("ru='ТО не подключено';uk='ТО не підключено'") 
			 Или Причина = НСтр("ru='У кассы не установлен ФР';uk='Біля каси не встановлений ФР'") Тогда
				Предупреждение(НСтр("ru='Зайдите с правами администратора кассы.';uk='Зайдіть з правами адміністратора каси.'"));
			КонецЕсли;

			ЗавершитьРаботуСистемы();

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Открывает форму текущего пользователя для изменения его настроек.
//
// Параметры:
//  Нет.
//
Процедура ОткрытьФормуТекущегоПользователя() Экспорт

	Если НЕ ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не задан текущий пользователь.';uk='Не заданий поточний користувач.'"));
	Иначе
		Форма = глЗначениеПеременной("глТекущийПользователь").ПолучитьФорму();
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры // ОткрытьФормуТекущегоПользователя()

// функция вызова формы редактирования настройки файла обновления конфигурации
Процедура ОткрытьФормуРедактированияНастройкиФайлаОбновления() Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Константы.НастройкаФайлаОбновленияКонфигурации) Тогда
		
		Предупреждение(НСтр("ru='Нет прав на чтение данных константы ""Настройка файла обновления конфигурации""';uk='Немає прав на читання даних константи ""Настройка файлу  оновлення конфігурації""'"), 30, НСтр("ru='Настройка файла обновления конфигурации';uk='Настройка файлу оновлення конфігурації'"));		
		Возврат;
		
	КонецЕсли;

	ФормаРедактирования = ПолучитьОбщуюФорму("НастройкаФайлаОбновленияКонфигурации");
	ФормаРедактирования.СтруктураПараметров = ПроцедурыОбменаДанными.ПолучитьНастройкиДляФайлаОбновленияКонфигурации(); 
	ФормаРедактирования.Открыть();
	
КонецПроцедуры

// Процедура осуществляет проверку на необходимость обмена данными с заданным интервалом
Процедура ПроверкаОбменаДанными() Экспорт

	Если глЗначениеПеременной("глОбработкаАвтоОбменДанными") = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	ОтключитьОбработчикОжидания("ПроверкаОбменаДанными");
	
	// проводим обмен данными
	глЗначениеПеременной("глОбработкаАвтоОбменДанными").ПровестиОбменДанными(); 
		
	ПодключитьОбработчикОжидания("ПроверкаОбменаДанными", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));

КонецПроцедуры

// Функция возвращает значение экспортных переменных модуля приложенийа
//
// Параметры
//  Имя - строка, содержит имя переменной целиком 
//
// Возвращаемое значение:
//   значение соответствующей экспортной переменной
Функция глЗначениеПеременной(Имя) Экспорт
		
	Возврат ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры

// Обработать параметр запуска программы.
// Реализация функции может быть расширена для обработки новых параметров.
//
// Параметры
//  ПараметрЗапуска  – Строка – параметр запуска, переданный в конфигурацию 
//								с помощью ключа командной строки /C.
//
// Возвращаемое значение:
//   Булево   – Истина, если необходимо прервать выполнение процедуры ПриНачалеРаботыСистемы.
//
Функция ОбработатьПараметрыЗапуска(Знач ПараметрЗапуска)

	// есть ли параметры запуска
	Если ПустаяСтрока(ПараметрЗапуска) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Параметр может состоять из частей, разделенных символом ";".
	// Первая часть - главное значение параметра запуска. 
	// Наличие дополнительных частей определяется логикой обработки главного параметра.
	ПараметрыЗапуска = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПараметрЗапуска,";");
	ЗначениеПараметраЗапуска = Врег(ПараметрыЗапуска[0]);
	
	Результат = УправлениеСоединениямиИБ.ОбработатьПараметрыЗапуска(ЗначениеПараметраЗапуска, ПараметрыЗапуска);
	Возврат Результат;

КонецФункции

//  Подключить актуальный менеджер FREDO Звіт
//
Функция глПодключитьМенеджерЗвит1С(ВыводитьСообщенияОбОшибках = Истина) Экспорт
	
	ИсточникОтчета = "РегламентированныйОтчетМенеджерЗвит1С";
	
	Если глМенеджерЗвит1С <> Неопределено Тогда
		
		//  Проверим, был ли подключен/переподключен внешний менеджер FREDO Звіт
		Если РегламентированнаяОтчетность.ВерсияРеглОтчетаАктуальна(ИсточникОтчета) = Истина Тогда
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		ПравоДоступаКОтчету = РегламентированнаяОтчетность.ПравоДоступаКРегламентированномуОтчету(ИсточникОтчета);
		Если ПравоДоступаКОтчету = Ложь ИЛИ ПравоДоступаКОтчету = Неопределено Тогда
			
			Если ВыводитьСообщенияОбОшибках Тогда 
				Предупреждение(НСтр("ru='Недостаточно прав на использование модуля взаимодействия с ""FREDO Звіт""!';uk='Недостатньо прав на використання модуля взаємодії з ""FREDO Звіт""!'"));
			КонецЕсли;			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МенеджерЗвит1С = РегламентированнаяОтчетность.РеглОтчеты(ИсточникОтчета);
	
	Если МенеджерЗвит1С = Неопределено Тогда
		Если ВыводитьСообщенияОбОшибках Тогда
			Сообщить(НСтр("ru='Не удалось получить менеджер ""FREDO Звіт""!';uk='Не вдалося отримати менеджер ""FREDO Звіт""!'"), СтатусСообщения.Важное);
			 
			
			// Возможно это ошибка для которой детальная информация не должна выводиться
			// выведем ее принудительно
			НайденныйЭлемент = РегламентированнаяОтчетность.ПолучитьРеглОтчетПоУмолчанию(ИсточникОтчета);
			Если НайденныйЭлемент = Справочники.РегламентированныеОтчеты.ПустаяСсылка() Тогда
				Сообщить(НСтр("ru='В справочнике ""Регламентированные отчеты"" не найден менеджер по работе с системой ""FREDO Звіт""';uk='У довіднику ""Регламентовані звіти"" не знайдений менеджер по роботі з системою ""FREDO Звіт""'"));
			КонецЕсли;
			
		КонецЕсли;
		
		Если глМенеджерЗвит1С <> Неопределено Тогда
			
			Если ВыводитьСообщенияОбОшибках Тогда                                                                                                                            
				Сообщить(НСтр("ru='Будет использован уже загруженный менеджер';uk='Буде використаний вже завантажений менеджер'"), СтатусСообщения.Информация);
			КонецЕсли;
			Возврат Истина;
			
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(МенеджерЗвит1С) = Тип("ОтчетМенеджер.РегламентированныйОтчетМенеджерЗвит1С") Тогда
		МенеджерЗвит1С = МенеджерЗвит1С.Создать();
	КонецЕсли;
	
	Если глМенеджерЗвит1С = Неопределено Тогда
		
		// Обновляем глобальную переменную сразу для поддержки новых конфигураций с старым внешним менеджером FREDO Звіт
		
		глМенеджерЗвит1С = МенеджерЗвит1С;
		
		Если Не глМенеджерЗвит1С.Инициализация(ВыводитьСообщенияОбОшибках) Тогда		
			глМенеджерЗвит1С = Неопределено;
			Возврат Ложь;	
		КонецЕсли;
		
	Иначе
		Попытка
			
			Если Не МенеджерЗвит1С.Переинициализация(ВыводитьСообщенияОбОшибках, глМенеджерЗвит1С) Тогда		
				Если ВыводитьСообщенияОбОшибках Тогда                                                                                                                            
					Сообщить(НСтр("ru='Будет использован уже загруженный менеджер';uk='Буде використаний вже завантажений менеджер'"), СтатусСообщения.Информация);
				КонецЕсли;
				Возврат Истина;
				
			КонецЕсли;
			
			глМенеджерЗвит1С = МенеджерЗвит1С;
			
		Исключение
			
			// Если остался устаревший менеджер FREDO Звіт. То в нем нет метода Переинициализация(...)
			
			Если ВыводитьСообщенияОбОшибках Тогда
				Сообщить(НСтр("ru='Не удалось переподключить менеджер ""FREDO Звіт"". "
"Необходимо обновить менеджер FREDO Звіт в справочнике ""Регламентированные отчеты""';uk='Не вдалося перепідключити менеджер ""FREDO Звіт"". "
"Необхідно оновити менеджер FREDO Звіт в довіднику ""Регламентовані звіти""'"), СтатусСообщения.Важное);
				Сообщить(НСтр("ru='Будет использован уже загруженный менеджер';uk='Буде використаний вже завантажений менеджер'"), СтатусСообщения.Информация);			
			КонецЕсли;
			Возврат Истина;
			
		КонецПопытки;
		
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

Процедура БухгалтерскийДействие() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

АдресРесурсовОбозревателя = "TradeEntrUkr"; // Не допускается изменять значение данной переменной
