////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ)

	// среди всех типов цен одного контрагента не может быть более одного,
	// ссылающегося на данный тип цен компании
	Если НЕ ОбменДанными.Загрузка И ЗначениеЗаполнено(ТипЦеныНоменклатуры) Тогда
		Отбор = Новый Структура("ТипЦеныНоменклатуры",ТипЦеныНоменклатуры);
		Выборка = Справочники.ТипыЦенНоменклатурыКонтрагентов.Выбрать(,Владелец,Отбор,);
		Пока Выборка.Следующий() Цикл
			Если Ссылка <> Выборка.Ссылка Тогда
				// такой тип цен уже встречался
				#Если Клиент Тогда
				Предупреждение(НСтр("ru='Тип цен номенклатуры ';uk='Тип цін номенклатури '")+Выборка.ТипЦеныНоменклатуры.Наименование+НСтр("ru=' уже использовался ';uk=' вже використовувався '")
				              +НСтр("ru='в типе цен номенклатуры контрагента ';uk='у типі цін номенклатури контрагента '")+Выборка.Наименование+"!");
				#КонецЕсли			  
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
