////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет, существуют ли ссылки на договор в движениях регистров накопления.
// Если есть - нельзя менять:
//  - Валюту взаиморасчетов
//  - Ведение взаиморасчетов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт

	Возврат ПолныеПрава.ПроверитьНаличиеСсылокНаДоговорКонтрагента(Ссылка);

КонецФункции //  СуществуютСсылки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() Тогда

		Если ЭтоГруппа Тогда

			// Для группы владельца менять нельзя
			Если Владелец <> Ссылка.Владелец Тогда

				Сообщить(НСтр("ru='Нельзя изменять контрагента для группы договоров.';uk='Не можна змінювати контрагента для групи договорів.'"), СтатусСообщения.Важное);
				Отказ = Истина;

			КонецЕсли; 

		Иначе

			// Проверим возможность смены владельца для договора
			Если Владелец <> Ссылка.Владелец Тогда

				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ДокументыПоДоговоруКонтрагента.Ссылка
				|ИЗ
				|	КритерийОтбора.ДокументыПоДоговоруКонтрагента(&Договор) КАК ДокументыПоДоговоруКонтрагента";
				
				Запрос.УстановитьПараметр("Договор", Ссылка);
				
				Результат = Запрос.Выполнить();
				ЕстьДокументыПоДоговору = НЕ Результат.Пустой();
				
				Если ЕстьДокументыПоДоговору Тогда

					Сообщить(НСтр("ru='Существуют документы, оформленные по договору ""';uk='Існують документи, оформлені по договору ""'") + Наименование + НСтр("ru='""."
"Контрагент договора не может быть изменен, элемент не записан.';uk='""."
"Контрагент договору не може бути змінений елемент не записаний.'"), 
							 СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли; 

			КонецЕсли; 

			// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
			Если ВедениеВзаиморасчетов <> Ссылка.ВедениеВзаиморасчетов
			 ИЛИ ВалютаВзаиморасчетов <> Ссылка.ВалютаВзаиморасчетов 
			 ИЛИ ВидДоговора <> Ссылка.ВидДоговора
			 ИЛИ Организация <> Ссылка.Организация			 
			 ИЛИ ВидУсловийДоговора <> Ссылка.ВидУсловийДоговора
			 ИЛИ СхемаНалоговогоУчета <> Ссылка.СхемаНалоговогоУчета И НЕ Ссылка.СхемаНалоговогоУчета.Пустая()
			 ИЛИ СхемаНалоговогоУчетаПоТаре <> Ссылка.СхемаНалоговогоУчетаПоТаре И НЕ Ссылка.СхемаНалоговогоУчетаПоТаре.Пустая()
			 ИЛИ СложныйНалоговыйУчет <> Ссылка.СложныйНалоговыйУчет 
			 ИЛИ ВестиПоДокументамРасчетовСКонтрагентомРегл <> Ссылка.ВестиПоДокументамРасчетовСКонтрагентомРегл 
			 ИЛИ ВестиПоДокументамРасчетовСКонтрагентом <> Ссылка.ВестиПоДокументамРасчетовСКонтрагентом Тогда

				Если ЭтотОбъект.СуществуютСсылки() Тогда

					Сообщить(НСтр("ru='Существуют документы, проведенные по договору ""';uk='Існують документи, проведені по договору ""'") + Наименование + НСтр("ru='""."
"Реквизиты ""Организация"", ""Ведение взаиморасчетов"", ""Валюта взаиморасчетов"", ""Вести по документам расчета с контрагентом (упр или бух. учет)""""Вид договора"","
"""Вести по документам расчетов с контрагентом"", ""Сложный учет НДС и НП"", ""Схема налогового учета"" и ""Условия выполнения договора"" не могут быть изменены, элемент не записан.';uk='""."
"Реквізити ""Організація"", ""Ведення взаєморозрахунків"", ""Валюта взаєморозрахунків"", ""Вести по документах розрахунку з контрагентом (упр або бух. облік)""""Вид договору"","
"""Вести по документах розрахунків з контрагентом"", ""Складний облік ПДВ і ПП"", ""Схема податкового обліку"" і ""Умови виконання договору"" не можуть бути змінені, елемент не записаний.'"), 
							 СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;
			
			Если  ОбособленныйУчетТоваровПоЗаказамПокупателей<>Ссылка.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
				Если ПолныеПрава.ПроверитьНаличиеСсылокНаДоговорКонтрагентаВЗаказахПокупателей(Ссылка) Тогда
					Сообщить(НСтр("ru='Существуют заказы покупателей, проведенные по договору ""';uk='Існують замовлення покупців, проведені за договором ""'") + Наименование + НСтр("ru='""."
"Реквизит ""Обособленный учет товаров по заказам покупателей"" не может быть изменен, элемент не записан.';uk='""."
"Реквізит ""Відособлений облік товарів по замовленнях покупців"" не може бути змінений, елемент не записаний.'"), 
					СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	// Проверим заполнение и очистим неиспользуемые реквизиты элемента договора.
	Если Не ЭтоГруппа Тогда

		// Проверим, заполнена ли валюта.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			Сообщить(НСтр("ru='Не указана валюта договора.';uk='Не вказана валюта договору.'"), СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнена ли организация.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(Организация) Тогда
			Сообщить(НСтр("ru='Не указана организация, от которой заключен договор.';uk='Не вказана організація, від якої укладений договір.'"), СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли способ ведения взаиморасчетов.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВедениеВзаиморасчетов) Тогда
			Сообщить(НСтр("ru='Не указан способ ведения взаиморасчетов по договору.';uk='Не вказаний спосіб ведення взаєморозрахунків по договору.'"), СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли вид договора.
		Если НЕ ОбменДанными.Загрузка Тогда
		
			Если НЕ ЗначениеЗаполнено(ВидДоговора) Тогда
				Сообщить(НСтр("ru='Не указан вид договора.';uk='Не зазначений вид договору.'"), СтатусСообщения.Важное);
				Отказ = Истина;
			Иначе
				// Проверим, правильно ли заполнен вид договора
				Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
					И НЕ Владелец.Покупатель Тогда
					Сообщить(НСтр("ru='Вид договора ""С покупателем"" может устанавливаться только когда у контрагента указано что он является покупателем.';uk='Вид договору ""З покупцем"" може встановлюватися тільки коли у контрагента зазначено, що він є покупцем.'"), СтатусСообщения.Важное);
					Отказ = Истина;
				ИначеЕсли (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
					И НЕ Владелец.Поставщик Тогда
					Сообщить(НСтр("ru='Вид договора ""С поставщиком"" может устанавливаться только когда у контрагента указано что он является поставщиком.';uk='Вид договору ""З постачальником"" може встановлюватися тільки коли у контрагента зазначено, що він є постачальником.'"), СтатусСообщения.Важное);
					Отказ = Истина;
				ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее
					И ВестиПоДокументамРасчетовСКонтрагентом Тогда
					Сообщить(НСтр("ru='Флажок ""Вести по документам расчетов с контрагентами"" не может устанавливаться у договоров с видом ""Прочее"".';uk='Прапор ""Вести по документам розрахунків з контрагентами"" не може встановлюватися у договорів з видом ""Інше"".'"), СтатусСообщения.Важное);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли; 

		Если Не КонтролироватьСуммуЗадолженности Тогда
			ДопустимаяСуммаЗадолженности = 0;
		КонецЕсли;

		Если Не КонтролироватьЧислоДнейЗадолженности Тогда
			ДопустимоеЧислоДнейЗадолженности = 0;
		КонецЕсли;

		Если Не ДержатьРезервБезОплатыОграниченноеВремя Тогда
			ЧислоДнейРезерваБезОплаты = 0;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура УстановитьСхемуНалогообложения() Экспорт
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		//СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомиссионером;
		СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомиссионером_НК;
		СложныйНалоговыйУчет = Истина;
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		//СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомитентом;
		СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомитентом_НК;
		СложныйНалоговыйУчет = Истина;
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.Бартер;		
	Иначе
		Если Внешнеэкономический Тогда
			СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ВЭД;		
		Иначе	
			СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
