Перем мОснование;

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
		ЭтотОбъект.ОсновнойБанковскийСчет     = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|   и Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Основание.ЮрФизЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;		
		мОснование             = Основание;
		
		КодыОрганизации = РегистрыСведений.КодыОрганизации.ПолучитьПоследнее(,Новый Структура("Организация",Основание));
		
		ИНН                    = КодыОрганизации.ИНН;
		КодПоЕДРПОУ            = КодыОрганизации.КодПоЕДРПОУ;
		НомерСвидетельства     = КодыОрганизации.НомерСвидетельства;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	Перем мСсылкаНового;
	
	// при обмене данными ничего не проверяем
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим основной вид деятельности контрагента
	Если ЗначениеЗаполнено(ОсновнойВидДеятельности) И ВидыДеятельности.Найти(ОсновнойВидДеятельности, "ВидДеятельности") = Неопределено Тогда
		ОсновнойВидДеятельности = Справочники.ВидыДеятельностиКонтрагентов.ПустаяСсылка();
	КонецЕсли; 
	
	НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель, мСсылкаНового);

	// установим головного контрагента если он не заполнен
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
			Если ЭтоНовый() Тогда
				ГоловнойКонтрагент = мСсылкаНового;
			Иначе
				ГоловнойКонтрагент = Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда

			Если ЗначениеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Контрагент %1 не может быть выбран головным, "
"так как для него уже был назначен головной контрагент %2!';uk='Контрагент %1 не може бути обраний головним, "
"тому що для нього вже був призначений головний контрагент %2!'"), СокрЛП(ГоловнойКонтрагент), СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)));
				Отказ = Истина;
				Возврат;
			Иначе

				// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
				// в качестве головного у другого контрагента.
				ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
				Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда

					СообщениеОНевозможностиЗаписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Контрагент %1 не может иметь головного контрагента!"
"Этот контрагент уже установлен головным для: ';uk='Контрагент %1 не може мати головного контрагента!"
"Цей контрагент уже встановлений головним для: '"), СокрЛП(ЭтотОбъект));
					Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
						СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
					КонецЦикла;

					ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
					Отказ = Истина;
					Возврат;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
		
		//Дандали В. 18.03.2023 {
		Если НЕ Отказ И НЕ Ссылка.ЭтоГруппа И ЗначениеЗаполнено(Ссылка.Родитель)
			И Ссылка.Родитель.Абоненты и Покупатель Тогда
			СоздатьДоговора(Ссылка);		
		КонецЕсли;
		//Дандали В. 18.03.2023 }
		
		
		Если ЗначениеЗаполнено(мОснование) Тогда
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Контрагент = Ссылка;
			ЗаписьРегистра.ВидСвязи   = Перечисления.ВидыСобственныхКонтрагентов.Организация;
			ЗаписьРегистра.Объект     = мОснование;
			НаборЗаписей.Записать(Ложь);
			мОснование = "";
		КонецЕсли;
		
	КонецЕсли;
	Если Модифицированность() Тогда 
		Записать();
	КонецЕсли;
КонецПроцедуры


Процедура СоздатьДоговора(Контрагент)
	
ОрганизацияУпр 		= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("bc270abf-9b1b-11ed-bf12-00155d86af1e"));//VechirTelecom (упр.)
ОрганизацияВечер 	= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9"));//ВЕЧІР ТЕЛЕКОМ ТОВ
	
	#Область ДоговорСПокупателем
	
		Если НЕ ДоговорСуществует(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем, Контрагент, ОрганизацияВечер) Тогда
			
			Если (Покупатель И Поставщик) ИЛИ (Покупатель) Тогда
							
				СпрОб = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
				СпрОб.Наименование = Контрагент.ID;
				СпрОб.Номер = Контрагент.ID;
				СпрОб.Владелец = Контрагент;
					

				ВедениеВзаиморасчетовПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
				Если ЗначениеЗаполнено(ВедениеВзаиморасчетовПоУмолчанию) Тогда
					СпрОб.ВедениеВзаиморасчетов = ВедениеВзаиморасчетовПоУмолчанию;
				Иначе
					СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
				КонецЕсли;
				
				ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
				Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
					СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");
				КонецЕсли;
				
				Если Контрагент.НеЯвляетсяРезидентом Тогда
					СпрОб.Внешнеэкономический = Истина;
				КонецЕсли;

				Если СпрОб.Внешнеэкономический и СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
					СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета")	
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ОрганизацияВечер) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	Организации.Ссылка,
						|	Организации.Наименование
						|ИЗ
						|	Справочник.Организации КАК Организации";

					Результат = Запрос.Выполнить();

					Выборка = Результат.Выбрать();

					Пока НЕ ЗначениеЗаполнено(СпрОб.Организация) И Выборка.Следующий() Цикл
						СпрОб.Организация = Выборка.Ссылка;
					КонецЦикла;
				КонецЕсли;
				СпрОб.Организация = ОрганизацияВечер;
				
				СпрОб.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
					
				Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
					СпрОб.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
				КонецЕсли;

				Если СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
				 ИЛИ СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
					СпрОб.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
				КонецЕсли;
				
				Если СпрОб.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
					СпрОб.ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
				КонецЕсли;
				
				СпрОб.СложныйНалоговыйУчет = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеЗначениеСложныйНалоговыйУчет");
				
				Если СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
					СпрОб.ВестиПоДокументамРасчетовСКонтрагентомРегл = СпрОб.ВестиПоДокументамРасчетовСКонтрагентом;
				КонецЕсли;
				
				Если (СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) И ТипЗнч(СпрОб.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
					СпрОб.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
				ИначеЕсли (СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) И ТипЗнч(СпрОб.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
					СпрОб.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();
				КонецЕсли;
				
				СпрОб.УстановитьСхемуНалогообложения();
				
				СпрОб.ВыводитьИнформациюОСделкеПриПечатиДокументов = НЕ (СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);

				Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
					СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Бартер;
				ИначеЕсли СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
					  ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				    СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Комиссия;
				Иначе
					СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Поставка;
				КонецЕсли;	
				
				Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
					СпрОб.ФормаРасчетов = "Бартер";  	
				Иначе		
					СпрОб.ФормаРасчетов = "Оплата з поточного рахунку";
				КонецЕсли;
				
				Попытка
					СпрОб.Записать();
					ОсновнойДоговорКонтрагента = СпрОб.Ссылка;
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
	КонецЕсли;
	#КонецОбласти
		
	#Область ДоговорСПокупателемУпр
	
		Если НЕ ДоговорСуществует(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем, Контрагент, ОрганизацияУпр) Тогда
			
			Если (Покупатель И Поставщик) ИЛИ (Покупатель) Тогда
							
				СпрОб = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
				СпрОб.Наименование = Контрагент.ID;
				СпрОб.Номер = Контрагент.ID;
				СпрОб.Владелец = Контрагент;
					

				ВедениеВзаиморасчетовПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
				Если ЗначениеЗаполнено(ВедениеВзаиморасчетовПоУмолчанию) Тогда
					СпрОб.ВедениеВзаиморасчетов = ВедениеВзаиморасчетовПоУмолчанию;
				Иначе
					СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
				КонецЕсли;
				
				ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
				Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
					СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");
				КонецЕсли;
				
				Если Контрагент.НеЯвляетсяРезидентом Тогда
					СпрОб.Внешнеэкономический = Истина;
				КонецЕсли;

				Если СпрОб.Внешнеэкономический и СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
					СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета")	
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ОрганизацияУпр) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	Организации.Ссылка,
						|	Организации.Наименование
						|ИЗ
						|	Справочник.Организации КАК Организации";

					Результат = Запрос.Выполнить();

					Выборка = Результат.Выбрать();

					Пока НЕ ЗначениеЗаполнено(СпрОб.Организация) И Выборка.Следующий() Цикл
						СпрОб.Организация = Выборка.Ссылка;
					КонецЦикла;
				КонецЕсли;
				СпрОб.Организация = ОрганизацияУпр;
				
				СпрОб.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
					
				Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
					СпрОб.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
				КонецЕсли;

				Если СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
				 ИЛИ СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
					СпрОб.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
				КонецЕсли;
				
				Если СпрОб.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
					СпрОб.ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
				КонецЕсли;
				
				СпрОб.СложныйНалоговыйУчет = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеЗначениеСложныйНалоговыйУчет");
				
				Если СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
					СпрОб.ВестиПоДокументамРасчетовСКонтрагентомРегл = СпрОб.ВестиПоДокументамРасчетовСКонтрагентом;
				КонецЕсли;
				
				Если (СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) И ТипЗнч(СпрОб.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
					СпрОб.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
				ИначеЕсли (СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) И ТипЗнч(СпрОб.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
					СпрОб.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();
				КонецЕсли;
				
				СпрОб.УстановитьСхемуНалогообложения();
				
				СпрОб.ВыводитьИнформациюОСделкеПриПечатиДокументов = НЕ (СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);

				Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
					СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Бартер;
				ИначеЕсли СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
					  ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				    СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Комиссия;
				Иначе
					СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Поставка;
				КонецЕсли;	
				
				Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
					СпрОб.ФормаРасчетов = "Бартер";  	
				Иначе		
					СпрОб.ФормаРасчетов = "Оплата з поточного рахунку";
				КонецЕсли;
				
				Попытка
					СпрОб.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	#Область ДоговорСКомисионером
	Если Покупатель Тогда 
	Если ДоговорСуществует(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером, Контрагент, ОрганизацияВечер) Тогда
		Возврат;
	КонецЕсли;
	
	СпрОб = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	СпрОб.Наименование = Контрагент.ID;
	СпрОб.Номер = Контрагент.ID;
	СпрОб.Владелец = Контрагент;
	
	СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;

	ВедениеВзаиморасчетовПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
	Если ЗначениеЗаполнено(ВедениеВзаиморасчетовПоУмолчанию) Тогда
		СпрОб.ВедениеВзаиморасчетов = ВедениеВзаиморасчетовПоУмолчанию;
	Иначе
		СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	КонецЕсли;
	
	ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;
	
	Если Контрагент.НеЯвляетсяРезидентом Тогда
		СпрОб.Внешнеэкономический = Истина;
	КонецЕсли;

	Если СпрОб.Внешнеэкономический и СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
		СпрОб.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета")	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОрганизацияВечер) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Организации.Ссылка,
			|	Организации.Наименование
			|ИЗ
			|	Справочник.Организации КАК Организации";

		Результат = Запрос.Выполнить();

		Выборка = Результат.Выбрать();

		Пока НЕ ЗначениеЗаполнено(СпрОб.Организация) И Выборка.Следующий() Цикл
			СпрОб.Организация = Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	СпрОб.Организация = ОрганизацияВечер;
	
	
	СпрОб.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
		
	Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		СпрОб.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
	КонецЕсли;

	Если СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
	 ИЛИ СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		СпрОб.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
	КонецЕсли;
	
	Если СпрОб.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		СпрОб.ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
	КонецЕсли;
	
	СпрОб.СложныйНалоговыйУчет = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеЗначениеСложныйНалоговыйУчет");
	
	Если СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		СпрОб.ВестиПоДокументамРасчетовСКонтрагентомРегл = СпрОб.ВестиПоДокументамРасчетовСКонтрагентом;
	КонецЕсли;
	
	Если (СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) И ТипЗнч(СпрОб.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
		СпрОб.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	ИначеЕсли (СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) И ТипЗнч(СпрОб.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
		СпрОб.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	СпрОб.УстановитьСхемуНалогообложения();
	
	СпрОб.ВыводитьИнформациюОСделкеПриПечатиДокументов = НЕ (СпрОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);

	Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Бартер;
	ИначеЕсли СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
		  ИЛИ СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
	    СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Комиссия;
	Иначе
		СпрОб.ВидДоговораПоГК = Справочники.ВидыДоговоровПоГК.Поставка;
	КонецЕсли;	
	
	Если СпрОб.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		СпрОб.ФормаРасчетов = "Бартер";  	
	Иначе		
		СпрОб.ФормаРасчетов = "Оплата з поточного рахунку";
	КонецЕсли;
	
	Попытка
		СпрОб.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

Функция ДоговорСуществует(ВидДоговора, Контрагент, Организация) 
	Попытка
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Поле1
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
Исключение
	Возврат Ложь;
	КонецПопытки;
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции