
// Процедура вызывается перед записью набора регистра сведений
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура должна быть заполнена обязательно!';uk=""Номенклатура повинна бути заповнена обов'язково!"""), Отказ);
			ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура не может быть услугой!';uk='Номенклатура не може бути послугою!'"), Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Склад) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Склад должен быть заполнен обязательно!';uk=""Склад повинен бути заповнений обов'язково!"""), Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.МестоХранения) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Место хранения должно быть заполнено обязательно!';uk=""Місце зберігання повинно бути заповнено обов'язково!"""), Отказ);
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
