
Процедура ПриЗаписиМобильногоДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	//Если Источник.Номер = "00000000184" ИЛИ Источник.Номер = "КД000002012"  Тогда
	//	Возврат;
	//КонецЕсли;
	
	УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(Источник.КодУзлаОбмена);
	Если УзелОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ИзменениеОрганизации") ИЛИ Источник.ДополнительныеСвойства.Свойство("СозданиеНового") ИЛИ Источник.ДополнительныеСвойства.Свойство("ИзменениеТоваров") Тогда 
		Возврат;
		
	КонецЕсли;
	ИмяКонфигурации = УзелОбмена.Конфигурация;
	Если ИмяКонфигурации="" Тогда 
		ИмяКонфигурации = "УТП";
	КонецЕсли;
	СоответствиеМенеджеровДокументов = ПолучитьСоответствиеИменМенеджеровМобильныхДокументов(ИмяКонфигурации);
	ИмяМенеджераДокумента = СоответствиеМенеджеровДокументов.Получить(Источник.Метаданные().Имя);
	Если НЕ ЗначениеЗаполнено(ИмяМенеджераДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	НеобходимоСделатьЗаписьСоответствия = Ложь;
	МенеджерЗаписиСоответствия = РегистрыСведений.vrgСоответствияМобильныхДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписиСоответствия.МобильныйДокумент = Источник.Ссылка;
	МенеджерЗаписиСоответствия.Прочитать();
	Если МенеджерЗаписиСоответствия.Выбран() Тогда
		ДокументОбъект = МенеджерЗаписиСоответствия.ОсновнойДокумент.ПолучитьОбъект();
		Если ДокументОбъект.Проведен Тогда
			Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
			КонецПопытки;
		КонецЕсли;
		Если ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.ЗаказПокупателя") Тогда 
			Если Источник.ПометкаУдаления <> ДокументОбъект.ПометкаУдаления Тогда
				ДокументОбъект.УстановитьПометкуУдаления(Источник.ПометкаУдаления);
			КонецЕсли;
		КонецЕсли;
	Иначе
		НеобходимоСделатьЗаписьСоответствия = Истина;
	КонецЕсли;
	
	 
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.vrgМаршрутныйЛист") Тогда
		
		ДокументОбъект = ПолучитьДокументМаршрутныйЛистЗаМесяц(Источник.Ссылка);
		Если ДокументОбъект = Неопределено Тогда
			
			Возврат
			
		КонецЕсли;
		
	Иначе
		
		Если ДокументОбъект = Неопределено Тогда
			ДокументОбъект = Документы[ИмяМенеджераДокумента].СоздатьДокумент();
			
			
		
		КонецЕсли;
		
	КонецЕсли;
	Если не ДокументОбъект.ПометкаУдаления Тогда	
		Выполнить("ЗаполнитьИзменитьДокумент" + ИмяМенеджераДокумента + ИмяКонфигурации + "(Источник, ДокументОбъект, УзелОбмена)");
		
		ЗаполнитьРеквизитыДокумента(ДокументОбъект);
		ВыполнитьЗаписьДокумента(ДокументОбъект, УзелОбмена,Источник);
		
		Если НеобходимоСделатьЗаписьСоответствия Тогда
			МенеджерЗаписиСоответствия.МобильныйДокумент = Источник.Ссылка;
			МенеджерЗаписиСоответствия.ОсновнойДокумент = ДокументОбъект.Ссылка;
			МенеджерЗаписиСоответствия.Записать(Истина);
		КонецЕсли;
		
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда 
			
			СформироватьДополнительныеДокументыПоЗаказуПокупателя(Источник,ДокументОбъект)
			
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьЗаписьДокумента(ДокументОбъект, УзелОбмена,Источник)
	Если не ДокументОбъект.ПометкаУдаления тогда 
		
		Попытка			
			Если ТипЗнч(ДокументОбъект) = тип("ДокументОбъект.ЗаказПокупателя") и (ДокументОбъект.Проект = Справочники.Проекты.НайтиПоКоду("S00000085") или ДокументОбъект.Проект = Справочники.Проекты.НайтиПоКоду("S00000174"))   Тогда 				
				Если Источник.Оплачен Тогда 
					//ЗаписьЖурналаРегистрации("ДокументОбъект"+ДокументОбъект,УровеньЖурналаРегистрации.Ошибка,,,"");
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);					
				Иначе
					Если ДокументОбъект.Проведен Тогда
						// если документ проведен, записываем с отменой проведения
						ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Иначе
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
				КонецЕсли;				
			Иначе				
				Если ДокументОбъект.Проведен Тогда
					// если документ проведен, записываем с отменой проведения
					ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Иначе
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			Сообщить(ОписаниеОшибки());
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
		
		
		
		Если ТипЗнч(ДокументОбъект) = тип("ДокументОбъект.ЗаказПокупателя")  Тогда 			
			Если Источник.Оплачен и (ДокументОбъект.Проект = Справочники.Проекты.НайтиПоКоду("S00000085") или  ДокументОбъект.Проект = Справочники.Проекты.НайтиПоКоду("S00000174"))  Тогда 
				//ЗаписьЖурналаРегистрации("ДокументОбъект"+ДокументОбъект,УровеньЖурналаРегистрации.Ошибка,,,"");
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);				
			КонецЕсли;			
		КонецЕсли;
		
		//Если ТипЗнч(ДокументОбъект) = тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		//	Попытка
		//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ЗаписьЖурналаРегистрации("ДокументОбъект"+ДокументОбъект,УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки(),"");
		//	КонецПопытки;
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыДокумента(ДокументОбъект) Экспорт
	
	
	
КонецПроцедуры

Функция ПолучитьСоответствиеИменМенеджеровМобильныхДокументов(ИмяКонфигурации) Экспорт
	
	СоответствиеМенеджеровДокументов = Новый Соответствие;
	
	Если ИмяКонфигурации = "УТП" Тогда
		СоответствиеМенеджеровДокументов.Вставить("vrgИнвентаризацияМобильная", "ИнвентаризацияТоваровНаСкладе");
		СоответствиеМенеджеровДокументов.Вставить("vrgПоступлениеМобильное", "ПоступлениеТоваровУслуг");
		СоответствиеМенеджеровДокументов.Вставить("vrgПриходныйОрдерМобильный", "ПриходныйОрдерНаТовары");
		СоответствиеМенеджеровДокументов.Вставить("vrgРасходныйОрдерМобильный", "РасходныйОрдерНаТовары");
		СоответствиеМенеджеровДокументов.Вставить("vrgРеализацияМобильная", "РеализацияТоваровУслуг");
		СоответствиеМенеджеровДокументов.Вставить("vrgВозвратМобильный", "ВозвратТоваровОтПокупателя");
		СоответствиеМенеджеровДокументов.Вставить("vrgВозвратПоставщикуМобильный", "ВозвратТоваровПоставщику");
		СоответствиеМенеджеровДокументов.Вставить("vrgСписаниеМобильное", "СписаниеТоваров");
		СоответствиеМенеджеровДокументов.Вставить("vrgОприходованиеМобильное", "ОприходованиеТоваров");
		СоответствиеМенеджеровДокументов.Вставить("vrgПеремещениеМобильное", "ПеремещениеТоваров");
		СоответствиеМенеджеровДокументов.Вставить("vrgЗаказПоставщикуМобильный", "ЗаказПоставщику");
		СоответствиеМенеджеровДокументов.Вставить("vrgЗаказКлиентаМобильный", "ЗаказПокупателя");
		//+NovashIV_24.01.2023
		СоответствиеМенеджеровДокументов.Вставить("vrgТребованияНакладнаяМобыльный", "ТребованиеНакладная");
		СоответствиеМенеджеровДокументов.Вставить("vrgМаршрутныйЛист", "МаршрутныйЛист");
		//-NovashIV_24.01.2023
	ИначеЕсли ИмяКонфигурации = "BASRetail" Тогда
		СоответствиеМенеджеровДокументов.Вставить("vrgИнвентаризацияМобильная", "ПересчетТоваров");
		СоответствиеМенеджеровДокументов.Вставить("vrgПоступлениеМобильное", "ПоступлениеТоваров");
		СоответствиеМенеджеровДокументов.Вставить("vrgЗаказПоставщикуМобильный", "ЗаказПоставщику");
	ИначеЕсли ИмяКонфигурации = "УТ23" Тогда
		СоответствиеМенеджеровДокументов.Вставить("vrgИнвентаризацияМобильная", "ИнвентаризацияТоваровНаСкладе");
		СоответствиеМенеджеровДокументов.Вставить("vrgПеремещениеМобильное", "ПеремещениеТоваров");
	КонецЕсли;
	
	Возврат СоответствиеМенеджеровДокументов;
	
КонецФункции

#Область УТП


Функция ПолучитьДокументМаршрутныйЛистЗаМесяц(ДокМоб) Экспорт 
	
	
	ДатаПоиска = НачалоМесяца(ТекущаяДата());
	
	Если ДатаПоиска <> НачалоМесяца(ДокМоб.Дата) Тогда
		
		Возврат Неопределено
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛист.Ссылка
		|ИЗ
		|	Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|ГДЕ
		|	МаршрутныйЛист.Дата > &Дата
		|	И МаршрутныйЛист.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", ДатаПоиска);
	Запрос.УстановитьПараметр("Сотрудник", ДокМоб.Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого  Стр Из  РезультатЗапроса Цикл
		
			
		
		Если ДатаПоиска = НачалоМесяца(Стр.Ссылка.Дата)  Тогда
			
			Возврат Стр.Ссылка.ПолучитьОбъект();
			
		Иначе
			
			Продолжить;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	
	
	
	НовыйДокумент = Документы.МаршрутныйЛист.СоздатьДокумент();
	НовыйДокумент.ПериодРегистрации = НачалоМесяца(ДокМоб.Дата);
	Возврат НовыйДокумент

	
	
КонецФункции

Процедура ЗаполнитьИзменитьДокументИнвентаризацияТоваровНаСкладеУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	Если НЕ МобильныйДокумент.СозданНаМобильномУстройстве Тогда
		Возврат;
	КонецЕсли;
		
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	//ДокументОбъект.Номер = МобильныйДокумент.Номер;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	//ДокументОбъект.УчитыватьСерии = Истина;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.КоличествоУчет = СтрокаТовары.КоличествоУчет;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТовары.Коэффициент;
		СтрокаТабличнойЧасти.Примечание      = СтрокаТовары.Примечание;
		СтрокаТабличнойЧасти.Этикетка      = СтрокаТовары.Этикетка;
		СтрокаТабличнойЧасти.Цена             = 0;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументПоступлениеТоваровУслугУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	ДокументОбъект.СкладОрдер = МобильныйДокумент.Склад;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	Если ЗначениеЗаполнено(МобильныйДокумент.ЗаказПоставщику) Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, МобильныйДокумент.ЗаказПоставщику);
	Иначе
		ДокументОбъект.Контрагент = МобильныйДокумент.Контрагент;
		ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокументОбъект, ДокументОбъект.мСтруктураПараметровДляПолученияДоговора);
		ДокументОбъект.ДоговорКонтрагента = МобильныйДокумент.ДоговорКонтрагента;
		СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокументОбъект);
		СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
		ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокументОбъект, Неопределено, ДокументОбъект.мВалютаРегламентированногоУчета,
		СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары");
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.мВалютаРегламентированногоУчета;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.ОтражатьВБухгалтерскомУчете = Ложь;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	ДокументОбъект.Сделка = МобильныйДокумент.ЗаказПоставщику;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.ЗаказПоставщику = МобильныйДокумент.ЗаказПоставщику;
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, "Приобретение");
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		//МассивСтрок = МобильныйДокумент.ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура", НоваяСтрокаТовары.Номенклатура));
		//Если МассивСтрок.Количество() > 0 Тогда
		//	НоваяСтрокаТовары.Цена = МассивСтрок[0].Цена;
		//КонецЕсли;
		СтрокаТабличнойЧасти.Цена = СтрокаТовары.Цена;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТовары.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ДокументОбъект.ОтражатьВБухгалтерскомУчете, ДокументОбъект.ОтражатьВБухгалтерскомУчете);
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументПриходныйОрдерНаТоварыУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходныйОрдер.Перемещение;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	Если ЗначениеЗаполнено(МобильныйДокумент.ПеремещениеТоваров) Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, МобильныйДокумент.ПеремещениеТоваров);
	КонецЕсли;
	
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	ДокументОбъект.ДокументПеремещения = МобильныйДокумент.ПеремещениеТоваров;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументРасходныйОрдерНаТоварыУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРасходныйОрдер.Перемещение;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	Если ЗначениеЗаполнено(МобильныйДокумент.ПеремещениеТоваров) Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, МобильныйДокумент.ПеремещениеТоваров);
	КонецЕсли;
	
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	ДокументОбъект.ДокументПередачи = МобильныйДокумент.ПеремещениеТоваров;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументРеализацияТоваровУслугУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), ДокументОбъект.мВалютаРегламентированногоУчета, "Продажа", , );
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	//+BalakoD 20230131
	ДокументОбъект.ДатаСоздания = ТекущаяДата();
	//-BalakoD 20230131
	ДокументОбъект.Организация        = МобильныйДокумент.Организация;
	ДокументОбъект.Контрагент         = МобильныйДокумент.Контрагент;
	ДокументОбъект.Подразделение      = МобильныйДокумент.Подразделение;
	ДокументОбъект.ДоговорКонтрагента = МобильныйДокумент.ДоговорКонтрагента;
	ДокументОбъект.Комментарий        = МобильныйДокумент.Комментарий;
	ДокументОбъект.Склад              = МобильныйДокумент.Склад;
	ДокументОбъект.Ответственный      = МобильныйДокумент.Ответственный;
	ДокументОбъект.ТипЦен             = МобильныйДокумент.ТипЦен;
	
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.ОтражатьВБухгалтерскомУчете  = Ложь;
	
	ДокументОбъект.Товары.Очистить();
	ДокументОбъект.Услуги.Очистить();
	Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
		Если СтрокаИсходногоДокумента.Количество <= 0 Тогда 
			Продолжить;
		Иначе 
			
			
			СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
			СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаИсходногоДокумента.ХарактеристикаНоменклатуры;
			//+NovashIV_29.01.2023
			СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаИсходногоДокумента.СерияНоменклатуры;
			//-NovashIV_29.01.2023
			
			// Выполнить общие действия для всех документов при изменении номенклатуры.
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			
			// Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, "Реализация");
			ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			
			// Заполнение цены зависит от розничности операции.
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета); 
			
			СтрокаТабличнойЧасти.Количество = СтрокаИсходногоДокумента.Количество;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент = СтрокаИсходногоДокумента.Коэффициент;
			СтрокаТабличнойЧасти.Цена = СтрокаИсходногоДокумента.Цена;
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		КонецЕсли;
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументВозвратТоваровОтПокупателяУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), ДокументОбъект.мВалютаРегламентированногоУчета, "Продажа", , );
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.Контрагент = МобильныйДокумент.Контрагент;
	ДокументОбъект.ДоговорКонтрагента = МобильныйДокумент.ДоговорКонтрагента;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	ДокументОбъект.СкладОрдер = МобильныйДокумент.Склад;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.ТипЦен = МобильныйДокумент.ТипЦен;
	ДокументОбъект.НомерТранзакцииAbills = МобильныйДокумент.НомерТранзакцииAbills;
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
		
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		// Заполняем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, "Реализация");
		
		СтрокаТабличнойЧасти.Количество = СтрокаИсходногоДокумента.Количество;
		СтрокаТабличнойЧасти.Цена = СтрокаИсходногоДокумента.Цена;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаИсходногоДокумента.Коэффициент;
		//СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтрокаИсходногоДокумента.Скидка;
		
		// Заполнение цены зависит от розничности операции.
		//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументВозвратТоваровПоставщикуУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), ДокументОбъект.мВалютаРегламентированногоУчета, "Покупка");
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.ДоговорКонтрагента);
	
	ДокументОбъект.СчетУчетаРасчетовСКонтрагентом 	= СчетаУчета.СчетРасчетов;
	Если ДокументОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПриБартере;
	КонецЕсли;
	ДокументОбъект.СчетУчетаРасчетовПоАвансам		= ДокументОбъект.СчетУчетаРасчетовСКонтрагентом;
	ДокументОбъект.СчетУчетаРасчетовПоТаре        	= СчетаУчета.СчетУчетаТары;
	ДокументОбъект.СчетУчетаРасчетовПоТареПоАвансам = ДокументОбъект.СчетУчетаРасчетовПоТаре;
	
	ДокументОбъект.СчетУчетаНДС 				= СчетаУчета.СчетУчетаНДСПриобретений;
	ДокументОбъект.СчетУчетаНДСПодтвержденный  = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
	
	СчетУчета = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(ДокументОбъект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетДоходовВозвратПоставщику);
	ДокументОбъект.СчетУчетаДоходовБУ 	= СчетУчета.СчетУчетаБУ;
	ДокументОбъект.СубконтоДоходов1 	= СчетУчета.Субконто1;
	ДокументОбъект.СубконтоДоходов2 	= СчетУчета.Субконто2;
	ДокументОбъект.СубконтоДоходов3 	= СчетУчета.Субконто3;
	
	СчетУчета = БухгалтерскийУчет.ПолучитьСчетУчетаПрочий(ДокументОбъект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратВозвратПоставщику);
	ДокументОбъект.СчетУчетаРасходовБУ 	= СчетУчета.СчетУчетаБУ;
	ДокументОбъект.СубконтоРасходов1 	= СчетУчета.Субконто1;
	ДокументОбъект.СубконтоРасходов2 	= СчетУчета.Субконто2;
	ДокументОбъект.СубконтоРасходов3 	= СчетУчета.Субконто3;
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.Контрагент = МобильныйДокумент.Контрагент;
	ДокументОбъект.ДоговорКонтрагента = МобильныйДокумент.ДоговорКонтрагента;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	//ДокументОбъект.ТипЦен = МобильныйДокумент.ТипЦен;
	
	СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
	ДокументОбъект.Контрагент, ДокументОбъект.ТипЦен, ДокументОбъект.ДоговорКонтрагента, ДокументОбъект.Дата,
	ДокументОбъект.ВалютаДокумента, ДокументОбъект.УчитыватьНДС, ДокументОбъект.СуммаВключаетНДС);
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
		
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		// Заполняем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, "Реализация");
		
		//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, СтруктураШапкиДокумента, ДокументОбъект.мВалютаРегламентированногоУчета);
		
		СтрокаТабличнойЧасти.Количество = СтрокаИсходногоДокумента.Количество;
		СтрокаТабличнойЧасти.Цена = СтрокаИсходногоДокумента.Цена;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаИсходногоДокумента.Коэффициент;
		//СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтрокаИсходногоДокумента.Скидка;
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Оборудование", ДокументОбъект.ОтражатьВБухгалтерскомУчете, ДокументОбъект.ОтражатьВБухгалтерскомУчете);
		
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументСписаниеТоваровУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.ТоварыПродукция;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.СчетДт = УзелОбмена.СчетСписания;
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		Если СтрокаТовары.Количество <= 0 Тогда 
			Продолжить;
		Иначе 
			
			СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
			СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
			СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент      = СтрокаТовары.Коэффициент;
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
			СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументОприходованиеТоваровУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийОприходованиеТоваров.ТоварыПродукция;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТовары.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументПеремещениеТоваровУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
	ДокументОбъект.СкладОтправитель = МобильныйДокумент.СкладОтправитель;
	ДокументОбъект.СкладПолучатель = МобильныйДокумент.СкладПолучатель;
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТовары.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
		Если Не (ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
			или ДокументОбъект.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
			СтрокаТабличнойЧасти.Цена = 0;
		ИначеЕсли (Не ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
			И (ДокументОбъект.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
			ВалютаДокумента    = ДокументОбъект.мВалютаРегламентированногоУчета;
			КурсДокумента      = 1;
			КратностьДокумента = 1;
			
			// Тип цен устанавливает склад получатель.
			СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
			ДокументОбъект.СкладПолучатель.ТипЦенРозничнойТорговли, ДокументОбъект.Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения,
			ВалютаДокумента, КурсДокумента, КратностьДокумента);
		ИначеЕсли ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ВалютаДокумента    = ДокументОбъект.мВалютаРегламентированногоУчета;
			КурсДокумента      = 1;
			КратностьДокумента = 1;
			
			СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура,, ДокументОбъект.СкладОтправитель,
			ДокументОбъект.мВалютаРегламентированногоУчета, ДокументОбъект.Дата,
			СтрокаТабличнойЧасти.ЕдиницаИзмерения,
			ВалютаДокумента, КурсДокумента, КратностьДокумента);
		КонецЕсли;
		Если ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ 
			ИЛИ ДокументОбъект.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			
			СтрокаТабличнойЧасти.СтавкаНДСВРознице	= СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			СтрокаТабличнойЧасти.СуммаВРознице 		= СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
			
		КонецЕсли;
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Товары", ДокументОбъект.ОтражатьВБухгалтерскомУчете, ДокументОбъект.ОтражатьВБухгалтерскомУчете);
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументЗаказПоставщикуУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"),
	ДокументОбъект.мВалютаРегламентированногоУчета, "Покупка", , , ДокументОбъект.мСтруктураПараметровДляПолученияДоговора);
	//УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(ДокументОбъект);
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Контрагент = МобильныйДокумент.Контрагент;
	ДокументОбъект.ОбновитьСтруктуруПараметровДляПолученияДоговора();
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокументОбъект, ДокументОбъект.мСтруктураПараметровДляПолученияДоговора);
	ДокументОбъект.ДоговорКонтрагента = МобильныйДокумент.ДоговорКонтрагента;
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокументОбъект);
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокументОбъект, ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	ДокументОбъект.мВалютаРегламентированногоУчета, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары");
	УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(ДокументОбъект, "ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	//ДокументОбъект.ТипЦен = МобильныйДокумент.ТипЦен;
	
	ДокументОбъект.Товары.Очистить();
	ДокументОбъект.Услуги.Очистить();
	Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
		
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект,"Приобретение");
		СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
		ДокументОбъект.Контрагент, ДокументОбъект.ТипЦен, ДокументОбъект.ДоговорКонтрагента, ДокументОбъект.Дата,
		ДокументОбъект.ВалютаДокумента, ДокументОбъект.УчитыватьНДС, ДокументОбъект.СуммаВключаетНДС);
		
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, СтруктураШапкиДокумента,
		ДокументОбъект.мВалютаРегламентированногоУчета, Истина);
		
		СтрокаТабличнойЧасти.Количество = СтрокаИсходногоДокумента.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент = СтрокаИсходногоДокумента.Коэффициент;
		СтрокаТабличнойЧасти.Цена = СтрокаИсходногоДокумента.Цена;
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументЗаказПокупателяУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	Если ДокументОбъект.Проект = Справочники.Проекты.НайтиПоКоду("S00000085") или ДокументОбъект.Проект = Справочники.Проекты.НайтиПоКоду("S00000174")  Тогда
		ДокументОбъект.Оплачен             = МобильныйДокумент.Оплачен;
		ДокументОбъект.ОплаченНаличными    = МобильныйДокумент.ОплаченНаличными;
		ДокументОбъект.ОплаченБезналичными = МобильныйДокумент.ОплаченБезналичными;
		ДокументОбъект.КомментарийМоб         = МобильныйДокумент.КомментарийДоп;
		
		Если ЗначениеЗаполнено(МобильныйДокумент.ОтветственныйЗаОплату) Тогда
			
	   		 ДокументОбъект.СкладГруппа         = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"ОсновнойСклад");
		КонецЕсли;
		 
	Иначе
		
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"),
		ДокументОбъект.мВалютаРегламентированногоУчета, "Продажа", , , ДокументОбъект.мСтруктураПараметровДляПолученияДоговора);
		//УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(ДокументОбъект);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
		ДокументОбъект.Дата             = МобильныйДокумент.Дата;
		ДокументОбъект.ДатаСоздания 	= ТекущаяДата();
		//Дандали В. по аналогии с реализацией
		ДокументОбъект.Организация      = МобильныйДокумент.Организация;
		ДокументОбъект.Подразделение    = МобильныйДокумент.Подразделение;
		ДокументОбъект.Контрагент       = МобильныйДокумент.Контрагент;
		ДокументОбъект.ПриИзмененииКонтрагента();
		ДокументОбъект.ДоговорКонтрагента = МобильныйДокумент.ДоговорКонтрагента;
		ДокументОбъект.ПриИзмененииДоговора();
		УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(ДокументОбъект, "ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
		ДокументОбъект.Комментарий         = МобильныйДокумент.Комментарий;
		ДокументОбъект.КомментарийМоб         = МобильныйДокумент.КомментарийДоп;
		ДокументОбъект.СкладГруппа         = МобильныйДокумент.Склад;
		ДокументОбъект.Ответственный       = МобильныйДокумент.Ответственный;
		ДокументОбъект.ТипЦен 	           = МобильныйДокумент.ТипЦен;
		ДокументОбъект.Оплачен             = МобильныйДокумент.Оплачен;
		ДокументОбъект.ОплаченНаличными    = МобильныйДокумент.ОплаченНаличными;
		ДокументОбъект.ОплаченБезналичными = МобильныйДокумент.ОплаченБезналичными; 
		ДокументОбъект.БезналичныйРасчет = МобильныйДокумент.БезналичныйРасчет;
		ДокументОбъект.НомерТранзакцииAbills = МобильныйДокумент.НомерТранзакцииAbills;
		
		ДокументОбъект.Товары.Очистить();
		ДокументОбъект.Услуги.Очистить();
		Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
			//+NovashIV_21.04.2023
			Если СтрокаИсходногоДокумента.Количество <= 0 Тогда 
				Продолжить;
			КонецЕсли; 
			//-NovashIV_21.04.2023
			Если СтрокаИсходногоДокумента.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда 
				Продолжить;
			КонецЕсли;
			СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
			СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
			
			ДокументОбъект.ПриИзмененииНоменклатурыТоваров(СтрокаТабличнойЧасти);
			
			СтрокаТабличнойЧасти.Количество        = СтрокаИсходногоДокумента.Количество;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения  = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент       = СтрокаИсходногоДокумента.Коэффициент;
			СтрокаТабличнойЧасти.Цена              = СтрокаИсходногоДокумента.Цена;
			//+NovashIV_21.04.2023
			СтрокаТабличнойЧасти.Размещение        = МобильныйДокумент.Склад;	
			СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаИсходногоДокумента.СерияНоменклатуры;
			СтрокаТабличнойЧасти.СтавкаНДС         = ?(ДокументОбъект.учитыватьНДС,Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.БезНДС);
			
			//-NovashIV_21.04.2023
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
			
		КонецЦикла;
		
		Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
			//+NovashIV_21.04.2023
			Если СтрокаИсходногоДокумента.Количество <= 0 Тогда 
				Продолжить;
			КонецЕсли; 
			//-NovashIV_21.04.2023
			 Если СтрокаИсходногоДокумента.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда 
				Продолжить;
			КонецЕсли;
			СтрокаТабличнойЧасти = ДокументОбъект.Услуги.Добавить();
			СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
			
			ДокументОбъект.ПриИзмененииНоменклатурыТоваров(СтрокаТабличнойЧасти,"Услуги");
			
			СтрокаТабличнойЧасти.Количество        = СтрокаИсходногоДокумента.Количество;
			//СтрокаТабличнойЧасти.ЕдиницаИзмерения  = СтрокаИсходногоДокумента.Номенклатура.ЕдиницаХраненияОстатков;;
			//СтрокаТабличнойЧасти.Коэффициент       = СтрокаИсходногоДокумента.Коэффициент;
			СтрокаТабличнойЧасти.Цена              = СтрокаИсходногоДокумента.Цена;
			//+NovashIV_21.04.2023
			//СтрокаТабличнойЧасти.Размещение        = МобильныйДокумент.Склад;	
			//СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаИсходногоДокумента.СерияНоменклатуры;
			СтрокаТабличнойЧасти.СтавкаНДС         = ?(ДокументОбъект.учитыватьНДС,Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.БезНДС);
			
			//-NovashIV_21.04.2023
			
			// Рассчитать реквизиты табличной части.
			//ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

//+NovashIV_24.01.2023
Процедура ЗаполнитьИзменитьДокументТребованиеНакладнаяУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата          = МобильныйДокумент.Дата;
	//+BalakoD 20230130
	ДокументОбъект.ДатаСоздания  = ТекущаяДата();
	//-BalakoD 20230130
	ДокументОбъект.ВидОперации   = Перечисления.ВидыОперацийТребованиеНакладная.Материалы;
	ДокументОбъект.Склад         = МобильныйДокумент.Склад;
	ДокументОбъект.Подразделение = МобильныйДокумент.Подразделение;
	ДокументОбъект.Организация   = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий   = МобильныйДокумент.Комментарий;
	ДокументОбъект.Акция   = 	   МобильныйДокумент.Акция;
	//
	
	ДокументОбъект.СтатьяЗатрат      = МобильныйДокумент.СтатьиЗатрат;
	ДокументОбъект.НаправлениеЗатрат = МобильныйДокумент.НаправлениеЗатрат;
	ДокументОбъект.Абонент           = МобильныйДокумент.Абонент;
	ДокументОбъект.Договор           = МобильныйДокумент.Договор;
	
	ДокументОбъект.НомерОпоры        = МобильныйДокумент.НомерОпоры;
	ДокументОбъект.НомерБокса        = МобильныйДокумент.НомерБокса;
	
	ДокументОбъект.Район             = МобильныйДокумент.Район;	
	ДокументОбъект.НаселенныйПункт   = МобильныйДокумент.НаселенныйПункт;
	ДокументОбъект.Улица             = МобильныйДокумент.Улица;
	ДокументОбъект.Дом               = МобильныйДокумент.Дом;
	ДокументОбъект.Квартира          = МобильныйДокумент.Квартира;
	
	ДокументОбъект.БезналичныйРасчет = МобильныйДокумент.БезналичныйРасчет;
	ДокументОбъект.НомерТранзакцииAbills = МобильныйДокумент.НомерТранзакцииAbills;
	
	
	ДокументОбъект.ОтражатьВУправленческомУчете          = Истина;
	
	//Договор Договор строкой куда передать?
	
	
	ДокументОбъект.Материалы.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		Если СтрокаТовары.Количество <= 0 Тогда 
			Продолжить;
		Иначе 
			
			СтрокаТабличнойЧасти                   = ДокументОбъект.Материалы.Добавить();
			СтрокаТабличнойЧасти.Номенклатура      = СтрокаТовары.Номенклатура;
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
			СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
			СтрокаТабличнойЧасти.Количество        = СтрокаТовары.Количество;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения  = СтрокаТовары.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент       = СтрокаТовары.Коэффициент;
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
			СтрокаТабличнойЧасти.Качество          = Справочники.Качество.Новый;
			СтрокаТабличнойЧасти.СпособСписанияОстаткаТоваров          = ПредопределенноеЗначение("Перечисление.СпособыСписанияОстаткаТоваров.СоСклада");
			
		КонецЕсли;
	КонецЦикла;
	
	//+NovashIV_21.04.2023
	ДокументОбъект.ОтражатьВБухгалтерскомУчете           = Ложь;
	//-NovashIV_21.04.2023
	
	//Дандали В. 21.10.2025 +
	Если ЗначениеЗаполнено(МобильныйДокумент.Заказ) Тогда
		МенеджерЗаписиСоответствия = РегистрыСведений.vrgСоответствияМобильныхДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСоответствия.МобильныйДокумент = МобильныйДокумент.Заказ;
		МенеджерЗаписиСоответствия.Прочитать();
		Если МенеджерЗаписиСоответствия.Выбран() Тогда
			ДокументОбъект.ДокументОснование = МенеджерЗаписиСоответствия.ОсновнойДокумент;
		КонецЕсли;
	КонецЕсли;
	//Дандали В. 21.10.2025 -
	
	
КонецПроцедуры
//-NovashIV_24.01.2023

Процедура ЗаполнитьИзменитьДокументМаршрутныйЛистУТП(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
		
		
		ДанныеМоб = МобильныйДокумент.Данные;
		ДанныеМаршрут = "";
		ДанныеКилометраж = 0;
		ДанныеПрицеп = Ложь;
		ДанныеВыданно = 0;
		
		Для каждого СтрокиМоб  Из ДанныеМоб Цикл
			
			Если ДанныеМаршрут = "" Тогда
				
				ДанныеМаршрут = СтрокиМоб.Маршрут;	
			Иначе
				ДанныеМаршрут = ДанныеМаршрут+"-"+СтрокиМоб.Маршрут;
				
			КонецЕсли;
			ДанныеПрицеп = СтрокиМоб.Прицеп;
			ДанныеКилометраж = ДанныеКилометраж + СтрокиМоб.Километраж;
		    ДанныеВыданно = ДанныеВыданно + СтрокиМоб.ВыданоТоплива;
		КонецЦикла; 
		
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Период",НачалоДня(МобильныйДокумент.ДАта));
		//СтруктураПоиска.Вставить("Маршрут",ДанныеМаршрут);
		//СтруктураПоиска.Вставить("Километраж",ДанныеКилометраж);
		//
		
		ДанныеДок = ДокументОбъект.Данные;
		
		НайденныеСтроки = ДанныеДок.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() Тогда
			
			ДАнныеКММаршрут = ПолучитьДанныеКМЗаСегодня(МобильныйДокумент.Ответственный);
			//Километраж = НайденныеСтроки[0].Километраж +ДанныеКилометраж;
			//Маршрут = НайденныеСтроки[0].Маршрут +"-"+ДанныеМаршрут;
			НайденныеСтроки[0].Маршрут =  ДАнныеКММаршрут.Маршрут;
			НайденныеСтроки[0].Километраж = ДАнныеКММаршрут.Километраж;
			НайденныеСтроки[0].ВыданоТоплива = ДАнныеКММаршрут.ВыданоТоплива;
			НайденныеСтроки[0].Прицеп = ДАнныеКММаршрут.Прицеп;
			//Здесь нужно добавить расчет колоннок в тч
			// н ЛИВ
			РасчитатьРасходАренду(НайденныеСтроки[0], ДокументОбъект.Автомобиль, ДокументОбъект.ПериодРегистрации);
			// к ЛИВ 
			
		Иначе
			
			НовСтрока = ДокументОбъект.Данные.Добавить();
			НовСтрока.Период = МобильныйДокумент.ДАта;
			НовСтрока.Маршрут = ДанныеМаршрут;
			НовСтрока.Километраж = ДанныеКилометраж;
			НовСтрока.ВыданоТоплива = ДанныеВыданно;
			НовСтрока.Прицеп = ДанныеПрицеп;
			//Здесь нужно добавить расчет колоннок в тч
			// н ЛИВ
			РасчитатьРасходАренду(НовСтрока, ДокументОбъект.Автомобиль, ДокументОбъект.ПериодРегистрации);
			// к ЛИВ 
			
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДокументОбъект.Подразделение) Тогда
			ДокументОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.Ответственный, "ОсновноеПодразделение");	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Автомобиль) Тогда
			//УзелПланаОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
			Автомобиль = ПолучитьАвтоПоФизЛицу(МобильныйДокумент.Ответственный.ФизЛицо);
		
			ДокументОбъект.Автомобиль = Автомобиль;
			//ДокументОбъект.ГосНомер = Автомобиль.ГосНомер;
			ДокументОбъект.Водитель = Автомобиль.Водитель;
			ДокументОбъект.ФизЛицо = Автомобиль.Водитель;
			ЗаполнитьЗначенияСвойств(ДокументОбъект,Автомобиль);
		КонецЕсли;		
	Иначе
		
		ДокументОбъект.Дата          = ТекущаяДата();
		ДокументОбъект.Дата          = НачалоМесяца(ТекущаяДата())+20;
		ДокументОбъект.Организация   = МобильныйДокумент.Организация;
		ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
		ДокументОбъект.Сотрудник = МобильныйДокумент.Ответственный;
		ДокументОбъект.ФизЛицо = МобильныйДокумент.Ответственный.ФизЛицо;
		ДокументОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.Ответственный, "ОсновноеПодразделение");
		
		Автомобиль = ПолучитьАвтоПоФизЛицу(ДокументОбъект.ФизЛицо);
		
		ДокументОбъект.Автомобиль = Автомобиль;
		//ДокументОбъект.ГосНомер = Автомобиль.ГосНомер;
		ДокументОбъект.Водитель = Автомобиль.Водитель;
		ЗаполнитьЗначенияСвойств(ДокументОбъект,Автомобиль);
		
		ДанныеМоб = МобильныйДокумент.Данные;
		ДанныеМаршрут = "";
		ДанныеКилометраж = 0;
		ДанныеПрицеп = Ложь;
		ДанныеВыданно = 0;

		
		Для каждого СтрокиМоб  Из ДанныеМоб Цикл
			
			Если ДанныеМаршрут = "" Тогда
				
				ДанныеМаршрут = СтрокиМоб.Маршрут;	
			Иначе
				ДанныеМаршрут = ДанныеМаршрут+"-"+СтрокиМоб.Маршрут;
				
			КонецЕсли;
			
			ДанныеПрицеп = СтрокиМоб.Прицеп;
			ДанныеКилометраж = ДанныеКилометраж + СтрокиМоб.Километраж;
		    ДанныеВыданно = ДанныеВыданно + СтрокиМоб.ВыданоТоплива;

		
		КонецЦикла; 
		
		
		НовСтрока = ДокументОбъект.Данные.Добавить();
		НовСтрока.Период = МобильныйДокумент.ДАта;
		НовСтрока.Маршрут = ДанныеМаршрут;
		НовСтрока.Километраж = ДанныеКилометраж;
		НовСтрока.ВыданоТоплива = ДанныеВыданно;
		НовСтрока.Прицеп = ДанныеПрицеп;
		//Здесь нужно добавить расчет колоннок в тч
		// н ЛИВ
		РасчитатьРасходАренду(НовСтрока, ДокументОбъект.Автомобиль, ДокументОбъект.ПериодРегистрации);
		// к ЛИВ 
		
	КонецЕсли;
	
		//Договор Договор строкой куда передать?
	
		//Дандали В. 21.10.2025 -
	
	
КонецПроцедуры

Процедура РасчитатьРасходАренду(СтрокаТабличнойЧасти, ДокАвтомобиль, ДокПериодРегистрации)

	ДанныеАвтомобиля = РегистрыСведений.СведенияОАвтомобилях.ПолучитьПоследнее(ДокПериодРегистрации, Новый Структура("Автомобиль", ДокАвтомобиль));
	ТарифАрендыАвто = ДанныеАвтомобиля.ТарифАренды;
	Прицеп = СтрокаТабличнойЧасти.Прицеп;
	КилометражУтвержденный = СтрокаТабличнойЧасти.КилометражУтвержденный;
	СезонТеплый = Истина;
	Месяц = Месяц(СтрокаТабличнойЧасти.Период);
	Если Месяц = 1 Или Месяц = 2 Или Месяц = 11 Или Месяц = 12 Тогда
		СезонТеплый = Ложь;
	КонецЕсли;	
	РасходТепло = ДокАвтомобиль.РасходТопливаЛитровНа100Км;
	РасходХолод = ДокАвтомобиль.РасходТопливаЛитровНа100КмЗимой;
	Расход = ?(СезонТеплый, РасходТепло, РасходХолод);	
	СтрокаТабличнойЧасти.РасходТопливаЛитров = ?(Прицеп, КилометражУтвержденный * Расход / 100 * 1.15, КилометражУтвержденный * Расход / 100);
	СтрокаТабличнойЧасти.СтоимостьАренды = ?(Прицеп, КилометражУтвержденный * ТарифАрендыАвто * 1.15, КилометражУтвержденный * ТарифАрендыАвто);
	СтрокаТабличнойЧасти.Удержание = ?(КилометражУтвержденный = 0, 0, ДанныеАвтомобиля.КилометражДляУдержания * ДанныеАвтомобиля.ТарифАренды);
	
КонецПроцедуры 

#КонецОбласти

#Область УТ23

функция ПолучитьДанныеКМЗаСегодня(Пользователь) 
	
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgМаршрутныйЛистДанные.Маршрут,
		|	vrgМаршрутныйЛистДанные.Километраж,
		|	vrgМаршрутныйЛистДанные.Ссылка,
		|	vrgМаршрутныйЛистДанные.ВыданоТоплива,
		|	vrgМаршрутныйЛистДанные.Прицеп
		|ИЗ
		|	Документ.vrgМаршрутныйЛист.Данные КАК vrgМаршрутныйЛистДанные
		|ГДЕ
		|	vrgМаршрутныйЛистДанные.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И vrgМаршрутныйЛистДанные.Ссылка.Ответственный = &Ответственный
		|
		|УПОРЯДОЧИТЬ ПО
		|	vrgМаршрутныйЛистДанные.Ссылка.Дата";
	
	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ответственный", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Км = 0;
	Маршрут = "";
	ВыданоТоплива = 0;
	Прицеп = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Маршрут = "" Тогда
			Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
		Иначе
			Маршрут = Маршрут +"-"+ВыборкаДетальныеЗаписи.Маршрут;
		
		КонецЕсли;
		Км = Км+ВыборкаДетальныеЗаписи.Километраж;
		Прицеп = ВыборкаДетальныеЗаписи.Прицеп;
		ВыданоТоплива = ВыданоТоплива + ВыборкаДетальныеЗаписи.ВыданоТоплива;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Маршрут",Маршрут);
	СтруктураВозврата.Вставить("Километраж",Км);
	СтруктураВозврата.Вставить("Прицеп",Прицеп);
	СтруктураВозврата.Вставить("ВыданоТоплива",ВыданоТоплива);

	 Возврат СтруктураВозврата
	
	
КонецФункции

функция ПолучитьАвтоПоФизЛицу(Физлицо)
	
	Если Не ЗначениеЗаполнено(Физлицо) Тогда
		
		Возврат Справочники.Автомобиль.ПустаяСсылка()

		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобиль.Ссылка
		|ИЗ
		|	Справочник.Автомобиль КАК Автомобиль
		|ГДЕ
		|	Автомобиль.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка
	КонецЦикла;
	
	Возврат Справочники.Автомобиль.ПустаяСсылка()
	
	
КонецФункции

Процедура ЗаполнитьИзменитьДокументИнвентаризацияТоваровНаСкладеУТ23(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	//ДокументОбъект.Номер = МобильныйДокумент.Номер;
	ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	//ДокументОбъект.УчитыватьСерии = Истина;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.КоличествоУчет = СтрокаТовары.КоличествоУчет;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		СтрокаТабличнойЧасти.Цена             = 0;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументПеремещениеТоваровУТ23(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	//ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	ДокументОбъект.Дата = МобильныйДокумент.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
	ДокументОбъект.СкладОтправитель = МобильныйДокумент.СкладОтправитель;
	ДокументОбъект.СкладПолучатель = МобильныйДокумент.СкладПолучатель;
	//УзелОбмена = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(МобильныйДокумент.КодУзлаОбмена);
	ДокументОбъект.Организация = МобильныйДокумент.Организация;
	ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Количество;
		СтрокаТабличнойЧасти.Цена = СтрокаТовары.Цена;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, Ложь);
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
		Если Не (ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
			или ДокументОбъект.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
			СтрокаТабличнойЧасти.Цена = 0;
		ИначеЕсли (Не ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ) 
			И (ДокументОбъект.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
			ВалютаДокумента    = ДокументОбъект.мВалютаРегламентированногоУчета;
			КурсДокумента      = 1;
			КратностьДокумента = 1;
			
			// Тип цен устанавливает склад получатель.
			СтрокаТабличнойЧасти.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры,
			ДокументОбъект.СкладПолучатель.ТипЦенРозничнойТорговли, ДокументОбъект.Дата, СтрокаТабличнойЧасти.ЕдиницаИзмерения,
			ВалютаДокумента, КурсДокумента, КратностьДокумента);
		ИначеЕсли ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ВалютаДокумента    = ДокументОбъект.мВалютаРегламентированногоУчета;
			КурсДокумента      = 1;
			КратностьДокумента = 1;
			
			СтрокаТабличнойЧасти.Цена = УправлениеРозничнойТорговлей.ПолучитьРозничнуюЦену(СтрокаТабличнойЧасти.Номенклатура,, ДокументОбъект.СкладОтправитель,
			ДокументОбъект.мВалютаРегламентированногоУчета, ДокументОбъект.Дата,
			СтрокаТабличнойЧасти.ЕдиницаИзмерения,
			ВалютаДокумента, КурсДокумента, КратностьДокумента);
		КонецЕсли;
		Если ДокументОбъект.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ 
			ИЛИ ДокументОбъект.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			
			СтрокаТабличнойЧасти.СтавкаНДСВРознице	= СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			СтрокаТабличнойЧасти.СуммаВРознице 		= СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область BASRetail

Процедура ЗаполнитьИзменитьДокументПересчетТоваровBASRetail(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	//// если создаём впервые, нужно сделать приказ на инвентаризацию
	//Если ДокументОбъект.ЭтоНовый() Тогда
	//	ПриказОбъект = Документы.ПриказНаПроведениеИнвентаризацииТоваров.СоздатьДокумент();
	//	ПриказОбъект.Статус = Перечисления.СтатусыПриказовНаПроведениеИнвентаризацийТоваров.ВРаботе;
	//Иначе
	//	ПриказОбъект = ДокументОбъект.ДокументОснование.ПолучитьОбъект();
	//КонецЕсли;
	//ПриказОбъект.Дата = МобильныйДокумент.Дата;
	//ПриказОбъект.ДатаНачала = МобильныйДокумент.Дата;
	//ПриказОбъект.ДатаОкончания = МобильныйДокумент.Дата;
	//ПриказОбъект.Организация = МобильныйДокумент.Организация;
	//ПриказОбъект.Ответственный = МобильныйДокумент.Ответственный;
	//ПриказОбъект.Склад = МобильныйДокумент.Склад;
	//ПриказОбъект.Магазин = МобильныйДокумент.Склад.Магазин;
	//ПриказОбъект.ПометкаУдаления = МобильныйДокумент.ПометкаУдаления;
	//ВыполнитьЗаписьПроведениеДокумента(ПриказОбъект, УзелОбмена);
	
	//ДокументОбъект.Дата = МобильныйДокумент.Дата;
	//ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//ДокументОбъект.Магазин = МобильныйДокумент.Склад.Магазин;
	//ДокументОбъект.Статус = Перечисления.СтатусыПересчетовТоваров.ВРаботе;
	//ДокументОбъект.Организация = МобильныйДокумент.Организация;
	//ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	//ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	//ДокументОбъект.ДокументОснование = ПриказОбъект.Ссылка;
	//ДокументОбъект.ПометкаУдаления = МобильныйДокумент.ПометкаУдаления;
	
	//ДокументОбъект.Товары.Очистить();
	//Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
	//	СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
	//	СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
	//	СтрокаТабличнойЧасти.Характеристика = СтрокаТовары.ХарактеристикаНоменклатуры;
	//	СтрокаТабличнойЧасти.КоличествоУпаковокФакт = СтрокаТовары.Количество;
	//	СтрокаТабличнойЧасти.КоличествоУпаковок = СтрокаТовары.КоличествоУчет;
	//	СтруктураДействий = Новый Структура;
	//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТабличнойЧасти.Характеристика);
	//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , СтрокаТабличнойЧасти.Упаковка);
	//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницФакт", "Факт");
	//	//СтруктураДействий.Вставить("ОчиститьКоличествоУчет");
	//	СтруктураДействий.Вставить("ПересчитатьСуммуФакт");
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//	СтруктураТЧ = Новый Структура;
	//	СтруктураТЧ.Вставить("СтруктураПолейТЧ", ПолучитьСтруктуруПолейТЧ(СтруктураДействий));
	//	СтруктураТЧ.Вставить("ТекущаяСтрока" , ПолучитьДанныеТекущейСтроки(СтрокаТабличнойЧасти, СтруктураТЧ.СтруктураПолейТЧ));
	//	КэшированныеЗначения = Неопределено;
	//	ОбработкаТабличнойЧастиТоварыСервер.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, КэшированныеЗначения);
	//	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураТЧ.ТекущаяСтрока);
	//КонецЦикла;
	
	////ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьПризнакИспользованияХарактеристик(ДокументОбъект.Товары);
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументПоступлениеТоваровBASRetail(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	//ДокументОбъект.Дата = МобильныйДокумент.Дата;
	//ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеТоваров;
	//ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//ДокументОбъект.Магазин = МобильныйДокумент.Склад.Магазин;
	//ДокументОбъект.Организация = МобильныйДокумент.Организация;
	//ДокументОбъект.БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ДокументОбъект.Организация,,ДокументОбъект.БанковскийСчетОрганизации);
	//ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	//ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	//ДокументОбъект.ЗаказПоставщику = МобильныйДокумент.ЗаказПоставщику;
	//ДокументОбъект.Контрагент = МобильныйДокумент.Контрагент;
	//ДокументОбъект.ПометкаУдаления = МобильныйДокумент.ПометкаУдаления;
	//ДокументОбъект.БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(ДокументОбъект.Контрагент);
	//ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ПоступлениеТоваров.ПараметрыУказанияСерий(ДокументОбъект));
	//Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
	//	ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьПризнакИспользованияХарактеристик(ДокументОбъект.Товары);
	//	ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьИспользоватьСерийныеНомераВТЧСервер(ДокументОбъект.Товары);
	//	ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);
	//	Если ЗначениеЗаполнено(ДокументОбъект.ЗаказПоставщику) Тогда
	//		РеквизитыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.ЗаказПоставщику, "ЦенаВключаетНДС, УчитыватьНДС");
	//		ДокументОбъект.УчитыватьНДС = РеквизитыЗаказа.УчитыватьНДС;
	//		ДокументОбъект.ЦенаВключаетНДС = РеквизитыЗаказа.ЦенаВключаетНДС;
	//	КонецЕсли;
	//	ОбработкаТабличнойЧастиТоварыКлиентСервер.ОбновитьСтатусыСерийИПодарочныхСертификатов(ДокументОбъект.Товары);
	//	ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьПризнакИспользованияХарактеристик(ДокументОбъект.ТоварыПоДаннымПоставщика);
	//	ОбработкаТабличнойЧастиТоварыКлиентСервер.ЗаполнитьСуммуВсегоВТаблице(ДокументОбъект.ТоварыПоДаннымПоставщика, ДокументОбъект.ЦенаВключаетНДС);
	//КонецЕсли;
	
	//ИспользоватьАссортимент = АссортиментСервер.ПолучитьФункциональнуюОпциюКонтроляАссортимента(ДокументОбъект.Магазин);
	//ДокументОбъект.Товары.Очистить();
	//Для Каждого СтрокаТовары Из МобильныйДокумент.Товары Цикл
	//	СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
	//	СтрокаТабличнойЧасти.Номенклатура = СтрокаТовары.Номенклатура;
	//	СтрокаТабличнойЧасти.Характеристика = СтрокаТовары.ХарактеристикаНоменклатуры;
	//	СтрокаТабличнойЧасти.Цена = СтрокаТовары.Цена;
	//	СтрокаТабличнойЧасти.КоличествоУпаковок = СтрокаТовары.Количество;
	//	СтруктураДействий = Новый Структура;
	//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТабличнойЧасти.Характеристика);
	//	СтруктураДействий.Вставить("ЗаполнитьТипНоменклатуры");
	//	СтруктураДействий.Вставить("ПроверитьСерийныеНомераПоВладельцу",
	//								ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПроверкиСерийныхНомеровПоВладельцу(СтрокаТабличнойЧасти, ДокументОбъект.СерийныеНомера));
	//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТабличнойЧасти.Характеристика);
	//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаТабличнойЧасти.Упаковка);
	//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//	СтруктураПараметровДействия = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(ДокументОбъект);
	//	СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", СтруктураПараметровДействия);
	//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",  ДокументОбъект.УчитыватьНДС);
	//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//	Если ИспользоватьАссортимент Тогда
	//		СтруктураПроверкиАссортимента = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента(ДокументОбъект, Ложь, "ЗаказПоставщику");
	//		СтруктураДействий.Вставить("ПроверитьАссортиментСтроки", СтруктураПроверкиАссортимента);
	//	КонецЕсли;
	//	СтруктураТЧ = Новый Структура;
	//	СтруктураТЧ.Вставить("СтруктураПолейТЧ", ПолучитьСтруктуруПолейТЧ(СтруктураДействий));
	//	СтруктураТЧ.Вставить("ТекущаяСтрока" , ПолучитьДанныеТекущейСтроки(СтрокаТабличнойЧасти, СтруктураТЧ.СтруктураПолейТЧ));
	//	КэшированныеЗначения = Неопределено;
	//	ОбработкаТабличнойЧастиТоварыСервер.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, КэшированныеЗначения);
	//	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураТЧ.ТекущаяСтрока);
	//КонецЦикла;
	//Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
	//	ЗакупкиСервер.ДобавитьЭтапОплаты(ДокументОбъект, ДокументОбъект.Контрагент.ГрафикОплаты, ДокументОбъект.Дата);
	//КонецЕсли;
	//ДокументОбъект.СуммаДокумента = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСуммуДокумента(ДокументОбъект.Товары, ДокументОбъект.ЦенаВключаетНДС);
	
КонецПроцедуры

Процедура ЗаполнитьИзменитьДокументЗаказПоставщикуBASRetail(МобильныйДокумент, ДокументОбъект, УзелОбмена) Экспорт
	
	//ДокументОбъект.Дата = МобильныйДокумент.Дата;
	//ДокументОбъект.ДатаПоступления = МобильныйДокумент.Дата;
	//ДокументОбъект.Организация = МобильныйДокумент.Организация;
	//ДокументОбъект.Контрагент = МобильныйДокумент.Контрагент;
	//ДокументОбъект.Комментарий = МобильныйДокумент.Комментарий;
	//ДокументОбъект.Склад = МобильныйДокумент.Склад;
	//ДокументОбъект.Магазин = МобильныйДокумент.Склад.Магазин;
	//ДокументОбъект.Ответственный = МобильныйДокумент.Ответственный;
	//ДокументОбъект.ПометкаУдаления = МобильныйДокумент.ПометкаУдаления;
	
	//ИспользоватьАссортимент = АссортиментСервер.ПолучитьФункциональнуюОпциюКонтроляАссортимента(ДокументОбъект.Магазин);
	//ДокументОбъект.Товары.Очистить();
	//Для Каждого СтрокаИсходногоДокумента Из МобильныйДокумент.Товары Цикл
	
	//	СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
	//	СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;
	//	СтрокаТабличнойЧасти.КоличествоУпаковок = СтрокаИсходногоДокумента.Количество;
	//	СтрокаТабличнойЧасти.Характеристика = СтрокаИсходногоДокумента.ХарактеристикаНоменклатуры;
	//	//СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
	//	СтрокаТабличнойЧасти.Цена = СтрокаИсходногоДокумента.Цена;
	//	СтруктураДействий = Новый Структура;
	//	СтруктураДействий.Вставить("ЗаполнитьТипНоменклатуры");
	//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТабличнойЧасти.Характеристика);
	//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , СтрокаТабличнойЧасти.Упаковка);
	//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//	СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки",
	//		ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(ДокументОбъект));
	//	
	//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ДокументОбъект.УчитыватьНДС);
	//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	//		ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
	//	
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//	Если ИспользоватьАссортимент Тогда
	//		СтруктураПроверкиАссортимента = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента(ДокументОбъект);
	//		СтруктураПроверкиАссортимента.Дата = ?(ЗначениеЗаполнено(ДокументОбъект.ДатаПоступления),
	//			ДокументОбъект.ДатаПоступления,
	//			ДокументОбъект.Дата);
	//		СтруктураПроверкиАссортимента.ТекстСообщения =
	//			НСтр("ru='Номенклатура ""%1"" не включена в ассортимент магазина или запрещена к закупке. Заказывать ее не рекомендуется.';uk='Номенклатура ""%1"" не включена в асортимент магазину або заборонена до купівлі. Замовляти її не рекомендується.'");
	//		СтруктураДействий.Вставить("ПроверитьАссортиментСтроки", СтруктураПроверкиАссортимента);
	//	КонецЕсли;
	//	СтруктураТЧ = Новый Структура;
	//	СтруктураТЧ.Вставить("СтруктураПолейТЧ", ПолучитьСтруктуруПолейТЧ(СтруктураДействий));
	//	СтруктураТЧ.Вставить("ТекущаяСтрока" , ПолучитьДанныеТекущейСтроки(СтрокаТабличнойЧасти, СтруктураТЧ.СтруктураПолейТЧ));
	//	КэшированныеЗначения = Неопределено;
	//	ОбработкаТабличнойЧастиТоварыСервер.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, КэшированныеЗначения);
	//	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураТЧ.ТекущаяСтрока);
	
	//КонецЦикла;
	
КонецПроцедуры

// Функция получения структуры полей ТЧ.
//
Функция ПолучитьСтруктуруПолейТЧ(СтруктураДействий)
	
	Перем СтруктураПараметровДействия;
	
	СтруктураПолейТЧ = Новый Структура;
	
	Если СтруктураДействий.Свойство("ОбработатьШтрихкоды", СтруктураПараметровДействия) Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
		СтруктураПолейТЧ.Вставить("ХарактеристикиИспользуются");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьСерийныеНомераПоВладельцу") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("КлючСтроки");
		СтруктураПолейТЧ.Вставить("КлючСвязиСерийныхНомеров");
		СтруктураПолейТЧ.Вставить("ИспользоватьСерийныеНомера");
		
	КонецЕсли;
	
	
	
	
	Если СтруктураДействий.Свойство("ПроверитьХарактеристикуПоВладельцу") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ХарактеристикиИспользуются");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьЗаполнитьУпаковкуПоВладельцу") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Упаковка");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц") Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
		СтруктураПолейТЧ.Вставить("Количество", 0);
	КонецЕсли;
	
	ИмяРеквизитаЦены = "";
	Если СтруктураДействий.Свойство("ОбнулитьЦену", ИмяРеквизитаЦены) Тогда
		Если НЕ ЗначениеЗаполнено(ИмяРеквизитаЦены)  Тогда
			ИмяРеквизитаЦены = "Цена";
		КонецЕсли;
		СтруктураПолейТЧ.Вставить(ИмяРеквизитаЦены, 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПоВидуЦен") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуЗакупки") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПрошлойЗакупки") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("ЦенаПрошлойЗакупки", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДС") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"    , 0);
		СтруктураПолейТЧ.Вставить("СтавкаНДС", 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС" , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДСПоСуммеСНДС") Тогда
		СтруктураПолейТЧ.Вставить("СуммаВсего", 0);
		СтруктураПолейТЧ.Вставить("СтавкаНДС" , 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС"  , 0);
		СтруктураПолейТЧ.Вставить("СуммаСНДС" , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"    , 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС" , 0);
		СтруктураПолейТЧ.Вставить("СуммаСНДС", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДСиАкцизногоНалога") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"    , 0);
		СтруктураПолейТЧ.Вставить("СтавкаНДС", 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС" , 0);
		СтруктураПолейТЧ.Вставить("СуммаАкцизногоНалога",0);
		СтруктураПолейТЧ.Вставить("ПодакцизныеТоварыДляКоммерческогоИспользования");
		СтруктураПолейТЧ.Вставить("ПодакцизныйТовар");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСумму") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"             , 0);
		СтруктураПолейТЧ.Вставить("Цена"              , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомРучнойСкидки") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"              , 0);
		СтруктураПолейТЧ.Вставить("Количество"         , 0);
		СтруктураПолейТЧ.Вставить("Цена      "         , 0);
		СтруктураПолейТЧ.Вставить("СуммаРучнойСкидки"  , 0);
		СтруктураПолейТЧ.Вставить("ПроцентРучнойСкидки", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомАвтоматическойСкидки") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"                      , 0);
		СтруктураПолейТЧ.Вставить("СуммаАвтоматическойСкидки"  , 0);
		СтруктураПолейТЧ.Вставить("ПроцентАвтоматическойСкидки", 0);
	КонецЕсли;
	
	ИмяКоличества = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуФакт", ИмяКоличества) Тогда
		
		Если Не ЗначениеЗаполнено(ИмяКоличества) Тогда
			ИмяКоличества = "Факт";
		КонецЕсли;
		
		СтруктураПолейТЧ.Вставить("СуммаФакт"                         , 0);
		СтруктураПолейТЧ.Вставить("Цена"                              , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок" + ИмяКоличества, 0);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуВозвратСУчетомОснования") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Коэффициент"         , 1);
		СтруктураПолейТЧ.Вставить("ПроцентСкидкиНаценки", 1);
		СтруктураПолейТЧ.Вставить("Сумма"               , 0);
		СтруктураПолейТЧ.Вставить("Цена"                , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок"  , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуЗаУпаковку") Тогда
		СтруктураПолейТЧ.Вставить("Цена"      , 0);
		СтруктураПолейТЧ.Вставить("Количество", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВПродажах") Тогда
		СтруктураПолейТЧ.Вставить("Цена"                       , 0);
		СтруктураПолейТЧ.Вставить("Сумма"                      , 0);
		СтруктураПолейТЧ.Вставить("СуммаАвтоматическойСкидки"  , 0);
		СтруктураПолейТЧ.Вставить("ПроцентАвтоматическойСкидки", 0);
		СтруктураПолейТЧ.Вставить("СуммаРучнойСкидки"          , 0);
		СтруктураПолейТЧ.Вставить("ПроцентРучнойСкидки"        , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок "        , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВЗакупках") Тогда
		СтруктураПолейТЧ.Вставить("Цена"                       , 0);
		СтруктураПолейТЧ.Вставить("Сумма"                      , 0);
		СтруктураПолейТЧ.Вставить("СуммаРучнойСкидки"          , 0);
		СтруктураПолейТЧ.Вставить("ПроцентРучнойСкидки"        , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок "        , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковок", ИмяКоличества) Тогда
		
		СтруктураПолейТЧ.Вставить("Упаковка");
		Если ЗначениеЗаполнено(ИмяКоличества) Тогда
			СтруктураПолейТЧ.Вставить("КоличествоУпаковок" + ИмяКоличества, 0);
			СтруктураПолейТЧ.Вставить("Количество" + ИмяКоличества, 0);
		Иначе
			СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
			СтруктураПолейТЧ.Вставить("Количество" , 0);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницПлан") Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковокПлан", 0);
		СтруктураПолейТЧ.Вставить("КоличествоПлан"        , 0);
	КонецЕсли;
	
	ИмяФакта = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницФакт",ИмяФакта) Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок"+ИмяФакта, 0);
		СтруктураПолейТЧ.Вставить("Количество"+ИмяФакта    , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ОчиститьКоличествоУчет") Тогда
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("Количество");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковокФакт",ИмяФакта) Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок"+ИмяФакта, 0);
		СтруктураПолейТЧ.Вставить("Количество"+ИмяФакта    , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьРасхождения") Тогда
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковокВДокументе");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковокРасхождения");
		СтруктураПолейТЧ.Вставить("ЕстьРасхождения");
		СтруктураПолейТЧ.Вставить("ВариантУчетаРасхождения");
	КонецЕсли; 
	
	Если СтруктураДействий.Свойство("ЗаполнитьРеквизитыПоНоменклатуре") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("ЭтоУслуга");
		СтруктураПолейТЧ.Вставить("ЭтоПодарочныйСертификат");
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьТипНоменклатуры") Тогда
		СтруктураПолейТЧ.Вставить("ТипНоменклатуры");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьДоговорПлатежногоАгента") Тогда
		СтруктураПолейТЧ.Вставить("ДоговорПлатежногоАгента");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьПредставлениеТабло") Тогда
		СтруктураПолейТЧ.Вставить("ПредставлениеТабло");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьФлагРезервирования") Тогда
		СтруктураПолейТЧ.Вставить("ТипНоменклатуры");
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Резервировать");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСкладПродажи") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Склад");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьОрганизациюПродажи") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Склад");
		СтруктураПолейТЧ.Вставить("Организация");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВСтроке") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Склад");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВШапке") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроставитьПродавца") Тогда
		СтруктураПолейТЧ.Вставить("Продавец");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьДанныеПоДокументуПродажи") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ДокументПродажи");
		СтруктураПолейТЧ.Вставить("ЧекККМ");
		СтруктураПолейТЧ.Вставить("Продавец");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена");
		СтруктураПолейТЧ.Вставить("Сумма");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
		СтруктураПолейТЧ.Вставить("Количество");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуПоСуммеВЗакупках") Тогда
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("Цена");
		СтруктураПолейТЧ.Вставить("СуммаВсего");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуПоСуммеСНДС") Тогда
		СтруктураПолейТЧ.Вставить("Сумма");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьАссортиментСтроки") Тогда
		СтруктураПолейТЧ.Вставить("НомерСтроки");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьЗапретРозничнойПродажи") Тогда
		СтруктураПолейТЧ.Вставить("НомерСтроки");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ОчиститьДанныеПоЗаказу") Тогда
		СтруктураПолейТЧ.Вставить("КодСтроки");
		СтруктураПолейТЧ.Вставить("ЗаказПокупателя");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьОтличныеДоговорыПлатежныхАгентов") Тогда
		СтруктураПолейТЧ.Вставить("ДоговорПлатежногоАгента");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьДубликатыЗависимыхРеквизитов", СтруктураПараметровДействия) Тогда
		Для Каждого ПолеСтруктуры Из СтруктураПараметровДействия Цикл
			СтруктураПолейТЧ.Вставить(ПолеСтруктуры.Ключ);
			ЗависимыеРеквизиты = Новый Структура(ПолеСтруктуры.Значение);
			Для Каждого Реквизит Из ЗависимыеРеквизиты Цикл
				СтруктураПолейТЧ.Вставить(Реквизит.Ключ+ПолеСтруктуры.Ключ, 0);
				СтруктураПолейТЧ.Вставить(Реквизит.Ключ, 0);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураПолейТЧ;
	
КонецФункции

// Функция данных текущей строки по структуре полей.
//
Функция ПолучитьДанныеТекущейСтроки(ТекущаяСтрока, СтруктураПолейТЧ)
	
	//ДанныеТекущейСтроки = Новый Структура;
	//ОбщегоНазначенияРТКлиентСервер.ДобавитьВСтруктуру(ДанныеТекущейСтроки, СтруктураПолейТЧ);
	//ЗаполнитьЗначенияСвойств(ДанныеТекущейСтроки, ТекущаяСтрока);
	
	//Возврат ДанныеТекущейСтроки;
	
КонецФункции

Процедура СформироватьДополнительныеДокументыПоЗаказуПокупателя(МобильныйДокумент,ЗаказПокупателя)
	
	
	Если МобильныйДокумент.Оплачен 
		и (ЗаказПокупателя.Проект = Справочники.Проекты.НайтиПоКоду("S00000085") или ЗаказПокупателя.Проект = Справочники.Проекты.НайтиПоКоду("S00000174") )  Тогда 
		
		//Запрос = новый запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	РеализацияТоваровУслуг.Ссылка
		//|ИЗ
		//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//|ГДЕ
		//|	(РеализацияТоваровУслуг.ДокументОснование = &ДокументОснование
		//|			ИЛИ РеализацияТоваровУслуг.Сделка = &ДокументОснование)";
		//Запрос.УстановитьПараметр("ДокументОснование",ЗаказПокупателя.ссылка);
		//
		//РезультатЗапроса = запрос.Выполнить().Выгрузить();
		//
		//Если не РезультатЗапроса.Количество() Тогда 
		//	
		//	
		//	Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		//	Реализация.Склад     			   = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"ОсновнойСклад");
		//	Реализация.Заполнить(ЗаказПокупателя.ссылка);
		//	
		//	Реализация.Дата 			       = ТекущаяДата() ;
		//	Реализация.ВалютаДокумента         = Константы.ВалютаРегламентированногоУчета.Получить();
		//	Реализация.КурсВзаиморасчетов      = 1;
		//	Реализация.КратностьВзаиморасчетов = 1;
		//	Реализация.Контрагент			   = ЗаказПокупателя.Контрагент;
		//	Реализация.ДоговорКонтрагента 	   = ЗаказПокупателя.ДоговорКонтрагента;
		//	Реализация.Организация 			   = ЗаказПокупателя.Организация;
		//	Реализация.Склад     			   = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"ОсновнойСклад");
		//	
		//	Реализация.ВидОперации     		   = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		//	Реализация.Подразделение		   = ЗаказПокупателя.Подразделение;
		//	Реализация.ОтражатьВБухгалтерскомУчете  = Ложь;	
		//	Реализация.ОтражатьВУправленческомУчете = Истина;
		//	Реализация.Ответственный 			    = МобильныйДокумент.ОтветственныйЗаОплату;
		//	Реализация.Товары.Загрузить(ЗаказПокупателя.Товары.Выгрузить());
		//	Для Каждого Строка из Реализация.Товары Цикл 
		//		Если ЗаказПокупателя.УчитыватьНДС Тогда 
		//			Строка.ставкаНДС = Перечисления.СтавкиНДС.НДС20;
		//		КонецЕсли;
		//		
		//		Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
		//		Строка.СхемаРеализации     = Справочники.СхемыРеализации.Товары;
		//		Строка.СчетУчетаБУ         = ПланыСчетов.Хозрасчетный.НайтиПоКоду("201");
		//		Строка.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
		//	КонецЦикла;
		//	Реализация.Комментарий = "#Создано автоматический при оплате на ТСД"; 
		//	Реализация.Записать();
		//	Попытка
		//		Если Реализация.Товары.Количество() Тогда  
		//			//Реализация.Записать(РежимЗаписиДокумента.Проведение);
		//		КонецЕсли;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		
		Если МобильныйДокумент.ОплаченБезналичными Тогда
			
			Запрос = новый запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОплатаОтПокупателяПлатежнойКартой.Ссылка
			|ИЗ
			|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
			|ГДЕ
			|	ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование",ЗаказПокупателя.ссылка);
			
			РезультатЗапроса = запрос.Выполнить().Выгрузить();
			
			Если не РезультатЗапроса.Количество() Тогда
				
				
				ДокОб 								= Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
				ДокОб.Дата 							= МобильныйДокумент.Дата;
				ДокОб.Ответственный 				= МобильныйДокумент.ОтветственныйЗаОплату;
				ДокОб.ДокументОснование				= ЗаказПокупателя.Ссылка;
				ДокОб.ОтражатьВБухгалтерскомУчете 	= Истина;
				ДокОб.Комментарий                   = "#Создано автоматический при оплате на ТСД";
				ДокОб.ВидОперации 					= Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя;
				ДокОб.ВалютаДокумента 				= Константы.ВалютаРегламентированногоУчета.Получить();
				ДокОб.ВидОплаты						= Справочники.ВидыОплатЧекаККМ.НайтиПоНаименованию("Платежная карта");
				ДокОб.Контрагент                    = ЗаказПокупателя.Контрагент;
				ДокОб.ДоговорЭквайринга             = Справочники.ДоговорыЭквайринга.НайтиПоКоду("000000004");
				ДокОб.IDТерминала					= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"IDТерминала");
				ДокОб.ДоговорВзаиморасчетовЭквайрера= ДокОб.ДоговорЭквайринга.ДоговорВзаиморасчетов;            
				ДокОб.КратностьДокумента            = 1;
				ДокОб.КурсДокумента                 = 1;
				ДокОб.Организация                   = Справочники.Организации.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ ТОВ");
				ДокОб.ОтражатьВБухгалтерскомУчете   = Истина;
				ДокОб.ОтражатьВУправленческомУчете  = Истина;
				ДокОб.Подразделение                 = ЗаказПокупателя.Подразделение;
				ДокОб.СтатусДокумента               = Перечисления.СтатусыДокументовОплаты.НеОбработан;
				ДокОб.СуммаДокумента                = ЗаказПокупателя.СуммаДокумента;
				ДокОб.СчетУчетаРасчетовСЭквайрером  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("333");
				ДокОб.Эквайрер                      = ДокОб.ДоговорЭквайринга.Эквайрер;            
				
				СтрокаРасшифровки = ДокОб.РасшифровкаПлатежа.Добавить();
				СтрокаРасшифровки.ДоговорКонтрагента             = ЗаказПокупателя.ДоговорКонтрагента;
				СтрокаРасшифровки.КратностьВзаиморасчетов        = 1;
				СтрокаРасшифровки.КурсВзаиморасчетов             = 1;
				СтрокаРасшифровки.НалоговоеНазначение            = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
				СтрокаРасшифровки.Проект                         = ЗаказПокупателя.Проект;
				СтрокаРасшифровки.Сделка					     = ЗаказПокупателя.Ссылка;	
				СтрокаРасшифровки.СтавкаНДС					     = Перечисления.СтавкиНДС.НДС20;
				СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств  = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Обладнання виручка");
				СтрокаРасшифровки.СуммаВзаиморасчетов            = ЗаказПокупателя.СуммаДокумента;
				СтрокаРасшифровки.СуммаНДС                       = ЗаказПокупателя.СуммаДокумента/6;
				СтрокаРасшифровки.СуммаПлатежа                   = ЗаказПокупателя.СуммаДокумента;
				СтрокаРасшифровки.СчетУчетаНДС                   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");
				СтрокаРасшифровки.СчетУчетаНДСПодтвержденный     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
				СтрокаРасшифровки.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3612");
				СтрокаРасшифровки.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3612"); 
				
				ДокОб.Записать();
				ДокОб.Записать(РежимЗаписиДокумента.Проведение);
				
				//Дандали В. 23.09.2025 +
				//Начиная с 01.10
				Если  НачалоДня(ТекущаяДата()) > Дата('20251001')
					И НЕ УжеЕстьНалоговая(ЗаказПокупателя.Ссылка) Тогда
					
					НалоговаяНакладная = Документы.НалоговаяНакладная.СоздатьДокумент();
					НалоговаяНакладная.Дата 				= МобильныйДокумент.Дата;
					НалоговаяНакладная.ВидОперации 			= Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
					НалоговаяНакладная.УчитыватьНДС 		= Истина;
					НалоговаяНакладная.СуммаВключаетНДС 	= Истина;
					НалоговаяНакладная.ДокументОснование 	= ЗаказПокупателя.Ссылка;
					НалоговаяНакладная.Контрагент			= ЗаказПокупателя.Контрагент;
					НалоговаяНакладная.ДоговорКонтрагента	= ЗаказПокупателя.ДоговорКонтрагента;
					НалоговаяНакладная.Организация			= ЗаказПокупателя.Организация;
					НалоговаяНакладная.Сделка				= ЗаказПокупателя.ссылка;
					НалоговаяНакладная.ВалютаДокумента		= ЗаказПокупателя.ВалютаДокумента;
					НалоговаяНакладная.ФормаРасчетов		= "Оплата з поточного рахунка";
					НалоговаяНакладная.УсловиеПродажи		= "замовлення № " + ЗаказПокупателя.OrderID+" вiд " + ЗаказПокупателя.Дата;
					НалоговаяНакладная.КурсВзаиморасчетов	= ЗаказПокупателя.КурсВзаиморасчетов;
					НалоговаяНакладная.КратностьВзаиморасчетов = ЗаказПокупателя.КратностьВзаиморасчетов;
					НалоговаяНакладная.СчетНДС				= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6412");
					НалоговаяНакладная.СчетУчетаНДС			= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");
					НалоговаяНакладная.ТипПричиныНевыдачиПокупателю = 2;
					
					НалоговаяНакладная.Товары.Загрузить(ЗаказПокупателя.Товары.Выгрузить());
					
					сч = 1;
					Для Каждого Товар из НалоговаяНакладная.Товары Цикл
						Товар.НомерСтрокиНН = сч;
						Товар.КодУКТВЭД		= Товар.Номенклатура.НоменклатураГТД;
						Товар.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Товар, НалоговаяНакладная);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Товар, НалоговаяНакладная);
						Товар.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
						сч = сч + 1;
					КонецЦикла;
					
					Попытка
						НалоговаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЗаписьЖурналаРегистрации("Проведение налоговой по оплате ", УровеньЖурналаРегистрации.Ошибка,,,"ЗаказПокупателя № " + ЗаказПокупателя.Номер + " " + ОписаниеОшибки()); 
						НалоговаяНакладная.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
					
				КонецЕсли;
				//Дандали В. 23.09.2025 -
				
		
		КонецЕсли;
		КонецЕсли;
		
		
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЧекККМ.Ссылка
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.ЗаказПокупателя = &ЗаказПокупателя";
		Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя.Ссылка);
		
		РезультатЗапроса = запрос.Выполнить().Выгрузить();
		
		Если не РезультатЗапроса.Количество() Тогда
			
			
			Если МобильныйДокумент.ОплаченНаличными Тогда 
				
				ЧекККМ 					 = Документы.ЧекККМ.СоздатьДокумент();
				ЧекККМ.Дата 			 = ТекущаяДата();
				ЧекККМ.ВидОперации 		 = Перечисления.ВидыОперацийЧекККМ.Продажа;
				ЧекККМ.ДокументОснование = ЗаказПокупателя.Ссылка;
				ЧекККМ.ЗаказПокупателя = ЗаказПокупателя.Ссылка;
				ЧекККМ.КассаККМ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"ОсновнаяКассаККМ");
				ЧекККМ.Комментарий = "#Создан автоматически при загрузке из ТСД";
				ЧекККМ.Организация = ЧекККМ.КассаККМ.Владелец;
				ЧекККМ.Ответственный = МобильныйДокумент.ОтветственныйЗаОплату;
				ЧекККМ.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"ОсновнойСклад");
				ЧекККМ.СуммаДокумента = ЗаказПокупателя.СуммаДокумента;
				
				оплаты = ЧекККМ.Оплата.Добавить();
				оплаты.ВидОплаты = Справочники.ВидыОплатЧекаККМ.Наличные;
				оплаты.Сумма = ЗаказПокупателя.СуммаДокумента;
				
				Для Каждого Строка из ЗаказПокупателя.товары цикл
					СтрокаЧека = ЧекККМ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЧека,Строка);
				КонецЦикла;
				
				
				Для Каждого Строка из ЗаказПокупателя.Услуги цикл
					СтрокаЧека = ЧекККМ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЧека,Строка);
				КонецЦикла;

				
				ЧекККМ.Записать();
				Попытка

				ЧекККМ.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
				КонецПопытки;
			Иначе
				ЧекККМ 					 = Документы.ЧекККМ.СоздатьДокумент();
				ЧекККМ.Дата 			 = ТекущаяДата();
				ЧекККМ.ВидОперации 		 = Перечисления.ВидыОперацийЧекККМ.Продажа;
				ЧекККМ.ДокументОснование = ЗаказПокупателя.Ссылка;
				ЧекККМ.ЗаказПокупателя 	 = ЗаказПокупателя.Ссылка;
				ЧекККМ.КассаККМ 		 = Справочники.КассыККМ.НайтиПоКоду("000000001",Истина,,);
				ЧекККМ.Комментарий 		 = "#Создан автоматически при загрузке из ТСД";
				ЧекККМ.Организация 		 = Справочники.Организации.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ ТОВ");
				ЧекККМ.Ответственный 	 = МобильныйДокумент.ОтветственныйЗаОплату;
				ЧекККМ.Склад 		     = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(МобильныйДокумент.ОтветственныйЗаОплату,"ОсновнойСклад");
				ЧекККМ.СуммаДокумента    = ЗаказПокупателя.СуммаДокумента;
				
				оплаты 				= ЧекККМ.Оплата.Добавить();
				оплаты.ВидОплаты 	= Справочники.ВидыОплатЧекаККМ.НайтиПоКоду("00002");
				оплаты.Сумма 		= ЗаказПокупателя.СуммаДокумента;
				
				Для Каждого Строка из ЗаказПокупателя.товары цикл
					СтрокаЧека = ЧекККМ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЧека,Строка);
				КонецЦикла;
				
				
				Для Каждого Строка из ЗаказПокупателя.Услуги цикл
					СтрокаЧека = ЧекККМ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЧека,Строка);
				КонецЦикла;
				
				ЧекККМ.Записать();
				
				Попытка
					ЧекККМ.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Функция	ПолучитьДоговорКонтрагента(Контрагент,Организация,ВидДоговора) Экспорт 
	
	ВозвращаемоеЗначение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Контрагент
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Ссылка;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция УжеЕстьНалоговая(ДокОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Поле1
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НЕ НалоговаяНакладная.ПометкаУдаления
		|	И НалоговаяНакладная.Проведен
		|	И НалоговаяНакладная.ДокументОснование = &Платежка";
	
	Запрос.УстановитьПараметр("Платежка", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

