Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;
Перем мАннулировать Экспорт;
Перем мПараметрыСвязиСтрокТЧ Экспорт;

Перем мМинимальныеЦены Экспорт;

Перем мРассчитыватьАвтоматическиеСкидки;
Перем мСписокФильтров;

Перем мУчетнаяПолитика;

Перем мУказаниеСкладовВТЧ Экспорт;

перем мНДС ;
перем Алфавит2;

Перем СтатусОтправкиПоПочте Экспорт;

	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Процедура осуществляет операцию оплаты картой, используя подключенную эквайринговую систему.
//
// Параметры:
//  СуммаОплаты - сумма оплаты
//
Процедура ОплатитьКартой(СуммаОплаты) Экспорт

	Перем ЭС;
	Перем ФР;
	
	//+ЛежаченкоДР
	//Если РаботаСТорговымОборудованием.ПолучитьПроверитьПараметрыДляОплатыКартой(ЭС, ФР) Тогда
	Если РаботаСТорговымОборудованием.ПолучитьПроверитьПараметрыДляОплатыКартой(ЭС, ФР, ПолучитьОсновнуюКассуККМПользователя()) Тогда
	//-ЛежаченкоДР
		КодRRN = Неопределено;
		//Дандали В. 28.02.2025 +
		СтрДопПараметры = Новый Структура;
		//Дандали В. 28.02.2025 -
		
		Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
			Результат = ПолучитьСерверТО().ОплатитьПлатежнойКартой(ЭС, СуммаОплаты, КодRRN, ФР, СтрДопПараметры);
		Иначе
			Результат = ПолучитьСерверТО().ОтменитьПлатежПоПлатежнойКарте(ЭС, СуммаОплаты, КодRRN, ФР);
		КонецЕсли;
		
		//Дандали В. 28.02.2025 +
		
		Если СтрДопПараметры.Свойство("ДанныеОбОплате") Тогда
			Для Каждого Парам из СтрДопПараметры.ДанныеОбОплате Цикл
				ДанныеОбОплате.Очистить();
				ЗаполнитьЗначенияСвойств(ДанныеОбОплате.Добавить(), Парам);
			КонецЦикла;
		КонецЕсли;
		//Дандали В. 28.02.2025 -
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Ошибка = ПолучитьСерверТО().ПолучитьТекстОшибкиТО(Результат);
			Предупреждение(Ошибка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОплатитьКартой()

// Функция формирует табличный документ с печатной формой.
//
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма.
//
Функция ПечатьЧека()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокЧек.Номер,
	|	ДокЧек.Дата,
	|	ДокЧек.КассаККМ,
	|	ДокЧек.Организация                  КАК Организация,
	|	ДокЧек.Организация.Представление    КАК Поставщик,
	|	ДокЧек.СуммаДокумента,
	|	ДокЧек.ВидОперации,
	|	ДокЧек.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.Представление      КАК Товар,
	|		Номенклатура.НаименованиеПолное КАК ТоварПолноеНаименование,
	|		Номенклатура.Код                КАК Код,
	|		Номенклатура.Артикул            Как Артикул,
	|		Количество,
	|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмерения,
	|		Цена,
	|		ПроцентСкидкиНаценки            КАК Скидка,
	|		ПроцентАвтоматическихСкидок     КАК СкидкаАвтоматическая,
	|		Сумма,
	|		ХарактеристикаНоменклатуры      КАК Характеристика,
	|		СерияНоменклатуры               КАК Серия
	|	),
	|	ДокЧек.Оплата.(
	|		НомерСтроки,
	|		ВидОплаты,
	|		Сумма
	|	),
	|	ВЫБОР	КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") = """"
	|				ТОГДА """"
	|			ИНАЧЕ
	|				ФИОФизЛицСрезПоследних.Фамилия + "" "" +
	|				ВЫБОР	КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") = """"
	|						ТОГДА """"
	|						ИНАЧЕ ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1)) + "". ""
	|				КОНЕЦ
	|				+
	|				ВЫБОР	КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") = """"
	|						ТОГДА """"
	|						ИНАЧЕ ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1)) + "".""
	|				КОНЕЦ
	|	КОНЕЦ КАК ФИО
	|ИЗ
	|	Документ.ЧекККМ КАК ДокЧек
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Пользователи КАК Пользователи
	|ПО
	|	Пользователи.Ссылка = ДокЧек.Ответственный
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ПО
	|	Пользователи.ФизЛицо = ФизическиеЛица.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата) КАК ФИОФизЛицСрезПоследних
	|ПО
	|	ФизическиеЛица.Ссылка = ФИОФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	ДокЧек.Ссылка = &ТекущийДокумент
	|УПОРЯДОЧИТЬ ПО
	|	ДокЧек.Товары.НомерСтроки,
	|	ДокЧек.Оплата.НомерСтроки
	|";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Чек_Накладная";

	Макет = ПолучитьМакет("Накладная");
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	// Выводим шапку накладной.
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Чек (возврат)';uk='Чек (повернення)'"), КодЯзыкаПечать);
	Иначе
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Чек", КодЯзыкаПечать);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
	ОбластьМакета.Параметры.Поставщик = Шапка.Организация;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ИНН");
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата,,,КодЯзыкаПечать);
	ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		
		Если ВыборкаСтрокТовары.Скидка + ВыборкаСтрокТовары.СкидкаАвтоматическая <> 0 Тогда
			
			ЕстьСкидки = Истина;
			Прервать;
			
		Иначе
			
			ЕстьСкидки = Ложь;
			Если ВыборкаСтрокТовары.Цена * ВыборкаСтрокТовары.Количество <> 0 Тогда
							
				ПроцентСкидки = (1 - ВыборкаСтрокТовары.Сумма/(ВыборкаСтрокТовары.Цена*ВыборкаСтрокТовары.Количество)) * 100 ;
				
				Если ПроцентСкидки <> 0 Тогда 
					
					Скидка = Ценообразование.ПолучитьСуммуСкидки(ВыборкаСтрокТовары.Сумма, ПроцентСкидки);
					Скидка = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(Скидка, 2);
					
					Если Скидка <> 0 Тогда
					    ЕстьСкидки = Истина;
						Прервать;
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;

	ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьДанных);
	Если ЕстьСкидки Тогда
		ТабДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьСуммы);

	ОбластьКолонкаТовар = Макет.Область("Товар");
	Если Не ВыводитьКоды Тогда
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки
		                                  + Макет.Область("КолонкаКодов").ШиринаКолонки;
	КонецЕсли;
	Если Не ЕстьСкидки Тогда
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки
		                                  + Макет.Область("СуммаБезСкидки").ШиринаКолонки
		                                  + Макет.Область("СуммаСкидки").ШиринаКолонки;
	КонецЕсли;

	ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

	Сумма          = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;

	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить(НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.';uk='В одному з рядків не заповнене значення номенклатури - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьНомера.Параметры.Заполнить(ВыборкаСтрокТовары);
		ТабДокумент.Вывести(ОбластьНомера);

		Если ВыводитьКоды Тогда
			Если Колонка = "Артикул" Тогда
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
			Иначе
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;

		ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьДанных.Параметры.Товар = ?(НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.ТоварПолноеНаименование),
		                                ВыборкаСтрокТовары.Товар, ВыборкаСтрокТовары.ТоварПолноеНаименование)
		                              + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ТабДокумент.Присоединить(ОбластьДанных);

		Скидка = ВыборкаСтрокТовары.Цена * ВыборкаСтрокТовары.Количество - ВыборкаСтрокТовары.Сумма;
		Если ЕстьСкидки Тогда
			ОбластьСкидок.Параметры.Скидка         = Скидка;
			ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаСтрокТовары.Сумма + Скидка;
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;

		ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокТовары);
		ТабДокумент.Присоединить(ОбластьСуммы);
		Сумма          = Сумма + ВыборкаСтрокТовары.Сумма;
		ВсегоСкидок    = ВсегоСкидок + Скидка;
		ВсегоБезСкидок = Сумма + ВсегоСкидок;
	КонецЦикла;

	// Вывести Итого.
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");

	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьДанных);
	Если ЕстьСкидки Тогда
		ОбластьСкидок.Параметры.ВсегоСкидок    = ВсегоСкидок;
		ОбластьСкидок.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
		ТабДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ОбластьСуммы.Параметры.Всего = Сумма;
	ТабДокумент.Присоединить(ОбластьСуммы);

	// Вывести Сумму прописью.
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ВыборкаСтрокТовары.Количество()
									   + НСтр("ru=', на сумму ';uk=', на суму '",КодЯзыкаПечать) + ОбщегоНазначения.ФорматСумм(Шапка.СуммаДокумента, мВалютаРегламентированногоУчета);

	ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(Шапка.СуммаДокумента, мВалютаРегламентированногоУчета, КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	//
	// Вывести Оплату и Сдачу.
	СуммаОплат = 0;
	СуммаБезналичныхОплат = 0;
	СписокОплат = Новый Соответствие();

	ВыборкаОплат = Шапка.Оплата.Выбрать();
	Пока ВыборкаОплат.Следующий() Цикл
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат
		   И ВыборкаОплат.ВидОплаты.ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
			СуммаБезналичныхОплат = СуммаБезналичныхОплат + ВыборкаОплат.Сумма;
		КонецЕсли;

		ЗаписьОплаты = СписокОплат.Получить(Строка(ВыборкаОплат.ВидОплаты.ТипОплаты));
		Если ЗаписьОплаты = Неопределено Тогда
			СписокОплат.Вставить(Строка(ВыборкаОплат.ВидОплаты.ТипОплаты), ВыборкаОплат.Сумма);
		Иначе
			СписокОплат.Вставить(Строка(ВыборкаОплат.ВидОплаты.ТипОплаты), ЗаписьОплаты + ВыборкаОплат.Сумма);
		КонецЕсли;
		СуммаОплат = СуммаОплат + ВыборкаОплат.Сумма;
	КонецЦикла;

	//Отдельная подготовка наличной оплаты для чека возврата
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		СписокОплат.Вставить(Строка(Перечисления.ТипыОплатЧекаККМ.Наличные), Шапка.СуммаДокумента - СуммаБезналичныхОплат);
	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("Оплата");
	ОплатаДобавлена = Ложь;
	Для Каждого ЗнПеречисления Из Перечисления.ТипыОплатЧекаККМ Цикл
		ЗаписьОплаты = СписокОплат.Получить(Строка(ЗнПеречисления));
		Если ЗаписьОплаты <> Неопределено Тогда
			ОбластьМакета.Параметры.Оплата = ?(ОплатаДобавлена, ОбластьМакета.Параметры.Оплата + Символы.ПС, "")
			                               + Локализация.ПолучитьЛокализованныйСинонимОбъекта(ЗнПеречисления, КодЯзыкаПечать) + ": "  + Формат(ЗаписьОплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
			ОплатаДобавлена = Истина;
		КонецЕсли;
	КонецЦикла;
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
		ОбластьМакета.Параметры.Сдача = Формат(СуммаОплат - Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
	Иначе
		ОбластьМакета.Параметры.Сдача = "0.00";
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	//
	
	// Вывести подписи.
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьЧека()

// Функция осуществляет проведение документа и печать чека на ФР.
//
// Параметры:
//  Ответ    - <Строка>
//           - Выходной параметр; описание произошедшей ошибки.
//
//  Отказ    - <Булево>
//           - Выходной параметр; признак отказа от выполнения операции.
//
// Возвращаемое значение:
//  <Булево> - Истина в случае успешного завершения операции.
//
Функция ПровестиИРаспечататьЧек(Ответ, Отказ, ФормаДокумента) Экспорт

	Результат = Истина;
	Ответ     = "";

	Попытка
		ФормаДокумента.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
		Ответ     = НСтр("ru='Ошибка при попытке проведения документа!';uk='Помилка при спробі проведення документа!'");
		Отказ     = Истина;
		Результат = Ложь;
		Возврат Результат;
	КонецПопытки;

	Если ЧекПробитНаККМ Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОрганизацияПлательщикНДС = ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата, КассаККМ.Владелец).НДС;
	
	//Если ОрганизацияПлательщикНДС
	//	И (НЕ ТипЦен.ЦенаВключаетНДС) Тогда
	//	ТекстСообщения = НСтр("ru='Цена не включает НДС, пробитие чеков не поддерживается';uk='Ціна не включає ПДВ, пробиття чеків не підтримується'");
	//	Сообщить(ТекстСообщения,СтатусСообщения.ОченьВажное);
	//	Отказ     = Истина;
	//	Результат = Ложь;
	//	Возврат Результат;
	//КонецЕсли; 

	МассивФР      = ПолучитьСерверТО().ПолучитьСписокУстройств(
	                    Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор,
	                    КассаККМ);

	КоличествоФР = МассивФР.Количество();
	Если КоличествоФР = 0 Тогда
		Ответ     = "";
		Отказ     = Истина;
		Результат = Истина;
		Возврат Результат;
	ИначеЕсли КоличествоФР = 1 Тогда
		ФР = МассивФР[0];
	Иначе
		СписокФР = РаботаСТорговымОборудованием.ПолучитьСписокУстройствТОДляВыбора(МассивФР);

		ФР = СписокФР.ВыбратьЭлемент(НСтр("ru='Необходимо выбрать фискальный регистратор';uk='Необхідно вибрати фіскальний реєстратор'"));
		Если ФР = Неопределено Тогда
			Ответ     = НСтр("ru='Операция отменена пользователем.';uk='Операція скасована користувачем.'");
			Отказ     = Истина;
			Результат = Ложь;
			Возврат Результат;
		Иначе
			ФР = ФР.Значение;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|    ТчТовары.Номенклатура.Представление               КАК Номенклатура,
	|    ТчТовары.Номенклатура.ПодакцизныйТовар            КАК ЭтоПодакцизныйТовар,
	|    ТчТовары.Номенклатура.Код			               КАК Код,
	|    ТчТовары.Артикул  								   КАК Артикул,
	|    ТчТовары.Штрихкод 								   КАК Штрихкод,
	|    ТчТовары.ИдентификаторСтроки 					   КАК ИдентификаторСтроки,
	|    ТчТовары.УказыватьШтрихкодАкцизнойМаркиПриПечатиЧека КАК УказыватьШтрихкодАкцизнойМаркиПриПечатиЧека,
	|    ТчТовары.ХарактеристикаНоменклатуры.Представление КАК ХарактеристикаНоменклатуры,
	|    ТчТовары.СерияНоменклатуры.Представление          КАК СерияНоменклатуры,
	|    ТчТовары.ЕдиницаИзмерения.Представление           КАК ЕдиницаИзмерения,
	|    ТчТовары.Цена                                     КАК Цена,
	|    ТчТовары.Количество                               КАК Количество,
	|    ТчТовары.Сумма                                    КАК Сумма,
	|    ТчТовары.Цена * ТчТовары.Количество - ТчТовары.Сумма КАК СуммаСкидок,
	|	ВЫБОР
	|		КОГДА ТчТовары.Цена * ТчТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ (1 - ТчТовары.Сумма / (ТчТовары.Цена * ТчТовары.Количество)) * 100
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|    ТчТовары.Номенклатура.СтавкаНДС                   КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТчТовары.Номенклатура.НоменклатураГТД) = ТИП(Справочник.КлассификаторУКТВЭД)
	|			ТОГДА ТчТовары.Номенклатура.НоменклатураГТД.Код
	|		КОГДА ТИПЗНАЧЕНИЯ(ТчТовары.Номенклатура.НоменклатураГТД) = ТИП(Справочник.НоменклатураГТД)
	|			ТОГДА ТчТовары.Номенклатура.НоменклатураГТД.КодУКТВЭД.Код
	|	КОНЕЦ КАК КодПоУКТВЭД,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТчТовары.Номенклатура.НоменклатураГТД) = ТИП(Справочник.КлассификаторУКТВЭД)
	|			ТОГДА ТчТовары.Номенклатура.НоменклатураГТД.ВыводитьПриПечатиЧека
	|		КОГДА ТИПЗНАЧЕНИЯ(ТчТовары.Номенклатура.НоменклатураГТД) = ТИП(Справочник.НоменклатураГТД)
	|			ТОГДА ТчТовары.Номенклатура.НоменклатураГТД.КодУКТВЭД.ВыводитьПриПечатиЧека
	|	КОНЕЦ КАК ВыводитьНаПечатьКодУКТВЭД
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|    Документ.ЧекККМ.Товары КАК ТчТовары
	|ГДЕ
	|    ТчТовары.Ссылка = &Ссылка
	|	;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.ЭтоПодакцизныйТовар,
	|	Товары.Код,
	|    Товары.Артикул,
	|    Товары.Штрихкод,
	|   Товары.ИдентификаторСтроки,
	|   Товары.УказыватьШтрихкодАкцизнойМаркиПриПечатиЧека,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Цена,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.СуммаСкидок,
	|	Товары.ПроцентСкидкиНаценки,
	|	Товары.СтавкаНДС,
	|	ЕСТЬNULL(Товары.КодПоУКТВЭД, """") КАК КодПоУКТВЭД,
	|	ЕСТЬNULL(Товары.ВыводитьНаПечатьКодУКТВЭД, ЛОЖЬ) КАК ВыводитьНаПечатьКодУКТВЭД
	|ИЗ
	|	Товары КАК Товары");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Ответ     = НСтр("ru='Пустой чек не может быть пробит на фискальном регистраторе!';uk='Порожній чек не може бути пробитий на фіскальному реєстраторі!'");
		Отказ     = Истина;
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Наименование");
	ТаблицаТоваров.Колонки.Добавить("Код");
	ТаблицаТоваров.Колонки.Добавить("НомерСекции");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Скидка");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДССтрокой");
	ТаблицаТоваров.Колонки.Добавить("ЭтоПодакцизныйТовар");
	ТаблицаТоваров.Колонки.Добавить("СтруктураДопРеквизитовТабличнойЧасти");

	фЕстьНДС = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(?(ЭтоНовый(), ТекущаяДата(), Дата), Ложь, Организация, "Нал").ЕстьНДС;
	
	ТЧАкцизныеМарки = АкцизныеМарки.Выгрузить();
	ТЧАкцизныеМарки.Индексы.Добавить("ИдентификаторСтроки");
	НесколькоАкцизныхМарокДляОдногоТовара = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Товар = ТаблицаТоваров.Добавить();
// н ЛИВ		
		////НаименованиеТовара = СокрЛП(Выборка.Номенклатура)
		////   + "(" + СокрЛП(Выборка.ЕдиницаИзмерения)
		////   + ?(ПустаяСтрока(Выборка.ХарактеристикаНоменклатуры), "", ", " + СокрЛП(Выборка.ХарактеристикаНоменклатуры))
		////   + ?(ПустаяСтрока(Выборка.СерияНоменклатуры)         , "", ", " + СокрЛП(Выборка.СерияНоменклатуры)) + ")";
		   
		НаименованиеТовара = СокрЛП(Выборка.Номенклатура)
			+ ?(ПустаяСтрока(Выборка.ХарактеристикаНоменклатуры), "", "(" + СокрЛП(Выборка.ХарактеристикаНоменклатуры) + ")");
// н ЛИВ		
		   
		 КодПоУКТВЭД = "";

		Если Выборка.ВыводитьНаПечатьКодУКТВЭД Тогда
			РазделительКодНаименование = "#"; //Знак разделителя между кодом УКТВЭД и наименованиес товара, можно заменять на другой 
			КодПоУКТВЭД = СтрЗаменить(Выборка.КодПоУКТВЭД," ","");
			НаименованиеТовара = КодПоУКТВЭД + РазделительКодНаименование + НаименованиеТовара;
		КонецЕсли;
		
		Товар.Наименование = НаименованиеТовара;
		Товар.Код		   = Выборка.Код;	
		Товар.НомерСекции  = Склад.НомерСекции;
		Товар.Цена         = Выборка.Цена;
		Товар.Количество   = Выборка.Количество;
		Товар.Скидка       = Выборка.ПроцентСкидкиНаценки;
		Товар.СтавкаНДС    = ?(фЕстьНДС, УчетНДС.ПолучитьСтавкуНДС(Выборка.СтавкаНДС), 0);
		Товар.СтавкаНДССтрокой       = Обработки.ТОСервер.ПолучитьСтавкуНДССтрокой(Выборка.СтавкаНДС);
		Товар.ЭтоПодакцизныйТовар    = ?(ПодакцизныеТоварыДляКоммерческогоИспользования, Ложь, Выборка.ЭтоПодакцизныйТовар);
		ШтрихкодыАкцизныхМарок = "";
		
		Если Выборка.ЭтоПодакцизныйТовар И Выборка.УказыватьШтрихкодАкцизнойМаркиПриПечатиЧека Тогда
			МассивШтрихкодыАкцизныхМарок = Новый Массив;
			НайденныеСтроки = ТЧАкцизныеМарки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Выборка.ИдентификаторСтроки));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл       
				МассивШтрихкодыАкцизныхМарок.Добавить(НайденнаяСтрока.ШтрихкодАкцизнойМарки);
			КонецЦикла;
			
			Если МассивШтрихкодыАкцизныхМарок.Количество() = 1 Тогда
				ШтрихкодыАкцизныхМарок = МассивШтрихкодыАкцизныхМарок[0];
			ИначеЕсли МассивШтрихкодыАкцизныхМарок.Количество() > 1 Тогда
				ШтрихкодыАкцизныхМарок = МассивВСтрокуСРазделителями(МассивШтрихкодыАкцизныхМарок);
				НесколькоАкцизныхМарокДляОдногоТовара = Истина;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураДопРеквизитовТабличнойЧасти = Новый Структура;
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("КодПоУКТВЭД"     , КодПоУКТВЭД);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("АртикулТовара"   , Выборка.Артикул);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("Штрихкод"        , Выборка.Штрихкод);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("Сумма"           , Выборка.Сумма);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("СуммаСкидок"     , Выборка.СуммаСкидок);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("ЦенаВключаетНДС" , 1);
		СтруктураДопРеквизитовТабличнойЧасти.Вставить("ШтрихкодыАкцизныхМарок" , ШтрихкодыАкцизныхМарок);
		
		Товар.СтруктураДопРеквизитовТабличнойЧасти = СтруктураДопРеквизитовТабличнойЧасти;

	КонецЦикла;
	
	СтруктураПараметровЧека  = Новый Структура;
	
	СтруктураПараметровЧека.Вставить("ТаблицаТоваров", ТаблицаТоваров);
	
	СтруктураОбщиеПараметры = Новый Структура;
	СтруктураОбщиеПараметры.Вставить("ЧекККМ", Ссылка);  // Ссылка на чек ККМ, нужна для Програмного РРО
	СтруктураОбщиеПараметры.Вставить("СуммаДокумента", СуммаДокумента);
	СтруктураОбщиеПараметры.Вставить("НомерЧекаВозврата", ?(ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат,ЧекККМПродажа.НомерЧекаККМ,"0")); // Номер чека ККМ, на основании которого делают возврат , нужнен для Програмного РРО
	СтруктураОбщиеПараметры.Вставить("НесколькоАкцизныхМарокДляОдногоТовара", НесколькоАкцизныхМарокДляОдногоТовара);
	
	СтруктураПараметровЧека.Вставить("СтруктураОбщиеПараметры", СтруктураОбщиеПараметры);

	ОшибкаТО = ПолучитьСерверТО().ПечатьЧека(ФР, ПолучитьСерверТО().ПолучитьПарольКассираККМ(), НомерЧекаККМ, НомерСменыККМ,
									СтруктураПараметровЧека, ПолучитьСуммуНаличнойОплаты(),
	                               ПолучитьСуммуБезналичнойОплаты(),
	                               ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат);

	Если НЕ ЗначениеЗаполнено(ОшибкаТО) Тогда
		ЧекПробитНаККМ = Истина;
		Попытка
			Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Ответ     = НСтр("ru='Не удалось записать документ с установленными параметрами пробитого чека.';uk='Не вдалося записати документ з встановленими параметрами пробитого чека.'");
			Отказ     = Истина;
			Результат = Ложь;
		КонецПопытки;
	Иначе
		Ответ     = ПолучитьСерверТО().ПолучитьТекстОшибкиФРТО(ОшибкаТО);
		Отказ     = Истина;
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПровестиИРаспечататьЧек()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru='Документ можно распечатать только после его записи';uk='Документ можна роздрукувати тільки після його запису'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru='Недостаточно полномочий для печати непроведенного документа!';uk='Недостатньо повноважень для друку непроведенного документа!'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "Чек" Тогда
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
				НачалоСообщенияОбОшибке = НСтр("ru='Не выбрана касса ККМ.';uk='Не обрана каса ККМ.'")
			Иначе
				НачалоСообщенияОбОшибке = НСтр("ru='У выбранной кассы ККМ не задана организация.';uk='У вибраної каси ККМ не задана організація.'");
			КонецЕсли;

			Предупреждение(НачалоСообщенияОбОшибке + Символы.ПС + НСтр("ru='Печать чека невозможна.';uk='Друк чека неможливий.'"));
			Возврат;
		КонецЕсли;

		// Получить экземпляр документа на печать.
		ТабДокумент = ПечатьЧека();
	ИначеЕсли ИмяМакета = "СерийныеНомера" Тогда
		ТабДокумент = УчетСерийныхНомеров.ПечатьСерийныхНомеров(Ссылка, "Товары");
	ИначеЕсли ИмяМакета = "РасходСРозничныхСкладовВЦенахАТТ" Тогда
		ТабДокумент = ЗаполнениеДокументов.НапечататьПриходРасходСРозничныхСкладовВЦенахАТТ(Ссылка, мВалютаРегламентированногоУчета, Ложь);
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
	
КонецПроцедуры // Печать()

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура("Чек", "Чек");
	СтруктураМакетов.Вставить("СерийныеНомера",      НСтр("ru='Список серийных номеров';uk='Список серійних номерів'"));
	СтруктураМакетов.Вставить("РасходСРозничныхСкладовВЦенахАТТ" , НСтр("ru='Расход с розничных складов в ценах АТТ';uk='Видаток з роздрібних складів в цінах АТТ'"));

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура открывает для выбора форму справочник Типы оплат чека ККМ
// с установленным параметром отбора на тип оплаты по значениям параметров констант учетной политики
// ИспользоватьОплатуПлатежнымиКартами
// ИспользоватьОплатуБанковскимиКредитами
//
// Параметры
//  СтандартнаяОбработка  - Булево - признак стандартной обработки выбора поля ввода
//  Элемент               - ПолеВвода - Поле ввода в котором происходит выбор типа оплаты
//
Процедура ВыборТипаОплаты(СтандартнаяОбработка, Элемент) Экспорт
	Перем ЗначениеОтбораТипаОплаты;
	
	СписокЗначенийОтбора = Новый СписокЗначений();
	СписокЗначенийОтбора.Добавить(Перечисления.ТипыОплатЧекаККМ.Наличные);
	Если глЗначениеПеременной("ИспользоватьОплатуПлатежнымиКартами") Тогда
		СписокЗначенийОтбора.Добавить(Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта);
	КонецЕсли;
	Если глЗначениеПеременной("ИспользоватьОплатуБанковскимиКредитами") Тогда
		СписокЗначенийОтбора.Добавить(Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);
	КонецЕсли;
	Если СписокЗначенийОтбора.Количество() = 1 Тогда
		ЗначениеОтбораТипаОплаты = СписокЗначенийОтбора[0].Значение;
	Иначе
		ЗначениеОтбораТипаОплаты = СписокЗначенийОтбора;
	КонецЕсли;
	
	УправлениеРозничнойТорговлей.НачалоВыбораВидаОплатыЧекаККМ(Элемент, ЗначениеОтбораТипаОплаты, СтандартнаяОбработка);
	
КонецПроцедуры // ВыборТипаОплаты()

#КонецЕсли

// Функция считает сумму, оплаченную наличными.
//
// Возвращаемое значение:
//  Число - сумма, оплаченная наличными.
//
Функция ПолучитьСуммуНаличнойОплаты() Экспорт

	СуммаНаличнойОплаты = 0;
	
	Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
		Для Каждого ТекОплата Из Оплата Цикл
			Если ЗначениеЗаполнено(ТекОплата.ВидОплаты)
			   И ТекОплата.ВидОплаты.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
				СуммаНаличнойОплаты = СуммаНаличнойОплаты + ТекОплата.Сумма;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СуммаБезналичныхОплат = 0;
		Для Каждого ТекОплата Из Оплата Цикл
			Если ЗначениеЗаполнено(ТекОплата.ВидОплаты)
			   И ТекОплата.ВидОплаты.ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
				СуммаБезналичныхОплат = СуммаБезналичныхОплат + ТекОплата.Сумма;
			КонецЕсли;
		КонецЦикла;

		СуммаНаличнойОплаты = Товары.Итог("Сумма") - СуммаБезналичныхОплат;
	КонецЕсли;

	Возврат СуммаНаличнойОплаты;

КонецФункции // ПолучитьСуммуНаличнойОплаты()

// Функция считает сумму, оплаченную безналичными.
//
// Возвращаемое значение:
//  Число - сумма, оплаченная наличными.
//
Функция ПолучитьСуммуБезналичнойОплаты() Экспорт

	СуммаБезналичнойОплаты = 0;
	Для Каждого ТекОплата Из Оплата Цикл
		Если ЗначениеЗаполнено(ТекОплата.ВидОплаты) И ТекОплата.ВидОплаты.ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
			СуммаБезналичнойОплаты = СуммаБезналичнойОплаты + ТекОплата.Сумма;
		КонецЕсли;
	КонецЦикла;

	Возврат СуммаБезналичнойОплаты;

КонецФункции // ПолучитьСуммуБезналичнойОплаты()

// Округляет сумму чека по правилам установленным в справочнике Кассы ККМ
//
// Параметры 
//  Нет
//
Процедура ОкруглитьСуммуЧека() Экспорт
	
	ПорядокОкругленияСуммыЧекаВПользуПокупателя = КассаККМ.ПорядокОкругленияСуммыЧекаВПользуПокупателя;
	ОбработкаТабличныхЧастей.ОкруглитьСуммуДокумента(ПорядокОкругленияСуммыЧекаВПользуПокупателя, Товары, Истина, Истина);
	
КонецПроцедуры // ОкруглитьСуммуЧека()

Функция МассивВСтрокуСРазделителями(ИсходныйМассив, Разделитель = ",") 
	
	СтрокаСРазделителями = "";
	Для каждого ЭлементМассива Из ИсходныйМассив Цикл
		СтрокаСРазделителями = СтрокаСРазделителями + ?(ПустаяСтрока(СтрокаСРазделителями), "", Разделитель) + ЭлементМассива;
	КонецЦикла;
	
	Возврат СокрЛП(СтрокаСРазделителями);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры:
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары".
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();

	Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ТаблицаТоваров.Колонки.Цена.Имя = "ЦенаВРознице";
	КонецЕсли;

	// Количество, для услуг не имеющих единицы.
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если СтрокаТаблицы.Услуга = Истина Тогда
			Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
					СтрокаТаблицы.Количество = 1;
				КонецЕсли;
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.КоличествоДок) Тогда
					СтрокаТаблицы.КоличествоДок = 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		ТаблицаТоваров.Колонки.Добавить("Сумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		ТаблицаТоваров.Колонки.Добавить("Количество", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 3));

		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
			Если СтрокаТаблицы.КоличествоДок = NULL Тогда
				СтрокаТаблицы.КоличествоДок = 0;
			КонецЕсли;

			СтрокаТаблицы.Количество = - СтрокаТаблицы.КоличествоДок;
			СтрокаТаблицы.Сумма = - СтрокаТаблицы.СуммаДок;
		КонецЦикла;
	КонецЕсли;

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры:
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары".
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуСкидок(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Номенклатура");
	ТаблицаДвижений.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаДвижений.Колонки.Добавить("УсловиеСкидки");
	ТаблицаДвижений.Колонки.Добавить("ЗначениеУсловияСкидки");
	ТаблицаДвижений.Колонки.Добавить("СуммаСкидки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));

	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		СуммаБезСкидки = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Окр(СтрокаТаблицы.Цена * СтрокаТаблицы.КоличествоВЕдиницахДокумента, 2), мВалютаРегламентированногоУчета,
		   СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		   1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		   1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		СуммаСоСкидками = СуммаБезСкидки;
		СкидкиЕсть = Ложь;

		Если СтрокаТаблицы.ПроцентАвтоматическихСкидок <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.Номенклатура = СтрокаТаблицы.Номенклатура;
			СтрокаДвижений.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
			СтрокаДвижений.УсловиеСкидки = СтрокаТаблицы.УсловиеАвтоматическойСкидки;
			СтрокаДвижений.ЗначениеУсловияСкидки = СтрокаТаблицы.ЗначениеУсловияАвтоматическойСкидки;
			СтрокаДвижений.СуммаСкидки = Окр(СуммаБезСкидки / 100 * СтрокаТаблицы.ПроцентАвтоматическихСкидок, 2);

			СуммаСоСкидками = СуммаСоСкидками - СтрокаДвижений.СуммаСкидки;

			СкидкиЕсть = Истина;
		КонецЕсли;

		Если СтрокаТаблицы.ПроцентСкидкиНаценки <> 0 Тогда
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.Номенклатура = СтрокаТаблицы.Номенклатура;
			СтрокаДвижений.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
			СтрокаДвижений.УсловиеСкидки = Перечисления.УсловияСкидкиНаценки.РучнаяСкидка;
			СтрокаДвижений.ЗначениеУсловияСкидки = СтрокаТаблицы.ПроцентСкидкиНаценки;
			СтрокаДвижений.СуммаСкидки = Окр(СуммаБезСкидки / 100 * СтрокаТаблицы.ПроцентСкидкиНаценки, 2);

			СуммаСоСкидками = СуммаСоСкидками - СтрокаДвижений.СуммаСкидки;
			СкидкиЕсть = Истина;
		КонецЕсли;

		СуммаСтроки = ?(ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат, -СтрокаТаблицы.Сумма, СтрокаТаблицы.Сумма);
		СуммаСтроки = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаСтроки, мВалютаРегламентированногоУчета,
		   СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		   1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		   1, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		Разница = СуммаСтроки - СуммаСоСкидками;
		Если Разница <> 0 И СкидкиЕсть Тогда
			СтрокаДвижений.СуммаСкидки = СтрокаДвижений.СуммаСкидки + Разница;
		КонецЕсли;

		// Натуральные скидки.
		Если СтрокаТаблицы.Комплект Тогда
			Если Ценообразование.ЭтоСпецПредложение(СтруктураШапкиДокумента.Дата,
			        СтрокаТаблицы.Номенклатура,
			        СтрокаТаблицы.ХарактеристикаНоменклатуры,
			        Ценообразование.ПолучитьМассивПолучателейСкидки(Перечисления.ВидыСкидок.Розничная, ЭтотОбъект)) Тогда
				Комплектующие = СоставНабора.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТаблицы.КлючСтроки));

				СтоимостьКомплектующих = 0;
				СоответствиеКомплектующих = Новый Соответствие;

				Для Каждого Комплектующая Из Комплектующие Цикл
					Цена = Комплектующая.Цена;

					СтоимостьКомплектующей = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Цена * СтрокаТаблицы.Количество * Комплектующая.Количество,
					   мВалютаРегламентированногоУчета, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
					   1, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 1,
					   СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

					СтоимостьКомплектующих = СтоимостьКомплектующих + СтоимостьКомплектующей;
					СоответствиеКомплектующих.Вставить(Комплектующая, СтоимостьКомплектующей);
				КонецЦикла;

				СуммаСкидки = СтоимостьКомплектующих - СуммаСтроки;

				Для Каждого Комплектующая Из СоответствиеКомплектующих Цикл
					СтрокаДвижений = ТаблицаДвижений.Добавить();
					СтрокаДвижений.Номенклатура = Комплектующая.Ключ.Номенклатура;
					СтрокаДвижений.ХарактеристикаНоменклатуры = Комплектующая.Ключ.ХарактеристикаНоменклатуры;
					СтрокаДвижений.УсловиеСкидки = Перечисления.УсловияСкидкиНаценки.СпецПредложение;
					СтрокаДвижений.ЗначениеУсловияСкидки = СтрокаТаблицы.Номенклатура;
					СтрокаДвижений.СуммаСкидки = Комплектующая.Значение / СтоимостьКомплектующих * СуммаСкидки;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		Для Каждого СтрокаСкидки Из ТаблицаДвижений Цикл
			СтрокаСкидки.СуммаСкидки = -СтрокаСкидки.СуммаСкидки;
		КонецЦикла;
	КонецЕсли;

	Возврат ТаблицаДвижений;

КонецФункции // ПодготовитьТаблицуСкидок()

// Проверяет правильность заполнения шапки документа.
//
// Параметры:
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - заголовок сообщения об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Склад, КассаККМ, Организация");

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Документ не может осуществлять реализацию с НТТ!';uk='Документ не може здійснювати реалізацію з НТТ!'"), Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Оплата".
//
// Параметры:
//  ТаблицаПоОплате - таблица значений, содержащая данные для проведения и проверки ТЧ "Оплата".
//  Отказ - флаг отказа в проведении.
//  Заголовок - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОплата(ТаблицаПоОплате, Отказ, Заголовок)

	СуммаВсего = Товары.Итог("Сумма");
	ОплаченоНал = ПолучитьСуммуНаличнойОплаты();
	ОплаченоБезнал = ПолучитьСуммуБезналичнойОплаты();
	ОплаченоВсего = Оплата.Итог("Сумма");

	Если ОплаченоВсего < СуммаВсего Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Сумма всех типов оплат меньше суммы документа!';uk='Сума всіх типів оплат менше суми документа!'"), Отказ, Заголовок);
	КонецЕсли;

	Если ОплаченоБезнал > СуммаВсего Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Сумма безналичной оплаты не может быть больше суммы документа!';uk='Сума безготівкової оплати не може бути більше суми документа!'"), Отказ, Заголовок);
	КонецЕсли;

	Если Оплата.Количество() = 1 Тогда
		СтрокаОплаты = Оплата[0];

		Если НЕ ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено значение реквизита ""Вид оплаты""!';uk='Не заповнено значення реквізиту ""Вид оплати""!'"), Отказ, Заголовок);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаОплаты.Сумма) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено значение реквизита ""Сумма оплаты""!';uk='Не заповнено значення реквізиту ""Сума оплати""!'"), Отказ, Заголовок);
		КонецЕсли;
	Иначе

		// Укажем, что надо проверить.
		СтруктураОбязательныхПолей = Новый Структура("ВидОплаты, Сумма");

		ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Оплата", СтруктураОбязательныхПолей, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОплата()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
//  ТаблицаПоТоварам - таблица значений, содержащая данные для проведения и проверки ТЧ "Товары".
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента,
	                                              Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, Сумма");

	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, "Товары", СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь наборов-пакетов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	Для Каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
		Если СтрокаТаблицы.Услуга <> Истина Тогда // для товаров единица измерения обязательна
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Для товара нужно заполнять единицу измерения (строка ';uk='Для товару потрібно заповнювати одиницю виміру (рядок '") + СтрокаТаблицы.НомерСтроки + ").", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УчетСерийныхНомеров.ПроверитьКоличествоСерийныхНомеровВДокументе(ЭтотОбъект, "Товары");

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры:
//  РежимПроведения - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоСкидкам - таблица значений, содержащая данные для проведения по скидкам,
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоСкидкам, Отказ, Заголовок);

	// По некоторым регистрам услуги проводить не нужно.
	// Подготовим отдельную таблицу.
	ТаблицаПоТоварамБезУслуг = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам,
	                           Новый Структура("Услуга", Ложь)).Выгрузить();

	// По регистру РозничнаяВыручка.
	СуммаНалБезСдачи = СуммаДокумента - ПолучитьСуммуБезналичнойОплаты();
	Если СуммаНалБезСдачи <> 0 Тогда
		НаборДвижений = Движения.РозничнаяВыручка;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.РозничнаяТочка = КассаККМ;
		СтрокаДвижений.Сумма          = ?(ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат, -СуммаНалБезСдачи, СуммаНалБезСдачи);
		СтрокаДвижений.Подразделение  = Неопределено;
		СтрокаДвижений.ВидРозничнойВыручки = ?(ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат,Перечисления.ВидыРозничнойВыручки.Возврат, Перечисления.ВидыРозничнойВыручки.Продажа);

		//Дандали В. 27.06.2024 +
		СтрокаДвижений.ОрганизацияРозничнойТочки = КассаККМ.Владелец;	
		//Дандали В. 27.06.2024 -
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
	КонецЕсли;

	// По регистру ПродажиПоДисконтнымКартам.
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ДисконтнаяКарта) Тогда
		СуммаДок = ?(ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат, -СуммаДокумента, СуммаДокумента);

		НаборДвижений = Движения.ПродажиПоДисконтнымКартам;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.ДисконтнаяКарта = СтруктураШапкиДокумента.ДисконтнаяКарта;
		СтрокаДвижений.ВладелецДисконтнойКарты = СтруктураШапкиДокумента.ВладелецДисконтнойКарты;
		СтрокаДвижений.Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДок, мВалютаРегламентированногоУчета,
								   СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
								   1,
								   СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
								   1,
								   СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьДвижения();
		КонецЕсли;
	КонецЕсли;

	//// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах или ТоварыВРознице.
	//Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
	//	НаборДвижений = Движения.ТоварыНаСкладах;
	//Иначе
	//	НаборДвижений = Движения.ТоварыВРознице;
	//КонецЕсли;

	//// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	//ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	////Получим таблицу по комплектам.
	//ТаблицаПоКомплектам = УправлениеЗапасами.СформироватьТаблицуКомплектующих(ТаблицаПоТоварамБезУслуг, ЭтотОбъект);
	//ТаблицаПоКомплектам.Колонки.Добавить("Склад");
	//ТаблицаПоКомплектам.ЗаполнитьЗначения(Склад, "Склад");

	//Если Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
	//	ТаблицаПоКомплектам.Колонки.Добавить("СуммаПродажная");

	//	ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, Склад,
	//	                 ТаблицаПоКомплектам.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

	//	УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаПоКомплектам, ТаблицаПоЦенам);
	//КонецЕсли;

	//// Заполним таблицу движений.
	//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоКомплектам, ТаблицаДвижений);

	//// Недостающие поля.
	//ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");

	//НаборДвижений.мПериод          = Дата;
	//НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	//// Проверка остатков при оперативном проведении.
	//Если СтруктураШапкиДокумента.КонтролироватьОстаткиТоваровПриОперативномПроведенииЧековККМ
	//   И РежимПроведения = РежимПроведенияДокумента.Оперативный
	//   И ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
	//	НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
	//КонецЕсли;

	//Если Не Отказ Тогда
	//	НаборДвижений.ВыполнитьРасход();
	//КонецЕсли;

	// ПО РЕГИСТРУ ПредоставленныеСкидки.
	НаборДвижений = Движения.ПредоставленныеСкидки;

	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоСкидкам, ТаблицаДвижений);

	ТаблицаДвижений.ЗаполнитьЗначения(Склад, "ПолучательСкидки");

	Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(ЧекККМПродажа, "ДокументСкидки");
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументСкидки");
	КонецЕсли;

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		НаборДвижений.ВыполнитьДвижения();
	КонецЕсли;
	
	//Яковлев Руслан
	ДвиженияПоВзаиморасчетамИРасчетам(ТаблицаПоТоварам, Отказ)
	
	//--Яковлев Руслан
КонецПроцедуры // ДвиженияПоРегистрам()



Процедура ДвиженияПоВзаиморасчетамИРасчетам(ТаблицаПоТоварам, Отказ)
	
	если не ЗначениеЗаполнено(ЗаказПокупателя) Тогда 
		Возврат;
	КонецЕсли;

	Контрагент 	       = ЗаказПокупателя.Контрагент;
	ДоговорКонтрагента = ЗаказПокупателя.ДоговорКонтрагента;
	Сделка			   = ЗаказПокупателя;

	ВалютаУправленческогоУчета	= Константы.ВалютаУправленческогоУчета.Получить();
	СтруктураКурсаВалютыУУ		= МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, Дата);

	НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыСКонтрагентами;
	ТаблицаВзаиморасчеты      = НаборЗаписейВзаиморасчеты.ВыгрузитьКолонки();
	НаборЗаписейРасчеты       = Движения.РасчетыСКонтрагентами;
	ТаблицаРасчеты            = НаборЗаписейРасчеты.ВыгрузитьКолонки();

	ОбщаяСумма = ТаблицаПоТоварам.Итог("Сумма");

	СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
		ОбщаяСумма,
		мВалютаРегламентированногоУчета, ВалютаУправленческогоУчета,
		1, СтруктураКурсаВалютыУУ.Курс,
		1, СтруктураКурсаВалютыУУ.Кратность);

	СтрокаВзаиморасчеты = ТаблицаВзаиморасчеты.Добавить();

	СтрокаВзаиморасчеты.ДоговорКонтрагента  = ДоговорКонтрагента;
	СтрокаВзаиморасчеты.Контрагент          = Контрагент;
	СтрокаВзаиморасчеты.Организация         = Организация;
	//СтрокаВзаиморасчеты.Подразделение       = ЗаказПокупателя.Подразделение;
	СтрокаВзаиморасчеты.Сделка              = Сделка;
	СтрокаВзаиморасчеты.СуммаВзаиморасчетов = ОбщаяСумма;
	СтрокаВзаиморасчеты.СуммаУпр            = СуммаУпр;

	СтрокаРасчеты = ТаблицаРасчеты.Добавить();

	СтрокаРасчеты.ДоговорКонтрагента  = ДоговорКонтрагента;
	СтрокаРасчеты.Контрагент  		  = Контрагент;
	СтрокаРасчеты.Организация  	      = Организация;
	СтрокаРасчеты.Сделка              = Сделка;
	СтрокаРасчеты.РасчетыВозврат      = Перечисления.РасчетыВозврат.Расчеты;
	СтрокаРасчеты.СуммаВзаиморасчетов = ОбщаяСумма;
	СтрокаРасчеты.СуммаУпр            = СуммаУпр;

	НаборЗаписейВзаиморасчеты.мПериод            = Дата;
	НаборЗаписейВзаиморасчеты.мТаблицаДвижений   = ТаблицаВзаиморасчеты;

	Если Не Отказ Тогда
		НаборЗаписейВзаиморасчеты.ВыполнитьРасход();
	КонецЕсли;

	НаборЗаписейРасчеты.мПериод            = Дата;
	НаборЗаписейРасчеты.мТаблицаДвижений   = ТаблицаРасчеты;

	Если Не Отказ Тогда
		НаборЗаписейРасчеты.ВыполнитьРасход();
	КонецЕсли;


КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") Тогда

		// Заполним вид операции.
		ВидыОперацийЧек = Перечисления.ВидыОперацийЧекККМ;
		Если Основание.ВидОперации = ВидыОперацийЧек.Продажа Тогда
			ВидОперации = ВидыОперацийЧек.Возврат;
			ЧекККМПродажа = Основание;
		Иначе
			Возврат;
		КонецЕсли;

		// Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

		КассаККМ = Основание.КассаККМ;
		ВладелецДисконтнойКарты = Основание.ВладелецДисконтнойКарты;

		// Скопируем состав.
		Товары.Загрузить(Основание.Товары.Выгрузить());

		СоставНабора.Загрузить(Основание.СоставНабора.Выгрузить());
		СерийныеНомера.Загрузить(Основание.СерийныеНомера.Выгрузить());
		СерийныеНомераСоставНабора.Загрузить(Основание.СерийныеНомераСоставНабора.Выгрузить());
		АкцизныеМарки.Загрузить(Основание.АкцизныеМарки.Выгрузить());
		
		Оплата.Загрузить(Основание.Оплата.Выгрузить());
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
		
		СуммаДокОснование 	= Основание.СуммаДокумента;
		Организация			= Основание.Организация;
		
		ВидыОперацийЧек 	= Перечисления.ВидыОперацийЧекККМ.Продажа;
		ДокументОснование 	= Основание;
		СуммаДокумента		= СуммаДокОснование;
		
		ТипЦен				= Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("de527c98-6381-11ee-bf31-00155d0a1408"));
		НоменклатураВыручка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("cd4a4817-593e-11ee-bf2c-00155d0a1408")); 
		КассаККМ			= Справочники.КассыККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("746737d7-5931-11ee-bf2c-00155d0a1408"));
		Склад				= Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("20c0dc66-c2cd-11eb-bae1-00155d0a3d01"));
		ВидОплатыКартой		= Справочники.ВидыОплатЧекаККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("e828139c-36ce-11ee-bf28-00155d0a1408"));
		
		//Товары
		стрТовары 					= Товары.Добавить();
		стрТовары.Количество 		= 1;
		стрТовары.Коэффициент		= 1;
		стрТовары.Номенклатура 		= НоменклатураВыручка;
		стрТовары.Цена				= СуммаДокОснование;
		стрТовары.Сумма				= СуммаДокОснование;
		стрТовары.ЕдиницаИзмерения 	= НоменклатураВыручка.ЕдиницаХраненияОстатков;
		
		стрОплата 			= Оплата.Добавить();
		стрОплата.ВидОплаты = ВидОплатыКартой;
		стрОплата.Сумма		= СуммаДокумента;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма");
	УчетСерийныхНомеров.УдалитьНеиспользуемыеСтрокиПодчиненнойТЧ(ЭтотОбъект, мПараметрыСвязиСтрокТЧ, "Товары");

	СтатусОтправкиПоПочте = А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(Ссылка);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;

	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета"    , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"    , "ВидСклада"                     , "ВидСклада");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	СтруктураШапкиДокумента.Вставить("КонтролироватьОстаткиТоваровПриОперативномПроведенииЧековККМ", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "КонтролироватьОстаткиТоваровПриОперативномПроведенииЧековККМ"));

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	СтатусЧека = Перечисления.СтатусыЧековККМ.Пробитый;
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Проверим корректность заполнения штрихкодов акцизных марок
	ПроверитьКорректностьЗаполненияАкцизныхМарок(Отказ);

	// Проверим допустимость для пользователя цен документа.
	УправлениеДопПравамиПользователей.ПроверитьДопустимостьЦенОтпуска(ЭтотОбъект, "Товары", Отказ);

	// Получим необходимые данные для проведения и проверки заполнения по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура", "Номенклатура");
	СтруктураПолей.Вставить("Услуга"      , "Номенклатура.Услуга");

	Если ВидОперации <> Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		СтруктураПолей.Вставить("Количество"   , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
		СтруктураПолей.Вставить("Сумма"        , "Сумма");
	Иначе
		СтруктураПолей.Вставить("КоличествоДок", "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
		СтруктураПолей.Вставить("СуммаДок"     , "Сумма");
	КонецЕсли;

	СтруктураПолей.Вставить("Цена"                               , "Цена");
	СтруктураПолей.Вставить("Набор"                              , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                           , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"         , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"                   , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("СерияНоменклатуры"                  , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"               , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ПроцентАвтоматическихСкидок"        , "ПроцентАвтоматическихСкидок");
	СтруктураПолей.Вставить("УсловиеАвтоматическойСкидки"        , "УсловиеАвтоматическойСкидки");
	СтруктураПолей.Вставить("ЗначениеУсловияАвтоматическойСкидки", "ЗначениеУсловияАвтоматическойСкидки");
	СтруктураПолей.Вставить("КлючСтроки"                         , "КлючСтроки");
	СтруктураПолей.Вставить("КоличествоВЕдиницахДокумента"       , "Количество");

	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);

	Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат И ЗначениеЗаполнено(ЧекККМПродажа) И Не ОбменДанными.Загрузка Тогда
		РезультатЗапросаПоТоварамОснования = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЧекККМПродажа, "Товары", СтруктураПолей);
		ТаблицаТоваровДокумента = РезультатЗапросаПоТоварам.Выгрузить();
		ТаблицаТоваровДокумента.Свернуть("Номенклатура, Цена, ХарактеристикаНоменклатуры, СерияНоменклатуры", "КоличествоДок");
		ТаблицаТоваровДокументаОснования = РезультатЗапросаПоТоварамОснования.Выгрузить();
		ТаблицаТоваровДокументаОснования.Свернуть("Номенклатура, Цена, ХарактеристикаНоменклатуры, СерияНоменклатуры", "КоличествоДок");
		ТаблицаТоваровДокументаОснования.Индексы.Добавить("Номенклатура, Цена, ХарактеристикаНоменклатуры, СерияНоменклатуры");

		Для Каждого СтрокаТаблицыТоваровДокумента Из ТаблицаТоваровДокумента Цикл
			СтрокиОснования = ТаблицаТоваровДокументаОснования.НайтиСтроки(
			                  Новый Структура ("Номенклатура, Цена, ХарактеристикаНоменклатуры, СерияНоменклатуры",
			                                   СтрокаТаблицыТоваровДокумента.Номенклатура,
			                                   СтрокаТаблицыТоваровДокумента.Цена,
			                                   СтрокаТаблицыТоваровДокумента.ХарактеристикаНоменклатуры,
			                                   СтрокаТаблицыТоваровДокумента.СерияНоменклатуры));

			Продано = 0;
			Если СтрокиОснования.Количество() > 0 Тогда
				Если СтрокиОснования[0].КоличествоДок >= СтрокаТаблицыТоваровДокумента.КоличествоДок Тогда
					Продолжить;
				Иначе
					Продано = СтрокиОснования[0].КоличествоДок;
				КонецЕсли;
			КонецЕсли;

			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='По документу основанию товара ""';uk='По документу підставі товару ""'") + СтрокаТаблицыТоваровДокумента.Номенклатура
			                    + НСтр("ru='"" по цене ""';uk='"" за ціною ""'") + ОбщегоНазначения.ФорматСумм(СтрокаТаблицыТоваровДокумента.Цена, мВалютаРегламентированногоУчета)+ """ "
			                    + Символы.ПС + ? (ЗначениеЗаполнено(СтрокаТаблицыТоваровДокумента.ХарактеристикаНоменклатуры),
			                         НСтр("ru='с характеристикой ""';uk='з характеристикою ""'") + СтрокаТаблицыТоваровДокумента.ХарактеристикаНоменклатуры + """", "")
			                    + ? (ЗначениеЗаполнено(СтрокаТаблицыТоваровДокумента.СерияНоменклатуры),
			                         НСтр("ru='с серией ""';uk='з серією ""'") + СтрокаТаблицыТоваровДокумента.СерияНоменклатуры + """", "")
			                    + НСтр("ru='продано ""';uk='продано ""'") + Продано +НСтр("ru='"", возвращается от покупателя ""';uk='"", повертається від покупця ""'")
			                    + СтрокаТаблицыТоваровДокумента.КоличествоДок + """.", Отказ, Заголовок);
		КонецЦикла;
	КонецЕсли;

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);

	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Получим необходимые данные для проведения и проверки заполнения по табличной части "Оплата".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ВидОплаты", "ВидОплаты");
	СтруктураПолей.Вставить("Сумма"    , "Сумма");

	ТаблицаПоОплате = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Оплата", СтруктураПолей).Выгрузить();

	// Проверить заполнение ТЧ "Оплата".
	ПроверитьЗаполнениеТабличнойЧастиОплата(ТаблицаПоОплате, Отказ, Заголовок);

	// Проверить заполнение ТЧ "Состав набора".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура");
	СтруктураПолей.Вставить("Количество");
	СтруктураПолей.Вставить("Цена");
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СоставНабора", СтруктураПолей, Отказ, Заголовок);

	Если Не Отказ Тогда

		// Подготовим таблицу скидок для проведения.
		ТаблицаПоСкидкам = ПодготовитьТаблицуСкидок(ТаблицаПоТоварам, СтруктураШапкиДокумента);

		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоСкидкам, Отказ, Заголовок);
	КонецЕсли;
	
	//РРО
	
	Если НЕ ЧекПробитНаККМ 
		И Товары.Количество() > 0
		И Оплата.Количество() > 0 Тогда
		
		//МассПараметров = Новый Массив;
		//МассПараметров.Добавить(Ссылка);
		//ФоновыеЗадания.Выполнить("ОтправкаДокументовПРРО.ПровестиДокументПоПРРО", МассПараметров,Новый УникальныйИдентификатор,"Отправка чека через интерфейс кассира");
		
		стрОтвета = ОтправкаДокументовПРРО.ПровестиДокументПоПРРО(Ссылка);
		
		Если стрОтвета.Успешно Тогда
			ЧекПробитНаККМ = Истина;
			ФискальныйНомерЧека = стрОтвета.ФискальныйНомер;
			URLЧека = стрОтвета.URL;
			Записать();
			Если ЗначениеЗаполнено(Ссылка.ДокументОснование)
				И ТипЗнч(Ссылка.ДокументОснование) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда	
				//Проставим статус в документе оплаты 
				ДокОплата = Ссылка.ДокументОснование.ПолучитьОбъект();
				ДокОплата.СтатусДокумента = Перечисления.СтатусыДокументовОплаты.ЕстьДокументОплаты;
				ДокОплата.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		СформироватьВозвратОтПокупателя();
	Иначе
		Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда 
			Если ЗаказПокупателя.Организация = Справочники.Организации.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ ТОВ") тогда
				СформироватьОплатуОтПокупателяПлатежнойКартой();
			КонецЕсли;
		КонецЕсли;
		//Дандали В. 12.11.2025 +
		Если КассаККМ.Владелец <> Справочники.Организации.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ ТОВ") Тогда 
			СформироватьПоступлениеТоваров();
		КонецЕсли;
		//Дандали В. 12.11.2025 -
		
		СформироватьРеализациюТоваров();
		
	КонецЕсли;
	
	//Дандали В. 30.01.2026 +
	Если ТекущаяДата() > (КонецДня(ТекущаяДата()) + 11)- 60*60 + 30*60 //23:30:11
		И НЕ А_ОбщегоНазначенияСервер.СегодняУжеЕстьЧек() Тогда
		
		Если СтатусОтправкиПоПочте <> Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте Тогда 
			А_ОбщегоНазначенияСервер.ЗаписатьДокументВОчередьНаОтправку(Ссылка);
		ИначеЕсли СтатусОтправкиПоПочте = Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте 
			И А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(Ссылка) = "" Тогда
			А_ОбщегоНазначенияСервер.УстановитьСтатусОтправкиПоПочте(Ссылка, Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте);
		КонецЕсли;
		
	КонецЕсли;
	//Дандали В. 30.01.2026 -
	
	//Дандали В. 15.04.2026 +
	Если ЗначениеЗаполнено(URLЧека) Тогда
		УзелОбмена = Константы.УзелОбменаССайтомСсылкамиНаЧек.Получить();
		Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Ссылка);
	КонецЕсли;
	//Дандали В. 15.04.2026 -
	
КонецПроцедуры // ОбработкаПроведения()

Процедура СформироватьПоступлениеТоваров()
	
		Если ЗначениеЗаполнено(ПоступлениеТоваров) Тогда 
			
			Об = ПоступлениеТоваров.ПолучитьОбъект();
			
		Иначе
			
			Об = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
			Об.Организация 		  = КассаККМ.Владелец;
			Об.Контрагент  		  = Справочники.Контрагенты.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ, ТОВ");
			Об.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("F00242565");
			Об.Дата		   	                  = НачалоДня(ТекущаяДата()) + 60*60*8;
			Об.ВидОперации	                  = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
			Об.Комментарий 	                  = "#Автоматически создан ИМ";
			Об.ВалютаДокумента 	              = Константы.ВалютаРегламентированногоУчета.Получить();
			Об.КратностьВзаиморасчетов        = 1;
			Об.КурсВзаиморасчетов             = 1;
			Об.ВидПоступления 	              = Перечисления.ВидыПоступленияТоваров.НаСклад;
			Об.СкладОрдер                     = ЗаказПокупателя.СкладГруппа;
			Об.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("631");
			Об.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("631");
			Об.ОтражатьВУправленческомУчете   = Ложь;
			Об.ОтражатьВБухгалтерскомУчете    = Истина;
			Об.Ответственный				  = ПараметрыСеанса.ТекущийПользователь;
			об.Подразделение			      = ЗаказПокупателя.Подразделение;
			Об.Проект 						  = ЗаказПокупателя.Проект;
		КонецЕсли;
		
		Для Каждого Строка из Товары Цикл 
			
			Если Строка.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			
				Продолжить;	
			
			КонецЕсли; 
			СтрокаТовара = об.Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТовара,Строка);
			СтрокаТовара.Склад = ЗаказПокупателя.СкладГруппа;
			
			СчетаУчета  = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Справочники.Организации.ПустаяСсылка(),СтрокаТовара.Номенклатура.Ссылка,Справочники.Склады.ПустаяСсылка(), СтрокаТовара.Номенклатура.Ссылка.ВидНоменклатуры);
			СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
			
			СтрокаТовара.СчетУчетаБУ = ?(СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка(),ПланыСчетов.Хозрасчетный.НайтиПоКоду("281"),СчетУчетаБУ);
		КонецЦикла;
		
		ДанныеПоЦенам = ПолучитьЦеныПоПартиям(об.Товары.Выгрузить());
		
		Для Каждого Строка из об.Товары Цикл
			
			Если Строка.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			
				Продолжить;	
			
			КонецЕсли; 
			
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Номенклатура", Строка.Номенклатура);
			СтрПоиска.Вставить("СерияНоменклатуры", Строка.СерияНоменклатуры);
			НайденныеСтроки = ДанныеПоЦенам.НайтиСтроки(СтрПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				НайденнаяЦена = ?(НайденныеСтроки[0].КоличествоКонечныйОстаток=0,1,НайденныеСтроки[0].СтоимостьКонечныйОстаток / НайденныеСтроки[0].КоличествоКонечныйОстаток);
				//Дандали В. 25.08.2025 +
				Если Об.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e818acc3-d3f3-11e5-84b2-005056875f16")) // ФОП ШЕВЧУК Оксана
					И НайденныеСтроки[0].НДСКонечныйОстаток > 0 
					И НайденныеСтроки[0].КоличествоКонечныйОстаток > 0 Тогда
					НайденнаяЦена = НайденнаяЦена + НайденныеСтроки[0].НДСКонечныйОстаток / НайденныеСтроки[0].КоличествоКонечныйОстаток;			
				КонецЕсли;
				//Дандали В. 25.08.2025 -
				
				Строка.Цена = ?(НайденнаяЦена <1 ,1,НайденнаяЦена);
				строка.Сумма = Строка.Цена * Строка.Количество;
			Иначе
				Строка.Цена = 1;
				Строка.Сумма = 1;
				Об.флНетЦеныСебестоимости = Истина;	
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(Об.Организация) 
			ИЛИ НЕ ЗначениеЗаполнено(Об.Контрагент)
			ИЛИ НЕ ЗначениеЗаполнено(Об.ДоговорКонтрагента)
			ИЛИ НЕ ЗначениеЗаполнено(Об.СкладОрдер) Тогда
				Сообщить(НСтр("ru='Не удалось провести поступление товаров и услуг';uk='Не вдалося провести надходження товарів та послуг'"));
			Возврат;	
		КонецЕсли;
		
		об.Записать();
		об.Записать(РежимЗаписиДокумента.Проведение);

		ПоступлениеТоваров = об.Ссылка;
		Записать();

КонецПроцедуры

Процедура СформироватьРеализациюТоваров()
	
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	(ВЫРАЗИТЬ(РеализацияТоваровУслуг.Ссылка.Сделка КАК Документ.ЗаказПокупателя)) = &Заказ
		|	И НЕ РеализацияТоваровУслуг.Ссылка.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		РеализацияТоваров = ВыборкаДетальныеЗаписи.Ссылка;
		Записать();
	КонецЕсли;
	
	


	Если не ЗначениеЗаполнено(РеализацияТоваров)  Тогда 
		
		Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Реализация.Склад     			   = ЗаказПокупателя.СкладГруппа;
		//Реализация.Заполнить(ЗаказПокупателя);
		
		Реализация.Дата 			       = ТекущаяДата() ;
		Реализация.ВалютаДокумента         = Константы.ВалютаРегламентированногоУчета.Получить();
		Реализация.КурсВзаиморасчетов      = 1;
		Реализация.КратностьВзаиморасчетов = 1;
		Реализация.Контрагент			   = ЗаказПокупателя.Контрагент;
		Реализация.ДоговорКонтрагента 	   = ЗаказПокупателя.ДоговорКонтрагента;
		Реализация.Организация 			   = ЗаказПокупателя.Организация;
		Реализация.Склад     			   = ЗаказПокупателя.СкладГруппа;
		Реализация.ВидОперации     		   = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		Реализация.Подразделение		   = ЗаказПокупателя.Подразделение;
		Реализация.ОтражатьВБухгалтерскомУчете = Ложь;	
		Реализация.ОтражатьВУправленческомУчете = Истина;
		Реализация.Сделка = ЗаказПокупателя;
		Реализация.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
		Реализация.Проект 	   = ЗаказПокупателя.Проект;
		//Дандали В. 08.04.2024 +
		//Задача №008870
		Реализация.УчитыватьНДС 	= Истина;
		Реализация.СуммаВключаетНДС = Истина;
		//Дандали В. 25.11.2025 +
		Если ЗаказПокупателя.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9")) Тогда //Вечер
			Реализация.АвторасчетНДС 	= Истина;
		Иначе
			Реализация.АвторасчетНДС 	= Ложь;
		КонецЕсли;
		//Дандали В. 25.11.2025 -
		
		//Дандали В. 08.04.2024 -

		Реализация.Товары.Загрузить(ЗаказПокупателя.Товары.Выгрузить());
		Для Каждого Строка из Реализация.Товары Цикл 
			Если ЗаказПокупателя.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9")) Тогда //Вечер
				Строка.ставкаНДС = Перечисления.СтавкиНДС.НДС20;
			Иначе
				Строка.ставкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
			
			Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
			Строка.СхемаРеализации     = Справочники.СхемыРеализации.Товары;
			СчетаУчета  = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Справочники.Организации.ПустаяСсылка(),Строка.Номенклатура.Ссылка,Справочники.Склады.ПустаяСсылка(), Строка.Номенклатура.Ссылка.ВидНоменклатуры);
			СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
			
			Строка.СчетУчетаБУ = ?(СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка(),ПланыСчетов.Хозрасчетный.НайтиПоКоду("281"),СчетУчетаБУ);
			
			СписатьСРезерва = Ложь;
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Номенклатура", строка.Номенклатура);
			СтрПоиска.Вставить("СерияНоменклатуры", строка.СерияНоменклатуры);
			
			НайденныеСтроки = ЗаказПокупателя.Товары.НайтиСтроки(СтрПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ДанныеЗаказа = НайденныеСтроки[0];
				Если ЗначениеЗаполнено(ДанныеЗаказа.Размещение) Тогда
					Строка.Склад = ДанныеЗаказа.Размещение;
					СписатьСРезерва = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если СписатьСРезерва Тогда
				Строка.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
			Иначе
				Строка.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
			КонецЕсли;
			
		КонецЦикла;
		
		Реализация.Услуги.Загрузить(ЗаказПокупателя.Услуги.Выгрузить());
		
		Для каждого СтрУ Из Реализация.Услуги  Цикл
			
			СтрУ.СхемаРеализации = Справочники.СхемыРеализации.НайтиПоНаименованию("ИМ");
			СтрУ.ЗаказПокупателя = ЗаказПокупателя;
			
		КонецЦикла; 
		
		Если Реализация.Товары.Количество() ИЛИ Реализация.Услуги.Количество() Тогда 
			Реализация.Записать();
			//Дандали В. 12.11.2025 +
			//Если ПолучитьСтатусЗаказа(ЗаказПокупателя)<> "Новий (оплачений)" Тогда 
			Если ЗаказПокупателя.СтатусИМ <> Перечисления.СтатусыЗаказаИМ.НовоеОплачено Тогда
			//Дандали В. 12.11.2025 -
			
				Попытка
				Реализация.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				//Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
			РеализацияТоваров = Реализация.Ссылка;
			Записать();
		КонецЕсли;
		
		//Дандали В. 02.02.2024     
		//Реализация по бух учету 
		//Дандали В. 08.03.2024 + 
		Если ЗаказПокупателя.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e818acc3-d3f3-11e5-84b2-005056875f16")) Тогда //ФОП ШЕВЧУК Оксана
		//Дандали В. 08.02.2024
			РеализацияБух = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			РеализацияБух.Склад     			   		= ЗаказПокупателя.СкладГруппа;
			РеализацияБух.СозданПоЧекуККМ				= Истина;
			РеализацияБух.Дата 			       			= ТекущаяДата() ;
			РеализацияБух.ВалютаДокумента         		= Константы.ВалютаРегламентированногоУчета.Получить();
			РеализацияБух.КурсВзаиморасчетов      		= 1;
			РеализацияБух.КратностьВзаиморасчетов 		= 1;
			РеализацияБух.Контрагент			   		= Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("1882c70e-281f-11e8-80dd-363164353037")); //ШЕВЧУК ОКсана ФОП
			РеализацияБух.ДоговорКонтрагента 	   		= Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("48b27d68-b5db-11ee-bf3c-00155d0a1408"));
			РеализацияБух.Организация 			   		= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9")); //Вечир телеком ТОВ
			РеализацияБух.Склад     			   		= ЗаказПокупателя.СкладГруппа;
			РеализацияБух.ВидОперации     		   		= Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
			РеализацияБух.Подразделение		   			= ЗаказПокупателя.Подразделение;
			РеализацияБух.ОтражатьВБухгалтерскомУчете 	= Истина;	
			РеализацияБух.ОтражатьВУправленческомУчете 	= Ложь;
			РеализацияБух.Сделка 						= ЗаказПокупателя;
			РеализацияБух.ВидПередачи 					= Перечисления.ВидыПередачиТоваров.СоСклада;
			РеализацияБух.Комментарий					= "#Создано автоматический при проведении чека";
			РеализацияБух.Проект 	   					= ?(ЗаказПокупателя.Проект=Справочники.Проекты.ПустаяСсылка(),Справочники.Проекты.НайтиПоКоду("S00000085"),ЗаказПокупателя.Проект);
			РеализацияБух.СчетУчетаРасчетовСКонтрагентом 	= ПланыСчетов.Хозрасчетный.НайтиПоКоду("3612");
			//РеализацияБух.СчетУчетаРасчетовПоАвансам 		= ПланыСчетов.Хозрасчетный.НайтиПоКоду("3612");
			РеализацияБух.СчетУчетаНДС						= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");
			РеализацияБух.СчетУчетаНДСПодтвержденный		= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
			РеализацияБух.УчитыватьНДС						= Истина;
			//Дандали В. 08.04.2024 +
			//Заккоменировал задача №008870
			//РеализацияБух.СуммаВключаетНДС = Истина;
			РеализацияБух.АвторасчетНДС						= Истина;
			//Дандали В. 08.04.2024 -

			РеализацияБух.Товары.Загрузить(ЗаказПокупателя.Товары.Выгрузить());
			Для Каждого Строка из РеализацияБух.Товары Цикл 
				Строка.ставкаНДС		 	= Перечисления.СтавкиНДС.НДС20;
				Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
				Строка.СхемаРеализации     = Справочники.СхемыРеализации.Товары;
				СчетаУчета  = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Справочники.Организации.ПустаяСсылка(),Строка.Номенклатура.Ссылка,Справочники.Склады.ПустаяСсылка(), Строка.Номенклатура.Ссылка.ВидНоменклатуры);
				СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
			
				Строка.СчетУчетаБУ = ?(СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка(),ПланыСчетов.Хозрасчетный.НайтиПоКоду("281"),СчетУчетаБУ);

				СписатьСРезерва = Ложь;
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("Номенклатура", строка.Номенклатура);
				СтрПоиска.Вставить("СерияНоменклатуры", строка.СерияНоменклатуры);
				
				НайденныеСтроки = ЗаказПокупателя.Товары.НайтиСтроки(СтрПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ДанныеЗаказа = НайденныеСтроки[0];
					Если ЗначениеЗаполнено(ДанныеЗаказа.Размещение) Тогда
						Строка.Склад = ДанныеЗаказа.Размещение;
						СписатьСРезерва = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если СписатьСРезерва Тогда
					Строка.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
				Иначе
					Строка.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
				КонецЕсли;
			КонецЦикла;
			
			тзДанные = РеализацияБух.Товары.Выгрузить();
			тзДанные.ЗаполнитьЗначения(РеализацияБух.Склад, "Склад");
			ДанныеПоЦенам = ПолучитьЦеныПоПартиям(тзДанные);
			
			Для Каждого Строка из РеализацияБух.Товары Цикл 
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("Номенклатура", Строка.Номенклатура);
				СтрПоиска.Вставить("СерияНоменклатуры", Строка.СерияНоменклатуры);
				НайденныеСтроки = ДанныеПоЦенам.НайтиСтроки(СтрПоиска);
				Если НайденныеСтроки.Количество() > 0  Тогда
					Если  НайденныеСтроки[0].СтоимостьКонечныйОстаток<>0 Тогда 
						Строка.Цена = ?(НайденныеСтроки[0].КоличествоКонечныйОстаток=0,1,НайденныеСтроки[0].СтоимостьКонечныйОстаток / НайденныеСтроки[0].КоличествоКонечныйОстаток);
						строка.Сумма = Строка.Цена * Строка.Количество;
					Иначе
						Строка.Цена = 1;
						Строка.Сумма = 1;
						РеализацияБух.флНетЦеныСебестоимости = Истина;	
					КонецЕсли;
				Иначе
					Строка.Цена = 1;
					Строка.Сумма = 1;
					РеализацияБух.флНетЦеныСебестоимости = Истина;	
				КонецЕсли;
			КонецЦикла;
						
			Если РеализацияБух.Товары.Количество() Тогда 
				РеализацияБух.Записать(РежимЗаписиДокумента.Запись);
				//Дандали В. 26.08.2025 +
				Если ЗначениеЗаполнено(ПоступлениеТоваров) Тогда
					НомерРеализации 						= РеализацияБух.Номер;
					ПоступлениеОБ 							= ПоступлениеТоваров.ПолучитьОбъект();
					ПоступлениеОБ.НомерВходящегоДокумента 	= СтрЗаменить(Число(Сред(НомерРеализации, 3, СтрДлина(НомерРеализации))), Символы.НПП, "");
					ПоступлениеОБ.ДатаВходящегоДокумента 	= РеализацияБух.Дата;
					ПоступлениеОБ.Записать();
				КонецЕсли;
				//Дандали В. 26.08.2025 -
				
				//Дандали В. 24.09.2025 +
				Если НачалоДня(ТекущаяДата()) > Дата('20251001') 
					И НЕ УжеЕстьНалоговая(РеализацияБух.Ссылка) Тогда
					
					НалоговаяНакладная = Документы.НалоговаяНакладная.СоздатьДокумент();
					НалоговаяНакладная.Дата 				= Дата;
					НалоговаяНакладная.ВидОперации 			= Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
					НалоговаяНакладная.УчитыватьНДС 		= Истина;
					НалоговаяНакладная.СуммаВключаетНДС 	= Ложь;
					НалоговаяНакладная.АвторасчетНДС 		= Истина;
					НалоговаяНакладная.ДокументОснование 	= РеализацияБух.Ссылка;
					НалоговаяНакладная.Контрагент			= РеализацияБух.Контрагент;
					НалоговаяНакладная.ДоговорКонтрагента	= РеализацияБух.ДоговорКонтрагента;
					НалоговаяНакладная.Организация			= РеализацияБух.Организация;
					НалоговаяНакладная.Сделка				= РеализацияБух.Ссылка;
					НалоговаяНакладная.ВалютаДокумента		= РеализацияБух.ВалютаДокумента;
					НалоговаяНакладная.ФормаРасчетов		= "Оплата з поточного рахунка";
					НалоговаяНакладная.УсловиеПродажи		= "замовлення № " + ЗаказПокупателя.OrderID+" вiд " + ЗаказПокупателя.Дата;
					НалоговаяНакладная.КурсВзаиморасчетов	= РеализацияБух.КурсВзаиморасчетов;
					НалоговаяНакладная.КратностьВзаиморасчетов = РеализацияБух.КратностьВзаиморасчетов;
					НалоговаяНакладная.СчетНДС				= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6412");
					НалоговаяНакладная.СчетУчетаНДС			= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");
					НалоговаяНакладная.ТипПричиныНевыдачиПокупателю = 2;
					
					НалоговаяНакладная.Товары.Загрузить(РеализацияБух.Товары.Выгрузить());
					
					сч = 1;
					Для Каждого Товар из НалоговаяНакладная.Товары Цикл
						Товар.НомерСтрокиНН = сч;
						Товар.КодУКТВЭД		= Товар.Номенклатура.НоменклатураГТД;
						Товар.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Товар, НалоговаяНакладная);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Товар, НалоговаяНакладная);
						Товар.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
						сч = сч + 1;
					КонецЦикла;
					
					Попытка
						НалоговаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЗаписьЖурналаРегистрации("Проведение налоговой по реализации ", УровеньЖурналаРегистрации.Ошибка,,,"Реализация № " + РеализацияБух.Номер + " " + ОписаниеОшибки()); 
						НалоговаяНакладная.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
					
				КонецЕсли;
				//Дандали В. 24.09.2025 -
				
			КонецЕсли;
			
		КонецЕсли;
		//Дандали В. 02.02.2024
		
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьВозвратОтПокупателя()
	
	ВозвратОтПокупателя 						= Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
	ВозвратОтПокупателя.Заполнить(ЧекККМПродажа.РеализацияТоваров);

	ВозвратОтПокупателя.Дата 			       	= ТекущаяДата() ;
	ВозвратОтПокупателя.ВалютаДокумента         = Константы.ВалютаРегламентированногоУчета.Получить();
	ВозвратОтПокупателя.КурсВзаиморасчетов      = 1;
	ВозвратОтПокупателя.КратностьВзаиморасчетов = 1;
	ВозвратОтПокупателя.Подразделение		   	= ЧекККМПродажа.ЗаказПокупателя.Подразделение;
	ВозвратОтПокупателя.ОтражатьВБухгалтерскомУчете = Ложь;	
	ВозвратОтПокупателя.ОтражатьВУправленческомУчете = Истина;

	Для Каждого Строка из ВозвратОтПокупателя.Товары Цикл 
		
		Строка.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		Строка.СхемаРеализации     = Справочники.СхемыРеализации.Товары;
		СчетаУчета  = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Справочники.Организации.ПустаяСсылка(),Строка.Номенклатура.Ссылка,Справочники.Склады.ПустаяСсылка(), Строка.Номенклатура.Ссылка.ВидНоменклатуры);
			СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
			
			Строка.СчетУчетаБУ = ?(СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка(),ПланыСчетов.Хозрасчетный.НайтиПоКоду("281"),СчетУчетаБУ);
	
		
	КонецЦикла;
	
	//Дандали В. 26.11.2024 + //Частичный возврат
	НужноПересчитатьСуммуОплаты = Ложь;
	Если ВозвратОтПокупателя.Товары.Количество() <> 0 
		И ВозвратОтПокупателя.Товары.Количество() > Товары.Количество() Тогда
		
		МассНаУдаление = Новый Массив;
		//заполнение идет по реализации. уберем товары, которых нет в чеке на возврат
		Для Каждого стрТовар из ВозвратОтПокупателя.Товары Цикл 
			стрПоиска = Новый Структура;
			стрПоиска.Вставить("Номенклатура", стрТовар.Номенклатура);
			стрПоиска.Вставить("СерияНоменклатуры", стрТовар.СерияНоменклатуры);
			НайденныеТоварыВЧекеНаВозврат = Товары.НайтиСтроки(стрПоиска);
			Если НайденныеТоварыВЧекеНаВозврат.Количество() = 0 Тогда
				МассНаУдаление.Добавить(стрТовар);
				НужноПересчитатьСуммуОплаты = Истина;  
				Продолжить;
			КонецЕсли;
			
			//Кейс когда продали например 3 ед. товаров, а вернули меньше (например 1) 
			Если НайденныеТоварыВЧекеНаВозврат[0].Количество <> стрТовар.Количество Тогда
				стрТовар.Количество = НайденныеТоварыВЧекеНаВозврат[0].Количество;	
				стрТовар.Сумма		= стрТовар.Цена * стрТовар.Количество;
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(стрТовар, ВозвратОтПокупателя);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого стрУдаление из МассНаУдаление Цикл
			ВозвратОтПокупателя.Товары.Удалить(стрУдаление);	
		КонецЦикла;
	КонецЕсли;
	
	Если НужноПересчитатьСуммуОплаты И Оплата.Количество() = 1 Тогда
		Если Оплата.Итог("Сумма") <> Товары.Итог("Сумма") Тогда
			Оплата[0].Сумма = Товары.Итог("Сумма");	
		КонецЕсли;
	КонецЕсли;	
	//Дандали В. 26.11.2024 -
	
	Если ВозвратОтПокупателя.Товары.Количество() Тогда 
		ВозвратОтПокупателя.Записать();
		ВозвратОтПокупателя.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОплатуОтПокупателяПлатежнойКартой()
	
	Запрос = новый запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ОплатаОтПокупателяПлатежнойКартой.Ссылка
			               |ИЗ
			               |	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
			               |ГДЕ
			               |	ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &ДокументОснование
			               |	И НЕ ОплатаОтПокупателяПлатежнойКартой.ПометкаУдаления";
			Запрос.УстановитьПараметр("ДокументОснование",ЗаказПокупателя.ссылка);
			
			РезультатЗапроса = запрос.Выполнить().Выгрузить();
			
			Если не РезультатЗапроса.Количество() Тогда
				
				
				ДокОб 								= Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
				ДокОб.Дата 							= Дата;
				ДокОб.Ответственный 				= Ответственный;
				ДокОб.ДокументОснование				= ЗаказПокупателя.Ссылка;
				ДокОб.ОтражатьВБухгалтерскомУчете 	= Истина;
				ДокОб.Комментарий                   = "#Создано автоматический при оплате на кассе";
				ДокОб.ВидОперации 					= Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя;
				ДокОб.ВалютаДокумента 				= Константы.ВалютаРегламентированногоУчета.Получить();
				ДокОб.ВидОплаты						= Справочники.ВидыОплатЧекаККМ.НайтиПоНаименованию("Платежная карта");
				ДокОб.Контрагент                    = ЗаказПокупателя.Контрагент;
				////Дандали В. 25.06.2025 +
				//Если ЭтотОбъект.Комментарий = "#Створено з обробки робоче місце ІМ" Тогда
				//	ДокОб.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоКоду("000000006"); //Нова пей
				//Иначе
				//	ДокОб.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоКоду("000000005"); //Приват
				//КонецЕсли;
				////Дандали В. 25.06.2025 -
				
				//Дандали В. 10.03.2026 +
				Попытка
					Менеджер 			    = РегистрыСведений.СпособыДоставкиОрганизации.СоздатьМенеджерЗаписи();
					Менеджер.СпособДоставки = ЗаказПокупателя.СпособОплаты;
					Менеджер.Прочитать();
				Исключение
					Менеджер = Неопределено;
				КонецПопытки;
				
				Если Менеджер <> Неопределено
					И ЗначениеЗаполнено(Менеджер.Организация)
					И ЗначениеЗаполнено(Менеджер.ДоговорЭквайринга) Тогда				
					ДокОб.ДоговорЭквайринга = Менеджер.ДоговорЭквайринга;
				Иначе
					Если ЭтотОбъект.Комментарий = "#Створено з обробки робоче місце ІМ" Тогда
						ДокОб.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоКоду("000000006"); //Нова пей
					Иначе
						ДокОб.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоКоду("000000005"); //Приват
					КонецЕсли;
				КонецЕсли;
				//Дандали В. 10.03.2026 -
				
				//Дандали В. 26.03.2026 +
				Если ЗаказПокупателя.СпособДоставки = "Доставка у відділення «Нова Пошта»" 
					И Найти("Оплата при отриманні", ЗаказПокупателя.СпособОплаты) <> Неопределено Тогда
					ДокОб.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоКоду("000000006"); //Нова пей
				КонецЕсли;
				//Дандали В. 26.03.2026 -
				
				
				ДокОб.ДоговорВзаиморасчетовЭквайрера= ДокОб.ДоговорЭквайринга.ДоговорВзаиморасчетов;            
				ДокОб.КратностьДокумента            = 1;
				ДокОб.КурсДокумента                 = 1;
				ДокОб.Организация                   = Справочники.Организации.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ ТОВ");
				ДокОб.ОтражатьВБухгалтерскомУчете   = Истина;
				ДокОб.ОтражатьВУправленческомУчете  = Истина;
				ДокОб.Подразделение                 = ЗаказПокупателя.Подразделение;
				ДокОб.СтатусДокумента               = Перечисления.СтатусыДокументовОплаты.НеОбработан;
				ДокОб.СуммаДокумента                = ЗаказПокупателя.СуммаДокумента;
				ДокОб.СчетУчетаРасчетовСЭквайрером  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("333");
				ДокОб.Эквайрер                      = ДокОб.ДоговорЭквайринга.Эквайрер;            
				
				СтрокаРасшифровки = ДокОб.РасшифровкаПлатежа.Добавить();
				СтрокаРасшифровки.ДоговорКонтрагента             = ЗаказПокупателя.ДоговорКонтрагента;//ПолучитьДоговорКонтрагента(ЗаказПокупателя.Контрагент,Справочники.Организации.НайтиПоНаименованию("ВЕЧІР ТЕЛЕКОМ ТОВ"),ЗаказПокупателя.ДоговорКонтрагента.ВидДоговора);
				СтрокаРасшифровки.КратностьВзаиморасчетов        = 1;
				СтрокаРасшифровки.КурсВзаиморасчетов             = 1;
				СтрокаРасшифровки.НалоговоеНазначение            = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
				СтрокаРасшифровки.Проект                         = ЗаказПокупателя.Проект;
				СтрокаРасшифровки.Сделка					     = ЗаказПокупателя.Ссылка;	
				СтрокаРасшифровки.СтавкаНДС					     = Перечисления.СтавкиНДС.НДС20;
				СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств  = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Обладнання виручка");
				СтрокаРасшифровки.СуммаВзаиморасчетов            = ЗаказПокупателя.СуммаДокумента;
				СтрокаРасшифровки.СуммаНДС                       = ЗаказПокупателя.СуммаДокумента/6;
				СтрокаРасшифровки.СуммаПлатежа                   = ЗаказПокупателя.СуммаДокумента;
				СтрокаРасшифровки.СчетУчетаНДС                   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");
				СтрокаРасшифровки.СчетУчетаНДСПодтвержденный     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
				СтрокаРасшифровки.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3612");
				СтрокаРасшифровки.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3612"); 
				
				//Дандали В. 21.02.2024 +
				Ошибка = Ложь;
				Попытка
					ДокОб.Записать();
					ДокОб.Записать(РежимЗаписиДокумента.Проведение);					
				Исключение
					ЗаписьЖурналаРегистрации("Проведение оплаты ", УровеньЖурналаРегистрации.Ошибка,,,"ЗаказПокупателя № " + ЗаказПокупателя.Номер + " " + ОписаниеОшибки()); 
					СтрДанные = Новый Структура;
					СтрДанные.Вставить("ОбъектЛогирования", ?(ЗначениеЗаполнено(ДокОб.Ссылка), ДокОб.Ссылка, "Документ оплата от покупателя по платежной карте"));
					СтрДанные.Вставить("Лог", ОписаниеОшибки());
					СтрДанные.Вставить("ДатаЛогирования", ТекущаяДата());
					А_ОбщегоНазначенияСервер.ДобавитьЗаписьЛогирования(СтрДанные);
					Ошибка = Истина;
				КонецПопытки;
				//Дандали В. 21.02.2024 +
				
				//Дандали В. 23.09.2025 +
				//Начиная с 01.10
				Если НЕ Ошибка 
					И НачалоДня(ТекущаяДата()) > Дата('20251001')
					И НЕ УжеЕстьНалоговая(ЗаказПокупателя.Ссылка) Тогда
					
					НалоговаяНакладная = Документы.НалоговаяНакладная.СоздатьДокумент();
					НалоговаяНакладная.Дата 				= Дата;
					НалоговаяНакладная.ВидОперации 			= Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
					НалоговаяНакладная.УчитыватьНДС 		= Истина;
					НалоговаяНакладная.СуммаВключаетНДС 	= Истина;
					НалоговаяНакладная.ДокументОснование 	= ЗаказПокупателя.Ссылка;
					НалоговаяНакладная.Контрагент			= ЗаказПокупателя.Контрагент;
					НалоговаяНакладная.ДоговорКонтрагента	= ЗаказПокупателя.ДоговорКонтрагента;
					НалоговаяНакладная.Организация			= ЗаказПокупателя.Организация;
					НалоговаяНакладная.Сделка				= ЗаказПокупателя;
					НалоговаяНакладная.ВалютаДокумента		= ЗаказПокупателя.ВалютаДокумента;
					НалоговаяНакладная.ФормаРасчетов		= "Оплата з поточного рахунка";
					НалоговаяНакладная.УсловиеПродажи		= "замовлення № " + ЗаказПокупателя.OrderID+" вiд " + ЗаказПокупателя.Дата;
					НалоговаяНакладная.КурсВзаиморасчетов	= ЗаказПокупателя.КурсВзаиморасчетов;
					НалоговаяНакладная.КратностьВзаиморасчетов = ЗаказПокупателя.КратностьВзаиморасчетов;
					НалоговаяНакладная.СчетНДС				= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6412");
					НалоговаяНакладная.СчетУчетаНДС			= ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");
					НалоговаяНакладная.ТипПричиныНевыдачиПокупателю = 2;
					
					НалоговаяНакладная.Товары.Загрузить(ЗаказПокупателя.Товары.Выгрузить());
					
					сч = 1;
					Для Каждого Товар из НалоговаяНакладная.Товары Цикл
						Товар.НомерСтрокиНН = сч;
						Товар.КодУКТВЭД		= Товар.Номенклатура.НоменклатураГТД;
						Товар.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Товар, НалоговаяНакладная);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Товар, НалоговаяНакладная);
						Товар.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
						сч = сч + 1;
					КонецЦикла;
					
					Попытка
						НалоговаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЗаписьЖурналаРегистрации("Проведение налоговой по оплате ", УровеньЖурналаРегистрации.Ошибка,,,"ЗаказПокупателя № " + ЗаказПокупателя.Номер + " " + ОписаниеОшибки()); 
						НалоговаяНакладная.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
					
				КонецЕсли;
				//Дандали В. 23.09.2025 -
				
		КонецЕсли;
	
КонецПроцедуры

Функция	ПолучитьДоговорКонтрагента(Контрагент,Организация,ВидДоговора) Экспорт 
	
	ВозвращаемоеЗначение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Контрагент
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ВозвращаемоеЗначение = РезультатЗапроса[0].Ссылка;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция ПолучитьЦеныПоПартиям(Данные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеИзПТУ.Номенклатура,
		|	ДанныеИзПТУ.СерияНоменклатуры,
		|	ДанныеИзПТУ.ХарактеристикаНоменклатуры,
		|	ДанныеИзПТУ.Склад
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ТЗДанные КАК ДанныеИзПТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПартииТоваровНаСкладахОстаткиИОбороты.НДСКонечныйОстаток) КАК НДСКонечныйОстаток,
		|	СУММА(ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток) КАК СтоимостьКонечныйОстаток,
		|	СУММА(ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
		|	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура,
		|	ПартииТоваровНаСкладахОстаткиИОбороты.СерияНоменклатуры
		|ИЗ
		|	РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
		|			,
		|			&ДатаДок,
		|			,
		|			,
		|			(Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, Склад) В
		|				(ВЫБРАТЬ
		|					ВТ_Данные.Номенклатура,
		|					ВТ_Данные.СерияНоменклатуры,
		|					ВТ_Данные.ХарактеристикаНоменклатуры,
		|					ВТ_Данные.Склад
		|				ИЗ
		|					ВТ_Данные КАК ВТ_Данные)) КАК ПартииТоваровНаСкладахОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровНаСкладахОстаткиИОбороты.СерияНоменклатуры,
		|	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	Запрос.УстановитьПараметр("ТзДанные", Данные);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)

	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения

// Функция выполняет пересчет автоматических скидок в документе.
//
// Возвращаемое значение:
//  Булево - Истина, если автоматические скидки были рассчитаны.
//
Функция ПересчитатьАвтоматическиеСкидки() Экспорт

	Если РассчитыватьАвтоматическиеСкидки() Тогда
		Если Оплата.Количество() = 1 Тогда
			ВидОплатыДляСкидок = Оплата[0].ВидОплаты;
		Иначе
			ВидОплатыДляСкидок = Справочники.ВидыОплатЧекаККМ.ПустаяСсылка();
		КонецЕсли;

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВидРеализации"                 , Перечисления.ВидыСкидок.Розничная);
		СтруктураПараметров.Вставить("СуммаДокумента"                , Ценообразование.ПолучитьСуммуДокументаБезСкидки(Товары));
		СтруктураПараметров.Вставить("Карта"                         , ДисконтнаяКарта);
		СтруктураПараметров.Вставить("ВидОплаты"                     , ВидОплатыДляСкидок);
		СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета", мВалютаРегламентированногоУчета);
		СтруктураПараметров.Вставить("УчетнаяПолитика"               , ПолучитьЗначениеУчетнойПолитики());

		ОбработкаТабличныхЧастей.РассчитатьСкидкиПриПродаже(ЭтотОбъект, Товары, СтруктураПараметров, мМинимальныеЦены, мСписокФильтров);
		
		ОкруглитьСуммуЧека();
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ПересчитатьАвтоматическиеСкидки()

//Проверяет необходимость Расчета автоматических скидок.
//
Функция РассчитыватьАвтоматическиеСкидки() Экспорт

	Если Не МожноРассчитыватьАвтоматическиеСкидки()
	 Или Проведен
	 Или ЧекПробитНаККМ
	 Или ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // РассчитыватьАвтоматическиеСкидки()

// Функция проверяет возможность расчета автоматических скидок в документе.
//
// Возвращаемое значение:
//  Булево.
//
Функция МожноРассчитыватьАвтоматическиеСкидки() Экспорт

	Если мРассчитыватьАвтоматическиеСкидки = Неопределено Тогда
		Если ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоКоличествуТовара

		 Или ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоСуммеДокумента
		 Или ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоВидуОплаты
		 Или ПолучитьЗначениеУчетнойПолитики().ИспользоватьСкидкиПоДисконтнойКарте Тогда
			мРассчитыватьАвтоматическиеСкидки = Истина;
		Иначе
			мРассчитыватьАвтоматическиеСкидки = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат мРассчитыватьАвтоматическиеСкидки;

КонецФункции // МожноРассчитыватьАвтоматическиеСкидки()

// Функция возвращает структуру со значениями учетной политики.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьЗначениеУчетнойПолитики() Экспорт

	Если мУчетнаяПолитика = Неопределено Тогда
		мУчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(?(ЭтоНовый(), ТекущаяДата(), Дата), Ложь);
	КонецЕсли;

	Возврат мУчетнаяПолитика;

КонецФункции // ПолучитьЗначениеУчетнойПолитики()

Процедура УдалитьАкцизныеМарки(СтрокаТабличнойЧасти) Экспорт
	
	Отбор = Новый Структура("ИдентификаторСтроки", СтрокаТабличнойЧасти.ИдентификаторСтроки);
	НайденныеСтроки = АкцизныеМарки.НайтиСтроки(Отбор);
		
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		АкцизныеМарки.Удалить(АкцизныеМарки.Индекс(СтрокаТЧ));
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьЗаполненияАкцизныхМарок(Отказ) Экспорт
	
	ТаблицаТоваров = Товары.Выгрузить();
	ТЧАкцизныеМарки = АкцизныеМарки.Выгрузить();
	ТЧАкцизныеМарки.Индексы.Добавить("ИдентификаторСтроки");
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		МассивШтрихкодыАкцизныхМарок = Новый Массив;
		НайденныеСтроки = ТЧАкцизныеМарки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл       
			МассивШтрихкодыАкцизныхМарок.Добавить(НайденнаяСтрока.ШтрихкодАкцизнойМарки);
		КонецЦикла;
		
		Если СтрокаТЧ.Номенклатура.УказыватьШтрихкодАкцизнойМаркиПриПечатиЧека 
				И НЕ КоличествоАкцизныхМарокСоответствуетКоличествуТовара(МассивШтрихкодыАкцизныхМарок.Количество(), СтрокаТЧ.Количество) Тогда
				
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не корректно заполнены акцизные марки для товара ""';uk='Не коректно заповнені акцизні марки для товару ""'") + СтрокаТЧ.Номенклатура
			                    + НСтр("ru='"" в строке ""';uk='"" в рядку ""'") + СтрокаТЧ.НомерСтроки +"""", Отказ);
								
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры


Функция КоличествоАкцизныхМарокСоответствуетКоличествуТовара(Знач КоличествоАкцизныхМарок, Знач КоличествоТовара) Экспорт
	
	МинимальноеКоличествоАМ = 0;
	МаксимальноеКоличествоАМ = 0;
	
	ЦелоеКоличествоТовара = Цел(КоличествоТовара);
	ДробноеКоличествоТовара = КоличествоТовара - ЦелоеКоличествоТовара;
	
	Если ЗначениеЗаполнено(ЦелоеКоличествоТовара) Тогда
		МинимальноеКоличествоАМ = ЦелоеКоличествоТовара;
		МаксимальноеКоличествоАМ = ЦелоеКоличествоТовара;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДробноеКоличествоТовара) Тогда
		МаксимальноеКоличествоАМ = МаксимальноеКоличествоАМ + 1;
	КонецЕсли;
	
	Возврат КоличествоАкцизныхМарок >= МинимальноеКоличествоАМ И КоличествоАкцизныхМарок <= МаксимальноеКоличествоАМ;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	ЧекПробитНаККМ = Ложь;
	НомерСменыККМ = 0;
	НомерЧекаККМ = "";
	АкцизныеМарки.Очистить();
	
	Если Товары.Количество() > 0 Тогда
		Товары.ЗагрузитьКолонку(Новый Массив(Товары.Количество()), "ИдентификаторСтроки");
	КонецЕсли;

КонецПроцедуры

//+ЛежаченкоДР
Функция ПолучитьОсновнуюКассуККМПользователя()
	НайденнаяКасса = Справочники.КассыККМ.ПустаяСсылка();
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка  = &Настройка
	|");
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяКассаККМ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяКасса = Выборка.Значение;
	КонецЕсли;
	Возврат НайденнаяКасса;
КонецФункции
//-ЛежаченкоДР

Функция ПолучитьСтатусЗаказа(ЗаказПокупателя)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Объект = &Объект
	               |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект",ЗаказПокупателя);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000221"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Значение;		
	КонецЕсли;
	
	
КонецФункции

Функция УжеЕстьНалоговая(ДокОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Поле1
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НЕ НалоговаяНакладная.ПометкаУдаления
		|	И НалоговаяНакладная.Проведен
		|	И НалоговаяНакладная.ДокументОснование = &Платежка";
	
	Запрос.УстановитьПараметр("Платежка", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мАннулировать                   = Ложь;
мПараметрыСвязиСтрокТЧ          = Новый Соответствие;

мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));
мПараметрыСвязиСтрокТЧ.Вставить("СоставНабора", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мСписокФильтров = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
   ПланыВидовХарактеристик.ПраваПользователей.НеОтпускатьТоварСЦенойНижеОпределенногоТипа,
   Неопределено);

УказаниеСкладов     = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");
мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
                      Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);

мНДС = Новый Соответствие();
мНДС.Вставить(200, 1);
мНДС.Вставить(000, 2);
мНДС.Вставить(20 , 1);
мНДС.Вставить(7 , 3);
мНДС.Вставить(70 , 3);
мНДС.Вставить(700 , 3);
