////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, существуют ли движения в регистрах по данному
// элементу справочника. Если существуют и изменялись определенные реквизиты,
// то запрещает запись.
Процедура ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)

	Если ЭтоНовый() или ОбменДанными.Загрузка Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	// Получение старых значений
	НалоговоеНазначениеСтарый  = Ссылка.НалоговоеНазначение;
	// Проверка изменений, если старое значение было заполнено
	ИзмененНалоговоеНазначение = (НалоговоеНазначение <> НалоговоеНазначениеСтарый) И ЗначениеЗаполнено(НалоговоеНазначениеСтарый);
	
	Если ИзмененНалоговоеНазначение Тогда
		
		Если ПолныеПрава.ОбъектыСтроительства_БылиДвиженияПоРегистрам(Ссылка) Тогда
			
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='	Нельзя изменять ""Налоговое назначение"",потому что были движения по регистру бухгалтерии ""Хозрасчетный""."
"	Текущее значение <%1> изменяется на старое <%2>.';uk='	Не можна змінювати ""Податкове призначення"",тому що були рухи по регістру бухгалтерії ""Госпрозрахунковий""."
"	Поточне значення <%1> змінюється на старе <%2>.'"), НалоговоеНазначение, НалоговоеНазначениеСтарый);
			ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
			НалоговоеНазначение = НалоговоеНазначениеСтарый
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьВозможностьЗаписиЭлемента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Запись элемента справочника ""%1"" Наим: <%2> код: <%3>:';uk='Запис елемента довідника ""%1"" Найм: <%2> код: <%3>:'"), Метаданные().Представление(), Наименование, Код);
				
	ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок);
	
	//Дандали В. 31.07.2024 +
	РазрешеноРедактироватьСоздавать = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(
	ПланыВидовХарактеристик.ПраваПользователей.НайтиПоНаименованию("Разрешить редактировать Объекты строительства"), Ложь)[0].Значение;
	
	Если НЕ РазрешеноРедактироватьСоздавать Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Користувачу заборонено створювати/редагувати цей довідник",Отказ);
	КонецЕсли;
	//Дандали В. 31.07.2024 -
	
КонецПроцедуры
