// +++ А_ИТ4Б Ересько 2016-05-30 {Добавлен общий модуль} 

#Если КЛИЕНТ Тогда 
 
///////////////////////////////////////////////////////////////
// РАБОТА С ФОРМАМИ
// ОТКРЫТИЕ ФОРМЫ ДОКУМЕНТА/СПРАВОЧНИКА

// Процедура срабатывает при открытии форм документов и справочников. Позволяет выполнить 
//определенные действия не ломая текст стандартных модулей форм.
//
Процедура ПриОткрытииФормыДокументаСправочника(МетаданныеОбъекта, ФормаОбъекта) Экспорт  
	
	Если МетаданныеОбъекта.Имя = "Организации" Тогда		
		ПриОткрытии_Организации(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "Пользователи" Тогда		
		ПриОткрытии_Пользователи(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "ПеремещениеТоваров" Тогда
		ПриОткрытии_ПеремещениеТоваров(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "СписаниеТоваров" Тогда
		ПриОткрытии_СписаниеТоваров(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "ОприходованиеТоваров" Тогда
		ПриОткрытии_ОприходованиеТоваров(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "НачислениеЗарплатыРаботникамОрганизаций" Тогда
		ПриОткрытии_НачислениеЗарплатыРаботникамОрганизаций(МетаданныеОбъекта, ФормаОбъекта)	
	ИначеЕсли МетаданныеОбъекта.Имя = "ЗарплатаКВыплатеОрганизаций" Тогда
		ПриОткрытии_ЗарплатаКВыплатеОрганизаций(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "ПоступлениеТоваровУслуг" Тогда
		ПриОткрытии_ПоступлениеТоваровУслуг(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "РеализацияТоваровУслуг" Тогда
		ПриОткрытии_РеализацияТоваровУслуг(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "НалоговаяНакладная" Тогда
		ПриОткрытии_НалоговаяНакладная(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "Приложение2КНалоговойНакладной" Тогда
		ПриОткрытии_Приложение2КНалоговойНакладной(МетаданныеОбъекта, ФормаОбъекта)
	ИначеЕсли МетаданныеОбъекта.Имя = "ПоступлениеДопРасходов" Тогда
		ПриОткрытии_ПоступлениеДопРасходов(МетаданныеОбъекта, ФормаОбъекта)
	КонецЕсли;
	
	ДобавитьКнопкуБлокировкиДокументаУУ(МетаданныеОбъекта, ФормаОбъекта);
	// А_Вячеслав(29.08.2017 
	ДобавитьКнопкуБлокировкиДокументаБУ(МетаданныеОбъекта, ФормаОбъекта);
	// А_Вячеслав) 
	
КонецПроцедуры

Процедура ПриОткрытии_Организации(МетаданныеОбъекта, ФормаОбъекта) 

	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление флага УУ
	Если Истина Тогда 
		
		// Добавление флага "УУ"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 35); 
		СтруктураСвойств.Вставить("Верх", 56);
		СтруктураСвойств.Вставить("Лево", 327);
		СтруктураСвойств.Вставить("Заголовок", "УУ");
		СтруктураСвойств.Вставить("Данные", "А_УправленческийУчет");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Префикс);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Префикс);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Нижняя граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Префикс);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		Элемент_А_УправленческийУчет = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Флажок"), "А_УправленческийУчет", , , СтруктураСвойств, СтруктураПривязок);
		
	КонецЕсли;
	
	//Добавление флага БУ
	Если Истина Тогда 
		
		// Добавление флага "БУ"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 35); 
		СтруктураСвойств.Вставить("Верх", 56);
		СтруктураСвойств.Вставить("Лево", 367);
		СтруктураСвойств.Вставить("Заголовок", "БУ");
		СтруктураСвойств.Вставить("Данные", "А_БухгалтерскийУчет");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Префикс);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Префикс);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Нижняя граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Префикс);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		Элемент_А_БухгалтерскийУчет = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Флажок"), "А_БухгалтерскийУчет", , , СтруктураСвойств, СтруктураПривязок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии_Пользователи(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	Если РольДоступна("ПолныеПрава") Тогда 
	
		//Довавим страницу "Доступные организации"
		СтраницаДоступныеОрганизации = ЭлементыФормы.ПанельПользователей.Страницы.Добавить("А_ДоступныеОрганизации", "Доступные организации");
			
		ТекущаяСтраницаПанели = ЭлементыФормы.ПанельПользователей.ТекущаяСтраница;
		ЭлементыФормы.ПанельПользователей.ТекущаяСтраница = СтраницаДоступныеОрганизации;
		
		//Добавление ТЧ "Доступные организации" и панели к ней
		Если Истина Тогда
			
			// Добавление ТЧ "Доступные организации"
			СтруктураСвойств = Новый Структура();
			СтруктураСвойств.Вставить("Высота", 281); 
			СтруктураСвойств.Вставить("Ширина", 552);
			СтруктураСвойств.Вставить("Верх", 24);
			СтруктураСвойств.Вставить("Лево", 6);
			СтруктураСвойств.Вставить("Данные", "А_ДоступныеОрганизации");
			СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
			СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
			
			СтруктураПривязок 			= Новый Структура();
			ТекущиеЗначенияПривязки 	= Новый Структура();
			
			ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ПанельПользователей);	
			ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
			
			СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
			ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
			СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
			
			ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ПанельПользователей);	
			ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Низ);
			
			СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
			ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
			СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
			
			ЭлементСписокДоступныхОрганизаций = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ТабличноеПоле"), "А_ДоступныеОрганизации", , ЭлементыФормы.ПанельПользователей, СтруктураСвойств, СтруктураПривязок);
			ЭлементСписокДоступныхОрганизаций.СоздатьКолонки();
		
			// Добавление комендную панель ТЧ "Доступные организации"
			СтруктураСвойств = Новый Структура();
			СтруктураСвойств.Вставить("Высота", 15); 
			СтруктураСвойств.Вставить("Ширина", 552);
			СтруктураСвойств.Вставить("Верх", 0);
			СтруктураСвойств.Вставить("Лево", 6);
			СтруктураСвойств.Вставить("ИсточникДействий", ЭлементСписокДоступныхОрганизаций);
			СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
			СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
			СтруктураСвойств.Вставить("Автозаполнение", Истина);
			
			СтруктураПривязок 			= Новый Структура();
			ТекущиеЗначенияПривязки 	= Новый Структура();
			
			ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ПанельПользователей);	
			ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
			
			СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
			ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
			СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
			
			ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ПанельПользователей);	
			ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
			
			СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
			ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
			СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
			
			ЭлементКонтактнаяПанельСписокДоступныхОрганизаций = ДобавитьЭлементФормы(ЭлементыФормы, Тип("КоманднаяПанель"), "А_КоманднаяПанельСписокДоступныхОрганизаций", , ЭлементыФормы.ПанельПользователей, СтруктураСвойств);//, СтруктураПривязок);
			
		КонецЕсли;
		
		ЭлементыФормы.ПанельПользователей.ТекущаяСтраница = ТекущаяСтраницаПанели;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКнопкуБлокировкиДокументаУУ(МетаданныеОбъекта, ФормаОбъекта)
	
	//Для справочников кнопку не добавляем
	Если ОбщегоНазначения.ПринадлежностьКлассуМетаданных("Справочники", МетаданныеОбъекта)
		Или ОбщегоНазначения.ПринадлежностьКлассуМетаданных("ПланыВидовХарактеристик", МетаданныеОбъекта) Тогда 
		Возврат
	КонецЕсли;
	
	ОбъектМетаданныхХозрасчетный = Метаданные.РегистрыБухгалтерии.Хозрасчетный;
	
	ЕстьПризнакОтражатьВУправленческомУчете = МетаданныеОбъекта.Реквизиты.Найти("ОтражатьВУправленческомУчете") <> Неопределено;
	ЕстьПризнакОтражатьВУпрУчете = МетаданныеОбъекта.Реквизиты.Найти("ОтражатьВУпрУчете") <> Неопределено;
	
	МассивДругихДокументов = Новый Массив;
	МассивДругихДокументов.Добавить(Метаданные.Документы.ПриемНаРаботуВОрганизацию);
	МассивДругихДокументов.Добавить(Метаданные.Документы.КадровоеПеремещениеОрганизаций);
	МассивДругихДокументов.Добавить(Метаданные.Документы.УвольнениеИзОрганизаций);
	
	ЭтоДругойДокумент = МассивДругихДокументов.Найти(МетаданныеОбъекта) <> Неопределено;	
	
	Если ((МетаданныеОбъекта.Движения.Содержит(ОбъектМетаданныхХозрасчетный)	 
		И ((ЕстьПризнакОтражатьВУправленческомУчете И ФормаОбъекта.ОтражатьВУправленческомУчете) Или (ЕстьПризнакОтражатьВУпрУчете И ФормаОбъекта.ОтражатьВУпрУчете)) Или ЭтоДругойДокумент)
		И ФормаОбъекта.Организация.А_УправленческийУчет) Тогда
		
		ДокументУУ = ФормаОбъекта.Ссылка;
		
		//Проверка блокировки документа
		//Если документа нет в РС, тогда такой документ блокировать не нужно
		ДанныеБУ = ПолучитьСвязанныйДокументБУ(ДокументУУ);
		
		Если ДанныеБУ.ДокументБУ = Неопределено Тогда 
			Возврат
		КонецЕсли;
		
		Если ДанныеБУ.Заблокирован Тогда 
			ТекстЗаголовка = "Разблокировать";
			ТекстПодсказки = "Разблокировать документ!"
		Иначе 
			ТекстЗаголовка = "Заблокировать";
			ТекстПодсказки = "Заблокировать документ!"
		КонецЕсли;
		
		ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
		КоманднаяПанель = ЭлементыФормы.ДействияФормы;
		
		ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
		КоманднаяПанель.Кнопки.Добавить("А_Разделитель", ТипКнопки);
		
		НовоеДействие = Новый Действие("ОсновныеДействияФормыПечатьПоУмолчанию");
		ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		БлокировкаДокумента = КоманднаяПанель.Кнопки.Добавить("А_БлокировкаДокумента", ТипКнопки, ТекстЗаголовка, НовоеДействие);
		БлокировкаДокумента.Подсказка = ТекстПодсказки;
		БлокировкаДокумента.Пояснение = ТекстПодсказки;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьКнопкуБлокировкиДокументаБУ(МетаданныеОбъекта, ФормаОбъекта)
	
	//Для справочников кнопку не добавляем
	Если ОбщегоНазначения.ПринадлежностьКлассуМетаданных("Справочники", МетаданныеОбъекта)
		Или ОбщегоНазначения.ПринадлежностьКлассуМетаданных("ПланыВидовХарактеристик", МетаданныеОбъекта) Тогда 
		Возврат
	КонецЕсли;
	
	ОбъектМетаданныхХозрасчетный = Метаданные.РегистрыБухгалтерии.Хозрасчетный;
	
	ЕстьПризнакОтражатьВБухгалтерскомУчете = МетаданныеОбъекта.Реквизиты.Найти("ОтражатьВБухгалтерскомУчете") <> Неопределено;
	ЕстьПризнакОтражатьВРеглУчете = МетаданныеОбъекта.Реквизиты.Найти("ОтражатьВРеглУчете") <> Неопределено;
	
	МассивДругихДокументов = Новый Массив;
	МассивДругихДокументов.Добавить(Метаданные.Документы.ПриемНаРаботуВОрганизацию);
	МассивДругихДокументов.Добавить(Метаданные.Документы.КадровоеПеремещениеОрганизаций);
	МассивДругихДокументов.Добавить(Метаданные.Документы.УвольнениеИзОрганизаций);
	
	ЭтоДругойДокумент = МассивДругихДокументов.Найти(МетаданныеОбъекта) <> Неопределено;	
	
	Если ((МетаданныеОбъекта.Движения.Содержит(ОбъектМетаданныхХозрасчетный)	 
		И ((ЕстьПризнакОтражатьВБухгалтерскомУчете И ФормаОбъекта.ОтражатьВБухгалтерскомУчете) Или (ЕстьПризнакОтражатьВРеглУчете И ФормаОбъекта.ОтражатьВРеглУчете)) Или ЭтоДругойДокумент)
		И ФормаОбъекта.Организация.А_БухгалтерскийУчет) Тогда
		
		ДокументБУ = ФормаОбъекта.Ссылка;
		
		//Проверка блокировки документа
		//Если документа нет в РС, тогда такой документ блокировать не нужно
		ДанныеУУ = ПолучитьСвязанныйДокументУУ(ДокументБУ);
		
		Если ДанныеУУ.ДокументУУ = Неопределено Тогда 
			Возврат
		КонецЕсли;
		
		// А_Вячеслав(29.08.2017 кнопка нужна пока только в ПТУ по наливу
		Если МетаданныеОбъекта = Метаданные.Документы.ПоступлениеТоваровУслуг Тогда
			Если РегистрыСведений.А_СвязьДокументовПоНаливу.ПолучитьРТУ(ФормаОбъекта.Ссылка) = Неопределено Тогда
				Возврат;
			КонецЕсли;	
		Иначе
			Возврат;
		КонецЕсли;
		// А_Вячеслав)
		
		Если ДанныеУУ.ЗаблокированБУ Тогда 
			ТекстЗаголовка = "Разблокировать";
			ТекстПодсказки = "Разблокировать документ!"
		Иначе 
			ТекстЗаголовка = "Заблокировать";
			ТекстПодсказки = "Заблокировать документ!"
		КонецЕсли;
		
		ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
		КоманднаяПанель = ЭлементыФормы.ДействияФормы;
		
		ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
		КоманднаяПанель.Кнопки.Добавить("А_Разделитель", ТипКнопки);
		
		НовоеДействие = Новый Действие("ОсновныеДействияФормыПечатьПоУмолчанию");
		ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		БлокировкаДокумента = КоманднаяПанель.Кнопки.Добавить("А_БлокировкаДокумента", ТипКнопки, ТекстЗаголовка, НовоеДействие);
		БлокировкаДокумента.Подсказка = ТекстПодсказки;
		БлокировкаДокумента.Пояснение = ТекстПодсказки;
		
	КонецЕсли;
	
КонецПроцедуры 


Процедура ПриОткрытии_ПеремещениеТоваров(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	ТекущаяСтраницаПанели = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ЭлементыФормы.ОсновнаяПанель.Страницы.Дополнительно;
	
	//Добавление поля "Вид взаиморасчетов"
	Если Истина Тогда 
		
		// Добавление надписи "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 87); 
		СтруктураСвойств.Вставить("Верх", 50);
		СтруктураСвойств.Вставить("Лево", 10);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая и правая границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ОсновнаяПанель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ОсновнаяПанель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		ЭлементНадписьВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Надпись"), "НадписьА_ВидВзаиморасчетов", , ЭлементыФормы.ОсновнаяПанель, СтруктураСвойств, СтруктураПривязок);
		
		// Добавление поля "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 208); 
		СтруктураСвойств.Вставить("Верх", 50);
		СтруктураСвойств.Вставить("Лево", 99);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		СтруктураСвойств.Вставить("Данные", "А_ВидВзаиморасчетов");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		СтруктураСвойств.Вставить("КнопкаОткрытия", Истина);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ОсновнаяПанель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ОсновнаяПанель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.ОсновнаяПанель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		ТекущиеЗначенияПривязки.Вставить("Элемент2", ЭлементыФормы.ОсновнаяПанель);	
		ТекущиеЗначенияПривязки.Вставить("Граница2", ГраницаЭлементаУправления.Право);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		ЭлементПолеВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ПолеВвода"), "А_ВидВзаиморасчетов", , ЭлементыФормы.ОсновнаяПанель, СтруктураСвойств, СтруктураПривязок);
		
	КонецЕсли;	
	
	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ТекущаяСтраницаПанели;
	// А_Вячеслав(03.05.2018 
	ЭлементыФормы.ДействияФормы.Кнопки.Подменю3.Кнопки.Вставить(2, "СвязанныеДокументыПоНаливу", ТипКнопкиКоманднойПанели.Действие, "Связанные документы по наливу", Новый Действие("ДействияФормыСвязанныеДокументыПоНаливу"))	// +++ А_ИТ4Б Ересько 2017-07-17 {Механизм для налива} 
	// А_Вячеслав) 
	
КонецПроцедуры

Процедура ПриОткрытии_СписаниеТоваров(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Вид взаиморасчетов"
	Если Истина Тогда 
		
		// Добавление надписи "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 88); 
		СтруктураСвойств.Вставить("Верх", 288);
		СтруктураСвойств.Вставить("Лево", 8);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.НадписьПодразделение);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Низ);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		ЭлементНадписьВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Надпись"), "НадписьА_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
		// Добавление поля "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 220); 
		СтруктураСвойств.Вставить("Верх", 288);
		СтруктураСвойств.Вставить("Лево", 96);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		СтруктураСвойств.Вставить("Данные", "А_ВидВзаиморасчетов");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		СтруктураСвойств.Вставить("КнопкаОткрытия", Истина);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Низ);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		ТекущиеЗначенияПривязки.Вставить("Элемент2", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница2", ГраницаЭлементаУправления.Право);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		ЭлементПолеВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ПолеВвода"), "А_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
		// А_Вячеслав(22.11.2018 
		// Добавление поля "А_НеСписыватьСумму"
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 220); 
		СтруктураСвойств.Вставить("Верх", 288);
		СтруктураСвойств.Вставить("Лево", ЭлементПолеВидВзаиморасчетов.Лево+ЭлементПолеВидВзаиморасчетов.Ширина+20);
		СтруктураСвойств.Вставить("Заголовок", "Не списывать сумму");
		СтруктураСвойств.Вставить("Данные", "А_НеСписыватьСумму");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		СтруктураСвойств.Вставить("КнопкаОткрытия", Ложь);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Низ);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементПолеВидВзаиморасчетов);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		// право
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		ЭлементПолеВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Флажок"), "А_НеСписыватьСумму", , , СтруктураСвойств, СтруктураПривязок);
		// А_Вячеслав) 
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриОткрытии_ОприходованиеТоваров(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Вид взаиморасчетов"
	Если Истина Тогда 
		
		// Добавление надписи "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 88); 
		СтруктураСвойств.Вставить("Верх", 316);
		СтруктураСвойств.Вставить("Лево", 8);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.НадписьПодразделение);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Низ);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		ЭлементНадписьВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Надпись"), "НадписьА_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
		// Добавление поля "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 220); 
		СтруктураСвойств.Вставить("Верх", 316);
		СтруктураСвойств.Вставить("Лево", 98);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		СтруктураСвойств.Вставить("Данные", "А_ВидВзаиморасчетов");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		СтруктураСвойств.Вставить("КнопкаОткрытия", Истина);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Низ);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		ТекущиеЗначенияПривязки.Вставить("Элемент2", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница2", ГраницаЭлементаУправления.Право);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		ЭлементПолеВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ПолеВвода"), "А_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриОткрытии_НачислениеЗарплатыРаботникамОрганизаций(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Вид взаиморасчетов"
	Если Истина Тогда 
		
		// Добавление надписи "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 120); 
		СтруктураСвойств.Вставить("Верх", 105);
		СтруктураСвойств.Вставить("Лево", 336);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Правая и левая граници
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Дата);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		//Верхняя граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		
		ЭлементНадписьВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Надпись"), "НадписьА_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
		// Добавление поля "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 196); 
		СтруктураСвойств.Вставить("Верх", 105);
		СтруктураСвойств.Вставить("Лево", 460);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		СтруктураСвойств.Вставить("Данные", "А_ВидВзаиморасчетов");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		СтруктураСвойств.Вставить("КнопкаОткрытия", Истина);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Верхняя граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Дата);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		ЭлементПолеВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ПолеВвода"), "А_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
	КонецЕсли;	
		
КонецПроцедуры
 
Процедура ПриОткрытии_ЗарплатаКВыплатеОрганизаций(МетаданныеОбъекта, ФормаОбъекта)
	
	ФормаОбъекта.Высота = ФормаОбъекта.Высота + 24;
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Вид взаиморасчетов"
	Если Истина Тогда 
		
		// Добавление надписи "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 85); 
		СтруктураСвойств.Вставить("Верх", 404);
		СтруктураСвойств.Вставить("Лево", 8);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.НадписьКоментарий);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Лево);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Комментарий);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		ЭлементНадписьВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Надпись"), "НадписьА_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
		// Добавление поля "Вид взаиморасчетов"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 150); 
		СтруктураСвойств.Вставить("Верх", 404);
		СтруктураСвойств.Вставить("Лево", 93);
		СтруктураСвойств.Вставить("Заголовок", "Вид взаиморасчетов");
		СтруктураСвойств.Вставить("Данные", "А_ВидВзаиморасчетов");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		СтруктураСвойств.Вставить("КнопкаОткрытия", Истина);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Правая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ФормаОбъекта.Панель);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		//Верхняя и нижняя границы
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Комментарий);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Верх);
						
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Верх", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Низ", СтруктураЗначенияПривязки);
		
		ЭлементПолеВидВзаиморасчетов = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ПолеВвода"), "А_ВидВзаиморасчетов", , , СтруктураСвойств, СтруктураПривязок);
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриОткрытии_ПоступлениеТоваровУслуг(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Счет учета НДС" в ТЧ "Товары"
	ДобавитьКолонкуВТабличноеПоле(ЭлементыФормы.Товары.Колонки, 
									21, 
									Тип("ПолеВвода"), 
									Новый Структура("ТекстШапки, Имя, Данные, Ширина, ИзменениеРазмера", "Счет учета НДС", "А_СчетУчетаНДС", "А_СчетУчетаНДС", 12, ИзменениеРазмераКолонки.Изменять));	
									
	// А_Заверуха 29/07/16 **** It4b 2016***** 
	//Добавление поля "Счет учета НДС" в ТЧ "Товары"
	ДобавитьКолонкуВТабличноеПоле(ЭлементыФормы.Услуги.Колонки, 
									21, 
									Тип("ПолеВвода"), 
									Новый Структура("ТекстШапки, Имя, Данные, Ширина, ИзменениеРазмера", "Счет учета НДС", "А_СчетУчетаНДС", "А_СчетУчетаНДС", 12, ИзменениеРазмераКолонки.Изменять));	

	// А_Заверуха
	
КонецПроцедуры

Процедура ПриОткрытии_РеализацияТоваровУслуг(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Счет учета НДС" в ТЧ "Товары"
	ДобавитьКолонкуВТабличноеПоле(ЭлементыФормы.Товары.Колонки, 
									24, 
									Тип("ПолеВвода"), 
									Новый Структура("ТекстШапки, Имя, Данные, Ширина, ИзменениеРазмера", "Счет учета НДС", "А_СчетУчетаНДС", "А_СчетУчетаНДС", 12, ИзменениеРазмераКолонки.Изменять));	
									
	ЭлементыФормы.ДействияФормы.Кнопки.Подменю3.Кнопки.Вставить(2, "СвязанныеДокументыПоНаливу", ТипКнопкиКоманднойПанели.Действие, "Связанные документы по наливу", Новый Действие("ДействияФормыСвязанныеДокументыПоНаливу"))	// +++ А_ИТ4Б Ересько 2017-07-17 {Механизм для налива} 
									
КонецПроцедуры

Процедура ПриОткрытии_НалоговаяНакладная(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Счет учета НДС" в ТЧ "Товары"
	ДобавитьКолонкуВТабличноеПоле(ЭлементыФормы.Товары.Колонки, 
									26, 
									Тип("ПолеВвода"), 
									Новый Структура("ТекстШапки, Имя, Данные, Ширина, ИзменениеРазмера", "Счет учета НДС", "А_СчетУчетаНДС", "А_СчетУчетаНДС", 12, ИзменениеРазмераКолонки.Изменять));	
		
КонецПроцедуры

Процедура ПриОткрытии_Приложение2КНалоговойНакладной(МетаданныеОбъекта, ФормаОбъекта)
	
	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление поля "Счет учета НДС" в ТЧ "Товары"
	ДобавитьКолонкуВТабличноеПоле(ЭлементыФормы.Товары.Колонки, 
									29, 
									Тип("ПолеВвода"), 
									Новый Структура("ТекстШапки, Имя, Данные, Ширина, ИзменениеРазмера", "Счет учета НДС", "А_СчетУчетаНДС", "А_СчетУчетаНДС", 12, ИзменениеРазмераКолонки.Изменять));	
		
КонецПроцедуры

Процедура ПриОткрытии_ПоступлениеДопРасходов(МетаданныеОбъекта, ФормаОбъекта) 

	ЭлементыФормы = ФормаОбъекта.ЭлементыФормы;
	
	//Добавление флага Хранение
	Если Истина Тогда 
		
		// Добавление флага "Хранение"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 50); 
		СтруктураСвойств.Вставить("Верх", 32);
		СтруктураСвойств.Вставить("Лево", 573);
		СтруктураСвойств.Вставить("Заголовок", "Хран.");
		СтруктураСвойств.Вставить("Подсказка", "Хранение");
		СтруктураСвойств.Вставить("Данные", "А_Хранение");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Дата);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		СтруктураДействий = Новый Структура("ПриИзменении", Новый Действие("А_ХранениеТранспортПриИзменении"));
		
		Элемент_А_УправленческийУчет = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Флажок"), "А_Хранение", , , СтруктураСвойств, СтруктураПривязок, СтруктураДействий);
		
	КонецЕсли;
	
	//Добавление флага Транспорт
	Если Истина Тогда 
		
		// Добавление флага "Хранение"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 50); 
		СтруктураСвойств.Вставить("Верх", 32);
		СтруктураСвойств.Вставить("Лево", 626);
		СтруктураСвойств.Вставить("Заголовок", "Тран.");
		СтруктураСвойств.Вставить("Подсказка", "Транспорт");
		СтруктураСвойств.Вставить("Данные", "А_Транспорт");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		
		СтруктураПривязок 			= Новый Структура();
		ТекущиеЗначенияПривязки 	= Новый Структура();
		
		//Левая граница
		ТекущиеЗначенияПривязки.Вставить("Элемент", ЭлементыФормы.Дата);	
		ТекущиеЗначенияПривязки.Вставить("Граница", ГраницаЭлементаУправления.Право);
		
		СтруктураЗначенияПривязки 	= Новый Структура("Элемент, Граница, Элемент2, Граница2");
		ЗаполнитьЗначенияСвойств(СтруктураЗначенияПривязки, ТекущиеЗначенияПривязки);
		СтруктураПривязок.Вставить("Лево", СтруктураЗначенияПривязки);
		СтруктураПривязок.Вставить("Право", СтруктураЗначенияПривязки);
		
		СтруктураДействий = Новый Структура("ПриИзменении", Новый Действие("А_ХранениеТранспортПриИзменении"));
		
		Элемент_А_УправленческийУчет = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Флажок"), "А_Транспорт", , , СтруктураСвойств, СтруктураПривязок, СтруктураДействий);
		
	КонецЕсли;
	
	//Добавление поля Тариф
	Если Истина Тогда 
		
		// Добавление надписи "Тариф"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 40); 
		СтруктураСвойств.Вставить("Верх", 160);
		СтруктураСвойств.Вставить("Лево", 560);
		СтруктураСвойств.Вставить("Заголовок", "Тариф");
		
		Элемент_А_УправленческийУчет = ДобавитьЭлементФормы(ЭлементыФормы, Тип("Надпись"), "НадписьА_Тариф", , , СтруктураСвойств);
		
		// Добавление поля "Тариф"
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Высота", 19); 
		СтруктураСвойств.Вставить("Ширина", 50); 
		СтруктураСвойств.Вставить("Верх", 160);
		СтруктураСвойств.Вставить("Лево", 600);
		СтруктураСвойств.Вставить("Заголовок", "Тариф");
		СтруктураСвойств.Вставить("Данные", "А_Тариф");
		СтруктураСвойств.Вставить("ИзменяетДанные", Истина);
		СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
		
		Элемент_А_УправленческийУчет = ДобавитьЭлементФормы(ЭлементыФормы, Тип("ПолеВвода"), "А_Тариф", , , СтруктураСвойств);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПриОткрытии_ФормыВыбораСправочникаФизЛица(Организация) Экспорт
	ФормаВыбора = Справочники.ФизическиеЛица.ПолучитьФормуВыбора();
	ФормаВыбора.РежимВыбора = Истина;
	ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = ЛОЖЬ;
	
	ФормаВыбора.СправочникСписок.Отбор.Ссылка.Значение = Справочники.ФизическиеЛица.НайтиПоНаименованию(Организация.Наименование);
	ФормаВыбора.СправочникСписок.Отбор.Ссылка.ВидСравнения 	= ВидСравнения.ВИерархии;
	ФормаВыбора.СправочникСписок.Отбор.Ссылка.Использование = Истина;
	ФизЛицо = ФормаВыбора.ОткрытьМодально();
	Возврат ФизЛицо;
КонецФункции

Функция ПолучитьДополнительныеДанныеДокумента(Документ) Экспорт
	
	Если Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	стрВозврата = Новый Структура;
	стрВозврата.Вставить("Оригинал", Ложь);
	стрВозврата.Вставить("Медок", Ложь);
	стрВозврата.Вставить("Вчасно", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеДанныеДокументов.Оригинал,
		|	ДополнительныеДанныеДокументов.Медок,
		|	ДополнительныеДанныеДокументов.Вчасно
		|ИЗ
		|	РегистрСведений.ДополнительныеДанныеДокументов КАК ДополнительныеДанныеДокументов
		|ГДЕ
		|	ДополнительныеДанныеДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стрВозврата, ВыборкаДетальныеЗаписи);			
	КонецЦикла;
	
	Возврат стрВозврата;
	
КонецФункции

Процедура ЗаписатьДополнительныеДанныеДокумента(Документ, Данные) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	МенЗап = РегистрыСведений.ДополнительныеДанныеДокументов.СоздатьМенеджерЗаписи();
	МенЗап.Документ = Документ;
	ЗаполнитьЗначенияСвойств(МенЗап, Данные);
	МенЗап.Записать();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////

// Функция добавляет колонку в табличное поле.
//
// Параметры
//  КолонкиТабличногоПоля - Коллекция колонок табличного поля - Коллекция колонок, в которую добавляем колонку.
//
//  ИндексКолонки - Число - Индекс добавляемой колонки, если не задан тогда колонка добавляется в конец табличного поля.
//
//  ЭлементУправления - Тип - Тип элемента управления.
//
//  СтруктураПараметровКолонки - Структура - Структура с параметрами колонки. Ключи структуры должны совпадать с названиями параметров.
//
//  СтруктураПараметровЭлементаУпраления - Структура - Структура с параметрами элемента упраления колонки. Ключи структуры должны совпадать с названиями параметров.
//
//  СтруктураДействийЭлементаУпраления - Структура - Структура с действиями элемента управления колонки. Ключи структуры должны совпадать с названиями действий, значения должны иметь тип Действия.
//
// Возвращаемое значение:
//   Колонка табличного поля - Добавленная колонка.
//
Функция ДобавитьКолонкуВТабличноеПоле(КолонкиТабличногоПоля, ИндексКолонки = Неопределено, ЭлементУправления = Неопределено, СтруктураПараметровКолонки = Неопределено, СтруктураПараметровЭлементаУпраления = Неопределено, СтруктураДействийЭлементаУпраления = Неопределено) Экспорт 	
	Если ИндексКолонки <> Неопределено Тогда
		
		Колонка = КолонкиТабличногоПоля.Вставить(ИндексКолонки);
		
	Иначе
		
		Колонка = КолонкиТабличногоПоля.Добавить();
		
	КонецЕсли;	
	
	Если ЭлементУправления <> Неопределено Тогда
		
		Колонка.УстановитьЭлементУправления(ЭлементУправления);
		
	КонецЕсли;	
	
	Если СтруктураПараметровКолонки <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(Колонка, СтруктураПараметровКолонки);
		
	КонецЕсли;	
	
	Если СтруктураПараметровЭлементаУпраления <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(Колонка.ЭлементУправления, СтруктураПараметровЭлементаУпраления);
		
	КонецЕсли;	
	
	Если СтруктураДействийЭлементаУпраления <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СтруктураДействийЭлементаУпраления Цикл
			
			Колонка.ЭлементУправления.УстановитьДействие(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат Колонка;
	
КонецФункции

// Процедура добавляет на форму новый элемент.
//
// Параметры
//  ЭлементыФормы - Коллекция элементов формы - Коллекция элементов формы, в которую добавляем новый элемент.
//
//  Тип - Тип - Тип добавляемого элемента.
//
//  Имя - Строка - Имя добавляемого элемента.
//
//  Видимость - Булево - Видимость добавляемого элемента.
//
//  ПоместитьНа - Панель - Панель на форме, на которую добавляем элемент. Если не задан, тогда добавляется непосредственно на форму.
//
//  СтруктураСвойств - Структура - Структура со свойствами элемента. Ключи структуры должны совпадать с названиями свойств.
//
//  СтруктураПривязок - Структура - Структура с привязками элемента. Ключи структуры должны совпадать с названиями границ элемента, значения - структура вида:
//									Ключи структуры дожны иметь следующие наименования: "Элемент, Граница, Элемент2, Граница2", значения - элементы и их границы.
//
//  СтруктураДействий - Структура - Структура с действиями элемента. Ключи структуры должны совпадать с названиями действий, значения должны иметь тип Действия.
//
// Возвращаемое значение:
//   Элемент формы - Добавленный элемент формы.
//
Функция ДобавитьЭлементФормы(ЭлементыФормы, Тип, Имя, Видимость = Истина, ПоместитьНа = Неопределено, СтруктураСвойств = Неопределено, СтруктураПривязок = Неопределено, СтруктураДействий = Неопределено) Экспорт 
	
	ЭлементФормы = ЭлементыФормы.Добавить(Тип, Имя, Видимость, ПоместитьНа);
	
	Если СтруктураСвойств <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЭлементФормы, СтруктураСвойств);
		
	КонецЕсли;
	
	Если СтруктураПривязок <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СтруктураПривязок Цикл
			
			ЭлементФормы.УстановитьПривязку(ГраницаЭлементаУправления[КлючИЗначение.Ключ], КлючИЗначение.Значение.Элемент, КлючИЗначение.Значение.Граница, КлючИЗначение.Значение.Элемент2, КлючИЗначение.Значение.Граница2);
		
		КонецЦикла; 
		
	КонецЕсли; 

	Если СтруктураДействий <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СтруктураДействий Цикл
			
			ЭлементФормы.УстановитьДействие(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат ЭлементФормы;
	
КонецФункции // ДобавитьЭлементФормы()

#КонецЕсли

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////// ПРОЦЕДУРЫ И ФУНКЦИИ ПО НАСТРОЙКЕ УПРАВЛЕНЧЕСКОГО УЧЕТА ////////////////////////////////////

// Получаем связаную организацию УУ по организации УУ
// Параметры:
// ОрганизацияБУ - справочник ссылка Организация
Функция ПолучитьОрганизациюУУ(ОрганизацияБУ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеОрганизаций_БУ_УУ.ОрганизацияУУ КАК ОрганизацияУУ
		|ИЗ
		|	РегистрСведений.А_СоответствиеОрганизаций_БУ_УУ КАК А_СоответствиеОрганизаций_БУ_УУ
		|ГДЕ
		|	А_СоответствиеОрганизаций_БУ_УУ.ОрганизацияБУ = &ОрганизацияБУ";
	
	Запрос.УстановитьПараметр("ОрганизацияБУ", ОрганизацияБУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		Возврат Справочники.Организации.ПустаяСсылка()
		
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.ОрганизацияУУ
		
	КонецЕсли;
	
КонецФункции

// Получаем связанный документ УУ по документу БУ
// Параметры:
// ДокументБУ - документ ссылка
Функция ПолучитьСвязанныйДокументУУ(ДокументБУ) Экспорт 
	
	Результат = Новый Структура("ДокументУУ,Заблокирован,ЗаблокированБУ", Неопределено, Ложь, Ложь);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументУУ КАК ДокументУУ,
		|	А_СоответствиеДокуметов_БУ_УУ.ЗаблокированБУ КАК ЗаблокированБУ,
		|	А_СоответствиеДокуметов_БУ_УУ.Заблокирован КАК Заблокирован
		|ИЗ
		|	РегистрСведений.А_СоответствиеДокуметов_БУ_УУ КАК А_СоответствиеДокуметов_БУ_УУ
		|ГДЕ
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументБУ = &ДокументБУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", ДокументБУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		Возврат Результат
		
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат.ДокументУУ     = ВыборкаДетальныеЗаписи.ДокументУУ;
		Результат.Заблокирован   = ВыборкаДетальныеЗаписи.Заблокирован;		
		Результат.ЗаблокированБУ = ВыборкаДетальныеЗаписи.ЗаблокированБУ;
		
		Возврат Результат
		
	КонецЕсли;
	
КонецФункции

// Получаем связанный документ БУ по документу УУ
// Параметры:
// ДокументУУ - документ ссылка
Функция ПолучитьСвязанныйДокументБУ(ДокументУУ) Экспорт 
	
	// А_Вячеслав(29.08.2017 
	//Результат = Новый Структура("ДокументБУ,Заблокирован", Неопределено, Ложь);
	Результат = Новый Структура("ДокументБУ,Заблокирован,ЗаблокированБУ", Неопределено, Ложь, Ложь);
	// А_Вячеслав) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументБУ КАК ДокументБУ,
		// А_Вячеслав(29.08.2017 
		|	А_СоответствиеДокуметов_БУ_УУ.Заблокирован КАК Заблокирован,
		|	А_СоответствиеДокуметов_БУ_УУ.ЗаблокированБУ КАК ЗаблокированБУ
		// А_Вячеслав) 
		|ИЗ
		|	РегистрСведений.А_СоответствиеДокуметов_БУ_УУ КАК А_СоответствиеДокуметов_БУ_УУ
		|ГДЕ
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументУУ = &ДокументУУ";
	
	Запрос.УстановитьПараметр("ДокументУУ", ДокументУУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		Возврат Результат
		
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат.ДокументБУ = ВыборкаДетальныеЗаписи.ДокументБУ;
		Результат.Заблокирован = ВыборкаДетальныеЗаписи.Заблокирован;		
		// А_Вячеслав(29.08.2017 
		Результат.ЗаблокированБУ = ВыборкаДетальныеЗаписи.ЗаблокированБУ;
		// А_Вячеслав) 
		
		Возврат Результат
		
	КонецЕсли;
	
КонецФункции

// Записываем соответствие документов БУ и УУ
// Параметры:
// ДокументБУ - документ ссылка
// ДокументУУ - документ ссылка
// Заблокирован - Булево
Процедура ЗаписатьСоответствиеДокументов_БУ_УУ(ДокументБУ, ДокументУУ, Заблокирован = Ложь) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.А_СоответствиеДокуметов_БУ_УУ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументБУ = ДокументБУ;
	МенеджерЗаписи.ДокументУУ = ДокументУУ;
	МенеджерЗаписи.Заблокирован = Заблокирован;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Записываем соответствие документов БУ и УУ
// Параметры:
// ДокументБУ - документ ссылка
// ДокументУУ - документ ссылка
// Заблокирован - Булево
Процедура ЗаписатьСоответствиеЗначенийРеквизитов_БУ_УУ(ЗначениеРеквизитаБУ, ЗначениеРеквизитаУУ) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.А_СоответствиеЗначенийРеквизитов_БУ_УУ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектБУ = ЗначениеРеквизитаБУ;
	МенеджерЗаписи.ОбъектУУ = ЗначениеРеквизитаУУ;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Изменение признака блокировки документа
// Параметры:
// ДокументУУ - документ ссылка
// Заблокирован - Булево
Процедура ОбработатьБлокировкуДокумента(пДокумент, Заблокирован) Экспорт 
	// А_Вячеслав(29.08.2017 
	МенеджерЗаписи = РегистрыСведений.А_СоответствиеДокуметов_БУ_УУ.СоздатьМенеджерЗаписи();
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", пДокумент.Метаданные()) Тогда
		
		ЭтоУУ = пДокумент.Организация.А_УправленческийУчет;
		
		Если ЭтоУУ Тогда
			лДокументБУ = ПолучитьСвязанныйДокументБУ(пДокумент).ДокументБУ;
			лДокументУУ = пДокумент;
		Иначе	
			лДокументУУ = ПолучитьСвязанныйДокументУУ(пДокумент).ДокументУУ;
			лДокументБУ = пДокумент;
		КонецЕсли;	
	
		
		МенеджерЗаписи.ДокументУУ = лДокументУУ;
		МенеджерЗаписи.ДокументБУ = лДокументБУ;
		МенеджерЗаписи.Прочитать();
		Если ЭтоУУ Тогда
			МенеджерЗаписи.Заблокирован = Заблокирован;
		Иначе
			МенеджерЗаписи.ЗаблокированБУ = Заблокирован;
		КонецЕсли;	
		МенеджерЗаписи.Записать();
		Возврат;
		
	Иначе // фиг знает кому это надо, но оставим старый механизм
		
		ДокументБУ = ПолучитьСвязанныйДокументБУ(пДокумент).ДокументБУ;
		
		МенеджерЗаписи.ДокументУУ = пДокумент;
		МенеджерЗаписи.ДокументБУ = ДокументБУ;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Заблокирован = Заблокирован;
		МенеджерЗаписи.Записать();
	КонецЕсли;	
	// А_Вячеслав) 
	
КонецПроцедуры

// определяет заблокирован ли документ
Функция ДокументЗаблокирован(пДокумент) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.А_СоответствиеДокуметов_БУ_УУ.СоздатьМенеджерЗаписи();
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", пДокумент.Метаданные()) Тогда
		
		ЭтоУУ = пДокумент.Организация.А_УправленческийУчет;
		
		Если ЭтоУУ Тогда
			лДокументБУ = ПолучитьСвязанныйДокументБУ(пДокумент).ДокументБУ;
			лДокументУУ = пДокумент;
		Иначе	
			лДокументУУ = ПолучитьСвязанныйДокументУУ(пДокумент).ДокументУУ;
			лДокументБУ = пДокумент;
		КонецЕсли;	
		
		МенеджерЗаписи.ДокументУУ = лДокументУУ;
		МенеджерЗаписи.ДокументБУ = лДокументБУ;
		МенеджерЗаписи.Прочитать();
		Если ЭтоУУ Тогда
			Возврат МенеджерЗаписи.Заблокирован;
		Иначе
			Возврат МенеджерЗаписи.ЗаблокированБУ;
		КонецЕсли;	
		
	Иначе // фиг знает кому это надо, но оставим старый механизм
		ДокументБУ = ПолучитьСвязанныйДокументБУ(пДокумент).ДокументБУ;
	
		МенеджерЗаписи.ДокументУУ = пДокумент;
		МенеджерЗаписи.ДокументБУ = ДокументБУ;
		МенеджерЗаписи.Прочитать();
		Возврат МенеджерЗаписи.Заблокирован;
		
	КонецЕсли;

КонецФункции // ДокументЗаблокирован()
 

// Заполнение счетов по соответствиям с регистра
// Параметры:
// ДокументОбъектУУ - документ объект
// ДокументОбъектБУ - документ объект
Процедура ЗаполнитьСчетаУчета(ДокументОбъектУУ, ДокументОбъектБУ, МетаданныеДокумента) Экспорт 
	
	//Получение таблицы соответствия счетов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеСчетов_БУ_УУ.ИмяТабЧасти,
		|	А_СоответствиеСчетов_БУ_УУ.ИмяРеквизита,
		|	А_СоответствиеСчетов_БУ_УУ.СчетБУ,
		|	А_СоответствиеСчетов_БУ_УУ.СчетУУ
		|ИЗ
		|	РегистрСведений.А_СоответствиеСчетов_БУ_УУ КАК А_СоответствиеСчетов_БУ_УУ
		|ГДЕ
		|	А_СоответствиеСчетов_БУ_УУ.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", МетаданныеДокумента.Имя);
	
	ТаблицаСоответствияСчетов = Запрос.Выполнить().Выгрузить();
	
	//Обработка счетов шапки
	СтрокиСПустойТабЧастью = ТаблицаСоответствияСчетов.НайтиСтроки(Новый Структура("ИмяТабЧасти", ""));	
	ТаблицаРеквизитовШапки = ТаблицаСоответствияСчетов.Скопировать(СтрокиСПустойТабЧастью, "ИмяТабЧасти,ИмяРеквизита");
	ТаблицаРеквизитовШапки.Свернуть("ИмяТабЧасти,ИмяРеквизита");
	
	Для Каждого СтрокаРеквизита Из ТаблицаРеквизитовШапки Цикл		
		ОбработатьПоискЗаполнениеСчета(СтрокаРеквизита, ТаблицаСоответствияСчетов, ДокументОбъектБУ, ДокументОбъектУУ)		
	КонецЦикла;
	
	//Обработка счетов табличной части
	ТаблицаИменТабЧастей = ТаблицаСоответствияСчетов.Скопировать(, "ИмяТабЧасти");
	ТаблицаИменТабЧастей.Свернуть("ИмяТабЧасти");
	
	Для Каждого СтрокаТабЧасть Из ТаблицаИменТабЧастей Цикл
		
		//Табличную часть с пустым именем пропускаем
		Если Не ЗначениеЗаполнено(СтрокаТабЧасть.ИмяТабЧасти) Тогда 
			Продолжить
		КонецЕсли;		
		
		//Выбираем реквизиты текущей табличной части
		СтрокиТекущейТабЧасти = ТаблицаСоответствияСчетов.НайтиСтроки(Новый Структура("ИмяТабЧасти", СтрокаТабЧасть.ИмяТабЧасти));	
		ТаблицаИменРеквизитовТабЧасти = ТаблицаСоответствияСчетов.Скопировать(СтрокиТекущейТабЧасти, "ИмяТабЧасти,ИмяРеквизита");
		ТаблицаИменРеквизитовТабЧасти.Свернуть("ИмяТабЧасти,ИмяРеквизита");
		
		//Обходим строки табличной части
		Для Каждого СтрокаТЧ_УУ Из ДокументОбъектУУ[СтрокаТабЧасть.ИмяТабЧасти] Цикл
			
			СтрокаТЧ_БУ = ДокументОбъектБУ[СтрокаТабЧасть.ИмяТабЧасти][СтрокаТЧ_УУ.НомерСтроки - 1];
			
			//Обходим нужные реквизиты табличной части
			Для Каждого СтрокаРеквизита Из ТаблицаИменРеквизитовТабЧасти Цикл				
				ОбработатьПоискЗаполнениеСчета(СтрокаРеквизита, ТаблицаСоответствияСчетов, СтрокаТЧ_БУ, СтрокаТЧ_УУ);				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Поиск соответствия счетов БУ и УУ, и подстановка их в документ УУ
// Параметры
// СтрокаРеквизита - строка таблицы значений, в которой хранится имя реквизита и табличной части, которые в данный момент обрабатываются
// ТаблицаСоответствияСчетов - таблица значений соответствий счетов БУ и УУ
// ОбрабатываемыйОбъектБУ - обрабатываемый объект (либо сам документ объект, либо строка табличной части)
// ОбрабатываемыйОбъектУУ - обрабатываемый объект (либо сам документ объект, либо строка табличной части)
Процедура ОбработатьПоискЗаполнениеСчета(СтрокаРеквизита, ТаблицаСоответствияСчетов, ОбрабатываемыйОбъектБУ, ОбрабатываемыйОбъектУУ)
	
	СчетБУ = ОбрабатываемыйОбъектБУ[СтрокаРеквизита.ИмяРеквизита];
	
	Если Не ЗначениеЗаполнено(СчетБУ) Тогда 
		Возврат
	КонецЕсли;
			
	//Ищем по совпадению счета БУ
	СтруктураПоиска = Новый Структура("ИмяТабЧасти,ИмяРеквизита,СчетБУ", СтрокаРеквизита.ИмяТабЧасти, СтрокаРеквизита.ИмяРеквизита, СчетБУ);
	МассивНайденныхСтрок = ТаблицаСоответствияСчетов.НайтиСтроки(СтруктураПоиска);
	
	Если МассивНайденныхСтрок.Количество() <> 0 Тогда 
		
		ОбрабатываемыйОбъектУУ[СтрокаРеквизита.ИмяРеквизита] = МассивНайденныхСтрок[0].СчетУУ
		
	Иначе
		
		//Ищем по пустом счету БУ
		СтруктураПоиска = Новый Структура("ИмяТабЧасти,ИмяРеквизита,СчетБУ", СтрокаРеквизита.ИмяТабЧасти, СтрокаРеквизита.ИмяРеквизита, ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		МассивНайденныхСтрок = ТаблицаСоответствияСчетов.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНайденныхСтрок.Количество() <> 0 Тогда				
			ОбрабатываемыйОбъектУУ[СтрокаРеквизита.ИмяРеквизита] = МассивНайденныхСтрок[0].СчетУУ
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Заполнение, создание транслирующихся реквизитов документов БУ и УУ
// ДокументОбъектУУ - документ объект
// ДокументОбъектБУ - документ объект
// МетаданныеДокумента - метаданные документа
Процедура ЗаполнитьСвязанныеРеквизиты(ДокументОбъектУУ, ДокументОбъектБУ, МетаданныеДокумента) Экспорт 
	
	//Заполнение вида взаиморасчетов
	ЕстьРеквизитВидВзаиморасчетов = МетаданныеДокумента.Реквизиты.Найти("А_ВидВзаиморасчетов") <> Неопределено;
	
	Если ЕстьРеквизитВидВзаиморасчетов Тогда 
		ДокументОбъектУУ.А_ВидВзаиморасчетов = ПолучитьЗначениеПоУмолчанию("ВидВзаиморасчетовДляУУ")
	КонецЕсли; 
	
	//Получение транслирующихся реквизитов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_НастройкиТрансляцииРеквизитов.ИмяТабЧасти,
		|	А_НастройкиТрансляцииРеквизитов.ИмяРеквизита
		|ИЗ
		|	РегистрСведений.А_НастройкиТрансляцииРеквизитов КАК А_НастройкиТрансляцииРеквизитов
		|ГДЕ
		|	А_НастройкиТрансляцииРеквизитов.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", МетаданныеДокумента.Имя);
	
	ТаблицаТранслирующихсяРеквизитов = Запрос.Выполнить().Выгрузить();
	
	//Обработка реквизитов шапки
	СтрокиСПустойТабЧастью = ТаблицаТранслирующихсяРеквизитов.НайтиСтроки(Новый Структура("ИмяТабЧасти", ""));	
	ТаблицаРеквизитовШапки = ТаблицаТранслирующихсяРеквизитов.Скопировать(СтрокиСПустойТабЧастью, "ИмяТабЧасти,ИмяРеквизита");
	ТаблицаРеквизитовШапки.Свернуть("ИмяТабЧасти,ИмяРеквизита");
	
	Для Каждого СтрокаРеквизита Из ТаблицаРеквизитовШапки Цикл		
		ОбработатьПоискЗаполнениеРеквизита(СтрокаРеквизита, ДокументОбъектБУ, ДокументОбъектУУ)		
	КонецЦикла;
	
	//Обработка реквизитов табличной части
	ТаблицаИменТабЧастей = ТаблицаТранслирующихсяРеквизитов.Скопировать(, "ИмяТабЧасти");
	ТаблицаИменТабЧастей.Свернуть("ИмяТабЧасти");
	
	Для Каждого СтрокаТабЧасть Из ТаблицаИменТабЧастей Цикл
		
		//Табличную часть с пустым именем пропускаем
		Если Не ЗначениеЗаполнено(СтрокаТабЧасть.ИмяТабЧасти) Тогда 
			Продолжить
		КонецЕсли;		
		
		//Выбираем реквизиты текущей табличной части
		СтрокиТекущейТабЧасти = ТаблицаТранслирующихсяРеквизитов.НайтиСтроки(Новый Структура("ИмяТабЧасти", СтрокаТабЧасть.ИмяТабЧасти));	
		ТаблицаИменРеквизитовТабЧасти = ТаблицаТранслирующихсяРеквизитов.Скопировать(СтрокиТекущейТабЧасти, "ИмяТабЧасти,ИмяРеквизита");
		ТаблицаИменРеквизитовТабЧасти.Свернуть("ИмяТабЧасти,ИмяРеквизита");
		
		//Обходим строки табличной части
		Для Каждого СтрокаТЧ_УУ Из ДокументОбъектУУ[СтрокаТабЧасть.ИмяТабЧасти] Цикл
			
			//Обходим нужные реквизиты табличной части
			Для Каждого СтрокаРеквизита Из ТаблицаИменРеквизитовТабЧасти Цикл
				
				СтрокаТЧ_БУ = ДокументОбъектБУ[СтрокаТабЧасть.ИмяТабЧасти][СтрокаТЧ_УУ.НомерСтроки - 1];
				ОбработатьПоискЗаполнениеРеквизита(СтрокаРеквизита, СтрокаТЧ_БУ, СтрокаТЧ_УУ)
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Поиск соответствия счетов БУ и УУ, и подстановка их в документ УУ
// Параметры
// СтрокаРеквизита - строка таблицы значений, в которой хранится имя реквизита и табличной части, которые в данный момент обрабатываются
// ОбрабатываемыйОбъектБУ - обрабатываемый объект (либо сам документ объект, либо строка табличной части)
// ОбрабатываемыйОбъектУУ - обрабатываемый объект (либо сам документ объект, либо строка табличной части)
Процедура ОбработатьПоискЗаполнениеРеквизита(СтрокаРеквизита, ОбрабатываемыйОбъектБУ, ОбрабатываемыйОбъектУУ)
	
	ЗначениеРеквизитаБУ = ОбрабатываемыйОбъектБУ[СтрокаРеквизита.ИмяРеквизита];
	
	//Если реквизит не заполнен, тогда пропускаем
	Если Не ЗначениеЗаполнено(ЗначениеРеквизитаБУ) Тогда 
		Возврат
	КонецЕсли;
	
	МетаданныеОбъекта = ЗначениеРеквизитаБУ.Метаданные();
	
	//Если данные реквизита не соответствуют нужным, тогда пропускаем
	Если МетаданныеОбъекта <> Метаданные.Справочники.ДоговорыКонтрагентов
		И МетаданныеОбъекта <> Метаданные.Справочники.БанковскиеСчета
		И МетаданныеОбъекта <> Метаданные.Справочники.СотрудникиОрганизаций
		И МетаданныеОбъекта <> Метаданные.Справочники.ПодразделенияОрганизаций 
		//И МетаданныеОбъекта <> Метаданные.Справочники.Валюты	// +++ А_ИТ4Б Ересько 2016-07-27 {Закомментировал} 
		Тогда
		
		Возврат
		
	КонецЕсли;
	
	// +++ А_ИТ4Б Ересько 2016-07-27 {Закомментировал} (Начало
	//Если  МетаданныеОбъекта = Метаданные.Справочники.Валюты Тогда
	//	Если ЗначениеРеквизитаБУ <> глЗначениеПеременной("ВалютаРегламентированногоУчета") тогда		
	//		ОбрабатываемыйОбъектУУ[СтрокаРеквизита.ИмяРеквизита] =  НайтиВалютуУУ(ОбрабатываемыйОбъектУУ.Организация,ПолучитьЗначениеПоУмолчанию("ВидВзаиморасчетовДляУУВалюта"),ЗначениеРеквизитаБУ);		
	//	КонецЕсли;
	//	Возврат
	//КонецЕсли;
	// +++ А_ИТ4Б Ересько 2016-07-27 Конец) 	
	
	//Поиск соответствия объектов БУ и УУ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	А_СоответствиеЗначенийРеквизитов_БУ_УУ.ОбъектУУ
	|ИЗ
	|	РегистрСведений.А_СоответствиеЗначенийРеквизитов_БУ_УУ КАК А_СоответствиеЗначенийРеквизитов_БУ_УУ
	|ГДЕ
	|	А_СоответствиеЗначенийРеквизитов_БУ_УУ.ОбъектБУ = &ОбъектБУ";
	
	Запрос.УстановитьПараметр("ОбъектБУ", ЗначениеРеквизитаБУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		//Если не нашли - создаем		
		НовыйЭлемент = ЗначениеРеквизитаБУ.Скопировать();
		
		//Физлицо затирается в процедуре ПриКопировании
		Если МетаданныеОбъекта = Метаданные.Справочники.СотрудникиОрганизаций Тогда
			НовыйЭлемент.Физлицо = ЗначениеРеквизитаБУ.Физлицо;
			НовыйЭлемент.Наименование = ЗначениеРеквизитаБУ.Наименование + " УУ";
		КонецЕсли;
		
		Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.Реквизиты Цикл
			
			Если РеквизитОбъекта.Тип.СодержитТип(Тип("СправочникСсылка.Организации"))
				И ТипЗнч(ЗначениеРеквизитаБУ[РеквизитОбъекта.Имя]) = Тип("СправочникСсылка.Организации") Тогда					
				НовыйЭлемент[РеквизитОбъекта.Имя] = ПолучитьОрганизациюУУ(ЗначениеРеквизитаБУ[РеквизитОбъекта.Имя])					
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			
			Если РеквизитОбъекта.Тип.СодержитТип(Тип("СправочникСсылка.Организации")) 
				И ТипЗнч(ЗначениеРеквизитаБУ[РеквизитОбъекта.Имя]) = Тип("СправочникСсылка.Организации") Тогда					
				НовыйЭлемент[РеквизитОбъекта.Имя] = ПолучитьОрганизациюУУ(ЗначениеРеквизитаБУ[РеквизитОбъекта.Имя])					
			КонецЕсли;
			
		КонецЦикла;
		
		Если МетаданныеОбъекта = Метаданные.Справочники.ДоговорыКонтрагентов Тогда 
			НовыйЭлемент.ВидВзаиморасчетов = ПолучитьЗначениеПоУмолчанию("ВидВзаиморасчетовДляУУ");
			// +++ А_ИТ4Б Ересько 2016-07-27 {Закомментировал} (Начало 
			//Попытка
			//	Если ЗначениеРеквизитаБУ.ВалютаВзаиморасчетов <> глЗначениеПеременной("ВалютаРегламентированногоУчета") тогда	
			//		НовыйЭлемент.ВалютаВзаиморасчетов = НайтиВалютуУУ(НовыйЭлемент.Организация,ПолучитьЗначениеПоУмолчанию("ВидВзаиморасчетовДляУУВалюта"),ЗначениеРеквизитаБУ.ВалютаВзаиморасчетов);
			//		НовыйЭлемент.ВидВзаиморасчетов = ПолучитьЗначениеПоУмолчанию("ВидВзаиморасчетовДляУУВалюта");
			//	КонецЕсли;
			//Исключение
			//КонецПопытки;
			// +++ А_ИТ4Б Ересько 2016-07-27 Конец)
			НовыйЭлемент.СхемаНалоговогоУчета = ПолучитьЗначениеПоУмолчанию("СхемаНалоговогоУчетаПоОтгрузке");
		КонецЕсли;
		
		// +++ А_ИТ4Б Ересько 2016-07-27 {Закомментировал} (Начало
		Если МетаданныеОбъекта = Метаданные.Справочники.БанковскиеСчета Тогда
		//	Попытка
		//		Если ЗначениеРеквизитаБУ.ВалютаДенежныхСредств <> глЗначениеПеременной("ВалютаРегламентированногоУчета") тогда	
		//			НовыйЭлемент.ВалютаДенежныхСредств= НайтиВалютуУУ(ОбрабатываемыйОбъектУУ.Организация,ПолучитьЗначениеПоУмолчанию("ВидВзаиморасчетовДляУУВалюта"),ЗначениеРеквизитаБУ.ВалютаДенежныхСредств);
		//		КонецЕсли;
		//	Исключение
		//	КонецПопытки;
			// А_Вячеслав(21.11.2018 
			НовыйЭлемент.Родитель = Неопределено;
			// А_Вячеслав) 
		
		КонецЕсли;
		// +++ А_ИТ4Б Ересько 2016-07-27 Конец)
		
		Если МетаданныеОбъекта = Метаданные.Справочники.ПодразделенияОрганизаций Тогда 
			
			Если ЗначениеЗаполнено(ЗначениеРеквизитаБУ.Родитель) Тогда 
				
				СтрокаРеквизитаВладелец = Новый Структура("ИмяРеквизита", "Родитель");
				
				ОбработатьПоискЗаполнениеРеквизита(СтрокаРеквизитаВладелец, ЗначениеРеквизитаБУ, НовыйЭлемент)
				
			КонецЕсли;
			
		КонецЕсли;
		
		НовыйЭлемент.Записать();
		ЗначениеРеквизитаУУ = НовыйЭлемент.Ссылка; 
		
		ЗаписатьСоответствиеЗначенийРеквизитов_БУ_УУ(ЗначениеРеквизитаБУ, ЗначениеРеквизитаУУ);
		
		ОбрабатываемыйОбъектУУ[СтрокаРеквизита.ИмяРеквизита] = ЗначениеРеквизитаУУ
		
	Иначе			
		
		//Если нашли подставляем
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();
		
		ОбрабатываемыйОбъектУУ[СтрокаРеквизита.ИмяРеквизита] = ВыборкаДетальныеЗаписи.ОбъектУУ			
		
	КонецЕсли;
	
КонецПроцедуры 

// Поиск реквизитов с типом Документ
//Возвращаем массив таких реквизитов
// ДокументОбъектУУ - документ объект
// ДокументОбъектБУ - документ объект
// МетаданныеДокумента - метаданные документа
Процедура ВыполнитьТрансляциюДокументов(ДокументОбъектУУ, ДокументОбъектБУ, МетаданныеДокумента) Экспорт
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСДокументами(МетаданныеДокумента.Реквизиты);
	
	Для Каждого РеквизитДокумента Из МассивРеквизитов Цикл
		
		Если ЗначениеЗаполнено(ДокументОбъектУУ[РеквизитДокумента]) Тогда 
		
			СтруктураДанных = ПолучитьСвязанныйДокументУУ(ДокументОбъектУУ[РеквизитДокумента]);
				
			Если СтруктураДанных.ДокументУУ <> Неопределено Тогда					
				ДокументОбъектУУ[РеквизитДокумента] = СтруктураДанных.ДокументУУ					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСДокументами(МетаданныеДокумента.СтандартныеРеквизиты);
	
	Для Каждого РеквизитДокумента Из МассивРеквизитов Цикл
		
		Если ЗначениеЗаполнено(ДокументОбъектУУ[РеквизитДокумента]) Тогда 
		
			СтруктураДанных = ПолучитьСвязанныйДокументУУ(ДокументОбъектУУ[РеквизитДокумента]);
				
			Если СтруктураДанных.ДокументУУ <> Неопределено Тогда					
				ДокументОбъектУУ[РеквизитДокумента] = СтруктураДанных.ДокументУУ					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		МассивРеквизитов = ПолучитьМассивРеквизитовСДокументами(ТЧ.Реквизиты);
		
		Для Каждого СтрокаТЧ Из ДокументОбъектУУ[ТЧ.Имя] Цикл
			
			Для Каждого РеквизитДокумента Из МассивРеквизитов Цикл
				
				Если ЗначениеЗаполнено(СтрокаТЧ[РеквизитДокумента]) Тогда 
					
					СтруктураДанных = ПолучитьСвязанныйДокументУУ(СтрокаТЧ[РеквизитДокумента]);
					
					Если СтруктураДанных.ДокументУУ <> Неопределено Тогда					
						СтрокаТЧ[РеквизитДокумента] = СтруктураДанных.ДокументУУ					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивРеквизитовСДокументами(ОбъектСРеквизитами)
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого РеквизитОбъекта Из ОбъектСРеквизитами Цикл
		
		Если РеквизитОбъекта.Имя = "Ссылка" Тогда 
			Продолжить
		КонецЕсли;
		
		ЭтоДокумент = Ложь;
			
		ТипыРеквизита = РеквизитОбъекта.Тип.Типы();
		
		Если ТипыРеквизита.Количество() > 1 Тогда 
			
			Для Каждого СтрокаМассиваТип Из ТипыРеквизита Цикл
				
				ТипРеквизита = Метаданные.НайтиПоТипу(СтрокаМассиваТип);
				
				Если ТипРеквизита = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				ПолноеИмяТипа = ТипРеквизита.ПолноеИмя();
				ТипОбъект = Лев(ПолноеИмяТипа, Найти(ПолноеИмяТипа,".") - 1);
				
				Если ТипОбъект = "Документ" Тогда 
					ЭтоДокумент = Истина;
					Прервать
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			
			ТипРеквизита = Метаданные.НайтиПоТипу(ТипыРеквизита[0]);
			
			Если ТипРеквизита = Неопределено Тогда 
				Продолжить
			КонецЕсли;
			
			ПолноеИмяТипа = ТипРеквизита.ПолноеИмя();
			ТипОбъект = Лев(ПолноеИмяТипа, Найти(ПолноеИмяТипа,".") - 1);
			
			Если ТипОбъект = "Документ" Тогда 
				ЭтоДокумент = Истина
			КонецЕсли;
			
		КонецЕсли;
		 
		Если ЭтоДокумент Тогда			
			МассивРеквизитов.Добавить(РеквизитОбъекта.Имя)			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРеквизитов;
	
КонецФункции

// NVV [09.01.2020 г.] ++
#Если КЛИЕНТ Тогда
// NVV --
Процедура А_УправленческийУчетДействие() Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда 
		Сообщить("Для пользователя с полными правами переключение организаций не работает!");
		Возврат
	КонецЕсли;
	
	ТекПользователь = глЗначениеПеременной("ГлТекущийПользователь");
	
	МассивОрганизаций = А_ОбщегоНазначенияСервер.ПолучитьСписокОрганизаций(ТекПользователь);
	СписокОрганизаций = Новый СписокЗначений;
	СписокОрганизаций.ЗагрузитьЗначения(МассивОрганизаций);
	
	ВыбраннаяОрганизация = СписокОрганизаций.ВыбратьЭлемент("Укажите организацию");
	
	Если ВыбраннаяОрганизация = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	А_ОбщегоНазначенияСервер.ПереключитьОрганизации(ВыбраннаяОрганизация.Значение, ТекПользователь);
	
	УстановитьЗаголовокКлиентскогоПриложения("Тек. организация");
	УстановитьЗаголовокСистемы(ВыбраннаяОрганизация.Значение);
	
КонецПроцедуры
// NVV [09.01.2020 г.] ++
#КонецЕсли
// NVV --

Процедура ПерезаполнитьСчетаУчетаНДСПоРегиструУчета(МетаданныеДокумента, ДокументОбъектУУ) Экспорт 
	
	Если МетаданныеДокумента.Имя = "Приложение2КНалоговойНакладной"
		//Или МетаданныеДокумента.Имя = "ПоступлениеТоваровУслуг"
		Или МетаданныеДокумента.Имя = "НалоговаяНакладная"
		// А_Заверуха 29/07/16 **** It4b 2016***** 
		//Или МетаданныеДокумента.Имя = "РеализацияТоваровУслуг" 
		// А_Заверуха
		Тогда 
		
		Если МетаданныеДокумента.Имя = "Приложение2КНалоговойНакладной" Тогда 
			ИмяСчета = "СчетУчетаНДСПриобретенийПодтвержденный"
		ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеТоваровУслуг" Тогда 
			ИмяСчета =  "СчетУчетаНДСПриобретений"
		ИначеЕсли МетаданныеДокумента.Имя = "НалоговаяНакладная" Тогда 
			ИмяСчета = "СчетУчетаНДСПриобретенийПодтвержденный"
		ИначеЕсли МетаданныеДокумента.Имя = "РеализацияТоваровУслуг" Тогда
			ИмяСчета = "СчетУчетаНДСПродаж"
		КонецЕсли;
		
		Для Каждого СтрокаТоваров Из ДокументОбъектУУ.Товары Цикл
			//А_ОбщегоНазначения.ЗаполнитьСчетУчетаНДСВТабЧасте(СтрокаТоваров, ДокументОбъектУУ.Организация, ДокументОбъектУУ.Контрагент, ДокументОбъектУУ.ДоговорКонтрагента, ИмяСчета);
		КонецЦикла;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеДопРасходов" Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(ДокументОбъектУУ.Организация, ДокументОбъектУУ.Контрагент, ДокументОбъектУУ.ДоговорКонтрагента);
		// А_Заверуха 29/07/16 **** It4b 2016***** 
		//ДокументОбъектУУ.СчетУчетаНДС 				= СчетаУчета.СчетУчетаНДСПриобретений;
		//ДокументОбъектУУ.СчетУчетаНДСПодтвержденный  = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
		
		Если ДокументОбъектУУ.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда 
			ДокументОбъектУУ.СчетУчетаНДС 				= СчетаУчета.СчетУчетаНДСПриобретений;
		КонецЕсли;
		
		Если ДокументОбъектУУ.СчетУчетаНДСПодтвержденный = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда 
			ДокументОбъектУУ.СчетУчетаНДСПодтвержденный  = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
		КонецЕсли;
		// А_Заверуха
		
	КонецЕсли;
	
КонецПроцедуры 



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////// ПРОЦЕДУРЫ И ФУНКЦИИ СЛУЖЕБНЫЕ ////////////////////////////////////////////////

Функция ПолучитьЗначениеПоУмолчанию(ИмяЗначения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияПоУмолчанию.ЗначениеПоУмолчанию
	               |ИЗ
	               |	РегистрСведений.А_ЗначенияПоУмолчанию КАК ЗначенияПоУмолчанию
	               |ГДЕ
	               |	ЗначенияПоУмолчанию.ИмяЗначения = &ИмяЗначения";
	
	Запрос.УстановитьПараметр("ИмяЗначения", ИмяЗначения);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ЗначениеПоУмолчанию;
	
КонецФункции

Процедура ЗаполнитьСчетУчетаНДСВТабЧасте(СтрокаТабличнойЧасти, Организация, Контрагент, ДоговорКонтрагента, ИмяСчета)	Экспорт 
	
	СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, ДоговорКонтрагента,, СтрокаТабличнойЧасти.Номенклатура);
	
	СтрокаТабличнойЧасти.А_СчетУчетаНДС = СчетаУчета[ИмяСчета];
	
КонецПроцедуры

// Заполнение данных по акцизу, пошлине, хранению и транспорту
// Разбиение по счетам 2812, 2813, 2814 и 2815 соответственно
Процедура ЗаполнитьДанныеПоАкцизуПошлинеХранениюТранспорту(СтруктураШапкиДокумента, Движения) Экспорт 
	
	
	МассивТоварныхСчетов = Новый Массив;
	МассивТоварныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2811"));
	МассивТоварныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("251"));
	МассивТоварныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("261"));
	
	МассивТоварныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладе);
	МассивТоварныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	МассивТоварныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	
	ТаблицаСчетовДопРАсходов = Разработка.ПолучитьТаблицуСоответвияСчетовДопРАсходов();
	
	МассивСчетовДопРасходов = ТаблицаСчетовДопРАсходов.ВыгрузитьКолонку("СчетДопРасходовИсходный");
	
	//Удалим счета остатков
	
	Для Каждого СчетОстатков из МассивТоварныхСчетов Цикл 
		
		Пока  МассивСчетовДопРасходов.найти(СчетОстатков) <> Неопределено Цикл 
			     УдаляемаяПозиция =  МассивСчетовДопРасходов.найти(СчетОстатков);
				 МассивСчетовДопРасходов.удалить(УдаляемаяПозиция);
		КонецЦикла;
		
	КонецЦикла;	
	// - IvanSidoruk 11.11.2020
	
	
	тзОстатки2811 = Новый ТаблицаЗначений;
	тзОстатки2811.Колонки.Добавить("Период");
	тзОстатки2811.Колонки.Добавить("Номенклатура");
	тзОстатки2811.Колонки.Добавить("Склад");
	тзОстатки2811.Колонки.Добавить("Партия");
	тзОстатки2811.Колонки.Добавить("Количество");
	тзОстатки2811.Колонки.Добавить("КоличествоНакоплено");
	тзОстатки2811.Колонки.Добавить("СуммаНакоплено");
	тзОстатки2811.Колонки.Добавить("Сумма");
	тзОстатки2811.Колонки.Добавить("Счет");
	
	//Получение данных по акцизу, пошлине, хранению и транспорту
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
		|	ХозрасчетныйОстатки.Субконто2 КАК Партия,
		|	ХозрасчетныйОстатки.Субконто3 КАК Склад,
		|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ Вт_ОстаткиКоличество
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет = &Счет_2811,
		|			&МассивСубконто,
		|			Субконто1 = &СубконтоДт1
		|				И Субконто2 = &СубконтоДт2
		|				И Субконто3 = &СубконтоДт3) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
		|	ХозрасчетныйОстатки.Субконто2 КАК Партия,
		|	ХозрасчетныйОстатки.Субконто3 КАК Склад,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ Вт_ОстаткиСумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В (&МассивСчетов),
		|			&МассивСубконто,
		|			Субконто1 = &СубконтоДт1
		|				И Субконто2 = &СубконтоДт2
		|				И Субконто3 = &СубконтоДт3) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ОстаткиСумма.Счет,
		|	Вт_ОстаткиСумма.Номенклатура,
		|	Вт_ОстаткиСумма.Партия,
		|	Вт_ОстаткиСумма.Склад,
		|	Вт_ОстаткиСумма.Сумма,
		|	ЕСТЬNULL(Вт_ОстаткиКоличество.Количество, 0) КАК Количество
		|ИЗ
		|	Вт_ОстаткиСумма КАК Вт_ОстаткиСумма
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОстаткиКоличество КАК Вт_ОстаткиКоличество
		|		ПО Вт_ОстаткиСумма.Номенклатура = Вт_ОстаткиКоличество.Номенклатура
		|			И Вт_ОстаткиСумма.Партия = Вт_ОстаткиКоличество.Партия
		|			И Вт_ОстаткиСумма.Склад = Вт_ОстаткиКоличество.Склад";
	// + IvanSidoruk 11.11.2020
	//МассивСчетов = Новый Массив;
	//МассивСчетов.Добавить(Счет2812);
	//МассивСчетов.Добавить(Счет2813);
	//МассивСчетов.Добавить(Счет2814);
	//МассивСчетов.Добавить(Счет2815);
	//// А_Карпчук ( 03.05.2019
	//МассивСчетов.Добавить(Счет2816);
	//МассивСчетов.Добавить(Счет2817);
	//// + IvanSidoruk 11.11.2020
	//МассивСчетов.Добавить(Счет2818);
	//// - IvanSidoruk 11.11.2020
	// А_Карпчук )
	//Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетовДопРасходов);
	// - IvanSidoruk 11.11.2020
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	// А_Вячеслав) 
	
	// + IvanSidoruk 18.08.2020
	ПисатьПродажиСебестоимостьПоПроводкам = Константы.ПисатьПродажиСебестоимостьПоПроводкам.Получить();	
	Если ПисатьПродажиСебестоимостьПоПроводкам Тогда 
		МетаданныеДокумента = СтруктураШапкиДокумента.Ссылка.метаданные(); 			
		ПишетПродажиСебестоимость = МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.ПродажиСебестоимость);
		
		Если ПишетПродажиСебестоимость Тогда 
			ТаблицаПродажиСебестоимостьИсходная = Движения.ПродажиСебестоимость.Выгрузить();
			
			ТекСделкаСебестоимость = Неопределено; 
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("Сделка",МетаданныеДокумента) Тогда 
					ТекСделкаСебестоимость = СтруктураШапкиДокумента.Ссылка.Сделка;
				КонецЕсли;
				
			// + IvanSidoruk 18.09.2020
			Если ЗначениеЗаполнено(ТекСделкаСебестоимость) Тогда 
				МетаданныеСделки = ТекСделкаСебестоимость.метаданные();
				
				Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента",МетаданныеСделки)  
					и (ТекСделкаСебестоимость.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам и ТекСделкаСебестоимость.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)  Тогда 
					ТекСделкаСебестоимость = Неопределено;					
				КонецЕсли;				
			КонецЕсли;
			// - IvanSidoruk 18.09.2020
			
			ТекПодразделениеСебестоимость= Неопределено; 
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение",МетаданныеДокумента) Тогда 
				ТекПодразделениеСебестоимость = СтруктураШапкиДокумента.Ссылка.Подразделение;
			КонецЕсли;
			
			ТекПроектСебестоимость =Неопределено; 
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("Проект",МетаданныеДокумента) Тогда 
					ТекПроектСебестоимость = СтруктураШапкиДокумента.Ссылка.Проект;
			КонецЕсли;				
		КонецЕсли;
		
		
	КонецЕсли;
	// - IvanSidoruk 18.08.2020	
	
	КоличествоПроводок = Движения.Хозрасчетный.Количество();
	
	Для Сч = 0 По КоличествоПроводок - 1 Цикл
		
		ПроводкаХозрасчетного = Движения.Хозрасчетный[Сч];
		
		// + IvanSidoruk 11.11.2020
		//Если ПроводкаХозрасчетного.СчетКт <> Счет2811 Тогда
		//	Продолжить
		//КонецЕсли;
		Счет2811 = ПроводкаХозрасчетного.СчетКт; 
		Если МассивТоварныхСчетов.Найти(ПроводкаХозрасчетного.СчетКт) =Неопределено Тогда
			Продолжить
		КонецЕсли;
		// - IvanSidoruk 11.11.2020

		
		// А_Вячеслав(03.10.2018 кеширование остатков
		лНайденныеСтроки = тзОстатки2811.НайтиСтроки(Новый Структура("Партия,Номенклатура,Склад,Период",
		 ПроводкаХозрасчетного.СубконтоКт.Партии,ПроводкаХозрасчетного.СубконтоКт.Номенклатура,ПроводкаХозрасчетного.СубконтоКт.Склады,ПроводкаХозрасчетного.Период));
		 
		Если лНайденныеСтроки.Количество()=0 Тогда
			
			Запрос.УстановитьПараметр("СубконтоДт1", ПроводкаХозрасчетного.СубконтоКт.Номенклатура);
			Запрос.УстановитьПараметр("СубконтоДт2", ПроводкаХозрасчетного.СубконтоКт.Партии);
			Запрос.УстановитьПараметр("СубконтоДт3", ПроводкаХозрасчетного.СубконтоКт.Склады);		
			Запрос.УстановитьПараметр("Счет_2811", Счет2811);
			Запрос.УстановитьПараметр("Период", Новый Граница (ПроводкаХозрасчетного.Период, ВидГраницы.Включая));
			
			РезультатЗапроса = Запрос.Выполнить();
			//ВнешниеОбработки.Создать("I:\EZ\Запросник2_0.epf").ОтладитьЗапрос(Запрос);
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				лНоваяСтрока = тзОстатки2811.Добавить();
				лНоваяСтрока.Период = ПроводкаХозрасчетного.Период;
				лНоваяСтрока.КоличествоНакоплено = 0;
				лНоваяСтрока.СуммаНакоплено = 0;
				ЗаполнитьЗначенияСвойств(лНоваяСтрока,ВыборкаДетальныеЗаписи);
			КонецЦикла;	
			лНайденныеСтроки = тзОстатки2811.НайтиСтроки(Новый Структура("Партия,Номенклатура,Склад,Период",
		 ПроводкаХозрасчетного.СубконтоКт.Партии,ПроводкаХозрасчетного.СубконтоКт.Номенклатура,ПроводкаХозрасчетного.СубконтоКт.Склады,ПроводкаХозрасчетного.Период));
			
		КонецЕсли;	
			
		Для	каждого ВыборкаДетальныеЗаписи Из лНайденныеСтроки Цикл
			
			Если ВыборкаДетальныеЗаписи.Сумма = 0  Или ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
				Продолжить
			КонецЕсли;
			
			НоваяПроводка = Движения.Хозрасчетный.Добавить();		
		
			// Заполним все свойства (кроме субконто):
			ЗаполнитьЗначенияСвойств(НоваяПроводка, ПроводкаХозрасчетного);
			
			Если СтруктураШапкиДокумента.ВидДокумента = "ПеремещениеТоваров" 
				или СтруктураШапкиДокумента.ВидДокумента = "КомплектацияНоменклатуры"  Тогда 
				НоваяПроводка.СчетДт = ВыборкаДетальныеЗаписи.Счет;
			КонецЕсли; 
			
			// Субконто ДТ
			Для каждого Субконто Из ПроводкаХозрасчетного.СчетДт.ВидыСубконто  Цикл
				
				ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(НоваяПроводка.СчетДт,
			   					  НоваяПроводка.СубконтоДт,
								  Субконто.ВидСубконто, 
								  ПроводкаХозрасчетного.СубконтоДт[Субконто.ВидСубконто]);
				
			
			КонецЦикла;

			// Субконто КТ
			Для каждого Субконто Из ПроводкаХозрасчетного.СчетКт.ВидыСубконто  Цикл
				
				ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(НоваяПроводка.СчетКт,
			   					  НоваяПроводка.СубконтоКт,
								  Субконто.ВидСубконто, 
								  ПроводкаХозрасчетного.СубконтоКт[Субконто.ВидСубконто]);
				
			
			КонецЦикла;
							  
			НоваяПроводка.СчетКт = ВыборкаДетальныеЗаписи.Счет;
			
			НоваяПроводка.Сумма = ВыборкаДетальныеЗаписи.Сумма / ВыборкаДетальныеЗаписи.Количество * ПроводкаХозрасчетного.КоличествоКт;
			
			ВыборкаДетальныеЗаписи.КоличествоНакоплено = ВыборкаДетальныеЗаписи.КоличествоНакоплено + ПроводкаХозрасчетного.КоличествоКт;
			ВыборкаДетальныеЗаписи.СуммаНакоплено = ВыборкаДетальныеЗаписи.СуммаНакоплено + НоваяПроводка.Сумма;
						
			НоваяПроводка.КоличествоКт = 0;
			
			НоваяПроводка.КоличествоДт = 0;
			
		
			// + IvanSidoruk 11.11.2020
			//Если ВыборкаДетальныеЗаписи.Счет = Счет2812 Тогда 
			//	НоваяПроводка.Содержание = "Списание акциза"
			//ИначеЕсли ВыборкаДетальныеЗаписи.Счет = Счет2813 Тогда 
			//	НоваяПроводка.Содержание = "Списание пошлины"
			//ИначеЕсли ВыборкаДетальныеЗаписи.Счет = Счет2814 Тогда 
			//	НоваяПроводка.Содержание = "Списание хранения"
			//ИначеЕсли ВыборкаДетальныеЗаписи.Счет = Счет2815 Тогда 
			//	НоваяПроводка.Содержание = "Списание транспорта"
			//	// А_Карпчук ( 03.05.2019
			//ИначеЕсли ВыборкаДетальныеЗаписи.Счет = Счет2816 Тогда 
			//	НоваяПроводка.Содержание = "Списание страхование"
			//ИначеЕсли ВыборкаДетальныеЗаписи.Счет = Счет2817 Тогда 
			//	НоваяПроводка.Содержание = "Списание охрана"
			//// + IvanSidoruk 11.11.2020
			//ИначеЕсли ВыборкаДетальныеЗаписи.Счет = Счет2818 Тогда 
			//	НоваяПроводка.Содержание = "Списание Маржа"
			//// - IvanSidoruk 11.11.2020
			//	// А_Карпчук )
			//КонецЕсли;
			//ТекСодержаниеПроводки = "";
			ТекСодержаниеПроводки = Разработка.ПолучитьСодержениеПроводоки(ТаблицаСчетовДопРАсходов,ВыборкаДетальныеЗаписи.Счет);
			
			НоваяПроводка.Содержание = ТекСодержаниеПроводки;
			// - IvanSidoruk 11.11.2020
			
			
			// + IvanSidoruk 18.08.2020
			Если ПисатьПродажиСебестоимостьПоПроводкам = Истина  И   ПишетПродажиСебестоимость = Истина Тогда 
				
					ТекНоменклатурныеПозицииСебстом	= НоваяПроводка.СубконтоКт.НоменклатурныеПозиции;
					ТекХарактеристикиСебест				 	= ?(ЗначениеЗаполнено(ТекНоменклатурныеПозицииСебстом),ТекНоменклатурныеПозицииСебстом.ХарактеристикаНоменклатуры,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
				
				 	//Добавим себестоимость в сущестующие строки себестоимости
					СтруктураПоискаСебестоимостиПродаж = Новый Структура;
					СтруктураПоискаСебестоимостиПродаж.Вставить("Номенклатура",НоваяПроводка.СубконтоКт.Номенклатура);
					СтруктураПоискаСебестоимостиПродаж.Вставить("ДокументОприходования",НоваяПроводка.СубконтоКт.Партии);
					СтруктураПоискаСебестоимостиПродаж.Вставить("ХарактеристикаНоменклатуры",ТекХарактеристикиСебест);
					
					
					МассивСтрокПродажиСебестоимости = ТаблицаПродажиСебестоимостьИсходная.найтиСтроки(СтруктураПоискаСебестоимостиПродаж);
					
					СтавкаНДС = ?(НоваяПроводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая, Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.НДС0);
					
					ТекСуммаНДССебест = УчетНДС.РассчитатьСуммуНДС(НоваяПроводка.Сумма,
						                                       Истина, Ложь,
						                                       УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС));
					
					
					Если МассивСтрокПродажиСебестоимости.Количество() = 0 Тогда 
						
												
						НоваяСтрокаПродажиСебестоимость  = ТаблицаПродажиСебестоимостьИсходная.Добавить();
						НоваяСтрокаПродажиСебестоимость.Период = ПроводкаХозрасчетного.Период;
						НоваяСтрокаПродажиСебестоимость.Активность = Истина;
						НоваяСтрокаПродажиСебестоимость.Регистратор = СтруктураШапкиДокумента.Ссылка;
						НоваяСтрокаПродажиСебестоимость.Номенклатура  = НоваяПроводка.СубконтоКт.Номенклатура;
						НоваяСтрокаПродажиСебестоимость.ХарактеристикаНоменклатуры = 
						НоваяСтрокаПродажиСебестоимость.ДокументОприходования 		= НоваяПроводка.СубконтоКт.Партии;
						НоваяСтрокаПродажиСебестоимость.Количество 		 					= НоваяПроводка.КоличествоКт;
						НоваяСтрокаПродажиСебестоимость.Стоимость 		 					= НоваяПроводка.Сумма;					
						НоваяСтрокаПродажиСебестоимость.НДС										= ТекСуммаНДССебест; 
						
						//Рекви
						НоваяСтрокаПродажиСебестоимость.Проект						= ТекПроектСебестоимость;
						НоваяСтрокаПродажиСебестоимость.Подразделение 			= ТекПодразделениеСебестоимость;
						НоваяСтрокаПродажиСебестоимость.ЗаказПокупателя 		= ТекСделкаСебестоимость;
						
															   
					Иначе 
						
						Если МассивСтрокПродажиСебестоимости.Количество() = 1 Тогда 
						    ИсходнаяСтрока = МассивСтрокПродажиСебестоимости[0];
							
						    ИсходнаяСтрока.Стоимость = ИсходнаяСтрока.Стоимость  + НоваяПроводка.Сумма; 
							ИсходнаяСтрока.НДС			= ИсходнаяСтрока.НДС 			+ ТекСуммаНДССебест; 						
						Иначе 
							//распределим стоимость по количеству
							ИтоговоеКоличество  = 0;
							
							Для Каждого СтркоаТЧСебестоимостиПродаж из МассивСтрокПродажиСебестоимости Цикл 
								ИтоговоеКоличество = ИтоговоеКоличество  + СтркоаТЧСебестоимостиПродаж.Количество;
							КонецЦикла;
							
							ТекПогрешностьСебестПродаж = 0;
							ТекСоотвествиеПогрешностейСебесПродаж = Новый Соответствие;
							ТекПогрешностьСебестПродажНДС = 0;
							ТекСоотвествиеПогрешностейСебесПродажНДС = Новый Соответствие;
							Для Каждого СтркоаТЧСебестоимостиПродаж из МассивСтрокПродажиСебестоимости Цикл 
								
								//ИсходнаяСтрока = МассивСтрокПродажиСебестоимости[0];
								Если ЗначениеЗаполнено(ИтоговоеКоличество) Тогда 								
									К =СтркоаТЧСебестоимостиПродаж.Количество/ИтоговоеКоличество; 
								Иначе 
									К = 1/ МассивСтрокПродажиСебестоимости.Количество();
								КонецЕсли;
								ТекСуммаРаспред = (НоваяПроводка.Сумма) *(К);
								ТекСуммаРаспред = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСуммаРаспред,2,ТекПогрешностьСебестПродаж ,ТекСоотвествиеПогрешностейСебесПродаж);
								
								ТекСуммаРаспредНДС = (ТекСуммаНДССебест) *(К);
								ТекСуммаРаспредНДС = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСуммаРаспредНДС,2,ТекПогрешностьСебестПродаж ,ТекСоотвествиеПогрешностейСебесПродаж);
								
								//СтркоаТЧСебестоимостиПродаж.Стоимость 	= ИсходнаяСтрока.Стоимость  + ТекСуммаРаспред; 
								//СтркоаТЧСебестоимостиПродаж.НДС			= ИсходнаяСтрока.НДС 		+ ТекСуммаРаспредНДС; 						
								
								СтркоаТЧСебестоимостиПродаж.Стоимость 	= СтркоаТЧСебестоимостиПродаж.Стоимость  + ТекСуммаРаспред; 
								СтркоаТЧСебестоимостиПродаж.НДС			= СтркоаТЧСебестоимостиПродаж.НДС 		+ ТекСуммаРаспредНДС; 						
								
								
							КонецЦикла;
								
							
						КонецЕсли;
					КонецЕсли;
			КонецЕсли;
			// - IvanSidoruk 18.08.2020
			
		КонецЦикла;
			
	КонецЦикла;	
	
	// коррекция погрешности округления
	Для каждого Строка Из тзОстатки2811 Цикл
		Если Строка.Количество = Строка.КоличествоНакоплено И Строка.Сумма <> Строка.СуммаНакоплено Тогда
			Для каждого Движение Из Движения.Хозрасчетный Цикл
				Если Движение.СчетКт = Строка.Счет И Движение.СубконтоКт.Партии = Строка.Партия И Движение.СубконтоКт.Номенклатура = Строка.Номенклатура 
					 И Движение.СубконтоКт.Склады = Строка.Склад Тогда
					Движение.Сумма = Движение.Сумма + (Строка.Сумма - Строка.СуммаНакоплено);
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла; 
	
	
	Если ПисатьПродажиСебестоимостьПоПроводкам = Истина  И   ПишетПродажиСебестоимость = Истина Тогда 
		Движения.ПродажиСебестоимость.Загрузить(ТаблицаПродажиСебестоимостьИсходная);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоАкцизуПошлинеХранениюТранспортуСтараяВерсия(СтруктураШапкиДокумента, Движения) Экспорт 
	
	// А_Заверуха 12/07/16 **** It4b 2016***** 
	//Если Не СтруктураШапкиДокумента.Организация.А_УправленческийУчет Тогда
	//	Возврат
	//КонецЕсли;
	// А_Заверуха
	
	КоличествоПроводок = Движения.Хозрасчетный.Количество();
	
	Для Сч = 0 По КоличествоПроводок - 1 Цикл
		
		ПроводкаХозрасчетного = Движения.Хозрасчетный[Сч];
		
		Если ПроводкаХозрасчетного.СчетКт <> ПланыСчетов.Хозрасчетный.НайтиПоКоду("2811") Тогда
			Продолжить
		КонецЕсли;
		
		//Получение данных по акцизу, пошлине, хранению и транспорту
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
			|	ХозрасчетныйОстатки.Субконто2 КАК Партия,
			|	ХозрасчетныйОстатки.Субконто3 КАК Склад,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество
			|ПОМЕСТИТЬ Вт_ОстаткиКоличество
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Период,
			|			Счет = &Счет_2811,
			|			&МассивСубконто,
			|			Субконто1 = &СубконтоДт1
			|				И Субконто2 = &СубконтоДт2
			|				И Субконто3 = &СубконтоДт3) КАК ХозрасчетныйОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ХозрасчетныйОстатки.Счет,
			|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
			|	ХозрасчетныйОстатки.Субконто2 КАК Партия,
			|	ХозрасчетныйОстатки.Субконто3 КАК Склад,
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
			|ПОМЕСТИТЬ Вт_ОстаткиСумма
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Период,
			|			Счет В (&МассивСчетов),
			|			&МассивСубконто,
			|			Субконто1 = &СубконтоДт1
			|				И Субконто2 = &СубконтоДт2
			|				И Субконто3 = &СубконтоДт3) КАК ХозрасчетныйОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Вт_ОстаткиСумма.Счет,
			|	Вт_ОстаткиСумма.Номенклатура,
			|	Вт_ОстаткиСумма.Партия,
			|	Вт_ОстаткиСумма.Склад,
			|	Вт_ОстаткиСумма.Сумма,
			|	ЕСТЬNULL(Вт_ОстаткиКоличество.Количество, 0) КАК Количество
			|ИЗ
			|	Вт_ОстаткиСумма КАК Вт_ОстаткиСумма
			|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОстаткиКоличество КАК Вт_ОстаткиКоличество
			|		ПО Вт_ОстаткиСумма.Номенклатура = Вт_ОстаткиКоличество.Номенклатура
			|			И Вт_ОстаткиСумма.Партия = Вт_ОстаткиКоличество.Партия
			|			И Вт_ОстаткиСумма.Склад = Вт_ОстаткиКоличество.Склад";
			
			
		Запрос.УстановитьПараметр("СубконтоДт1", ПроводкаХозрасчетного.СубконтоКт.Номенклатура);
		Запрос.УстановитьПараметр("СубконтоДт2", ПроводкаХозрасчетного.СубконтоКт.Партии);
		Запрос.УстановитьПараметр("СубконтоДт3", ПроводкаХозрасчетного.СубконтоКт.Склады);		
		Запрос.УстановитьПараметр("Счет_2811", ПланыСчетов.Хозрасчетный.НайтиПоКоду("2811"));
		Запрос.УстановитьПараметр("Период", Новый Граница (ПроводкаХозрасчетного.Период, ВидГраницы.Включая));
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2812"));
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2813"));
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2814"));
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2815"));
		Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
		
		// А_Заверуха 12/07/16 **** It4b 2016***** 
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
		Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
		// А_Заверуха
		
		РезультатЗапроса = Запрос.Выполнить();
		//ВнешниеОбработки.Создать("I:\EZ\Запросник2_0.epf").ОтладитьЗапрос(Запрос);
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Сумма = 0  Или ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
				Продолжить
			КонецЕсли;
			
			НоваяПроводка = Движения.Хозрасчетный.Добавить();		
		
			// Заполним все свойства (кроме субконто):
			ЗаполнитьЗначенияСвойств(НоваяПроводка, ПроводкаХозрасчетного);
			
			Если СтруктураШапкиДокумента.ВидДокумента = "ПеремещениеТоваров" Тогда 
				НоваяПроводка.СчетДт = ВыборкаДетальныеЗаписи.Счет;
			КонецЕсли; 
			
			// Субконто ДТ
			Для каждого Субконто Из ПроводкаХозрасчетного.СчетДт.ВидыСубконто  Цикл
				
				ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(НоваяПроводка.СчетДт,
			   					  НоваяПроводка.СубконтоДт,
								  Субконто.ВидСубконто, 
								  ПроводкаХозрасчетного.СубконтоДт[Субконто.ВидСубконто]);
				
			
			КонецЦикла;

			// Субконто КТ
			Для каждого Субконто Из ПроводкаХозрасчетного.СчетКт.ВидыСубконто  Цикл
				
				ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(НоваяПроводка.СчетКт,
			   					  НоваяПроводка.СубконтоКт,
								  Субконто.ВидСубконто, 
								  ПроводкаХозрасчетного.СубконтоКт[Субконто.ВидСубконто]);
				
			
			КонецЦикла;
							  
			НоваяПроводка.СчетКт = ВыборкаДетальныеЗаписи.Счет;
			
			НоваяПроводка.Сумма = ВыборкаДетальныеЗаписи.Сумма / ВыборкаДетальныеЗаписи.Количество * ПроводкаХозрасчетного.КоличествоКт;
			
						
			// А_Заверуха 12/07/16 **** It4b 2016***** 
			НоваяПроводка.КоличествоКт = 0;
			// А_Заверуха
			
			НоваяПроводка.КоличествоДт = 0;
			
			Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2812") Тогда 
				НоваяПроводка.Содержание = "Списание акциза"
			ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2813") Тогда 
				НоваяПроводка.Содержание = "Списание пошлины"
			ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2814") Тогда 
				НоваяПроводка.Содержание = "Списание хранения"
			ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2815") Тогда 
				НоваяПроводка.Содержание = "Списание транспорта"
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;	
	
КонецПроцедуры

Процедура УстановитьВремяДокументов(МетаданныеДокумента, ДокументОбъект, РежимЗаписи, РежимПроведения) Экспорт 	// +++ А_ИТ4Б Ересько 2016-08-05 {} 
	
	//Время устанавливаем только при первом проведении документа
	Если Не (РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ДокументОбъект.Проведен) Тогда 
		// А_Вячеслав(08.01.2019 
		Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("А_ЭтоЗеркальныйРТУДокумент") 
			И НЕ МетаданныеДокумента.Имя = "ПоступлениеТоваровУслуг"  // А_Карпчук ( 21.01.2019 - в ПТУ всегда устанавливаем время)
			И НЕ МетаданныеДокумента.Имя = "ПоступлениеДопРасходов"  // А_Карпчук ( 29.01.2019 - в Пост. доп.расх всегда устанавливаем время)
			Тогда
			Возврат;
		КонецЕсли;
		// А_Вячеслав) 
	КонецЕсли;
	
	//Для того чтобы установить произвольное время проведения - нужно установить Неопреративное проведение
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	
	// + IvanSidoruk 22.01.2019
	ИмяДока = МетаданныеДокумента.Имя; 
	// - IvanSidoruk 22.01.2019
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеВремениДокументам.Время
		|ИЗ
		|	РегистрСведений.А_СоответствиеВремениДокументам КАК А_СоответствиеВремениДокументам
		|ГДЕ
		|	А_СоответствиеВремениДокументам.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", ИмяДока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 	ВыборкаДетальныеЗаписи.Следующий();
		
		ДатаДокументаСУчетомЧасов = Дата(Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + " " + Прав(ВыборкаДетальныеЗаписи.Время, 8));
		
		//Добавление секунды пока нужно только для док. ПоступлениеТоваровУслуг 
		Если ИмяДока = "ПоступлениеТоваровУслуг" 			
			Или  ИмяДока = "ОтчетОРозничныхПродажах" 
			Или  ИмяДока = "ОтчетПроизводстваЗаСмену" 
			Или  ИмяДока = "ПеремещениеТоваров" 
			Или  ИмяДока = "ВозвратТоваровОтПокупателя"
			Или  ИмяДока = "ВозвратТоваровПоставщику"
			Или  ИмяДока = "ВводВЭксплуатациюОС"
			Или  ИмяДока = "КомплектацияНоменклатуры"
			Или  ИмяДока = "ОприходованиеТоваров"
			Или  ИмяДока = "СписаниеТоваров"
			Или  ИмяДока = "ТребованиеНакладная"

			Тогда 
		
		
			//Поиск последнего документа проведенного в данном часе
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	МАКСИМУМ(ОбрабатываемыйДокумент.Дата) КАК Дата
				|ИЗ
				|	Документ." + МетаданныеДокумента.Имя + " КАК ОбрабатываемыйДокумент
				|ГДЕ
				|	НАЧАЛОПЕРИОДА(ОбрабатываемыйДокумент.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
				|	И ЧАС(ОбрабатываемыйДокумент.Дата) = ЧАС(&Дата)
				|	И ОбрабатываемыйДокумент.Ссылка <> &ТекДокумент
				|
				|ИМЕЮЩИЕ
				|	НЕ МАКСИМУМ(ОбрабатываемыйДокумент.Дата) ЕСТЬ NULL ";
			
			// А_Вячеслав(21.01.2019 если документ с услугами
			 Если ИмяДока = "ПоступлениеТоваровУслуг" и ДокументОбъект.Услуги.Количество()>0 И ДокументОбъект.Товары.Количество()=0 Тогда
				ДатаДокументаСУчетомЧасов = Дата(Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + " 19:00:00");
			КонецЕсли;
			// А_Вячеслав) 
			Запрос.УстановитьПараметр("Дата", ДатаДокументаСУчетомЧасов);
			Запрос.УстановитьПараметр("ТекДокумент", ДокументОбъект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда 
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВыборкаДетальныеЗаписи.Следующий();
				
				// А_Вячеслав(21.01.2019 
				//ДатаДокументаСУчетомЧасов = ВыборкаДетальныеЗаписи.Дата + 1;
				ДатаДокументаСУчетомЧасов = ВыборкаДетальныеЗаписи.Дата + 2;
				// А_Вячеслав) 
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДокументОбъект.Дата = ДатаДокументаСУчетомЧасов
		
	КонецЕсли;	
	
КонецПроцедуры 

// Служебная функция - заполняет ПроводкаНовая теми же данными, что содержатся в проводке ПроводкаИсходная
//
Процедура СкопироватьПроводкуРегистраБухгалтерии(ПроводкаНовая, ПроводкаИсходная) Экспорт	// +++ А_ИТ4Б Ересько 2017-07-14 {}

	// Заполним все свойства (кроме субконто):
	ЗаполнитьЗначенияСвойств(ПроводкаНовая, ПроводкаИсходная);
	
	// Субконто ДТ
	Для каждого Субконто Из ПроводкаИсходная.СчетДт.ВидыСубконто  Цикл
		
		ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(ПроводкаНовая.СчетДт,
	   					  ПроводкаНовая.СубконтоДт,
						  Субконто.ВидСубконто, 
						  ПроводкаИсходная.СубконтоДт[Субконто.ВидСубконто]);
		
	
	КонецЦикла;

	// Субконто КТ
	Для каждого Субконто Из ПроводкаИсходная.СчетКт.ВидыСубконто  Цикл
		
		ОбщегоНазначения.УстановитьСубконтоПоВидуСубконто(ПроводкаНовая.СчетКт,
	   					  ПроводкаНовая.СубконтоКт,
						  Субконто.ВидСубконто, 
						  ПроводкаИсходная.СубконтоКт[Субконто.ВидСубконто]);
		
	
	КонецЦикла;
	
КонецПроцедуры

// А_Заверуха 14/07/16 **** It4b 2016***** 
Процедура  КорректировкаСумм(ТабДвижений, Знач Дата, лСсылкаНаРегистратор) Экспорт 
	
	// А_Карпчук ( 24.09.2018
	// добавлен параметр лСсылкаНаРегистратор
	// А_Карпчук )
	
	ТабХозрасчетный = ТабДвижений.Скопировать();
	
	
	ТабХозрасчетный.Свернуть("СчетКТ, СубконтоКт1, СубконтоКт2, СубконтоКт3", "Сумма");
	ТабХозрасчетный.Колонки.Добавить("Разница");
	
	МассивНоменклатуры = Новый Массив;
	МассивСкладов = Новый Массив;
	МассивПартий = Новый Массив;
	
	Для каждого СтрокаДвиж из ТабДвижений Цикл 
		Если СтрокаДвиж.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2812") 
			ИЛИ СтрокаДвиж.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2813") 
			ИЛИ СтрокаДвиж.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2814") 
			ИЛИ СтрокаДвиж.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2815") Тогда 
			
			Если СтрокаДвиж.ВидСубконтоКт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда 
				МассивНоменклатуры.Добавить(СтрокаДвиж.СубконтоКт1);
			ИначеЕсли СтрокаДвиж.ВидСубконтоКт2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда 
				МассивНоменклатуры.Добавить(СтрокаДвиж.СубконтоКт2);
			ИначеЕсли СтрокаДвиж.ВидСубконтоКт3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда 
				МассивНоменклатуры.Добавить(СтрокаДвиж.СубконтоКт3);
			КонецЕсли;	
			
			Если СтрокаДвиж.ВидСубконтоКт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии Тогда 
				МассивПартий.Добавить(СтрокаДвиж.СубконтоКт1);
			ИначеЕсли СтрокаДвиж.ВидСубконтоКт2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии Тогда 
				МассивПартий.Добавить(СтрокаДвиж.СубконтоКт2);
			ИначеЕсли СтрокаДвиж.ВидСубконтоКт3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии Тогда 
				МассивПартий.Добавить(СтрокаДвиж.СубконтоКт3);
			КонецЕсли;	
			
			Если СтрокаДвиж.ВидСубконтоКт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады Тогда 
				МассивСкладов.Добавить(СтрокаДвиж.СубконтоКт1);
			ИначеЕсли СтрокаДвиж.ВидСубконтоКт2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады Тогда 
				МассивСкладов.Добавить(СтрокаДвиж.СубконтоКт2);
			ИначеЕсли СтрокаДвиж.ВидСубконтоКт3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады Тогда 
				МассивСкладов.Добавить(СтрокаДвиж.СубконтоКт3);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	// А_Карпчук ( 24.09.2018 - если есть несколько реализаций по одной партии в одну секунду, то к дате добавим еще одну секунду
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Разрешенные
	|	ХозрасчетныйОстатки.Регистратор,
	|	ХозрасчетныйОстатки.Регистратор.Дата
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&Дата,
	|			&Дата,
	|			Регистратор,
	|			Счет В (&МассивСчетов),
	|			&МассивСубконто,
	|			Субконто1 В (&Субконто1)
	|				И Субконто2 В (&Субконто2)
	|				И Субконто3 В (&Субконто3),
	|			,
	|			) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Регистратор,
	|	ХозрасчетныйОстатки.Регистратор.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Ссылка,
	|	&Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Регистратор,
	|	ВТ_Документы.РегистраторДата
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Регистратор,
	|	ВТ_Документы.РегистраторДата";
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2812"));
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2813"));
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2814"));
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("2815"));
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("МассивСубконто",МассивСубконто);
	
	Запрос.УстановитьПараметр("Субконто1", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Субконто2", МассивПартий);
	Запрос.УстановитьПараметр("Субконто3", МассивСкладов);
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", лСсылкаНаРегистратор);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Ном = 1; КоличествоВсегоДокументов = ВыборкаДетальныеЗаписи.Количество();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Ном = КоличествоВсегоДокументов Тогда 
			Если ВыборкаДетальныеЗаписи.Регистратор = лСсылкаНаРегистратор Тогда
				Дата = Дата + 1;
				Прервать;
			КонецЕсли;
		Иначе
			Если ВыборкаДетальныеЗаписи.Регистратор = лСсылкаНаРегистратор Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		Ном = Ном + 1;
	КонецЦикла;
	// А_Карпчук )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ХозрасчетныйОстатки.Субконто3
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Дата,
	|			Счет В (&МассивСчетов),
	|			&МассивСубконто,
	|			Субконто1 В (&Субконто1)
	|				И Субконто2 В (&Субконто2)
	|				И Субконто3 В (&Субконто3)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ХозрасчетныйОстатки.Субконто3";
	
	Запрос.УстановитьПараметр("МассивСубконто",МассивСубконто);
	
	Запрос.УстановитьПараметр("Субконто1", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Субконто2", МассивПартий);
	Запрос.УстановитьПараметр("Субконто3", МассивСкладов);
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Массив =  ТабХозрасчетный.НайтиСтроки(Новый Структура("СчетКТ, СубконтоКт1, СубконтоКт2, СубконтоКт3",
		ВыборкаДетальныеЗаписи.Счет, ВыборкаДетальныеЗаписи.Субконто2, ВыборкаДетальныеЗаписи.Субконто1,ВыборкаДетальныеЗаписи.Субконто3));
		Если Не Массив.Количество() = 0 Тогда 
			Для Каждого Строка Из Массив Цикл 
				Разница = Строка.Сумма - ВыборкаДетальныеЗаписи.СуммаОстаток;
				РазницаПроверка = ?(Разница>0,Разница,-Разница);
				
				Если РазницаПроверка <= 0.1 И Не Разница = 0 Тогда 
					Строка.Разница = Разница;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаХоз из ТабХозрасчетный Цикл 
		Если Не СтрокаХоз.Разница = 0 И Не СтрокаХоз.Разница = Неопределено Тогда 
			Массив = ТабДвижений.НайтиСтроки(Новый Структура("СчетКТ, СубконтоКт1, СубконтоКт2, СубконтоКт3",
			СтрокаХоз.СчетКТ, СтрокаХоз.СубконтоКТ1, СтрокаХоз.СубконтоКТ2,СтрокаХоз.СубконтоКТ3));
			
			Если Не Массив.Количество() = 0 Тогда 
				Массив[0].Сумма = Массив[0].Сумма - СтрокаХоз.Разница;													 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
		

КонецПроцедуры

// Процедура выполняет заполнение табличной части по перемещению товаров.
// Заполним табличные части по документу основанию (Перемещению товаров);
//
// Параметры:
//  ПоступлениеДопРасходов - документ Поступление доп. расходов
//  Перемещение - ссылка на документ основание (Перемещение товаров).
//  ТабЧастьТовары - табличная часть документа Поступления доп. расходов
//  ИзПроведения - заполнение может происходить с внешней обработки заполнения ТЧ или с обработки проведения
//
Процедура ЗаполнитьПоступлениеДопРасходовПоПеремещению(ПоступлениеДопРасходов = Неопределено, Перемещение, ТабЧастьТовары, ИзПроведения = Ложь) Экспорт // +++ А_ИТ4Б Ересько 2016-08-08 {} 
	
	Если ИзПроведения И (Не ЗначениеЗаполнено(Перемещение)
		Или ТипЗнч(Перемещение) <> Тип("ДокументСсылка.ПеремещениеТоваров")
		Или ТабЧастьТовары.Количество() = 0) Тогда 
		
		Возврат
		
	КонецЕсли;
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Перемещение", Перемещение);
	Запрос.УстановитьПараметр("СчетТоваров", ПланыСчетов.Хозрасчетный.НайтиПоКоду("2811"));

	Запрос.Текст ="ВЫБРАТЬ
	              |	ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Номенклатура,
	              |	ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК ПТУ,
	              |	ХозрасчетныйДвиженияССубконто.Сумма,
	              |	ХозрасчетныйДвиженияССубконто.КоличествоДт КАК Количество,
	              |	ХозрасчетныйДвиженияССубконто.СубконтоДт1.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	              |	ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетУчетаБУ,
	              |	ХозрасчетныйДвиженияССубконто.НалоговоеНазначениеДт КАК НалоговоеНазначение
	              |ИЗ
	              |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	              |			,
	              |			,
	              |			СчетДт = &СчетТоваров
	              |				И СчетКт = &СчетТоваров,
	              |			,
	              |			) КАК ХозрасчетныйДвиженияССубконто
	              |ГДЕ
	              |	ХозрасчетныйДвиженияССубконто.Регистратор = &Перемещение";

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаРезультатЗапроса = РезультатЗапроса.Выгрузить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если ИзПроведения Тогда
			
		ПоступлениеДопРасходов.А_Тариф = ?(ТабЧастьТовары[0].А_Тариф = 0, ПоступлениеДопРасходов.А_Тариф, ТабЧастьТовары[0].А_Тариф);
		СуммаДопРасходов = ТабЧастьТовары.Итог("Сумма");
		ВсегоКоличество =  ТаблицаРезультатЗапроса.Итог("Количество");
		ТабЧастьТовары.Очистить();			
		
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = ТабЧастьТовары.Добавить();
			
		СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество                 = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент                = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		СтрокаТабличнойЧасти.ДокументПартии             = Выборка.ПТУ;	    
		СтрокаТабличнойЧасти.СуммаТовара 				= Выборка.Сумма;
		СтрокаТабличнойЧасти.СчетУчетаБУ  				= Выборка.СчетУчетаБУ;
		СтрокаТабличнойЧасти.НалоговоеНазначение 		= Выборка.НалоговоеНазначение;
		СтрокаТабличнойЧасти.А_Склад 					= Перемещение.СкладПолучатель;

		Если ИзПроведения Тогда
		
			Если ПоступлениеДопРасходов.А_Тариф = 0 Тогда 
					
				СтрокаТабличнойЧасти.Сумма 		= СтрокаТабличнойЧасти.Количество / ВсегоКоличество * СуммаДопРасходов;
				СтрокаТабличнойЧасти.СуммаНДС   = СтрокаТабличнойЧасти.Сумма / 6;	
					
			Иначе 
				
				СтрокаТабличнойЧасти.Сумма 		= СтрокаТабличнойЧасти.Количество * ПоступлениеДопРасходов.А_Тариф;
				СтрокаТабличнойЧасти.СуммаНДС   = СтрокаТабличнойЧасти.Сумма / 6;
				
			КонецЕсли;
			
		КонецЕсли;
										   
	КонецЦикла;
	
КонецПроцедуры
 

// +++ А_ИТ4Б Ересько 2016-07-27 {Закомментировал} 
//А_Клещев
//Функция НайтиВалютуУУ(Организация,ВидВзаиморасчетов,Валюта) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Валюты.Ссылка КАК Валюта
//	               |ИЗ
//	               |	Справочник.Валюты КАК Валюты
//	               |ГДЕ
//	               |	Валюты.Организация = &Организация
//	               |	И Валюты.ВидВзаиморасчетов = &ВидВзаиморасчетов
//	               |	И Валюты.Наименование ПОДОБНО &Наименование";
//	
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("ВидВзаиморасчетов", ВидВзаиморасчетов);
//	Запрос.УстановитьПараметр("Наименование", "%"+СокрЛП(Валюта.Наименование)+"%");

//	
//	Результат = Запрос.Выполнить();
//	Если Результат.Пустой() Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Выборка = Результат.Выбрать();
//	Выборка.Следующий();
//	
//	Возврат Выборка.Валюта;

//КонецФункции
//А_Клещев
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// А_Заверуха 23/08/16 **** It4b 2016***** 
Процедура А_ЗаблокироватьДокументы(Период) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументБУ,
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументУУ
		|ИЗ
		|	РегистрСведений.А_СоответствиеДокуметов_БУ_УУ КАК А_СоответствиеДокуметов_БУ_УУ
		|ГДЕ
		|	А_СоответствиеДокуметов_БУ_УУ.ДокументУУ.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И А_СоответствиеДокуметов_БУ_УУ.Заблокирован = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Период));
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.А_СоответствиеДокуметов_БУ_УУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ВыборкаДетальныеЗаписи.ДокументБУ);
		НаборЗаписей.Отбор.ДокументУУ.Установить(ВыборкаДетальныеЗаписи.ДокументУУ);
		НаборЗаписей.Прочитать();
		
		Для Каждого Строка Из НаборЗаписей Цикл
			Строка.Заблокирован = Истина;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	
	
КонецПроцедуры

// А_Заверуха 25/08/16 **** It4b 2016***** 
Процедура А_УстановитьНаличиеОтсутствиеДокументов(Документ=Неопределено,Переключить=Ложь,Накладная=Неопределено, Доверенность=Неопределено, Заявка=Неопределено,ТТН=Неопределено)Экспорт 
	
	// А_Вячеслав(26.09.2019 
	//НаборЗаписей = РегистрыСведений.А_НаличиеДокументов.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.ДокументСсылка.Установить(Документ);
	//НаборЗаписей.Прочитать();
	//
	//Если НаборЗаписей.Количество() = 0 Тогда 
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.ДокументСсылка 	= Документ;
	//	НоваяЗапись.Доверенность 	= Доверенность;
	//	НоваяЗапись.Заявка 			= Заявка;
	//	НоваяЗапись.Накладная 		= Накладная;
	//Иначе 
	//	Для Каждого Строка Из НаборЗаписей Цикл 
	//		Строка.Доверенность = Доверенность;
	//		Строка.Заявка 		= Заявка;
	//		строка.Накладная 	= Накладная;
	//	КонецЦикла;
	//КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		возврат;
	КонецЕсли; 
	
	лЗапись = РегистрыСведений.А_НаличиеДокументов.СоздатьМенеджерЗаписи();
	лЗапись.ДокументСсылка = Документ;
	лЗапись.Прочитать();
	лЗапись.ДокументСсылка = Документ;
	Если Переключить Тогда
		Если Доверенность = Истина Тогда 
			лЗапись.Доверенность = Не лЗапись.Доверенность;
		КонецЕсли;
		
		Если Заявка = Истина Тогда 
			лЗапись.Заявка = Не лЗапись.Заявка;
		КонецЕсли;
		
		Если Накладная = Истина Тогда 
			лЗапись.Накладная = Не лЗапись.Накладная;
		КонецЕсли;
		Если ТТН = Истина Тогда 
			лЗапись.ТТН = Не лЗапись.ТТН;
		КонецЕсли;
	Иначе
		Если Накладная<>Неопределено Тогда
			лЗапись.Накладная = Накладная;
		КонецЕсли;
		Если Доверенность<>Неопределено Тогда
			лЗапись.Доверенность = Доверенность;
		КонецЕсли;
		Если Заявка<>Неопределено Тогда
			лЗапись.Заявка = Заявка;
		КонецЕсли;
		Если ТТН<>Неопределено Тогда
			лЗапись.ТТН = ТТН;
		КонецЕсли;
	КонецЕсли;
	лЗапись.Записать();
	
КонецПроцедуры

// А_Заверуха 25/08/16 **** It4b 2016***** 
Процедура А_ПолучитьНаличиеДокументов(Документ, Накладная, Доверенность, Заявка,ТТН)Экспорт
	
	НаборЗаписей = РегистрыСведений.А_НаличиеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументСсылка.Установить(Документ);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда 
		Накладная 		= Ложь;
		Доверенность 	= Ложь;
		Заявка 			= Ложь;
		ТТН 			= Ложь;
	Иначе 
		Для Каждого Строка Из НаборЗаписей Цикл 
			Накладная 		= Строка.Накладная;
			Доверенность 	= Строка.Доверенность;
			Заявка	 		= Строка.Заявка;
			ТТН	 		= Строка.ТТН;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// А_Вячеслав(31.10.2016 
Процедура УстановитьЗначениеПоУмолчанию(пИмяЗначения,пЗначение) Экспорт
	
	рс = РегистрыСведений.А_ЗначенияПоУмолчанию.СоздатьМенеджерЗаписи();
	рс.ИмяЗначения = пИмяЗначения;
	рс.Прочитать();
	рс.ИмяЗначения = пИмяЗначения;
	рс.ЗначениеПоУмолчанию = пЗначение;
	рс.Записать();
	
КонецПроцедуры

Функция ПолучитьЗначениеПоУмолчаниюСУстановкой(пИмяЗначения,пЗначениеПоУмолчанию = Неопределено) Экспорт

	Если ПустаяСтрока(пИмяЗначения) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	лЗначение = А_ОбщегоНазначения.ПолучитьЗначениеПоУмолчанию(пИмяЗначения);
	Если лЗначение = Неопределено И НЕ пЗначениеПоУмолчанию = Неопределено Тогда
		Попытка
			лЗначение = пЗначениеПоУмолчанию;
			А_ОбщегоНазначения.УстановитьЗначениеПоУмолчанию(пИмяЗначения,пЗначениеПоУмолчанию);	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Установлено значение по умолчанию: "+пИмяЗначения+" = "+пЗначениеПоУмолчанию;
			Сообщение.Сообщить(); 
		Исключение
		    Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Произошла ошибка при установке значения по умолчанию: "+пИмяЗначения;
			Сообщение.Сообщить(); 
		КонецПопытки; 
	КонецЕсли;	
	Возврат лЗначение;

КонецФункции // ()
 
// А_Вячеслав) 

// А_Заверуха 24/02/17 **** It4b 2016***** 
Процедура А_УстановитьНаличиеОтсутствиеДокументовАктов(Документ, Акт)Экспорт 
	
	НаборЗаписей = РегистрыСведений.А_НаличиеАктов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Документ 	= Документ;
		НоваяЗапись.Акт 		= Акт;
	Иначе 
		Для Каждого Строка Из НаборЗаписей Цикл 
			Строка.Акт = Акт;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// А_Заверуха 24/02/17 **** It4b 2016***** 
Процедура А_ПолучитьДокументы_Акт(Документ, Акт)Экспорт
	
	НаборЗаписей = РегистрыСведений.А_НаличиеАктов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда 
		Акт 		= Ложь;
	Иначе 
		Для Каждого Строка Из НаборЗаписей Цикл 
			Акт 	= Строка.Акт;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСвязанныйСРеализациейДокументПоступления(Источник,СвязанныйДоговор) Экспорт 
	
	// А_Карпчук ( 16.07.2019 - отключаем данный механизм пока
	Возврат;
	// А_Карпчук )
	
	// А_Карпчук ( 31.01.2019
	Если Источник.Дата < Дата(2018,12,01,0,0,0) Тогда
		Возврат;
	КонецЕсли;
	// А_Карпчук )

	Сообщение = Новый СообщениеПользователю;
	
	УпрОрганизация = Источник.Организация.А_УправленческийУчет;
	
	лПТУ = А_ОбщегоНазначенияСервер.ПолучитьСвязанныйДокумент(Источник.Ссылка);
	НовыйДокумент = НЕ ЗначениеЗаполнено(лПТУ);
	Если НовыйДокумент Тогда
		ПТУ_Объект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	Иначе	
		Если ДокументЗаблокирован(лПТУ) Тогда
			Сообщение.Текст = "Документ "+лПТУ+" заблокирован! не перезаполняем.";
			Сообщение.Сообщить(); 
			Возврат;
		КонецЕсли;
		ПТУ_Объект = лПТУ.ПолучитьОбъект();
	КонецЕсли;	
	
	если ложь тогда ПТУ_Объект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент() конецесли;
	
	Если Не НовыйДокумент Тогда
		Если ПТУ_Объект.ПометкаУдаления Тогда 
			ПТУ_Объект.УстановитьПометкуУдаления(Ложь)
		КонецЕсли;
	КонецЕсли;
	
	//Создание и заполнение док. ПТУ
	//ПТУ_Объект.Заполнить(пДокументОснование);
	ЗаполнитьЗначенияСвойств(ПТУ_Объект,Источник,,"Номер,Ссылка");
	
	// А_Вячеслав(03.05.2018 
	ПТУ_Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;		
	ПТУ_Объект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	//ПТУ_Объект.Дата = Источник.Дата;
	//ПТУ_Объект.СуммаВключаетНДС = Ложь;
	ПТУ_Объект.ТекущаяТемпература = Источник.ТекущаяТемпература;
	ПТУ_Объект.СкладОрдер = Источник.Склад;
		
	//ПТУ_Объект.А_АвтоНалив = ВидНалива = Перечисления.А_ВидыНалива.АвтоНалив;
	//ПТУ_Объект.А_ЖДНалив = ВидНалива = Перечисления.А_ВидыНалива.ЖДНалив;
	ПТУ_Объект.ДоговорКонтрагента = СвязанныйДоговор;
	ПТУ_Объект.Организация = СвязанныйДоговор.Организация;
	ПТУ_Объект.Контрагент = СвязанныйДоговор.Владелец;
	
	// Выполняем общие действия для всех документов при изменении Контрагент.
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ПТУ_Объект);
	
	ПТУ_Объект.А_ПоставкаТовараВГрн = Истина; // А_Вячеслав(09.01.2019 нужна для акциза
	ПТУ_Объект.ДоговорКонтрагента = СвязанныйДоговор;
	
	//Действия при изменении договора
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ПТУ_Объект);
	мТекущаяВалютаВзаиморасчетов = ПТУ_Объект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ПТУ_Объект, мТекущаяВалютаВзаиморасчетов, ПТУ_Объект.мВалютаРегламентированногоУчета, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары");
	
	ПТУ_Объект.Сделка = А_ОбщегоНазначенияСервер.ПолучитьСвязанныйДокумент(Источник.Сделка);
	
	//Заполнение счетов шапки
	СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(ПТУ_Объект.Организация, ПТУ_Объект.Контрагент, ПТУ_Объект.ДоговорКонтрагента);
	
	ПТУ_Объект.СчетУчетаРасчетовСКонтрагентом 		= СчетаУчета.СчетРасчетов;
	ПТУ_Объект.СчетУчетаРасчетовПоАвансам     		= СчетаУчета.СчетАвансов;					
	ПТУ_Объект.СчетУчетаРасчетовПоТаре        		= СчетаУчета.СчетУчетаТары;
	ПТУ_Объект.СчетУчетаРасчетовПоТареПоАвансам 	= СчетаУчета.СчетАвансовПоТаре;			
	ПТУ_Объект.СчетУчетаНДС 						= СчетаУчета.СчетУчетаНДСПриобретений;
	ПТУ_Объект.СчетУчетаНДСПодтвержденный  			= СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
	
	ПТУ_Объект.Товары.Очистить();
	ПТУ_Объект.ВозвратнаяТара.Очистить();
	ПТУ_Объект.Услуги.Очистить();
	
	Счет2811 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2811");
	Счет2812 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2812");
	Счет2813 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2813");
	
	партияРТУ = Неопределено;
	ТоварыПартииРТУ = Неопределено;
	лСуммаАкциз = 0;
	лСуммаПошлина = 0;
	
	Для каждого Движ Из Источник.Движения.Хозрасчетный Цикл
		
		Если Движ.СчетКТ = Счет2811 Тогда
			партияРТУ = Движ.СубконтоКт.Партии;
			// А_Карпчук ( 04.04.2019
			//ТоварыПартииРТУ = партияРТУ.товары.выгрузить();
			Если партияРТУ.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
				ТоварыПартииРТУ = партияРТУ.товары.выгрузить();
			ИначеЕсли партияРТУ.Метаданные().ТабличныеЧасти.Найти("Продукция") <> Неопределено Тогда
				ТоварыПартииРТУ = партияРТУ.Продукция.выгрузить();
			КонецЕсли;
			// А_Карпчук )
		ИначеЕсли Движ.СчетКТ = Счет2812 Тогда
			лСуммаАкциз = лСуммаАкциз + Движ.Сумма;
		ИначеЕсли Движ.СчетКТ = Счет2813 Тогда
			лСуммаПошлина = лСуммаПошлина + Движ.Сумма;
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого Строка Из Источник.Товары Цикл
	
		нс = ПТУ_Объект.Товары.добавить();
		ЗаполнитьЗначенияСвойств(нс,Строка);
		
		//При изменении номенклатуры
		// Заполняем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(нс, ПТУ_Объект);

		// Рассчитываем реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(нс, ПТУ_Объект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(нс, ПТУ_Объект);
		//Заполнение счета учета НДС
		нс.А_СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6412");
		
		Если ТоварыПартииРТУ <> Неопределено Тогда
			НацйдСтроки = ТоварыПартииРТУ.найтиСтроки(Новый Структура("Номенклатура",Строка.Номенклатура));
			Если НацйдСтроки.количество()>0 Тогда
				// А_Карпчук ( 04.04.2019
				//нс.А_Сертификат = НацйдСтроки[0].А_Сертификат;
				Если ТоварыПартииРТУ.Колонки.Найти("А_Сертификат") <> Неопределено Тогда
					нс.А_Сертификат = НацйдСтроки[0].А_Сертификат;
				КонецЕсли;
				// А_Карпчук )
				нс.БазоваяПлотность = НацйдСтроки[0].БазоваяПлотность;
				нс.КоэффициентЛитров = НацйдСтроки[0].КоэффициентЛитров;
		    КонецЕсли;
		КонецЕсли; 
		
		нс.А_СуммаАкциза = лСуммаАкциз;
		нс.А_СуммаПошлины = лСуммаПошлина;
	
	КонецЦикла;
	
	Для каждого Строка Из Источник.Услуги Цикл
	
		СтрокаУслуг = ПТУ_Объект.Услуги.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУслуг,Строка);
		
		//Установка типов субконто
		Для Сч = 1 По СтрокаУслуг.СчетЗатрат.ВидыСубконто.Количество() Цикл
			
			ТипСубк = СтрокаУслуг.СчетЗатрат.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения; 
			СтрокаУслуг["Субконто" + Сч] = ТипСубк.ПривестиЗначение(СтрокаУслуг["Субконто" + Сч]);
			
		КонецЦикла;
		
		//Заполнение НалоговоеНазначение
		СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(ПТУ_Объект.Организация, СтрокаУслуг.Номенклатура, Неопределено);
		СтрокаУслуг.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
		
		//Заполнение счета учета НДС
		СтрокаУслуг.А_СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6412");
	КонецЦикла;
		
	Попытка
		ПТУ_Объект.ДополнительныеСвойства.Вставить("А_ЭтоЗеркальныйРТУДокумент",Истина);
		ПТУ_Объект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить(ОписаниеОшибки());
		ПТУ_Объект.Записать(РежимЗаписиДокумента.Запись)
	КонецПопытки;
		
	А_ОбщегоНазначенияСервер.УстановитьСвязанныйДокумент(Источник.Ссылка,ПТУ_Объект.Ссылка);
		
	Сообщить("Создан внутренний документ: """ + ПТУ_Объект.Ссылка + """.");
	
	//По скольку у нас работает механизм трансляции БУ в УУ, в данный момент уже создано РТУ по УУ и ПТУ по УУ
	// Нужно внести эти документы в связь по РС А_СвязьДокументовПоНаливу
	Если ПТУ_Объект.Проведен И УпрОрганизация Тогда 
		
		
		РТУ_БУ = ПолучитьСвязанныйДокументБУ(Источник.Ссылка);
		ПТУ_БУ = А_ОбщегоНазначенияСервер.ПолучитьСвязанныйДокумент(РТУ_БУ.ДокументБУ);
		
		Если ЗначениеЗаполнено(ПТУ_БУ) Тогда 
			
			лРС = РегистрыСведений.А_СоответствиеДокуметов_БУ_УУ.СоздатьНаборЗаписей();
			лРС.Отбор.ДокументУУ.Установить(ПТУ_Объект.Ссылка);
			лРС.Прочитать();
			лРС.Очистить();
			лРС.Записать();
			лРС.Отбор.ДокументУУ.Установить(ПТУ_Объект.Ссылка);
			лРС.Отбор.ДокументБУ.Установить(ПТУ_БУ);
			лРС.Прочитать();
			нс = лРС.Добавить();
			нс.ДокументБУ = ПТУ_БУ;
			нс.ДокументУУ = ПТУ_Объект.Ссылка;
			нс.Заблокирован = Ложь;
			лРС.Записать();
			//ЗаписатьСоответствиеДокументов_БУ_УУ(ПТУ_БУ,ПТУ_Объект.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
