// Текущие курс и кратность валюты документа для расчетов
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;

// Хранят группировочные признаки вида операции
Перем ЕстьРасчетыСКонтрагентами Экспорт;
Перем ЕстьРасчетыПоКредитам Экспорт;
Перем ЕстьРасчетыПоПлатежнымКартам Экспорт;

// Хранит таблицу, использующуюся при проведении документа
Перем ТаблицаПлатежейУпр;

Перем мУдалятьДвижения;

//Определение периода движений документа
Перем ДатаДвижений;

Перем мСтруктураПараметровДенежныхСредств;

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж) Экспорт

	КурсДокумента      = ?(КурсДокумента      = 0, 1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента);

	Если Не СтрокаПлатеж = Неопределено Тогда
		
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);

	КонецЕсли;

КонецПроцедуры // ПроверкаКурсовВалют()

// Возвращает данные необходимые для проводок документа с видом операции постепление средств от ФСС
//
// Вовращаемое значение:
//  таблица с полями ВидРасчета, Сумма, СтатьяРасчетовСФСС
// 
Функция СформироватьЗапросДляПроводокЗаявки() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр( "ССылка" , Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СтатьяРасчетовСФСС,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сумма КАК Результат
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНачислениямЗаСчетФСС КАК ВзаиморасчетыПоНачислениямЗаСчетФСС
	               |		ПО ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка = ВзаиморасчетыПоНачислениямЗаСчетФСС.Регистратор
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Возврат Результат;	
КонецФункции

// Формирует движения по регистрам
////  Отказ                     - флаг отказа в проведении,
////  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
////  Режим 					  - режим проведения документа
//
Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента);
	
	Если ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам Тогда
		ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента);
	КонецЕсли; 
	
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента,РежимПроведения, Отказ, Заголовок);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
        ДвиженияЗаявки(Отказ);
    КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента,РежимПроведения, Отказ, Заголовок)

	// Бухгалтерские проводки документа
	Если Не СтруктураШапкиДокумента.Оплачено Тогда
		Возврат;
	Конецесли;
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;

	ВидСчетаОрг = СтруктураШапкиДокумента.СчетОрганизации.ВидСчета;
	ВалютаСчета = СтруктураШапкиДокумента.СчетОрганизации.ВалютаДенежныхСредств;
	ПроводкиБУ  = Движения.Хозрасчетный;

	РасчетыВВалюте = Ложь;
	
	СчетДт = СтруктураШапкиДокумента.СчетБанк;

	Если СчетДт.Валютный Тогда
		РасчетыВВалюте = Истина;
	КонецЕсли;
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам ИЛИ ЕстьРасчетыПоПлатежнымКартам Тогда

		СтруктураШапкиДокумента.Вставить("КоррСчет", СчетДт);
		
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
		
		Если ЕстьРасчетыПоПлатежнымКартам И СтруктураШапкиДокумента.СуммаУслуг > 0 Тогда
		
			СтрокаУслуг = РеестрПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаУслуг, РеестрПлатежей[0]);
			
			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			СуммаУслугРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтруктураШапкиДокумента.СуммаУслуг, ВалютаДокумента,
														мВалютаРегламентированногоУчета, 
														ДанныеОВалютеДок.Курс,
														1, 
														ДанныеОВалютеДок.Кратность,
														1);

														
			СтрокаУслуг.ГривневаяСумма       = СуммаУслугРегл;
			СтрокаУслуг.СуммаВзаиморасчетов  = СтруктураШапкиДокумента.СуммаУслуг;
			
			СтрокаУслуг.КоррСчет      = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			СтрокаУслуг.КоррСубконто1 = СубконтоКт1;
			СтрокаУслуг.КоррСубконто2 = СубконтоКт2;
			СтрокаУслуг.КоррСубконто3 = СубконтоКт3;
			
			РеестрПлатежей.Колонки.Добавить("НалоговоеНазначение");
		    СтрокаУслуг.НалоговоеНазначение = НалоговоеНазначениеПлатежныеКартыУслуги;
			
		КонецЕсли;
	
		СодержаниеПроводки = "";
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами тогда
			СодержаниеПроводки = "Расчеты с контрагентом";
			РеестрПлатежей.ЗагрузитьКолонку(РеестрПлатежей.ВыгрузитьКолонку("СчетОплаты"),"СчетАванса");
		ИначеЕсли ЕстьРасчетыПоПлатежнымКартам тогда
			СодержаниеПроводки = "Расчеты по платежным картам и банковским кредитам";
			РеестрПлатежей.ЗагрузитьКолонку(РеестрПлатежей.ВыгрузитьКолонку("СчетОплаты"),"СчетАванса");
			КолонкаКонтрагент = Новый Массив;
			Для Инд = 0 По 1 Цикл
				КолонкаКонтрагент.Добавить(СтруктураШапкиДокумента.Контрагент);
			КонецЦикла;
			РеестрПлатежей.ЗагрузитьКолонку(КолонкаКонтрагент,"Контрагент");			
		ИначеЕсли ЕстьРасчетыПоКредитам Тогда
		    СодержаниеПроводки = "Расчеты по кредитам и займам";
		КонецЕсли; 

		Если БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(ЭтотОбъект,СтруктураШапкиДокумента,ЕстьРасчетыСКонтрагентами,Отказ,Заголовок,СодержаниеПроводки,,РеестрПлатежей)=Ложь тогда
			Возврат;
		КонецЕсли;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств 
		  или ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты Тогда

		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период     = ДатаДвижений;
		Проводка.СчетДт     = СчетДт;
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			Проводка.Содержание = "Прочее поступление денежных средств";
		ИначеЕсли Проводка.СчетДт.Валютный Тогда
			Проводка.Содержание = "Поступление приобретенной валюты";
		Иначе
			Проводка.Содержание = "Поступление средств от продажи валюты";
		КонецЕсли;	
		Проводка.Организация = СтруктураШапкиДокумента.Организация;

		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СчетОрганизации);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);

		Проводка.СчетКт = СчетУчетаРасчетовСКонтрагентом;
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.СубконтоКт1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураШапкиДокумента.СубконтоКт2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураШапкиДокумента.СубконтоКт3);
		Иначе
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураШапкиДокумента.Контрагент);
		КонецЕсли;	
		
		Если РасчетыВВалюте Тогда

			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаДт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = СтруктураШапкиДокумента.ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СтруктураШапкиДокумента.СуммаДокумента;
			КонецЕсли;

			ДанныеОВалютеДок   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДвижений);
			Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураШапкиДокумента.ВалютаДокумента, мВалютаРегламентированногоУчета,
														 ДанныеОВалютеДок.Курс,      1, 
														 ДанныеОВалютеДок.Кратность, 1);
		Иначе
			Проводка.Сумма = СуммаДокумента;
		КонецЕсли;
		                                                                                       
			Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств 
				И СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
			
			Проводка.НалоговоеНазначениеКт = НалоговоеНазначениеПриПрочемПоступлении;
			
			Если НЕ НалоговоеНазначениеПриПрочемПоступлении = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
		Объект = Ссылка.ПолучитьОбъект();
		ВыборкаДляПроводок = Объект.СформироватьЗапросДляПроводокЗаявки().Выбрать();
		Пока ВыборкаДляПроводок.Следующий() Цикл
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = ДатаДвижений;
			Проводка.Организация = Организация;
			Проводка.Содержание = "Поступление денежных средств от ФСС";
			
			Проводка.СчетДт      = СчетДт;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СчетОрганизации);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			
			Проводка.СчетКт      = СчетУчетаРасчетовСКонтрагентом;
			
			Если Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Справочники.Налоги.Соцстрах);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
			ИначеЕсли Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев Тогда
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Справочники.Налоги.СоцстрахНесчФОТ);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
			Иначе
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
			КонецЕсли;	
			
			Проводка.Сумма = ВыборкаДляПроводок.Результат;
		КонецЦикла;
		
	КонецЕсли;
	
	Если   ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда

		Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			
			Если НЕ СтрокаРасшифровки.ВозвратАвансаДо01042011НУ Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011 = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПриобретение = (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ВХОДЯЩ") > 0) ИЛИ (Найти(ВРЕГ(СтруктураШапкиДокумента.ВидДокумента), "ПРИХОД") > 0);			
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			СуммаСторноДоходовЗатрат = - СтрокаРасшифровки.СуммаВДВРПоАвансуДо01042011;
				
			Если ЭтоПриобретение Тогда
				Проводка.СчетДт    = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
				Проводка.СчетКт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru='(НУ) Сторно расходов при возврате аванса до 01.04.2011';uk='(ПО) Сторно витрат при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
					
			Иначе	
				Проводка.СчетКт    = ПланыСчетов.Хозрасчетный.ДругиеДоходыОтОбычнойДеятельности;
				Проводка.СчетДт    = ПланыСЧетов.Хозрасчетный.Вспомогательный;
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = СуммаСторноДоходовЗатрат;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", СтрокаРасшифровки.СтатьяПоВозвратуАвансаДо2011НУ);
				Проводка.Содержание = НСтр("ru='(НУ) Сторно доходов при возврате аванса до 01.04.2011';uk='(ПО) Сторно доходів при поверненні авансу до 01.04.2011'",Локализация.КодЯзыкаИнформационнойБазы());
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> мВалютаРегламентированногоУчета) тогда
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(ЭтотОбъект,СтруктураШапкиДокумента, мВалютаРегламентированногоУчета,Отказ);
	КонецЕсли; // Учет курсовых разниц

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если (ЕстьРасчетыСКонтрагентами или ЕстьРасчетыПоКредитам) и СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
			РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
		ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств) и СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
			НалоговыйУчет.ДвиженияПоЕдиномуНалогуПрочее(ЭтотОбъект,СтруктураШапкиДокумента,Отказ);	
		КонецЕсли;
	
		Если
			ЕстьРасчетыПоПлатежнымКартам И СтруктураШапкиДокумента.ЕстьЕдиныйНалог Тогда
			ДвиженияПоЕдиномуНалогуКарты(СтруктураШапкиДокумента,Отказ);
		КонецЕсли;	
		
		Если (ЕстьРасчетыСКонтрагентами и не ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами)
		   И СтруктураШапкиДокумента.ЕстьНДС Тогда
		
			РеестрПлатежей = НалоговыйУчет.ПодготовитьТаблицуОплатДляНалоговогоУчета(СтруктураШапкиДокумента);
			НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаПлатежныхДокументов(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежей,Отказ);
				
		КонецЕсли; 
		
	КонецЕсли; 
	
	
	//Дандали В. 12.06.2025 +
	//Кейс когда частичная оплата. терминал не указывать 
	Если Найти(НазначениеПлатежа, "згідно дог спож кредит") = 0 Тогда  
		
		//Яковлев
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам Тогда 
			Для Каждого Проводка из ПроводкиБУ цикл
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Терминал", Терминал);
			КонецЦикла;				
		КонецЕсли;
		
	КонецЕсли;
	//Дандали В. 12.06.2025 -
	
КонецПроцедуры

Процедура ДвиженияПоЕдиномуНалогуКарты(СтруктураШапкиДокумента,Отказ)

	РеестрПлатежейПоЕдиномуНалогу = Новый ТаблицаЗначений;
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("ГривневаяСумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СтатьяДекларацииПоЕдиномуНалогу");
	РеестрПлатежейПоЕдиномуНалогу.Колонки.Добавить("СтоимостьОС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));		
	Строка = РеестрПлатежейПоЕдиномуНалогу.Добавить();
	Строка.ГривневаяСумма = СуммаДокумента;
	Строка.СтатьяДекларацииПоЕдиномуНалогу = СтатьяДекларацииПоЕдиномуНалогу;

	Строка = РеестрПлатежейПоЕдиномуНалогу.Добавить();
	Строка.ГривневаяСумма = СуммаУслуг;
	Строка.СтатьяДекларацииПоЕдиномуНалогу = СтатьяДекларацииПоЕдиномуНалогуОплатаУслугБанка;
	
	НалоговыйУчет.ДвиженияПоЕдиномуНалогуРасчеты(ЭтотОбъект,СтруктураШапкиДокумента,РеестрПлатежейПоЕдиномуНалогу,Отказ);

КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)

	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыСКонтрагентами", ЕстьРасчетыСКонтрагентами);
	мСтруктураПараметровДенежныхСредств.Вставить("ЕстьРасчетыПоКредитам",     ЕстьРасчетыПоКредитам);
	мСтруктураПараметровДенежныхСредств.Вставить("БанковскийСчетКасса",       СчетОрганизации);
	мСтруктураПараметровДенежныхСредств.Вставить("ДатаДвижений",              ДатаДвижений);
	
	УправлениеДенежнымиСредствами.ПровестиПоступлениеДенежныхСредствУпр(
		СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок);
	
	// Движение по регистру затрат
	Если Оплачено
		И ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам Тогда
		
		ТаблицаЗатрат = Новый ТаблицаЗначений;
		ТаблицаЗатрат.Колонки.Добавить("Подразделение");
		ТаблицаЗатрат.Колонки.Добавить("СтатьяЗатрат");
		ТаблицаЗатрат.Колонки.Добавить("НоменклатурнаяГруппа");
		ТаблицаЗатрат.Колонки.Добавить("СуммаУпр");
		
		// Заполним таблицу затрат
		СтрокаЗатрат = ТаблицаЗатрат.Добавить();

		СтрокаЗатрат.Подразделение 			= СтруктураШапкиДокумента.Подразделение;
		СтрокаЗатрат.СтатьяЗатрат 			= СтруктураШапкиДокумента.СтатьяЗатрат;
		СтрокаЗатрат.НоменклатурнаяГруппа 	= СтруктураШапкиДокумента.НоменклатурнаяГруппа;
		
		СтрокаКурсыВалют=ТаблицаПлатежейУпр[0];
		СтрокаЗатрат.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаУслуг, ВалютаДокумента,
														глЗначениеПеременной("ВалютаУправленческогоУчета"), 
														СтрокаКурсыВалют.КурсДокумента,
														СтрокаКурсыВалют.КурсУпрУчета, 
														СтрокаКурсыВалют.КратностьДокумента,
														СтрокаКурсыВалют.КратностьУпрУчета);
														
		СтруктДопПараметры = Новый Структура;
		СтруктДопПараметры.Вставить("КодОперацииНЗП", Перечисления.КодыОперацийНезавершенноеПроизводство.УслугиКонтрагентаНаПроизводство);
		
		// движения по затратам
		УправлениеЗатратами.ДвиженияПоПрочимЗатратамУпр(ЭтотОбъект, ТаблицаЗатрат, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, СтруктДопПараметры);
		
	КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Если НЕ (Оплачено И ОтражатьВУправленческомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком Тогда
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя Тогда
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	Иначе
		ВидРасчетовПоОперации = Перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, "РасшифровкаПлатежа", ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);

КонецПроцедуры

Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Режим, Заголовок)
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента Тогда
		Сообщить(Заголовок+НСтр("ru=' "
"не совпадают сумма документа и ее расшифровка.';uk='"
"не збігаються сума документа та її розшифровка.'"));
		
		Отказ=Истина;
		
	КонецЕсли;
	
	// Сформируем структуру обязательных полей
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	СтруктураОбязательныхПолей.Вставить("СчетОрганизации",НСтр("ru='Не указан банковский счет организации!';uk='Не зазначений банківський рахунок організації!'"));
	СтруктураОбязательныхПолей.Вставить("СуммаДокумента");
	Если Оплачено Тогда
		СтруктураОбязательныхПолей.Вставить("ДатаОплаты",НСтр("ru='Не указана дата оплаты документа банком!';uk='Не вказана дата оплати документа банком!'"));
	КонецЕсли; 
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам ИЛИ ЕстьРасчетыПоПлатежнымКартам Тогда
		СтруктураОбязательныхПолей.Вставить("Контрагент");
	КонецЕсли;		
	// Регл. обязательные поля
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураОбязательныхПолей.Вставить("СчетБанк",       НСтр("ru='Не указан счет учета денежных средств';uk='Не зазначений рахунок обліку грошових коштів'"));
		
		Если СчетБанк.Валютный Тогда
			СтруктураОбязательныхПолей.Вставить("ВалютаДокумента",НСтр("ru='Не указана валюта документа.';uk='Не зазначена валюта документа.'"));
		КонецЕсли;

		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом",НСтр("ru='Не указан счет учета.';uk='Не зазначений рахунок.'"));
		КонецЕсли;

		Если ЕстьРасчетыПоПлатежнымКартам И СуммаУслуг > 0 Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом",НСтр("ru='Не указан счет учета.';uk='Не зазначений рахунок.'"));
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств
		   И СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015
		   И СчетУчетаРасчетовСКонтрагентом.НалоговыйУчет Тогда
		
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПриПрочемПоступлении", НСтр("ru='Не указано налоговое назначение!';uk='Не зазначене податкове призначення!'"));
			
		КонецЕсли;
		
		Если ЕстьРасчетыПоПлатежнымКартам 
		   И СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 
		   И СчетУчетаРасчетовСКонтрагентом.НалоговыйУчет Тогда
		   
        	СтруктураОбязательныхПолей.Вставить("НалоговоеНазначениеПлатежныеКартыУслуги", НСтр("ru='Не указано налоговое назначение!';uk='Не зазначене податкове призначення!'"));
			
		КонецЕсли;
			
	КонецЕсли;
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Проверка ТЧ (общая)
	СтруктураОбязательныхПолейТЧ = Новый Структура();
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		СтруктураОбязательныхПолейТЧ.Вставить("СуммаВзаиморасчетов");
		СтруктураОбязательныхПолейТЧ.Вставить("ДоговорКонтрагента");
		Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
			СтруктураОбязательныхПолейТЧ.Вставить("СчетУчетаРасчетовСКонтрагентом");
		КонецЕСли;
	ИначеЕсли ЕстьРасчетыПоПлатежнымКартам И ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей = Новый Структура("СчетУчетаРасчетовСКонтрагентом");
	КонецЕСли;
	
	УправлениеДенежнымиСредствами.ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "РасшифровкаПлатежа", СтруктураОбязательныхПолейТЧ, Отказ, Заголовок);
	
	Если    СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			//Проверим на возможность проведения в БУ и НУ
			УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(Платеж.ДоговорКонтрагента, ВалютаДокумента,
												 ОтражатьВБухгалтерскомУчете, ОтражатьВБухгалтерскомУчете, мВалютаРегламентированногоУчета, 
												 Ложь, Отказ, Заголовок, "", Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		КонецЦикла;
	КонецЕСли;	
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента,Отказ, Режим, Заголовок);
	КонецЕСли;	
		
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок);
	КонецЕСли;	

КонецПроцедуры

Процедура ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента, Отказ, Режим, Заголовок)

	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		ПроверитьЗаполнениеТЧУпр(Отказ, Заголовок);
		Если Не Отказ Тогда
			УправлениеДенежнымиСредствами.КонтрольОстатковПоТЧ(Дата, ТаблицаПлатежейУпр, Отказ, Заголовок,,Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧУпр(Отказ, Заголовок)

	Для Каждого Платеж Из РасшифровкаПлатежа Цикл

		ПроверитьЗначение(Платеж.ДоговорКонтрагента,Отказ, Заголовок,НСтр("ru='Договор';uk='Договір'"));
		ПроверитьЗначение(Платеж.СуммаВзаиморасчетов,Отказ, Заголовок,НСтр("ru='Сумма взаиморасчетов';uk='Сума взаєморозрахунків'"));
		
		Если Не Отказ Тогда
			
			// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
			Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя",НСтр("ru='Заказ покупателя';uk='Замовлення покупця'"),НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);
				
				Если Отказ Тогда
				
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+НСтр("ru=' установлен способ ведения взаиморасчетов ""по заказам""! "
"Заполните поле ""';uk=' встановлений спосіб ведення взаєморозрахунків ""по замовленнях""! "
"Заповніть поле ""'")+ТекстСделка+"""!");
					
				КонецЕсли;
				
			ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				
				ТекстСделка=?(УправлениеДенежнымиСредствами.ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа="ЗаказПокупателя",НСтр("ru='Счет покупателю';uk='Рахунок покупцю'"),НСтр("ru='Счет поставщику';uk='Рахунок постачальнику'"));
				ПроверитьЗначение(Платеж.Сделка,Отказ, Заголовок,ТекстСделка);

				Если Отказ Тогда
					Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+НСтр("ru=' установлен способ ведения взаиморасчетов ""по счетам""! "
"Заполните поле ""';uk=' встановлений спосіб ведення взаєморозрахунків ""по рахунках""! "
"Заповніть поле ""'")+ТекстСделка+"""!");
				КонецЕсли;
						
			КонецЕсли;

			Если ЗначениеЗаполнено(Организация) 
				И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Выбран договор контрагента, не соответствующий организации, указанной в документе!';uk='Обрано договір контрагента, що не відповідає організації, вибраній в документі!'"), Отказ, Заголовок);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТЧ

Процедура ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам ИЛИ ЕстьРасчетыПоПлатежнымКартам Тогда

		Для Каждого Платеж Из РасшифровкаПлатежа Цикл
			УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, Платеж.ДоговорКонтрагента, 
													  Платеж.ДоговорКонтрагента.Организация, Отказ, Заголовок);
		КонецЦикла;

	КонецЕсли;
    
	Если ЕстьРасчетыСКонтрагентами
		И НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами
		И СтруктураШапкиДокумента.ЕстьНДС Тогда
		// проверим заполнение ТЧ для целей налогового учета (упрощенный налоговый учет)
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если НЕ Платеж.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
				
				// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДС.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+НСтр("ru=' не указан Счет учета НДС (неподтвержденный)!';uk=' не зазначений Рахунок обліку ПДВ (непідтверджений)!'"));
						
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураШапкиДокумента.ЕстьНДС И Платеж.СчетУчетаНДСПодтвержденный.Пустая() Тогда
					
					Отказ = истина;
					
					Если Отказ Тогда
					
						Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+НСтр("ru=' не указан Счет учета НДС н/о (н/к)!';uk=' не зазначений Рахунок обліку ПДВ п/з (п/к)!'"));
						
					КонецЕсли;
				КонецЕсли;
				Если Платеж.НалоговоеНазначение.Пустая() 
						И ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком Тогда

                    Отказ = истина;
						
                    Если Отказ Тогда
						
                        Сообщить("По договору "+Строка(Платеж.ДоговорКонтрагента)+НСтр("ru=' не указано Налоговое назначение!';uk=' не вказано Податкове призначення!'"));
							
                    КонецЕсли;
				КонецЕсли;
               				
				
			КонецЕсли;
			
		КонецЦикла; 	
		
	КонецЕсли;
	
	Если  ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком
		И СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
		
		Для каждого Платеж  Из РасшифровкаПлатежа Цикл
			Если   Платеж.ВозвратАвансаДо01042011НУ И НЕ ЗначениеЗаполнено(Платеж.СтатьяПоВозвратуАвансаДо2011НУ) Тогда
				
				СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для договора ""%1"" не указана статья по возврату аванса до 01.04.2011!';uk='Для договору ""%1"" не зазначена стаття по поверненню аванса до 01.04.2011!'"), Строка(Платеж.ДоговорКонтрагента));
				
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);			
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;				
    
КонецПроцедуры //ПроверитьЗаполнениеДокументаРегл()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	Если ЕстьРасчетыСКонтрагентами Тогда
		МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.РасчетыСКонтрагентами);
	КонецЕсли; 
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеРасчетВФСС") Тогда
		УправлениеДенежнымиСредствами.ЗаполнитьПриходПоОснованию(ЭтотОбъект, Основание, УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный"));
	КонецЕсли;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеРасчетВФСС") Тогда
	    ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС;
		Организация = Основание.Организация;
	    Если ЗначениеЗаполнено(Организация) Тогда
			СчетОрганизации = Организация.БанковскийСчетДляРасчетовСФСС;
		Иначе
			СчетОрганизации = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;

		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ЗаявлениеРасчет = Основание;
		
		Дата378 = ПроведениеРасчетов.ВариантыАлгоритмовРасчетаЗарплаты().ДатаВводаСчета378;
		Если ОбщегоНазначения.ПолучитьРабочуюДату() < Дата378 Тогда
			Если НЕ Основание.ЗаСчетФССОтНС Тогда
				СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию;
			Иначе
				СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев;
			КонецЕсли;
		Иначе
			СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСГосударственнымиЦелевымиФондами;
		КонецЕсли;	

		СуммаДокумента = Основание.ВсегоПоДокументу;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)

	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
 	// Сформируем структуру реквизитов шапки документа
 	СтруктураШапкиДокумента		= ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                      , "ВедениеВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"                       , "ВалютаВзаиморасчетов");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                       			, "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                       			, "ВидДоговора");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                     , "ВедениеУчетаПоПроектам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"           , "ВалютаУправленческогоУчета"             	, "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"           , "КурсВалютыУправленческогоУчета"         	, "КурсВалютыУправленческогоУчета");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами ИЛИ
		ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
		
		КурсДокумента      = РасшифровкаПлатежа[0].КурсВзаиморасчетов;
		КратностьДокумента = РасшифровкаПлатежа[0].КратностьВзаиморасчетов;

	Иначе	
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
 	СтруктураШапкиДокумента.Вставить("КурсДокумента"		, КурсДокумента);
	СтруктураШапкиДокумента.Вставить("КратностьДокумента"	, КратностьДокумента);
	
	ДатаДвижений=?(Оплачено,УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Дата,ДатаОплаты),Дата);
	СтруктураШапкиДокумента.Вставить("ДатаОплаты",ДатаДвижений);
	
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	ЕстьРасчетыПоПлатежнымКартам=(ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам);
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыльДо2015,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	ТаблицаПлатежейУпр = УправлениеДенежнымиСредствами.ПолучитьТаблицуПлатежейУпр(ДатаДвижений,ВалютаДокумента,Ссылка, "ПлатежноеПоручениеВходящее");
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
 		ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ,Режим,Заголовок);
	КонецЕсли;
	// Движения по документу

	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(Режим, Отказ, Заголовок, СтруктураШапкиДокумента);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

		
	Движения.ЛимитыБюджетированияПоСтатьям.Записывать = Истина;
	Движения.ЛимитыБюджетированияПоСтатьям.Очистить();
	Для Каждого стр Из РасшифровкаПлатежа Цикл
		
		Если Организация.А_БухгалтерскийУчет Тогда 
			Если  стр.СтатьяДвиженияДенежныхСредств.ВидСтатьи = Перечисления.ВидыДвиженийПриходРасход.Расход Тогда 

			ДанныеПоЛимитам =  Бюджетирование.ПолучитьДанныеПоЛимитам(Подразделение,стр.Проект,стр.СтатьяДвиженияДенежныхСредств,Организация,Дата);
			
			НоваяЗапись               = Движения.ЛимитыБюджетированияПоСтатьям.Добавить();
			НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Регистратор   = Ссылка;
			НоваяЗапись.Период        = Дата;
			НоваяЗапись.Организация   = ?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация);
			НоваяЗапись.Подразделение = Подразделение;
			НоваяЗапись.Статья        = стр.СтатьяДвиженияДенежныхСредств;
			НоваяЗапись.Проект        = ?(ДанныеПоЛимитам.Естьпроект,стр.Проект,Справочники.Проекты.ПустаяСсылка());
			НоваяЗапись.ПроектУправленческий = стр.Проект;


			НоваяЗапись.Сумма       = -1*стр.СуммаПлатежа;
			НоваяЗапись.VatNoVat    = Перечисления.VatNoVat.NOVAT;
			НоваяЗапись.ТипПериода  = ДанныеПоЛимитам.ТипПериодаЗапроса;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Дандали В. 23.09.2025 +
	Если НЕ Отказ 
		И Контрагент.БО 
		И НЕ УжеЕстьНалоговая(Ссылка) Тогда
		
		ДокНалоговая = Документы.НалоговаяНакладная.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокНалоговая, ЭтотОбъект,,"Номер");
		
		ДокНалоговая.Дата 						= Дата;
		ДокНалоговая.ВидОперации 				= Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
		ДокНалоговая.УчитыватьНДС 				= Истина;
		ДокНалоговая.СуммаВключаетНДС 			= Истина;
		ДокНалоговая.ДокументОснование 			= Ссылка;
		ДокНалоговая.КурсВзаиморасчетов 		= 1;
		ДокНалоговая.КратностьВзаиморасчетов 	= 1;
		
		ДанныеРасшифровки 			= РасшифровкаПлатежа[0];
		ДокНалоговая.СчетНДС 		= ДанныеРасшифровки.СчетУчетаНДСПодтвержденный;
		ДокНалоговая.СчетУчетаНДС 	= ДанныеРасшифровки.СчетУчетаНДС;

		ДанныеППК = ПолучитьАдресаППК(Контрагент);
		
		Если ДанныеППК = "" Тогда
			Возврат;
		КонецЕсли;
				
		сч = 1;
		Для Каждого стрППК из ДанныеППК Цикл
			
			НовСтр 					= ДокНалоговая.Услуги.Добавить();
			НовСтр.Номенклатура 	= ПолучитьСоздатьНоменклатуру(Дата);
			НовСтр.Содержание 		= НовСтр.Номенклатура.НаименованиеПолное + " " + стрППК.Адрес;
			НовСтр.Количество 		= 1;
			НовСтр.Цена 			= ?(СтрППК.ИндивидуальныйТариф,стрППК.ЦенаТарифа, ПолучитьАктуальныйТариф(стрППК.Ссылка, Дата));
			НовСтр.СтавкаНДС		= ДанныеРасшифровки.СтавкаНДС;
			НовСтр.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
			НовСтр.Сумма 			= НовСтр.Цена;
			НовСтр.КодУКТВЭД		= НовСтр.Номенклатура.НоменклатураГТД;
			НовСтр.НомерСтрокиНН 	= сч;
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтр, ДокНалоговая);
			сч = сч + 1;
		КонецЦикла;
		
		Попытка
			ДокНалоговая.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокНалоговая.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;

	КонецЕсли;
	//Дандали В. 23.09.2025 -
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	СтруктураДействий = Новый Структура("УстановитьДоговор");
	УправлениеДенежнымиСредствами.ВыполнитьДействияПередЗаписьюПлатежногоДокумента(ЭтотОбъект, СтруктураДействий, Отказ, РежимЗаписи, РежимПроведения);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПокупкаПродажаВалюты Тогда
		Для каждого Платеж из РасшифровкаПлатежа Цикл
			Платеж.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЦикла
	КонецЕсли;
	
	//Дандали В. 03.05.2023 
	ОтветственныйДоп = ПараметрыСеанса.ТекущийПользователь;
	//Дандали В. 03.05.2023 
	
	ПроектРасшифровки = ?(РасшифровкаПлатежа.ВыгрузитьКолонку("Проект").Количество() > 0, РасшифровкаПлатежа.ВыгрузитьКолонку("Проект")[0], Справочники.Проекты.ПустаяСсылка());
	
	IDТерминалаСтрока = СтрЗаменить(Комментарий,",", Символы.ПС);
	IDТерминала = СокрЛП(СтрПолучитьСтроку(IDТерминалаСтрока,2));
	
	Если не СтрДлина(IDТерминала)=8 Тогда 
		IDТерминала = "";	
	КонецЕсли;
	
	Если IDТерминала <> "" Тогда 
		Терминал = Справочники.Терминалы.НайтиПоНаименованию(IDТерминала);
		Если Терминал.Пустая() Тогда 
			ТерминалОб = Справочники.Терминалы.СоздатьЭлемент();
			ТерминалОб.Наименование = IDТерминала;
			ТерминалОб.Записать();
			
			Терминал = ТерминалОб.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	//Дандали В. 22.10.2025 +
	Если ЗначениеЗаполнено(СчетКонтрагента) 
		И ЗначениеЗаполнено(СчетКонтрагента.Банк) Тогда
		МФО = СчетКонтрагента.Банк.Код;	
	КонецЕсли;
	//Дандали В. 22.10.2025 -
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Функция УжеЕстьНалоговая(ПлатежкаВходящяя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Поле1
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НЕ НалоговаяНакладная.ПометкаУдаления
		|	И НалоговаяНакладная.Проведен
		|	И НалоговаяНакладная.ДокументОснование = &Платежка";
	
	Запрос.УстановитьПараметр("Платежка", ПлатежкаВходящяя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьАдресаППК(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ППК.Адрес КАК Адрес,
	|	ППК.ЦенаТарифа КАК ЦенаТарифа,
	|	ППК.ИндивидуальныйТариф КАК ИндивидуальныйТариф,
	|	ППК.Ссылка
	|ИЗ
	|	Справочник.ППК КАК ППК
	|ГДЕ
	|	НЕ ППК.ПометкаУдаления
	|	И ППК.Контрагент = &Контрагент
	|	И ППК.АктивныйНН";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), "", РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ПолучитьСоздатьНоменклатуру(Дата) 
	
	НаименованиеПоиска = Формат(Дата, "Л=uk_UA; ДФ=MMMM") + " " +СтрЗаменить(Строка(Год(Дата)), Символы.НПП, "");
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеПоиска, Истина);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	Номенклатура 							= Справочники.Номенклатура.СоздатьЭлемент();
	Номенклатура.Наименование 				= НаименованиеПоиска;
	Номенклатура.НаименованиеПолное 		= "Надання доступу до мережі Інтернет за "+ НаименованиеПоиска + " р.";
	Номенклатура.Родитель 					= Справочники.Номенклатура.НайтиПоНаименованию("Послуги надані", Истина);
	Номенклатура.ВидНоменклатуры 			= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуга", Истина);
	Номенклатура.БазоваяЕдиницаИзмерения 	= Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("грн");
	Номенклатура.СтавкаНДС					= Перечисления.СтавкиНДС.НДС20;
	Номенклатура.КодЛьготы  				= Справочники.КлассификаторУКТВЭД.НайтиПоКоду("61.10         ");
	
	Попытка
		Номенклатура.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	ЕдИзм 							= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	ЕдИзм.Владелец 					= Номенклатура.Ссылка;
	ЕдИзм.ЕдиницаПоКлассификатору 	= Номенклатура.БазоваяЕдиницаИзмерения;
	ЕдИзм.Коэффициент				= 1;
	ЕдИзм.Наименование 				= "грн";
	Попытка
		ЕдИзм.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Номенклатура.ЕдиницаДляОтчетов 	= ЕдИзм.Ссылка;
	Попытка
		Номенклатура.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Номенклатура.Ссылка
	
КонецФункции

Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентом(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина) Экспорт
	
	Если НЕ (ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком тогда
            
            Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансов;
			КонецЕсли;	
				
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПриобретений,СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется 	 			= СчетаУчета.Амортизируется;
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();				
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;						
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();			
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеСредствОтФСС Тогда
			
			Дата378 = ПроведениеРасчетов.ВариантыАлгоритмовРасчетаЗарплаты().ДатаВводаСчета378;
			Если Дата < Дата378 Тогда
				Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСКонтрагентом) Тогда
					СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию;
				КонецЕсли;
			Иначе
				Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСКонтрагентом) Тогда
					СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСГосударственнымиЦелевымиФондами;
				КонецЕсли;
			КонецЕсли;	
		Иначе
		
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
			
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
			
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет значение, необходимое при проведении
Процедура ПроверитьЗначение(Значение, Отказ, Заголовок, ИмяРеквизита)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда 
		
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено значение реквизита ""';uk='Не заповнене значення реквізиту ""'")+ИмяРеквизита+"""",Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗначение()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЧастичнаяОплата Тогда
		Сообщить(НСтр("ru='По документу ';uk='По документу '")+ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект))+НСтр("ru=' уже прошла частичная оплата."
"Перед отменой проведения документа необходимо отменить проведение платежных ордеров.';uk=' вже пройшла часткова оплата."
"Перед скасуванням проведення документа необхідно скасувати проведення платіжних ордерів.'"));
		Отказ=Истина;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ДвиженияЗаявки(Отказ)
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		// Движения по документу
		Если Не Отказ Тогда
			ДвиженияПоРегистрамНакопленияЗаявки(ВыборкаПоШапкеДокумента,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = "
	|Выбрать РАЗРЕШЕННЫЕ
	|	Дата,
	|	Организация,
	|	Ответственный,
	|	Контрагент,
	|	СчетОрганизации,
	|	СчетКонтрагента,
	| 	Ссылка
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросДляПроведения()
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр( "ССылка" , Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Организация,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.ПериодВзаиморасчетов,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СтатьяРасчетовСФСС,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сотрудник,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СчетУчета,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сумма,
				   |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СуммаУпр,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Документ
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа 
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНачислениямЗаСчетФСС КАК ВзаиморасчетыПоНачислениямЗаСчетФСС
	               |		ПО ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.Ссылка = ВзаиморасчетыПоНачислениямЗаСчетФСС.Регистратор
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка";
		   
	Возврат Запрос.Выполнить();		
КонецФункции

Процедура ДвиженияПоРегистрамНакопленияЗаявки(ВыборкаПоШапкеДокумента, Отказ)
	РезультатЗапросаПоДокументам = СформироватьЗапросДляПроведения();
	ВыборкаПоДокументам = РезультатЗапросаПоДокументам.Выбрать();
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		//движения по РН ВзаиморасчетыПоНачислениямЗаСчетФСС
		Движение = Движения.ВзаиморасчетыПоНачислениямЗаСчетФСС.Добавить();
	
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
	
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ПериодВзаиморасчетов	= ВыборкаПоДокументам.ПериодВзаиморасчетов;
		Движение.СтатьяРасчетовСФСС     = ВыборкаПоДокументам.СтатьяРасчетовСФСС;
		Движение.Сотрудник              = ВыборкаПоДокументам.Сотрудник;
		Движение.СчетУчета			    = ВыборкаПоДокументам.СчетУчета;
		
		// Ресурсы
		Движение.Сумма					= ВыборкаПоДокументам.Сумма; 
		Движение.СуммаУпр				= ВыборкаПоДокументам.СуммаУпр;
	
		//Реквизиты
		Движение.Документ 				= ВыборкаПоДокументам.Документ;
		Движение.КодОперации			= Перечисления.КодыОперацийРасчетыСФСС.Получено;

		//движения по РН ВзаиморасчетыСРаботникамиОрганизаций
        Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		
		// Свойства
		Движение.Период					= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения   			= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ПериодВзаиморасчетов	= ВыборкаПоДокументам.ПериодВзаиморасчетов;
		Движение.Сотрудник				= ВыборкаПоДокументам.Сотрудник;
		Движение.СчетУчета			    = ВыборкаПоДокументам.СчетУчета;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов	= ВыборкаПоДокументам.Сумма;
		Движение.СуммаВзаиморасчетовУпр = ВыборкаПоДокументам.СуммаУпр;
		
		//Реквизиты
		Движение.КодОперации			= Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления;
	КонецЦикла
	
		
КонецПроцедуры

Процедура РассчитатьСуммуЗаявок() Экспорт
	Сумма = 0;
	
	РезультатЗапросаПоДокументам = ПолучитьЗапросДляРасчетаСумм();
	ВыборкаПоДокументам = РезультатЗапросаПоДокументам.Выбрать();
		
	Пока ВыборкаПоДокументам.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаПоДокументам.Сумма) Тогда
	   		Сумма = Сумма + ВыборкаПоДокументам.Сумма;
		КонецЕсли;	
	КонецЦикла;
		
	СуммаДокумента = Сумма;
	
КонецПроцедуры
	
Функция ПолучитьЗапросДляРасчетаСумм()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ЕстьNULL(ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ЗаявлениеРасчет.ВсегоПоДокументу,0) КАК Сумма 
	                |ИЗ
	                |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	                |ГДЕ
	                |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить();				
					
Конецфункции	                           	

Функция ПолучитьАктуальныйТариф(мППК, Месяц)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТарифиППКСрезПоследних.ЦенаТарифа
	|ИЗ
	|	РегистрСведений.ТарифиППК.СрезПоследних(&мДата {(&мДата)}, ) КАК ТарифиППКСрезПоследних
	|ГДЕ
	|	ТарифиППКСрезПоследних.Тариф = &Тариф";
	
	Запрос.УстановитьПараметр("мДата", Месяц);
	Запрос.УстановитьПараметр("Тариф", мППК.Тариф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЦенаТарифа; 
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мСтруктураПараметровДенежныхСредств = Новый Структура;
мСтруктураПараметровДенежныхСредств.Вставить("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Безналичные);
