
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не Отказ Тогда
		
		глУчетнаяПолитикаПоНалоговомуУчету = ОбщегоНазначения.СоздатьКЭШУчетнойПолитики("НалоговыйУчет");
		ПараметрыСеанса.УчетнаяПолитикаПоНалоговомуУчету = Новый ХранилищеЗначения(глУчетнаяПолитикаПоНалоговомуУчету, 
		Новый СжатиеДанных(0));
		
		РегистрыСведений.СтатусыПлательщиковЕдиногоНалога.АктуализироватьДанные(ЭтотОбъект);		
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Строка Из ЭтотОбъект Цикл
			
		РеквизитыСхемаНалогообложения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Строка.СхемаНалогообложения, "НалогНаПрибыль,НДС,ЕдиныйНалог");
			
		Если Строка.ГруппаПлательщикаЕдиногоНалога <> Перечисления.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая Тогда
			Строка.ДатаИзмененияСхемыНалогообложенияВСерединеМесяца = '00010101';
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
