Функция ПолучитьДанныеПоЛимитам(Подразделение,Проект,СтатьяДДС,Организация,Период) Экспорт 
	Типпериода = Неопределено;	
	ЕстьПроект = Ложь;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛимитыБюджетированияПоСтатьям.ТипПериода
	               |ИЗ
	               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям КАК ЛимитыБюджетированияПоСтатьям
	               |ГДЕ
	               |	ЛимитыБюджетированияПоСтатьям.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛимитыБюджетированияПоСтатьям.Подразделение = &Подразделение
	               |	И ЛимитыБюджетированияПоСтатьям.Статья = &Статья
	               |	И ЛимитыБюджетированияПоСтатьям.Проект = &Проект
	               |	И ЛимитыБюджетированияПоСтатьям.Организация = &Организация
	               |	И ЛимитыБюджетированияПоСтатьям.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Период));
	Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);

	Запрос.УстановитьПараметр("КонецПериода",КонецГода(Период));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Организация",?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация));

	Запрос.УстановитьПараметр("Статья",СтатьяДДС);
	Запрос.УстановитьПараметр("Проект",Проект);
	
	РезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если не РезультатаЗапроса.Количество() Тогда 
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛимитыБюджетированияПоСтатьям.ТипПериода
		               |ИЗ
		               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям КАК ЛимитыБюджетированияПоСтатьям
		               |ГДЕ
		               |	ЛимитыБюджетированияПоСтатьям.Период МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ЛимитыБюджетированияПоСтатьям.Подразделение = &Подразделение
		               |	И ЛимитыБюджетированияПоСтатьям.Статья = &Статья
		               |	И ЛимитыБюджетированияПоСтатьям.Проект = &Проект
		               |	И ЛимитыБюджетированияПоСтатьям.Организация = &Организация
		               |	И ЛимитыБюджетированияПоСтатьям.ВидДвижения = &ВидДвижения";
		
		Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Период));
		Запрос.УстановитьПараметр("КонецПериода",КонецГода(Период));
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Запрос.УстановитьПараметр("Статья",СтатьяДДС);
		Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Проект",Справочники.Проекты.ПустаяСсылка());
		Запрос.УстановитьПараметр("Организация",?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация));


		
		РезультатаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатаЗапроса.Количество() Тогда 
			Типпериода = РезультатаЗапроса[0].ТипПериода; 
		КонецЕсли;
	Иначе
		Типпериода = РезультатаЗапроса[0].ТипПериода;
		ЕстьПроект = Истина;

	КонецЕсли;			
	
	
	Если Типпериода = Перечисления.ТипыПериодов.Месяц Тогда 
		ТипПериодаЗапроса = "Месяц";
		ПериодЗапроса = НачалоМесяца(Период);
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.ТриМесяца Тогда 
		ТипПериодаЗапроса = "Квартал";
		ПериодЗапроса = НачалоКвартала(Период);
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.ПодГода Тогда 
		ТипПериодаЗапроса = "Полугодие" ;
		ПериодЗапроса = НачалоПолугодия(Период);
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.Год Тогда 
		ТипПериодаЗапроса = "Год";
		ПериодЗапроса = НачалоГода(Период);	
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.БезОграничений Тогда
		ТипПериодаЗапроса = "";
		ПериодЗапроса =Период;
	Иначе
		ТипПериодаЗапроса = "";

		ПериодЗапроса =Период;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст  ="ВЫБРАТЬ
	               |	ЛимитыБюджетированияПоСтатьямОбороты.СуммаОборот,
				   |	ЛимитыБюджетированияПоСтатьямОбороты.СуммаПриход,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.СуммаРасход,
				   |    &ТипПериодаЗапросаБюджет как ТипПериодаЗапроса,
				   |    &ЕстьПроект как ЕстьПроект
				  

	               |ИЗ
	               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям.Обороты(
	               |			,
	               |			,"
				   +ТипПериодаЗапроса+",
	               |			Организация = &Организация
	               |				И Подразделение = &Подразделение
	               |				И Проект = &Проект
	               |				И Статья = &Статья) КАК ЛимитыБюджетированияПоСтатьямОбороты
				   |ГДЕ"+?(ТипПериодаЗапроса=""," Истина"," ЛимитыБюджетированияПоСтатьямОбороты.Период = &Период")+"
             	   |	";
				   
				   
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Запрос.УстановитьПараметр("Статья",СтатьяДДС);
		Запрос.УстановитьПараметр("Проект",?(ЕстьПроект,Проект,Справочники.Проекты.ПустаяСсылка()));
		Запрос.УстановитьПараметр("Организация",?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация));
		Запрос.УстановитьПараметр("Период",ПериодЗапроса);
		Запрос.УстановитьПараметр("ТипПериодаЗапроса",ТипПериодаЗапроса);
		Запрос.УстановитьПараметр("ТипПериодаЗапросаБюджет",Типпериода); 
		Запрос.УстановитьПараметр("ЕстьПроект",ЕстьПроект);

		

		

				   
	РезультатЗапросаПоЛимитам = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапросаПоЛимитам.Количество() Тогда 
		Возврат РезультатЗапросаПоЛимитам[0];
	Иначе
		Возврат Новый Структура("СуммаОборот,СуммаПриход,СуммаРасход,ТипПериодаЗапроса,ЕстьПроект",0,0,0,Типпериода,ЕстьПроект);
	КонецЕсли;
	

	
КонецФункции


Функция НачалоПолугодия(Знач Дата) Экспорт
    
    ПервыйДеньГода = НачалоГода(Дата);
    ПервыйДеньИюля = НачалоМесяца(ДобавитьМесяц(ПервыйДеньГода, 6));
    
    Если Месяц(Дата) < 7 Тогда
        Возврат ПервыйДеньГода;
    Иначе
        Возврат ПервыйДеньИюля;
    КонецЕсли;
    
КонецФункции
