Процедура ОткрытьСтруктуруПодчиненности(Ссылка) Экспорт 
	
	ФормаСтруктурыПодчиненности = ПолучитьОбщуюФорму("ФормаСтрПодчиненности");
	Если ФормаСтруктурыПодчиненности.Открыта() Тогда
		ФормаСтруктурыПодчиненности.Закрыть();
	КонецЕсли;
	ФормаСтруктурыПодчиненности.ДокументСсылка = Ссылка;
	ФормаСтруктурыПодчиненности.Открыть();
	
КонецПроцедуры

// + IvanSidoruk 14.05.2020
Функция СформироватьНаименованиеНоменклатурыПоПараметрам(Номенклатура,Характеристика,ГруппаПродукцииЗаПредназначением, ТорговаяМаркиНоменклатуры,КлассификацияЗаУровнемВязкости,КлассификацияЗаУровнемЭксплуатационныхСвойств, ДляРегистра = Ложь) Экспорт 
	
	Наименовние = "";
	
	Если ЗначениеЗаполнено(ГруппаПродукцииЗаПредназначением) Тогда 
		Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(ГруппаПродукцииЗаПредназначением.Наименование);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ТорговаяМаркиНоменклатуры) Тогда 
		Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(ТорговаяМаркиНоменклатуры.Наименование);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Номенклатура.Наименование) Тогда 
		Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(Номенклатура.Наименование);
	КонецЕсли;
	
	
	//+003547 ВБалако закомментировал
	//Если ЗначениеЗаполнено(КлассификацияЗаУровнемВязкости) Тогда 
	//	Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(КлассификацияЗаУровнемВязкости.Наименование);
	//КонецЕсли;
	//-003547 ВБалако закомментировал
	
	//+004001 ВБалако 20210113 закомментировал
	//Если ЗначениеЗаполнено(КлассификацияЗаУровнемЭксплуатационныхСвойств) Тогда 
	//	Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(КлассификацияЗаУровнемЭксплуатационныхСвойств.Наименование);
	//КонецЕсли;
	//-004001 ВБалако 20210113
	
	// + IvanSidoruk 21.10.2020
	
	Если ДляРегистра = Истина
			и ЗначениеЗаполнено(Характеристика) Тогда 
		
		Если НЕ ЭтоНАлив(Характеристика,Номенклатура) Тогда 		
			Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(Характеристика.Наименование);
		КонецЕсли;
	//	
	КонецЕсли;
	// - IvanSidoruk 21.10.2020
	
	Если Не ЗначениеЗаполнено(Наименовние) Тогда 
		 Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(Номенклатура.Наименование);
	КонецЕсли;
	
	Возврат Наименовние;
КонецФункции
// - IvanSidoruk 14.05.2020

// + IvanSidoruk 14.05.2020
Функция СформироватьНаименованиеНоменклатурыПоПараметрамНовое(Номенклатура,Характеристика,ГруппаПродукцииЗаПредназначением, ТорговаяМаркиНоменклатуры,КлассификацияЗаУровнемВязкости,КлассификацияЗаУровнемЭксплуатационныхСвойств, ДляРегистра = Ложь) Экспорт 
	
	Наименовние = "";
	
	Если ЗначениеЗаполнено(ГруппаПродукцииЗаПредназначением) Тогда 
		Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(ГруппаПродукцииЗаПредназначением.Наименование);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ТорговаяМаркиНоменклатуры) Тогда 
		Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(ТорговаяМаркиНоменклатуры.Наименование);
	КонецЕсли;
	
	
		
	
	//Если ЗначениеЗаполнено(КлассификацияЗаУровнемВязкости) Тогда 
	//	Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(КлассификацияЗаУровнемВязкости.Наименование);
	//КонецЕсли;
	
	//Если ЗначениеЗаполнено(КлассификацияЗаУровнемЭксплуатационныхСвойств) Тогда 
	//	Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(КлассификацияЗаУровнемЭксплуатационныхСвойств.Наименование);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура.НаименованиеПолное) Тогда 
		Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(Номенклатура.НаименованиеПолное);
	КонецЕсли;

	
	
	Если ДляРегистра = Истина
			и ЗначениеЗаполнено(Характеристика) Тогда 
		
		Если НЕ ЭтоНАлив(Характеристика,Номенклатура) Тогда 		
			Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(Характеристика.Наименование);
		КонецЕсли;
	//	
	КонецЕсли;
	// - IvanSidoruk 21.10.2020
	
	Если Не ЗначениеЗаполнено(Наименовние) Тогда 
		 Наименовние = Наименовние+?(ЗначениеЗаполнено(Наименовние)," ","")+СокрЛП(Номенклатура.Наименование);
	КонецЕсли;
	
	Возврат Наименовние;
КонецФункции



// + IvanSidoruk 14.05.2020
//+003431 ВБалако 20200924	
//Функция  ВернутьТаблицуНаименованийНоменклатурыКонтрагента(МассивНоменклатуры, Контрагент, ДатаСреза,Организация = Неопределено) Экспорт 
Функция  ВернутьТаблицуНаименованийНоменклатурыКонтрагента(МассивНоменклатуры, Контрагент = Неопределено, ДатаСреза = Неопределено,Организация = Неопределено) Экспорт 
//-003431 ВБалако 20200924

	пДатаСреза = ?(ЗначениеЗаполнено(ДатаСреза), КонецДня(ДатаСреза), КонецДня(ТекущаяДата()));
	
	// + IvanSidoruk 20.07.2020
	БратьПоКонтрагентуОрганизации = Ложь;
	ТекКонтагентВнутригруппа = Неопределено;
	//+003431 ВБалако 20200924
	Если ЗначениеЗаполнено(Контрагент) Тогда
		//-003431 ВБалако 20200924
		Если ЗначениеЗаполнено(Организация) Тогда 
			ЭтоВнутригруппа = РазработкаСервер.ЭтоВнутригруппа(Организация,Контрагент);
			
			Если ЭтоВнутригруппа = Истина Тогда 
				ТекКонтагентВнутригруппа = Организация.vr_Контрагент;	
				БратьПоКонтрагентуОрганизации = ЗначениеЗаполнено(ТекКонтагентВнутригруппа);
			КонецЕсли;
		КонецЕсли;
		// - IvanSidoruk 20.07.2020
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСреза", пДатаСреза);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		// + IvanSidoruk 20.07.2020
		Запрос.УстановитьПараметр("БратьПоКонтрагентуОрганизации", БратьПоКонтрагентуОрганизации);
		Запрос.УстановитьПараметр("ТекКонтагентВнутригруппа", ТекКонтагентВнутригруппа);
		// - IvanSidoruk 20.07.2020
		
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		//+003431 ВБалако 20200924
		ТекстЗапроса1 = "И Контрагент = &Контрагент";
		ТекстЗапроса2 = "И Контрагент = &ТекКонтагентВнутригруппа";
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСреза", пДатаСреза);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		Запрос.УстановитьПараметр("БратьПоКонтрагентуОрганизации", БратьПоКонтрагентуОрганизации);
		ТекстЗапроса1 = "";
		ТекстЗапроса2 = "";
	КонецЕсли;
	//-003431 ВБалако 20200924
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураКонтрагентовСрезПоследних.Номенклатура,
		|	НоменклатураКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НоменклатураКонтрагентовСрезПоследних.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов.СрезПоследних(
		|			&ДатаСреза,
		|			Номенклатура В (&МассивНоменклатуры)
		//+003431 ВБалако 20200924
		//|				И Контрагент = &Контрагент) КАК НоменклатураКонтрагентовСрезПоследних
		|				"+ ТекстЗапроса1 +") КАК НоменклатураКонтрагентовСрезПоследних
		//-003431 ВБалако 20200924
		| ГДЕ
		|	ВЫРАЗИТЬ(НаименованиеНоменклатурыКонтрагента  КАК СТРОКА(100))  <> &ПустаяСтрока
		|
		// + IvanSidoruk 20.07.2020
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	НоменклатураКонтрагентовСрезПоследних.Номенклатура,
		|	НоменклатураКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НоменклатураКонтрагентовСрезПоследних.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов.СрезПоследних(
		|			&ДатаСреза,
		|			Номенклатура В (&МассивНоменклатуры)
		//+003431 ВБалако 20200924
		//|				И Контрагент = &ТекКонтагентВнутригруппа) КАК НоменклатураКонтрагентовСрезПоследних
		|				"+ ТекстЗапроса2 +") КАК НоменклатураКонтрагентовСрезПоследних
		//+003431 ВБалако 20200924
		| ГДЕ
		|	ВЫРАЗИТЬ(НаименованиеНоменклатурыКонтрагента  КАК СТРОКА(100))  <> &ПустаяСтрока
		|	и &БратьПоКонтрагентуОрганизации = Истина
		// - IvanSidoruk 20.07.2020
		|";
	
	ТАблицаНаименованийКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТАблицаНаименованийКонтрагентов;
	
КонецФункции
// - IvanSidoruk 14.05.2020


// + IvanSidoruk 14.05.2020
Функция ПолучитьНаименованиеНоменклатуры(Номенклатура,Характеристика,ТАблицаНаименованийКонтрагентов,ДляРегистра = Ложь, добавлятьГТД= Ложь)  Экспорт 
	
	СтрокаНаименования = "";
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда 
		Возврат СтрокаНаименования;	
	КонецЕсли;
	
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда 
		Возврат Номенклатура; 
	КонецЕсли;
	
	//СтрокаНаименованияКонтрагента =  ТАблицаНаименованийКонтрагентов.Найти(Номенклатура,"Номенклатура");
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",Номенклатура);
	СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры",Характеристика);
	СтрокаНаименованияКонтрагента =  ТАблицаНаименованийКонтрагентов.НАйтиСтроки(СтруктураПоиска);
	
	ЕстьНаименваниеКонтрагента = Ложь;
	Если СтрокаНаименованияКонтрагента.Количество()>0 Тогда 
		СтрокаНаименования = СокрЛП(СтрокаНаименованияКонтрагента[0].НаименованиеНоменклатурыКонтрагента);
		ЕстьНаименваниеКонтрагента = Истина;
	КонецЕсли;
	
	Если ДляРегистра = Истина И ЗначениеЗаполнено(СтрокаНаименования) Тогда 
		Возврат СтрокаНаименования;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(СтрокаНаименования) Тогда 
		//+003431 ВБалако 20200924
		//СтрокаНаименования = СокрЛП(Номенклатура.НаименованиеПолное);
		СписокЗначенийРеквизитов = СписокКлючевыхРеквизитовНоменклатуры(Номенклатура);
		СтрокаНаименования = СформироватьНаименованиеНоменклатурыПоПараметрам(Номенклатура,Характеристика,СписокЗначенийРеквизитов[0].Значение,СписокЗначенийРеквизитов[1].Значение,СписокЗначенийРеквизитов[2].Значение,СписокЗначенийРеквизитов[3].Значение);
		//-003431 ВБалако 20200924			
	КонецЕсли;	
	
	// + IvanSidoruk 08.10.2020
	Если Не ЕстьНаименваниеКонтрагента
		и ЗначениеЗаполнено(Характеристика) 
		и ЗначениеЗаполнено(СтрокаНаименования)  Тогда 
		ЭтоНАлив = Разработка.ЭтоНАлив(Характеристика,Номенклатура);
		СтрокаНаименования = СтрокаНаименования + ?(ЭтоНАлив,""," "+ Строка(Характеристика))
	КонецЕсли;
	// - IvanSidoruk 08.10.2020
	
	Если добавлятьГТД = Истина и ЗначениеЗаполнено(СтрокаНаименования) Тогда 
		ТекНоменклатураГТД = Номенклатура.НоменклатураГТД;
		Если ЗначениеЗаполнено(ТекНоменклатураГТД) Тогда 
				СтрокаНаименования = СтрокаНаименования + " ("+СокрЛП(ТекНоменклатураГТД)+")";		
			КонецЕсли;
	КонецЕсли;	
	
	Возврат СтрокаНаименования;
	
	
КонецФункции
// - IvanSidoruk 14.05.2020

//+005377 BalakoD 20210915
Функция ПолучитьНаименованиеНоменклатурыДляОтчёта(Номенклатура,Характеристика, Контрагент, Дата) Экспорт
	
	Если Характеристика = Неопределено ИЛИ Контрагент = Неопределено ИЛИ Дата = Неопределено Тогда
		Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда
			Возврат Номенклатура; 
		ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат Номенклатура.НаименованиеПолное;
		КонецЕсли;	
	КонецЕсли;	
	
	пДатаСреза = Дата;
	
	// + IvanSidoruk 20.07.2020
	БратьПоКонтрагентуОрганизации = Ложь;
	ТекКонтагентВнутригруппа = Неопределено;
	// - IvanSidoruk 20.07.2020
	//+003431 ВБалако 20200924
	Если ЗначениеЗаполнено(Контрагент) Тогда
		//-003431 ВБалако 20200924
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСреза", пДатаСреза);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		// + IvanSidoruk 20.07.2020
		Запрос.УстановитьПараметр("БратьПоКонтрагентуОрганизации", БратьПоКонтрагентуОрганизации);
		Запрос.УстановитьПараметр("ТекКонтагентВнутригруппа", ТекКонтагентВнутригруппа);
		// - IvanSidoruk 20.07.2020
		
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		//+003431 ВБалако 20200924
		ТекстЗапроса1 = "И Контрагент = &Контрагент";
		ТекстЗапроса2 = "И Контрагент = &ТекКонтагентВнутригруппа";
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСреза", пДатаСреза);
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		Запрос.УстановитьПараметр("БратьПоКонтрагентуОрганизации", БратьПоКонтрагентуОрганизации);
		ТекстЗапроса1 = "";
		ТекстЗапроса2 = "";
	КонецЕсли;
	//-003431 ВБалако 20200924
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураКонтрагентовСрезПоследних.Номенклатура,
		|	НоменклатураКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НоменклатураКонтрагентовСрезПоследних.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов.СрезПоследних(
		|			&ДатаСреза,
		|			Номенклатура = &Номенклатура
		//+003431 ВБалако 20200924
		//|				И Контрагент = &Контрагент) КАК НоменклатураКонтрагентовСрезПоследних
		|				"+ ТекстЗапроса1 +") КАК НоменклатураКонтрагентовСрезПоследних
		//-003431 ВБалако 20200924
		| ГДЕ
		|	ВЫРАЗИТЬ(НаименованиеНоменклатурыКонтрагента  КАК СТРОКА(100))  <> &ПустаяСтрока
		|
		// + IvanSidoruk 20.07.2020
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	НоменклатураКонтрагентовСрезПоследних.Номенклатура,
		|	НоменклатураКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НоменклатураКонтрагентовСрезПоследних.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов.СрезПоследних(
		|			&ДатаСреза,
		|			Номенклатура = &Номенклатура
		//+003431 ВБалако 20200924
		//|				И Контрагент = &ТекКонтагентВнутригруппа) КАК НоменклатураКонтрагентовСрезПоследних
		|				"+ ТекстЗапроса2 +") КАК НоменклатураКонтрагентовСрезПоследних
		//+003431 ВБалако 20200924
		| ГДЕ
		|	ВЫРАЗИТЬ(НаименованиеНоменклатурыКонтрагента  КАК СТРОКА(100))  <> &ПустаяСтрока
		|	и &БратьПоКонтрагентуОрганизации = Истина
		// - IvanSidoruk 20.07.2020
		|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Возврат ТАблицаНаименованийКонтрагентов;
	Если Выборка.Следующий() Тогда
		
		СтрокаНаименования = "";
		
		Номенклатура = Выборка.Номенклатура;
		Характеристика = Выборка.ХарактеристикаНоменклатуры;
		
		
		ЕстьНаименваниеКонтрагента = Ложь;
		Если НЕ ЗначениеЗаполнено(Выборка.НаименованиеНоменклатурыКонтрагента) Тогда 
			СтрокаНаименования = СокрЛП(Выборка.НаименованиеНоменклатурыКонтрагента);
			ЕстьНаименваниеКонтрагента = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаНаименования) Тогда 
			//+003431 ВБалако 20200924
			//СтрокаНаименования = СокрЛП(Номенклатура.НаименованиеПолное);
			СписокЗначенийРеквизитов = СписокКлючевыхРеквизитовНоменклатуры(Номенклатура);
			СтрокаНаименования = СформироватьНаименованиеНоменклатурыПоПараметрам(Номенклатура,Характеристика,СписокЗначенийРеквизитов[0].Значение,СписокЗначенийРеквизитов[1].Значение,СписокЗначенийРеквизитов[2].Значение,СписокЗначенийРеквизитов[3].Значение);
			//-003431 ВБалако 20200924			
		КонецЕсли;	
		
		// + IvanSidoruk 08.10.2020
		Если Не ЕстьНаименваниеКонтрагента
			и ЗначениеЗаполнено(Характеристика) 
			и ЗначениеЗаполнено(СтрокаНаименования)  Тогда 
			ЭтоНАлив = Разработка.ЭтоНАлив(Характеристика,Номенклатура);
			СтрокаНаименования = СтрокаНаименования + ?(ЭтоНАлив,""," "+ Строка(Характеристика))
		КонецЕсли;
		// - IvanSidoruk 08.10.2020
		
		Возврат СтрокаНаименования;
		
	Иначе
		
		СтрокаНаименования = "";
		ЕстьНаименваниеКонтрагента = Ложь;
		
		Если Не ЗначениеЗаполнено(СтрокаНаименования) Тогда 
			//+003431 ВБалако 20200924
			СписокЗначенийРеквизитов = СписокКлючевыхРеквизитовНоменклатуры(Номенклатура);
			СтрокаНаименования = СформироватьНаименованиеНоменклатурыПоПараметрам(Номенклатура,Характеристика,СписокЗначенийРеквизитов[0].Значение,СписокЗначенийРеквизитов[1].Значение,СписокЗначенийРеквизитов[2].Значение,СписокЗначенийРеквизитов[3].Значение);
			//-003431 ВБалако 20200924			
		КонецЕсли;	
		
		// + IvanSidoruk 08.10.2020
		Если Не ЕстьНаименваниеКонтрагента
			и ЗначениеЗаполнено(Характеристика) 
			и ЗначениеЗаполнено(СтрокаНаименования)  Тогда 
			ЭтоНАлив = Разработка.ЭтоНАлив(Характеристика,Номенклатура);
			СтрокаНаименования = СтрокаНаименования + ?(ЭтоНАлив,""," "+ Строка(Характеристика))
		КонецЕсли;
		// - IvanSidoruk 08.10.2020
		
		Возврат СтрокаНаименования;
		
		Если Характеристика = Неопределено ИЛИ Контрагент = Неопределено ИЛИ Дата = Неопределено Тогда
			Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда
				Возврат Номенклатура; 
			ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				Возврат Номенклатура.НаименованиеПолное;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции	
//-005377 BalakoD 20210915

Процедура ОтчетПроизводстваЗаСменуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//+003431 ВБалако 20200924
	Если НЕ Отказ Тогда 
		//Источник = документ ОтчетПроизводстваЗаСмену
		ПроверкаЕдиницИзмеренияИХарактеристикОбработкаПроведения(Источник, Отказ, РежимПроведения,Истина);
	КонецЕсли;
	//-003431 ВБалако 20200924
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	// + IvanSidoruk 23.02.2021
	ИспользоватьДопРАсходыНаТоварныхСчета  = Разработка.ИспользоватьДопРасходовНаТоварныхСчетах(Источник.Дата);
	
	ПерезаписьНенужна = ?(Источник.ВидОперации = Перечисления.ВидыОперацийПроизводства.ВозвратИзПроизводства и  ИспользоватьДопРАсходыНаТоварныхСчета = Ложь, Истина, Ложь);
	// - IvanSidoruk 23.02.2021
	
	Если ((НЕ Источник.ДополнительныеСвойства.Свойство("ЭтоПереЗапись")) ИЛИ  Источник.ДополнительныеСвойства.Свойство("ЭтоПереЗапись")  и   Источник.ДополнительныеСвойства.ЭтоПереЗапись = Ложь )  Тогда 
		
		Если НЕ ПерезаписьНенужна Тогда 
			Источник.ДополнительныеСвойства.Вставить("ЭтоПереЗапись", Истина);
		КонецЕсли;
		
		
		
		//Заполним Суммы
		//Источник.Продукция.итог("Количество") ;
		ИтогоКоличество	= 0;
		Для Каждого СтркоаТЧ из Источник.Продукция Цикл 
			К =?(ЗначениеЗаполнено(СтркоаТЧ.Коэффициент), СтркоаТЧ.Коэффициент,СтркоаТЧ.ЕдиницаИзмерения.Коэффициент);
			ТЕкКоличество = СтркоаТЧ.Количество * К /СтркоаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
			ИтогоКоличество = ИтогоКоличество + ТЕкКоличество; 
		КонецЦикла;
		
		ТаблицаПродукции	= Источник.Продукция;
		
		ИтоговаяСуммаДо	= ТаблицаПродукции.итог("СуммаПлановая") ;
		
		// + IvanSidoruk 11.11.2020
		СебестоимостьТовараДо	= ТаблицаПродукции.итог("СебестоимостьТовара") ;
		СебестоимостьАкцизДо	= ТаблицаПродукции.итог("СебестоимостьАкциз") ;
		
		СебестоимостьПошлинаДо		= ТаблицаПродукции.итог("СебестоимостьПошлина") ;
		СебестоимостьБрокерскиеДо	= ТаблицаПродукции.итог("СебестоимостьБрокерские") ;
		СебестоимостьТранспортДо		= ТаблицаПродукции.итог("СебестоимостьТранспорт") ;
		СебестоимостьУтилизацияДо	= ТаблицаПродукции.итог("СебестоимостьУтилизация") ;
		СебестоимостьХранениеДо		= ТаблицаПродукции.итог("СебестоимостьХранение") ;
		СебестоимостьМаржаДо			= ТаблицаПродукции.итог("СебестоимостьМаржа") ;
		// - IvanSidoruk 11.11.2020
		
		
		// + IvanSidoruk 18.09.2020
		ИтоговаяСуммаМатериалы	= Источник.Материалы.итог("Себестоимость") ;
		// - IvanSidoruk 18.09.2020
		
		
		ГлСчетаУчетаНСП = РазработкаСервер.ПолучитьСчетаУчетаНСП();
		
		ТаблицаСчетовДопЗатрат = ПолучитьТаблицуСоответвияСчетовДопРАсходов();
		
		ИтоговаяСумма = 0;
		// + IvanSidoruk 18.09.2020
		ОписаниеТиповЧислоСумма = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
		
		ТаблицаСебестоимостейМатериалов = Новый ТаблицаЗначений;
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("Номенклатура");
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("Количество",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("Себестоимость",ОписаниеТиповЧислоСумма);
		
		// + IvanSidoruk 11.11.2020
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьТовара"			,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьАкциз"			,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьПошлина"		,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьБрокерские"	,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьТранспорт"		,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьУтилизация"	,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьХранение"		,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостейМатериалов.Колонки.Добавить("СебестоимостьМаржа"			,	ОписаниеТиповЧислоСумма);
		// - IvanSidoruk 11.11.2020
		
		// - IvanSidoruk 18.09.2020
		Для Каждого Проводка из Источник.Движения.Хозрасчетный Цикл 
			
			ТекСчетКТ = Проводка.СчетКт;
			Если ГлСчетаУчетаНСП.Найти(ТекСчетКТ) = Неопределено  Тогда
				Продолжить;
			КонецЕсли;
			
			// + IvanSidoruk 18.09.2020
			ТекМатериал = Проводка.СубконтоКт.Номенклатура;
			СтрокаМатериалов = ТаблицаСебестоимостейМатериалов.Найти(ТекМатериал,"Номенклатура");
			Если СтрокаМатериалов = Неопределено Тогда 
				СтрокаМатериалов = ТаблицаСебестоимостейМатериалов.Добавить(); 
			КонецЕсли;
			
			ТекСумма =   Проводка.Сумма;
			
			СтрокаМатериалов.Номенклатура	= ТекМатериал;
			СтрокаМатериалов.Количество 		= СтрокаМатериалов.Количество 		+ Проводка.КоличествоКт;
			СтрокаМатериалов.Себестоимость 	= СтрокаМатериалов.Себестоимость	+ ТекСумма;
			 // - IvanSidoruk 18.09.2020
			 
			 // + IvanSidoruk 11.11.2020
			 
			 
			 ЭтоСебестоимостьТовара	= ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Товара");
			 ЭтоСебестоимостьАкциз		= ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Акциз");
			 ЭтоСебестоимостьПошлина	= ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Пошлина");			 
			 ЭтоСебестоимостьБрокерские	= 	ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Брокерские");
			 ЭтоСебестоимостьТранспорт		= 	ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Транспорт");
			 ЭтоСебестоимостьУтилизация		= ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Утилизация");
			 ЭтоСебестоимостьХранение		= ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Хранение")	;		 
			 ЭтоСебестоимостьМаржа			= ИспользоватьДопРАсходыНаТоварныхСчета и ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Маржа");
			
			//Инетерестная штука если счет ТОВАРЫНЫЙ но какой-то другой, нельзя потерять себестоимость!!!! 
			Если ИспользоватьДопРАсходыНаТоварныхСчета Тогда 
				Если  НЕ ЭтоСебестоимостьТовара
					 и не ЭтоСебестоимостьАкциз
					  и не  ЭтоСебестоимостьПошлина
					   и не  ЭтоСебестоимостьБрокерские
					    и не ЭтоСебестоимостьТранспорт
						и не ЭтоСебестоимостьУтилизация
							и не ЭтоСебестоимостьХранение
						 и не ЭтоСебестоимостьМаржа Тогда 
						 
						 
						 СтрокаМатериалов.СебестоимостьТовара			= СтрокаМатериалов.СебестоимостьТовара		+ ТекСумма
					 КонецЕсли;
			КонецЕсли;					
			
			СтрокаМатериалов.СебестоимостьТовара			= СтрокаМатериалов.СебестоимостьТовара		+?(ЭтоСебестоимостьТовара, ТекСумма,0);
			
			СтрокаМатериалов.СебестоимостьАкциз				= СтрокаМатериалов.СебестоимостьАкциз			+?(ЭтоСебестоимостьАкциз, ТекСумма,0);
			СтрокаМатериалов.СебестоимостьПошлина 		= СтрокаМатериалов.СебестоимостьПошлина		+?(ЭтоСебестоимостьПошлина, ТекСумма,0);
			СтрокаМатериалов.СебестоимостьБрокерские 	= СтрокаМатериалов.СебестоимостьБрокерские	+?(ЭтоСебестоимостьБрокерские, ТекСумма,0);
			СтрокаМатериалов.СебестоимостьТранспорт		= СтрокаМатериалов.СебестоимостьТранспорт	+?(ЭтоСебестоимостьТранспорт, ТекСумма,0);
			СтрокаМатериалов.СебестоимостьУтилизация		= СтрокаМатериалов.СебестоимостьУтилизация	+?(ЭтоСебестоимостьУтилизация, ТекСумма,0);
			СтрокаМатериалов.СебестоимостьХранение		= СтрокаМатериалов.СебестоимостьХранение		+?(ЭтоСебестоимостьХранение, ТекСумма,0);
			СтрокаМатериалов.СебестоимостьМаржа			= СтрокаМатериалов.СебестоимостьМаржа			+?(ЭтоСебестоимостьМаржа, ТекСумма,0);
			// - IvanSidoruk 11.11.2020
			
			ИтоговаяСумма = ИтоговаяСумма  + Проводка.Сумма;
		КонецЦикла;
		
		// + IvanSidoruk 11.11.2020
		ИтоговаяСебестоимостьТовара 		= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьТовара");
		ИтоговаяСебестоимостьАкциз 			= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьАкциз");
		ИтоговаяСебестоимостьПошлина		= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьПошлина");
		ИтоговаяСебестоимостьБрокерские	= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьБрокерские");
		ИтоговаяСебестоимостьТранспорт	= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьТранспорт");
		ИтоговаяСебестоимостьУтилизация	= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьУтилизация");
		ИтоговаяСебестоимостьХранение	= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьХранение");
		ИтоговаяСебестоимостьМаржа		= ТаблицаСебестоимостейМатериалов.Итог("СебестоимостьМаржа");
		// - IvanSidoruk 11.11.2020
		
		Если ПерезаписьНенужна Тогда 
			Если ИтоговаяСуммаДо <>ИтоговаяСумма Тогда  
				ОбщегоНазначения.СообщитьОбОшибке("Внимание! Сумма списанных материалов ="+ИтоговаяСумма +" не равна сумме продукции ("+ИтоговаяСуммаДо+"). Перераспределите сумму "+(ИтоговаяСумма-ИтоговаяСуммаДо)+"!", Отказ);  
			КонецЕсли;
		Иначе 
			// + IvanSidoruk 18.09.2020
			//Если ИтоговаяСуммаДо <>ИтоговаяСумма  Тогда 
			Если (ИтоговаяСуммаДо <>ИтоговаяСумма) 
				или (ИтоговаяСуммаМатериалы <> ИтоговаяСумма) 
				// + IvanSidoruk 11.11.2020
					или  (СебестоимостьТовараДо  <>ИтоговаяСебестоимостьТовара) 
							или  (СебестоимостьАкцизДо  <>ИтоговаяСебестоимостьАкциз) 
							или  (СебестоимостьПошлинаДо  <>ИтоговаяСебестоимостьПошлина) 
							или  (СебестоимостьБрокерскиеДо  <>ИтоговаяСебестоимостьБрокерские) 
							или  (СебестоимостьТранспортДо  <>ИтоговаяСебестоимостьТранспорт) 
							или  (СебестоимостьУтилизацияДо  <>ИтоговаяСебестоимостьУтилизация) 
							или  (СебестоимостьХранениеДо  <>ИтоговаяСебестоимостьХранение) 
							или  (СебестоимостьМаржаДо  <>ИтоговаяСебестоимостьМаржа) 
							// - IvanSidoruk 11.11.2020
						Тогда 
				// - IvanSidoruk 18.09.2020
				соотвествиеПогрешностей	= Новый Соответствие;				
				ТекПогрешность					= 0;
				
				// + IvanSidoruk 11.11.2020
				соотвествиеПогрешностейСебестоимостьТовара			= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьАкциз			= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьПошлина		= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьБрокерские	= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьТранспорт	= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьУтилизация	= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьХранение		= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьМаржа			= Новый Соответствие;
				
				ТекПогрешностьСебестоимостьТовара						= 0;
				ТекПогрешностьСебестоимостьАкциз							= 0;
				ТекПогрешностьСебестоимостьПошлина						= 0;
				ТекПогрешностьСебестоимостьБрокерские					= 0;
				ТекПогрешностьСебестоимостьТранспорт					= 0;
				ТекПогрешностьСебестоимостьУтилизация					= 0;
				ТекПогрешностьСебестоимостьХранение						= 0;
				ТекПогрешностьСебестоимостьМаржа							= 0;
				// - IvanSidoruk 11.11.2020
				
				
				Для Каждого СтрокаТЧ из Источник.Продукция Цикл 
					К =?(ЗначениеЗаполнено(СтрокаТЧ.Коэффициент), СтрокаТЧ.Коэффициент,СтрокаТЧ.ЕдиницаИзмерения.Коэффициент);
					ТекКОличество = СтрокаТЧ.Количество * К /СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;					
					//Сумма =  ИтоговаяСумма*(СтрокаТЧ.Количество/ИтогоКоличество);
					
					КоличествоПропорциональноБазовых = (ТекКОличество/ИтогоКоличество);
					Сумма =  ИтоговаяСумма*КоличествоПропорциональноБазовых;
					
					ОбщегоНазначения.ОкруглитьСУчетомПогрешности(Сумма,2,ТекПогрешность, соотвествиеПогрешностей);
										
					// + IvanSidoruk 11.11.2020
					ТекСебестоимостьТовара 		= 0;		
					ТекСебестоимостьАкциз 			= 0;		
					ТекСебестоимостьПошлина 		= 0;		
					ТекСебестоимостьБрокерские = 0;
					ТекСебестоимостьТранспорт	= 0;				
					ТекСебестоимостьУтилизация	= 0;		
					ТекСебестоимостьХранение 	= 0;		
					ТекСебестоимостьМаржа 		= 0;
					
					Если ИспользоватьДопРАсходыНаТоварныхСчета Тогда 
								
					
						ТекСебестоимостьТовара 		= ИтоговаяСебестоимостьТовара*КоличествоПропорциональноБазовых;					
						ТекСебестоимостьТовара			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьТовара,2,ТекПогрешностьСебестоимостьТовара, соотвествиеПогрешностейСебестоимостьТовара,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьАкциз 			= ИтоговаяСебестоимостьАкциз*КоличествоПропорциональноБазовых;
						ТекСебестоимостьАкциз			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьАкциз,2,ТекПогрешностьСебестоимостьАкциз, соотвествиеПогрешностейСебестоимостьАкциз,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьПошлина 		= ИтоговаяСебестоимостьПошлина*КоличествоПропорциональноБазовых;
						ТекСебестоимостьПошлина			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьПошлина,2,ТекПогрешностьСебестоимостьПошлина, соотвествиеПогрешностейСебестоимостьПошлина,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьБрокерские = ИтоговаяСебестоимостьБрокерские*КоличествоПропорциональноБазовых;
						ТекСебестоимостьБрокерские	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьБрокерские,2,ТекПогрешностьСебестоимостьБрокерские, соотвествиеПогрешностейСебестоимостьБрокерские,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьТранспорт 	= ИтоговаяСебестоимостьТранспорт*КоличествоПропорциональноБазовых;
						ТекСебестоимостьТранспорт	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьТранспорт,2,ТекПогрешностьСебестоимостьТранспорт, соотвествиеПогрешностейСебестоимостьТранспорт,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьУтилизация	= ИтоговаяСебестоимостьУтилизация*КоличествоПропорциональноБазовых;
						ТекСебестоимостьУтилизация	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьУтилизация,2,ТекПогрешностьСебестоимостьУтилизация, соотвествиеПогрешностейСебестоимостьУтилизация,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьХранение 	= ИтоговаяСебестоимостьХранение*КоличествоПропорциональноБазовых;
						ТекСебестоимостьХранение		=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьХранение,2,ТекПогрешностьСебестоимостьХранение, соотвествиеПогрешностейСебестоимостьХранение,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьМаржа			= ИтоговаяСебестоимостьМаржа*КоличествоПропорциональноБазовых;
						ТекСебестоимостьМаржа			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьМаржа,2,ТекПогрешностьСебестоимостьМаржа, соотвествиеПогрешностейСебестоимостьМаржа,СтрокаТЧ.Номенклатура);
					КонецЕсли;
					
					СтрокаТЧ.СебестоимостьТовара 			= ТекСебестоимостьТовара;		
					СтрокаТЧ.СебестоимостьАкциз 			= ТекСебестоимостьАкциз;		
					СтрокаТЧ.СебестоимостьПошлина 		= ТекСебестоимостьПошлина;		
					СтрокаТЧ.СебестоимостьБрокерские	= ТекСебестоимостьБрокерские;		
					СтрокаТЧ.СебестоимостьТранспорт 	= ТекСебестоимостьТранспорт;		
					СтрокаТЧ.СебестоимостьУтилизация	= ТекСебестоимостьУтилизация;		
					СтрокаТЧ.СебестоимостьХранение		= ТекСебестоимостьХранение;		
					СтрокаТЧ.СебестоимостьМаржа 			= ТекСебестоимостьМаржа;		
					// - IvanSidoruk 11.11.2020
					
					СтрокаТЧ.СуммаПлановаяУпр      = Сумма;
					СтрокаТЧ.СуммаПлановая           = Сумма;	
					
					СтрокаТЧ.ПлановаяСтоимостьУпр = СтрокаТЧ.СуммаПлановаяУпр / ТекКОличество;
					СтрокаТЧ.ПлановаяСтоимость = СтрокаТЧ.СуммаПлановая / ТекКОличество;
				КонецЦикла;
				
				// + IvanSidoruk 18.09.2020
				//Материалы тоже нужно писать
				ТекПогрешность					= 0;
				соотвествиеПогрешностей	= Новый Соответствие;								
				Для Каждого СтрокаТЧМатериалы из   Источник.Материалы Цикл 
					
					ТекКоличество = СтрокаТЧМатериалы.Количество * СтрокаТЧМатериалы.Коэффициент /СтрокаТЧМатериалы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;					
					
					ИтоговоеКоличествоМатериала 		= 0;
					ИтоговоеСебестоимостьМатериала 	= 0;
					//найдем строчку с итоговыми суммами
					СтрокаДанных =  ТаблицаСебестоимостейМатериалов.Найти(СтрокаТЧМатериалы.Номенклатура,"Номенклатура");
					Если  СтрокаДанных <> Неопределено Тогда 
						ИтоговоеСебестоимостьМатериала	= СтрокаДанных.Себестоимость;	
						ИтоговоеКоличествоМатериала		= СтрокаДанных.Количество;	
					КонецЕсли;					
					
					ТекСебестоимость = 0;
					Если ЗначениеЗаполнено(ИтоговоеКоличествоМатериала) Тогда 
						ТекСебестоимость =  ИтоговоеСебестоимостьМатериала*(ТекКоличество/ИтоговоеКоличествоМатериала);					
						ТекСебестоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимость,2,ТекПогрешность, соотвествиеПогрешностей);
					КонецЕсли;
					
					СтрокаТЧМатериалы.Себестоимость  =ТекСебестоимость;
					
				КонецЦикла;
				// - IvanSidoruk 18.09.2020
				
				Источник.Записать(РежимЗаписиДокумента.Проведение,РежимПроведения);
				Источник.ДополнительныеСвойства.Вставить("ЭтоПереЗапись", Ложь);
			
			КонецЕсли;
			
		КонецЕсли;

		
		
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОткрытьВнешнююОбработкуОтчет(СсылкаОбработка,СтрукутраПарам = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(СсылкаОбработка) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если СсылкаОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
		ТипОбработки = ".erf";
		МенеджерОбработок = ВнешниеОтчеты;
	ИначеЕсли СсылкаОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка Тогда
		ТипОбработки = ".epf";
		МенеджерОбработок = ВнешниеОбработки;
	Иначе
		Возврат;
	КонецЕсли;
	
	Попытка
		ПутьКФайлу = ПолучитьИмяВременногоФайла(ТипОбработки);
		
		СсылкаОбработка.ХранилищеВнешнейОбработки.Получить().Записать(ПутьКФайлу);
	
		Форма = МенеджерОбработок.ПолучитьФорму(ПутьКФайлу);
		
		//  + IvanSidoruk 14.01.2019
		Если ТипЗнч(СтрукутраПарам) = тип("Структура") Тогда 
			Для Каждого КлючСтр из СтрукутраПарам Цикл 
				Форма[КлючСтр.Ключ] = КлючСтр.Значение;				
			КонецЦикла;
		КонецЕсли;
		//  - IvanSidoruk 14.01.2019
		
		Если Форма <> Неопределено Тогда
			Форма.Открыть();
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);

	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ПутьКФайлу); 
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

// - IvanSidoruk 24.07.2020

// + IvanSidoruk 31.07.2020
Функция ПолучитьСубконтоПоИндексуСубконто(Проводка,ИндексСубконто,ВидСчета ="Кт") Экспорт 

	ЗначениеСубконто = Неопределено;
	
	
	
	ТекСчет = Проводка["Счет"+ВидСчета];
	Если ЗначениеЗаполнено(ТекСчет) Тогда  
		ВидыСубконто = ТекСчет.ВидыСубконто;
		
		КоличествоВидовСубконто = ВидыСубконто.Количество();
		
		Если ИндексСубконто <= КоличествоВидовСубконто Тогда 
			ВидСубконто = ВидыСубконто[ИндексСубконто-1].ВидСубконто;
			ЗначениеСубконто = Проводка["Субконто"+ВидСчета][ВидСубконто];			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат ЗначениеСубконто;
	
КонецФункции

Процедура ОткрытьОтчетБаланс() Экспорт 
	
	     ОткрытьВнешнююОбработкуОтчет(Справочники.ВнешниеОбработки.Баланс);
	
КонецПроцедуры

Функция ИспольЗоватьНаливЖдНаливПоТарифу() Экспорт  

	Возврат (Константы.ВключитьНаливЖдНаливПоТарифу.Получить() = Истина);
	
КонецФункции

// + IvanSidoruk 14.12.2021
Функция ПолучитьМассвиДоходныхСчетов() Экспорт 
	
	ЗаппросСчетов = Новый Запрос;
	ЗаппросСчетов.Текст  ="
	 |ВЫБРАТЬ
	 |	Хозрасчетный.Ссылка КАК Ссылка
	 |ИЗ
	 |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	 |ГДЕ
	 |	Хозрасчетный.Ссылка В ИЕРАРХИИ(Значение(ПланСчетов.Хозрасчетный.ДоходыОтРеализации), Значение(ПланСчетов.Хозрасчетный.ДругойОперационныйДоход),Значение(ПланСчетов.Хозрасчетный.ДоходОтУчастияВКапитале)
	 |									,Значение(ПланСчетов.Хозрасчетный.ПрочиеФинансовыеДоходы),Значение(ПланСчетов.Хозрасчетный.ДругиеДоходы)
	 |									,Значение(ПланСчетов.Хозрасчетный.ЧрезвычайныеДоходы),Значение(ПланСчетов.Хозрасчетный.СтраховыеПлатежи))
	 |";
	
	МассивСчетов = ЗаппросСчетов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивСчетов;
	
КонецФункции
// - IvanSidoruk 14.12.2021


// + IvanSidoruk 16.06.2020
Процедура ОпределениеДоходностиПоДокументуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//+003431 ВБалако 20200924
	Если НЕ Отказ Тогда 
		//Источник = документ РеализацияТоваровУслуг
		ПроверкаЕдиницИзмеренияИХарактеристикОбработкаПроведения(Источник, Отказ, РежимПроведения, Истина);
	КонецЕсли;
	//-003431 ВБалако 20200924
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	//ПерезаписьНенужна = ?(Источник.ВидОперации = Перечисления.ВидыОперацийПроизводства.ВозвратИзПроизводства, Истина, Ложь);
	
	Если ((НЕ Источник.ДополнительныеСвойства.Свойство("ЭтоПереЗапись")) ИЛИ  Источник.ДополнительныеСвойства.Свойство("ЭтоПереЗапись")  и   Источник.ДополнительныеСвойства.ЭтоПереЗапись = Ложь )  Тогда 
		
		ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
		
		//Если НЕ ПерезаписьНенужна Тогда 
		//	Источник.ДополнительныеСвойства.Вставить("ЭтоПереЗапись", Истина);
		//КонецЕсли;
		ТаблицаСчетовДопЗатрат = ПолучитьТаблицуСоответвияСчетовДопРАсходов();
		//Заполним Суммы
		
		ИспользоватьДопРАсходыНаТоварныхСчета  = Разработка.ИспользоватьДопРасходовНаТоварныхСчетах(Источник.Дата);
		
		//ТаблицатТоваровИсточник = Источник.Товары.Выгрузить(); 
		ИтоговаяСебестоимостьДо	= Источник.Товары.итог("Себестоимость") ;
		// + IvanSidoruk 10.11.2020
		СебестоимостьТовараДо	= Источник.Товары.итог("СебестоимостьТовара") ;
		СебестоимостьАкцизДо	= Источник.Товары.итог("СебестоимостьАкциз") ;
		
		СебестоимостьПошлинаДо		= Источник.Товары.итог("СебестоимостьПошлина") ;
		СебестоимостьБрокерскиеДо	= Источник.Товары.итог("СебестоимостьБрокерские") ;
		СебестоимостьТранспортДо		= Источник.Товары.итог("СебестоимостьТранспорт") ;
		СебестоимостьУтилизацияДо	= Источник.Товары.итог("СебестоимостьУтилизация") ;
		СебестоимостьХранениеДо		= Источник.Товары.итог("СебестоимостьХранение") ;
		СебестоимостьМаржаДо			= Источник.Товары.итог("СебестоимостьМаржа") ;
		// - IvanSidoruk 10.11.2020
		
		СуммаВключаетНДС = Источник.СуммаВключаетНДС;
		ДоходДо = Источник.Товары.итог("Доход") ;
		
		
		// + IvanSidoruk 14.12.2021
		//для определяния доходности по валютным документам, нужно еще Доход собирать в грн
		СуммаДоходаВГРНВсегоДокумента = 0;
		ЭтоВалютныйДокумент = ВалютаРегл <> Источник.ВалютаДокумента;
		Если ЭтоВалютныйДокумент Тогда 
			МассивСчетовДоходов = ПолучитьМассвиДоходныхСчетов();
		КонецЕсли;
		// - IvanSidoruk 14.12.2021
		
		
		//ИтогоКоличество	= ТаблицатТоваровИсточник.итог("Количество") ;
		//ИтогоКоличество =0;
		//Для Каждого СтрокаТЧ Из ТаблицатТоваровИсточник Цикл 
		//	КБазовой = СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
		//	КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
		//	
		//	ИтогоКоличество = ИтогоКоличество + 	(СтрокаТЧ.Количество *СтрокаТЧ.Коэффициент)/КБазовой;
		//КонецЦикла;
		
		ГлСчетаУчетаНСП = РазработкаСервер.ПолучитьСчетаУчетаНСП();
		
		ИтоговаяСебестоимость= 0;
		
		МассивСчетовСебестоимости =Новый Массив;
		МассивСчетовСебестоимости.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойГотовойПродукции);
		МассивСчетовСебестоимости.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьРеализованныхТоваров);
		МассивСчетовСебестоимости.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьРеализованныхРаботИУслуг);
		МассивСчетовСебестоимости.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов);
		
		
		//Собирать Себестоимость нужно в разрезе Склада, Номенклатуры, Характеристики
		ТаблицаСебестоимостей =Новый ТаблицаЗначений;
		ТаблицаСебестоимостей.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаСебестоимостей.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		
		ТаблицаСебестоимостей.Колонки.Добавить("Характеристика",	 Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));		
		ТаблицаСебестоимостей.Колонки.Добавить("Количество",	Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
		
		// + IvanSidoruk 03.11.2021
		ТаблицаСебестоимостей.Колонки.Добавить("Партия");
		// - IvanSidoruk 03.11.2021
		
		ОписаниеТиповЧислоСумма = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,2));                                                     
		ТаблицаСебестоимостей.Колонки.Добавить("Себестоимость",	ОписаниеТиповЧислоСумма);
		
		// + IvanSidoruk 11.11.2020
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьТовара"			,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьАкциз"			,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьПошлина"		,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьБрокерские"	,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьТранспорт"		,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьУтилизация"	,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьХранение"		,	ОписаниеТиповЧислоСумма);
		ТаблицаСебестоимостей.Колонки.Добавить("СебестоимостьМаржа"			,	ОписаниеТиповЧислоСумма);
		// - IvanSidoruk 11.11.2020
		
		// + IvanSidoruk 20.07.2020
		ТаблицаПартийИНоменклатуры = Новый ТаблицаЗначений;;
		ТаблицаПартийИНоменклатуры.Колонки.Добавить("Номенклатура");
		ТаблицаПартийИНоменклатуры.Колонки.Добавить("ХарактеристикаНоменклатуры");
		ТаблицаПартийИНоменклатуры.Колонки.Добавить("Партия");
		// - IvanSidoruk 20.07.2020
		
		Для Каждого Проводка из Источник.Движения.Хозрасчетный Цикл 
			ТекСчетКТ = Проводка.СчетКт; 
			
			ТекСумма =   Проводка.Сумма;
			
			// + IvanSidoruk 14.12.2021
			Если ЭтоВалютныйДокумент Тогда 
				Если МассивСчетовДоходов.найти(ТекСчетКТ)<> Неопределено Тогда 
					СуммаДоходаВГРНВсегоДокумента =СуммаДоходаВГРНВсегоДокумента +ТекСумма; 
				КонецЕсли;
				
				Если МассивСчетовДоходов.найти(Проводка.СчетДт)<> Неопределено Тогда 
					СуммаДоходаВГРНВсегоДокумента =СуммаДоходаВГРНВсегоДокумента -ТекСумма; 
				КонецЕсли;
			КонецЕсли;
			// - IvanSidoruk 14.12.2021
				
			
			
			Если ГлСчетаУчетаНСП.Найти(ТекСчетКТ) = Неопределено  или МассивСчетовСебестоимости.Найти(Проводка.СчетДт) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			
			
			
			ТекХарактеристика = ?(ЗначениеЗаполнено(Проводка.СубконтоКт.НоменклатурныеПозиции),Проводка.СубконтоКт.НоменклатурныеПозиции.ХарактеристикаНоменклатуры,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			новаяСтркоа = ТаблицаСебестоимостей.Добавить();
			новаяСтркоа.Номенклатура  =Проводка.СубконтоКт.Номенклатура;
			новаяСтркоа.Склад				  =Проводка.СубконтоКт.Склады;
			новаяСтркоа.Характеристика = ТекХарактеристика;
			новаяСтркоа.Количество 	   =Проводка.КоличествоКт;
			новаяСтркоа.Себестоимость   =ТекСумма;
			// + IvanSidoruk 03.11.2021
			новаяСтркоа.Партия  	=Проводка.СубконтоКт.Партии;
			// - IvanSidoruk 03.11.2021
			
			// + IvanSidoruk 11.11.2020
			//нужно разложить себестоимость по структуре
			//у нас теперь несколько счетов хранения, акциза и.т.д
			
			
			ЭтоТовара 		= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Товара");
			ЭтоАкциз			= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Акциз");
			ЭтоПошлина		= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Пошлина");
			ЭтоБрокерские= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Брокерские");
			ЭтоТранспорт	= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Транспорт");
			ЭтоУтилизация = ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Утилизация");
			ЭтоХранение	= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Хранение");
			ЭтоМаржа		= ИспользоватьДопРАсходыНаТоварныхСчета И ЭтоСчетПринадлежитИдентицифкатору(ТаблицаСчетовДопЗатрат,ТекСчетКТ,"Маржа");
			
			
			новаяСтркоа.СебестоимостьТовара			= ?(ЭтоТовара, ТекСумма,0);
			новаяСтркоа.СебестоимостьАкциз			= ?(ЭтоАкциз, ТекСумма,0);
			новаяСтркоа.СебестоимостьПошлина 		= ?(ЭтоПошлина, ТекСумма,0);
			новаяСтркоа.СебестоимостьБрокерские = ?(ЭтоБрокерские, ТекСумма,0);
			новаяСтркоа.СебестоимостьТранспорт	= ?(ЭтоТранспорт, ТекСумма,0);
			новаяСтркоа.СебестоимостьУтилизация	= ?(ЭтоУтилизация, ТекСумма,0);
			новаяСтркоа.СебестоимостьХранение		= ?(ЭтоХранение, ТекСумма,0);
			новаяСтркоа.СебестоимостьМаржа			= ?(ЭтоМаржа, ТекСумма,0);
			
			//Если счета нет, то в себестоимость товара добавим
			Если ИспользоватьДопРАсходыНаТоварныхСчета Тогда 
				Если НЕ ЭтоТовара
					и Не ЭтоАкциз
					и Не ЭтоПошлина
					и Не ЭтоБрокерские
					и Не ЭтоТранспорт
					и Не ЭтоУтилизация
					и Не ЭтоХранение
					и Не ЭтоМаржа				
					Тогда 
					
					новаяСтркоа.СебестоимостьТовара = новаяСтркоа.СебестоимостьТовара + ТекСумма;
				КонецЕсли;
			КонецЕсли;
			// - IvanSidoruk 11.11.2020			
			
			// + IvanSidoruk 20.07.2020
			ТекПартияСебестоимости = Проводка.СубконтоКт.Партии;
			Если ЗначениеЗаполнено(ТекПартияСебестоимости) 
				и ТипЗнч(ТекПартияСебестоимости) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
				
				ЭтоВнутригруппа = РазработкаСервер.ЭтоВнутригруппа(ТекПартияСебестоимости.Организация, ТекПартияСебестоимости.Контрагент);
				
				Если ЭтоВнутригруппа = Истина Тогда 
					
					
					СтрукутураПоискаПартииНоменулатуры = Новый Структура;
					СтрукутураПоискаПартииНоменулатуры.Вставить("Номенклатура",Проводка.СубконтоКт.Номенклатура);
					СтрукутураПоискаПартииНоменулатуры.Вставить("Партия",ТекПартияСебестоимости);
					СтрукутураПоискаПартииНоменулатуры.Вставить("ХарактеристикаНоменклатуры",ТекХарактеристика);
					
					ТаблРезпартийтоВаров = ТаблицаПартийИНоменклатуры.НайтиСтроки(СтрукутураПоискаПартииНоменулатуры);
					
					Если ТаблРезпартийтоВаров.Количество() =0 Тогда 
						новаяСтркоаПартий = ТаблицаПартийИНоменклатуры.Добавить();
						новаяСтркоаПартий.Номенклатура							=Проводка.СубконтоКт.Номенклатура;
						новаяСтркоаПартий.ХарактеристикаНоменклатуры	=ТекХарактеристика;
						новаяСтркоаПартий.Партия										=ТекПартияСебестоимости;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// - IvanSidoruk 20.07.2020
			
		КонецЦикла;
		
		
		ИтоговаяСебестоимость = ТаблицаСебестоимостей.Итог("Себестоимость");
		
		// + IvanSidoruk 11.11.2020
		ИтоговаяСебестоимостьТовара 		= ТаблицаСебестоимостей.Итог("СебестоимостьТовара");
		ИтоговаяСебестоимостьАкциз 			= ТаблицаСебестоимостей.Итог("СебестоимостьАкциз");
		ИтоговаяСебестоимостьПошлина		= ТаблицаСебестоимостей.Итог("СебестоимостьПошлина");
		ИтоговаяСебестоимостьБрокерские	= ТаблицаСебестоимостей.Итог("СебестоимостьБрокерские");
		ИтоговаяСебестоимостьТранспорт	= ТаблицаСебестоимостей.Итог("СебестоимостьТранспорт");
		ИтоговаяСебестоимостьУтилизация	= ТаблицаСебестоимостей.Итог("СебестоимостьУтилизация");
		ИтоговаяСебестоимостьХранение	= ТаблицаСебестоимостей.Итог("СебестоимостьХранение");
		ИтоговаяСебестоимостьМаржа		= ТаблицаСебестоимостей.Итог("СебестоимостьМаржа");
		// - IvanSidoruk 11.11.2020
		
		
		// + IvanSidoruk 14.12.2021
		
		ВалютнаяСуммаПропорционирования = 0;
		ТкПогрешностьСуммыВалюты = 0;
		Если ЭтоВалютныйДокумент Тогда 
		
			СуммаТоваровГрн = СуммаДоходаВГРНВсегоДокумента;
			СуммаНДСГРН		= 0;
			ВалютнаяСуммаПропорционирования = Источник.Товары.итог("Сумма");
		Иначе 
			
			СуммаТоваровГрн = Источник.Товары.итог("Сумма");
			СуммаНДСГРН	 = ?(СуммаВключаетНДС,Источник.Товары.итог("СуммаНДС"),0);
					
			//СуммаТоваровГрн = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаТоваровВВалютеДокумента,Источник.ВалютаДокумента,ВалютаРегл,Источник.КурсВзаиморасчетов,Источник.КратностьВзаиморасчетов,1,1);
			//СуммаНДСГРН		= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСВВалютеДокумента,Источник.ВалютаДокумента,ВалютаРегл,Источник.КурсВзаиморасчетов,Источник.КратностьВзаиморасчетов,1,1);
			
		КонецЕсли;
		ДоходПосле = СуммаТоваровГрн - СуммаНДСГРН - ИтоговаяСебестоимость;
		
		// - IvanSidoruk 14.12.2021
		//Если ПерезаписьНенужна Тогда 
		//	Если ИтоговаяСебестоимостьДо <>ИтоговаяСебестоимость Тогда  
		//		//ОбщегоНазначения.СообщитьОбОшибке("Внимание! Сумма списанных материалов ="+ИтоговаяСумма +" не равна сумме продукции ("+ИтоговаяСуммаДо+"). Перераспределите сумму "+(ИтоговаяСумма-ИтоговаяСуммаДо)+"!", Отказ);  
		//	КонецЕсли;
		//Иначе 			
		
			Если ИтоговаяСебестоимостьДо <>ИтоговаяСебестоимость 
						или (ДоходДо <> ДоходПосле)
						или  (СебестоимостьТовараДо  <>ИтоговаяСебестоимостьТовара) 
							или  (СебестоимостьАкцизДо  <>ИтоговаяСебестоимостьАкциз) 
							или  (СебестоимостьПошлинаДо  <>ИтоговаяСебестоимостьПошлина) 
							или  (СебестоимостьБрокерскиеДо  <>ИтоговаяСебестоимостьБрокерские) 
							или  (СебестоимостьТранспортДо  <>ИтоговаяСебестоимостьТранспорт) 
							или  (СебестоимостьУтилизацияДо  <>ИтоговаяСебестоимостьУтилизация) 
							или  (СебестоимостьХранениеДо  <>ИтоговаяСебестоимостьХранение) 
							или  (СебестоимостьМаржаДо  <>ИтоговаяСебестоимостьМаржа) 
							Тогда 
							
				соотвествиеПогрешностей	= Новый Соответствие;
				
				соотвествиеПогрешностейСебестоимостьТовара			= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьАкциз			= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьПошлина		= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьБрокерские	= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьТранспорт	= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьУтилизация	= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьХранение		= Новый Соответствие;
				соотвествиеПогрешностейСебестоимостьМаржа			= Новый Соответствие;
				
				ТекПогрешность					= 0;
				
				ТекПогрешностьСебестоимостьТовара						= 0;
				ТекПогрешностьСебестоимостьАкциз							= 0;
				ТекПогрешностьСебестоимостьПошлина						= 0;
				ТекПогрешностьСебестоимостьБрокерские					= 0;
				ТекПогрешностьСебестоимостьТранспорт					= 0;
				ТекПогрешностьСебестоимостьУтилизация					= 0;
				ТекПогрешностьСебестоимостьХранение						= 0;
				ТекПогрешностьСебестоимостьМаржа							= 0;
				
				
				ТабличнаяЧастьТовары =  Источник.Товары;
				
				// + IvanSidoruk 03.11.2021
				ОтбиратьПоПартии = Истина;
				для Каждого СтркоаТЧТовара Из ТабличнаяЧастьТовары Цикл 
					
					Если Не ЗначениеЗаполнено(СтркоаТЧТовара.ДокументОприходования) Тогда 
						ОтбиратьПоПартии=  Ложь;	
						Прервать;
					КонецЕсли;					
				КонецЦикла;				
				// - IvanSidoruk 03.11.2021
				
				Для Каждого СтрокаТЧ из ТабличнаяЧастьТовары Цикл 
					
					СтрокаТЧ.Себестоимость 		= 0;
					СтрокаТЧ.Доход				= 0;
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);
					СтруктураПоиска.Вставить("Склад"					,?(ЗначениеЗаполнено(СтрокаТЧ.Склад),СтрокаТЧ.Склад, Источник.Склад));
					СтруктураПоиска.Вставить("Характеристика",СтрокаТЧ.ХарактеристикаНоменклатуры);
					
					// + IvanSidoruk 03.11.2021
					Если ОтбиратьПоПартии Тогда 						
						СтруктураПоиска.Вставить("Партия",СтрокаТЧ.ДокументОприходования);
					КонецЕсли; 
					// - IvanSidoruk 03.11.2021
					
					ТекТаблицаСебестоимости =   ТаблицаСебестоимостей.Скопировать(СтруктураПоиска);
					
					СебестоимостьПоТовару 	= ТекТаблицаСебестоимости.Итог("Себестоимость");
					КоличествоПоТовару 		= ТекТаблицаСебестоимости.Итог("Количество");
					
					// + IvanSidoruk 10.11.2020
					СебестоимостьТовара 			= ТекТаблицаСебестоимости.Итог("СебестоимостьТовара");					
					СебестоимостьАкциз 			= ТекТаблицаСебестоимости.Итог("СебестоимостьАкциз");
					СебестоимостьПошлина 		= ТекТаблицаСебестоимости.Итог("СебестоимостьПошлина");
					СебестоимостьБрокерские 	= ТекТаблицаСебестоимости.Итог("СебестоимостьБрокерские");
					СебестоимостьТранспорт 	= ТекТаблицаСебестоимости.Итог("СебестоимостьТранспорт");
					СебестоимостьУтилизация	= ТекТаблицаСебестоимости.Итог("СебестоимостьУтилизация");
					СебестоимостьХранение 		= ТекТаблицаСебестоимости.Итог("СебестоимостьХранение");
					СебестоимостьМаржа			= ТекТаблицаСебестоимости.Итог("СебестоимостьМаржа");
					// - IvanSidoruk 10.11.2020					

					//Пересчет
					КБазовой = СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
					КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
					КоличествоВБазовыхЕдиница = 	(СтрокаТЧ.Количество *СтрокаТЧ.Коэффициент)/КБазовой; 
					
					КоличествоПропорциональноБазовых = (КоличествоВБазовыхЕдиница/КоличествоПоТовару);
					
					Сумма =  СебестоимостьПоТовару*КоличествоПропорциональноБазовых;
					Сумма	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(Сумма,2,ТекПогрешность, соотвествиеПогрешностей,СтрокаТЧ.Номенклатура);
					
					СтрокаТЧ.Себестоимость = Сумма;		
					
					// + IvanSidoruk 10.11.2020
					//для теста нужно переопределить 					
					//СтрокаТЧ.СебестоимостьАкциз = ИтоговаяСебестоимостьАкциз;		
					// + IvanSidoruk 11.11.2020
					ТекСебестоимостьТовара 		= 0;		
					ТекСебестоимостьАкциз 			= 0;		
					ТекСебестоимостьПошлина 		= 0;		
					ТекСебестоимостьБрокерские = 0;
					ТекСебестоимостьТранспорт	= 0;				
					ТекСебестоимостьУтилизация	= 0;		
					ТекСебестоимостьХранение 	= 0;		
					ТекСебестоимостьМаржа 		= 0;
					
					Если ИспользоватьДопРАсходыНаТоварныхСчета Тогда 
						ТекСебестоимостьТовара 		= СебестоимостьТовара*КоличествоПропорциональноБазовых;					
						ТекСебестоимостьТовара			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьТовара,2,ТекПогрешностьСебестоимостьТовара, соотвествиеПогрешностейСебестоимостьТовара,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьАкциз 			= СебестоимостьАкциз*КоличествоПропорциональноБазовых;
						ТекСебестоимостьАкциз			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьАкциз,2,ТекПогрешностьСебестоимостьАкциз, соотвествиеПогрешностейСебестоимостьАкциз,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьПошлина 		= СебестоимостьПошлина*КоличествоПропорциональноБазовых;
						ТекСебестоимостьПошлина			=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьПошлина,2,ТекПогрешностьСебестоимостьПошлина, соотвествиеПогрешностейСебестоимостьПошлина,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьБрокерские = СебестоимостьБрокерские*КоличествоПропорциональноБазовых;
						ТекСебестоимостьБрокерские	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьБрокерские,2,ТекПогрешностьСебестоимостьБрокерские, соотвествиеПогрешностейСебестоимостьБрокерские,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьТранспорт 	= СебестоимостьТранспорт*КоличествоПропорциональноБазовых;
						ТекСебестоимостьТранспорт	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьТранспорт,2,ТекПогрешностьСебестоимостьТранспорт, соотвествиеПогрешностейСебестоимостьТранспорт,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьУтилизация	= СебестоимостьУтилизация*КоличествоПропорциональноБазовых;
						ТекСебестоимостьУтилизация	=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьУтилизация,2,ТекПогрешностьСебестоимостьУтилизация, соотвествиеПогрешностейСебестоимостьУтилизация,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьХранение 	= СебестоимостьХранение*КоличествоПропорциональноБазовых;
						ТекСебестоимостьХранение		=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьХранение,2,ТекПогрешностьСебестоимостьХранение, соотвествиеПогрешностейСебестоимостьХранение,СтрокаТЧ.Номенклатура);
						
						ТекСебестоимостьМаржа			= СебестоимостьМаржа*КоличествоПропорциональноБазовых;
						ТекСебестоимостьМаржа		=  ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСебестоимостьМаржа,2,ТекПогрешностьСебестоимостьМаржа, соотвествиеПогрешностейСебестоимостьМаржа,СтрокаТЧ.Номенклатура);
					КонецЕсли;
					
					СтрокаТЧ.СебестоимостьТовара 			= ТекСебестоимостьТовара;		
					СтрокаТЧ.СебестоимостьАкциз 			= ТекСебестоимостьАкциз;		
					СтрокаТЧ.СебестоимостьПошлина 		= ТекСебестоимостьПошлина;		
					СтрокаТЧ.СебестоимостьБрокерские	= ТекСебестоимостьБрокерские;		
					СтрокаТЧ.СебестоимостьТранспорт 	= ТекСебестоимостьТранспорт;		
					СтрокаТЧ.СебестоимостьУтилизация	= ТекСебестоимостьУтилизация;		
					СтрокаТЧ.СебестоимостьХранение		= ТекСебестоимостьХранение;		
					СтрокаТЧ.СебестоимостьМаржа 			= ТекСебестоимостьМаржа;		
					// - IvanSidoruk 10.11.2020
					
					// + IvanSidoruk 14.12.2021					
					//ТекМаржа = СтрокаТЧ.Сумма-?(СуммаВключаетНДС,СтрокаТЧ.СуммаНДС,0) - СтрокаТЧ.Себестоимость;
					
					Если ЭтоВалютныйДокумент и ЗначениеЗаполнено(ВалютнаяСуммаПропорционирования)
						 Тогда 
						//Сумма Дохода будем размазывать по валютной сумме
						ТекСуммаДохода =СуммаДоходаВГРНВсегоДокумента *(СтрокаТЧ.Сумма/ВалютнаяСуммаПропорционирования);
						ТекСуммаДоходаГрн 	= ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСуммаДохода,2,ТкПогрешностьСуммыВалюты);
						ТекСуммаНДСГрн		= 0;
						
					Иначе 
						ТекСуммаДоходаГрн	= СтрокаТЧ.Сумма;
						ТекСуммаНДСГрн 	= ?(СуммаВключаетНДС,СтрокаТЧ.СуммаНДС,0) ;
						
						//ТекСуммаДоходаГрн	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ТекСуммаДоходаВВалютеДокумента,Источник.ВалютаДокумента,ВалютаРегл,Источник.КурсВзаиморасчетов,Источник.КратностьВзаиморасчетов,1,1);
						//ТекСуммаНДСГрн 		= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ТекСуммаНДСВВалютеДокумента,Источник.ВалютаДокумента,ВалютаРегл,Источник.КурсВзаиморасчетов,Источник.КратностьВзаиморасчетов,1,1);
					КонецЕсли;
		
					ТекМаржа = ТекСуммаДоходаГрн-ТекСуммаНДСГрн- СтрокаТЧ.Себестоимость;
					// - IvanSidoruk 14.12.2021
					
					СтрокаТЧ.Доход  = ТекМаржа;
					
					Если ИспользоватьДопРАсходыНаТоварныхСчета Тогда 
						//СтрокаТЧ.СебестоимостьМаржа
						СтрокаТЧ.СебестоимостьМаржа =  СтрокаТЧ.СебестоимостьМаржа  + ТекМаржа;
					Иначе 
						СтрокаТЧ.СебестоимостьМаржа =  0;						
					КонецЕсли;
					
				КонецЦикла;
				
				Источник.ДополнительныеСвойства.Вставить("ЭтоПереЗапись", Истина);
				Источник.Записать(РежимЗаписиДокумента.Проведение,РежимПроведения);
				Источник.ДополнительныеСвойства.Вставить("ЭтоПереЗапись", Ложь);
			
			КонецЕсли;
			
		//КонецЕсли;

		//Проверим есть ли наименование если есть поступления от внутригруппы
		ЭтоВнутригруппа = РазработкаСервер.ЭтоВнутригруппа(Источник.Организация, Источник.Контрагент);
		Если НЕ (ЭтоВнутригруппа = Истина) Тогда 
			
			//тут наимнования по ПТИУ и По РТИУ
			
			для Каждого СтркоаНоменуклатурыПартии из ТаблицаПартийИНоменклатуры Цикл 
				
				ТекПартияСписания 	=  СтркоаНоменуклатурыПартии.Партия;
				ТекНоменклатура		=  СтркоаНоменуклатурыПартии.Номенклатура;
				ТекХарактеристика 	= СтркоаНоменуклатурыПартии.ХарактеристикаНоменклатуры;
				
				
				МассивТоваров = Новый Массив;
				МассивТоваров.Добавить(ТекНоменклатура);
				
				ТаблицаНаименований										= Разработка.ВернутьТаблицуНаименованийНоменклатурыКонтрагента(МассивТоваров, ТекПартияСписания.Контрагент, ТекПартияСписания.Дата,ТекПартияСписания.Организация);
				ТаблицаНаименованийПоКнтрагентуПродаж	= Разработка.ВернутьТаблицуНаименованийНоменклатурыКонтрагента(МассивТоваров, Источник.Контрагент, Источник.Дата);
				
				СтрокаДляЗаполнения 						= Разработка.ПолучитьНаименованиеНоменклатуры(ТекНоменклатура,ТекХарактеристика,ТаблицаНаименований);
				СтрокаДляЗаполненияПоКонтрагенту 	= Разработка.ПолучитьНаименованиеНоменклатуры(ТекНоменклатура,ТекХарактеристика,ТаблицаНаименованийПоКнтрагентуПродаж);
				
				Если СтрокаДляЗаполнения <>СтрокаДляЗаполненияПоКонтрагенту Тогда 
					ОбщегоНазначения.СообщитьОбОшибке("Внимание! Отлчичается наименование "+СтрокаДляЗаполненияПоКонтрагенту + " от поступившего наименования:"+СтрокаДляЗаполнения+ "("+ТекПартияСписания+")  перезаполните наименование для контрагента, если нужно!");
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	
	// + IvanSidoruk 11.11.2020
	
	//+ Шовкопляс 20200505
	Если НЕ Отказ Тогда
		Если ((НЕ Источник.ДополнительныеСвойства.Свойство("ЭтоПереЗапись")) ИЛИ  (Источник.ДополнительныеСвойства.Свойство("ЭтоПереЗапись")  и   Источник.ДополнительныеСвойства.ЭтоПереЗапись = Ложь )) Тогда 
			РазработкаСервер.СгенерироватьПТиУПоДоговоруСоответствия(Источник.Ссылка, Отказ);
		КонецЕсли;
	КонецЕсли;
	////- Шовкопляс 20200505
	// - IvanSidoruk 11.11.2020
	
КонецПроцедуры
// - IvanSidoruk 16.06.2020

//+002907 ВБалако
Функция ПолучитьПутьСохранения() Экспорт 
	
	Пользователь = глЗначениеПеременной("глТекущийПользователь");
	ИмяМашины	 = ВРег(СокрЛП(ИмяКомпьютера()));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяМашины", ИмяМашины);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДАнные.Путь КАК Путь,
		|	ДАнные.Порядок КАК Порядок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПутиСохраненияДокументов.Путь КАК Путь,
		|		1 КАК Порядок
		|	ИЗ
		|		РегистрСведений.ПутиСохраненияДокументов КАК ПутиСохраненияДокументов
		|	ГДЕ
		|		ПутиСохраненияДокументов.Пользователь = &Пользователь
		|		И ПутиСохраненияДокументов.ИмяМашины = &ИмяМашины
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Константы.ПапкаГдеСохранятьДоговора,
		|		2
		|	ИЗ
		|		Константы КАК Константы) КАК Данные
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекПуть = "";
	Если Выборка.Следующий() Тогда 
		ТекПуть = СокрЛП(Выборка.Путь);
	КонецЕсли;
	
	Возврат ТекПуть;
	
КонецФункции
//-002907 ВБалако


//+002995 ВБалако
Функция ПолучитьШтамОрганизации(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.ШтампОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ДвоичныеДанные = Выборка.ШтампОрганизации.Получить();
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда 
		Картинка = Новый Картинка(ДвоичныеДанные);
	Иначе
		Картинка = Новый Картинка;
	КонецЕсли;
	Возврат Картинка;
	
КонецФункции	
//-002995 ВБалако

//+003156 ВБалако
Функция ПолучитьПечатьВТК(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.ПечатьВТК
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ДвоичныеДанные = Выборка.ПечатьВТК.Получить();
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда 
		Картинка = Новый Картинка(ДвоичныеДанные);
	Иначе
		Картинка = Новый Картинка;
	КонецЕсли;
	Возврат Картинка;
	
КонецФункции

Функция ПодписьПользователя(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Подпись
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Картинка = Новый Картинка;
	
	Если Выборка.Следующий() Тогда 
		
		ДвоичныеДанные = Выборка.Подпись.Получить();
		
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда 
			Картинка = Новый Картинка(ДвоичныеДанные);
		КонецЕсли;
		
	КонецЕсли;
		
	
	Возврат Картинка;
КонецФункции
//-003156 ВБалако

// + IvanSidoruk 08.07.2020
Процедура ПередЗаписьюСохронизироватьСостояниеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
		
	
	Если не Отказ и  ЗначениеЗаполнено(Источник.Ссылка) Тогда 
		РазработкаСервер.СинхронизироватьСостяниеДокументов(Источник.Ссылка,РежимЗаписи, РежимПроведения,Источник.ПометкаУдаления);	
	КонецЕсли;

КонецПроцедуры
// - IvanSidoruk 08.07.2020

// + IvanSidoruk 09.07.2020
Функция ПолучитьТаблицуПодразделенийОрганизаций(Подразделение,Организация)Экспорт 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	               |ИЗ
	               |	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	               |
	               |ГДЕ
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение И
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации <> &ПустоеПодразделениеОрганизации И
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация";
				   
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ПустоеПодразделениеОрганизации",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());

	ТаблицаПодразделений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПодразделений;
	
КонецФункции
// - IvanSidoruk 09.07.2020

// + IvanSidoruk 24.07.2020
Функция ИспользоватьННВРезерве(ДатаДока) Экспорт 
	
	пДАтаДока = ?(ЗначениеЗаполнено(ДатаДока),ДатаДока, ТекущаяДата());
	ДатаКонстанта =Константы.ДатаНачалаОтбораженияННВРЕзерве.Получить();
	
	
	ИспользоватьННВРезерве = (ЗначениеЗаполнено(ДатаКонстанта) и ДатаКонстанта<=пДАтаДока);
		
	Возврат ИспользоватьННВРезерве;
	
КонецФункции
// - IvanSidoruk 24.07.2020

//+003156 ВБалако
Функция НаименованиеНоменклатурыВПаспорКачества (Номенклатура, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		
		Сообщить("Номенклатура не заполнена");
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.ГруппаПродукцииЗаПредназначением КАК ГруппаПрод,
		|	Номенклатура.ТорговаяМаркиНоменклатуры КАК ТорговаяМарка,
		|	Номенклатура.КлассификацияЗаУровнемВязкости КАК КлассВязкости,
		|	Номенклатура.КлассификацияЗаУровнемЭксплуатационныхСвойствДляПаспортаКачества КАК КлассУЭС
		
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ГруппаПрод 		= Справочники.ГруппаПродукцииЗаПредназначением.ПустаяСсылка() И
				Выборка.ТорговаяМарка = Справочники.ТорговыеМаркиНоменклатуры.ПустаяСсылка() И
				Выборка.КлассВязкости 	= Справочники.КлассификацияЗаУровнемВязкости.ПустаяСсылка() И
				Выборка.КлассУЭС 			= Справочники.КлассификацияЗаУровнемЭксплуатационныхСвойств.ПустаяСсылка() Тогда
			
			Сообщить(НСтр("ru='Укажите хотя бы одну характеристику для Номенклатуры на закладке ""Классификация номенклатур""!';uk='Вкажіть хоча б одну характеристику для Номенклатури на закладці ""Класифікація номенклатур""!'"));
			
			СтандартнаяОбработка = Ложь;
			Форма = Номенклатура.ПолучитьФорму();
			Форма.Открыть();
			
			Возврат Неопределено;
			
		Иначе
			
			НоменклатураМодерн = "" + СокрЛП(Номенклатура) + ", " +
													?(ЗначениеЗаполнено(Выборка.ГруппаПрод), "" + Выборка.ГруппаПрод + ", ", "") + 
													?(ЗначениеЗаполнено(Выборка.ТорговаяМарка), "" + Выборка.ТорговаяМарка + ", ", "") + 
													//+004001 ВБалако 20210113
													//?(ЗначениеЗаполнено(Выборка.КлассВязкости), "" + Выборка.КлассВязкости + ", ", "") +  
													//?(ЗначениеЗаполнено(Выборка.КлассУЭС), "" + Выборка.КлассУЭС + ", ", "");
													?(ЗначениеЗаполнено(Выборка.КлассВязкости), "" + Выборка.КлассВязкости + ", ", "");  
													//-004001 ВБалако 20210113
			
			НоменклатураМодерн = Лев(НоменклатураМодерн,СтрДлина(НоменклатураМодерн) - 2);
			
			Возврат НоменклатураМодерн;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецФункции	
//-003156 ВБалако

// + IvanSidoruk 08.08.2020
Функция ИспользоватьЛитрыКГ() Экспорт 
	ИспользоватьЛитрыКГ = Константы.ИспользоватьЛитрыКГ.Получить();
	Возврат ИспользоватьЛитрыКГ;
КонецФункции
// - IvanSidoruk 08.08.2020

// + IvanSidoruk 03.09.2020
Функция ПолучитьЕдиницуИзмеренияПоХарактеристике(ТекХарактеристика) Экспорт 
	
	Единца = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Если НЕ ЗначениеЗаполнено(ТекХарактеристика) Тогда 
		Возврат Единца;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХарактеристикаЕдиницыИзмерения", ТекХарактеристика);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.ХарактеристикаЕдиницыИзмерения = &ХарактеристикаЕдиницыИзмерения
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Единца = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Единца;
	
КонецФункции
// - IvanSidoruk 03.09.2020

// + IvanSidoruk 03.09.2020
	//+003431 ВБалако 20200924
//Процедура ПроверкаЕдиницИзмеренияИХарактеристикОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
Процедура ПроверкаЕдиницИзмеренияИХарактеристикОбработкаПроведения(Источник, Отказ, РежимПроведения, ВызовФункции = Ложь) Экспорт

	//ЕдиницИзмерения для РеализацияТоваровУслуг проверим в подписке ОпределениеДоходностиПоДокументу
	//ЕдиницИзмерения для ОтчетПроизводстваЗаСмену проверим в подписке ФормированиеПлановыхСуммПоПроводкам
	Если  (НЕ(ВызовФункции = Истина)) и 
			(ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") или 
			ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену")) Тогда 
		Возврат;
	КонецЕсли;
	//-003431 ВБалако 20200924
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = Источник.Метаданные();
	
	МассивДокументовДляПропуска  =Новый Массив;
	МассивДокументовДляПропуска.Добавить("НалоговаяНакладная");
	МассивДокументовДляПропуска.Добавить("Приложение1КНалоговойНакладной");
	МассивДокументовДляПропуска.Добавить("Приложение2КНалоговойНакладной");
	
	
	МассивВидовНоменклатурыДляКонтроля = Новый Массив;
	МассивВидовНоменклатурыДляКонтроля.Добавить(Справочники.ВидыНоменклатуры.ОЛИВА);
	МассивВидовНоменклатурыДляКонтроля.Добавить(Справочники.ВидыНоменклатуры.Присадки);
	
	ТекИмяДокумента = МетаданныеДокумента.Имя; 
	
	Если МассивДокументовДляПропуска.Найти(ТекИмяДокумента) <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтоДокументПеремещенияПЕресорт = ?(ТекИмяДокумента = "ПеремещениеТоваров" и Источник.Пересорт = Истина , Истина, Ложь);
	
	Для Каждого ТабличнаяЧастьМетаданные из  МетаданныеДокумента.ТабличныеЧасти Цикл 
		
		ИмяТабличнойЧасти = ТабличнаяЧастьМетаданные.Имя;
		
		ДаннаяТЧ = Источник[ИмяТабличнойЧасти]; 
		КоличествоСтрочек =  ДаннаяТЧ.Количество();
		
		//нет строк - нечего прверять
		Если КоличествоСтрочек = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭтоТоварыПересорт = ?(ИмяТабличнойЧасти = "Товары" и ЭтоДокументПеремещенияПЕресорт, Истина, Ложь); 
		
		ЕстьНоменклатура							= ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Номенклатура", МетаданныеДокумента, ИмяТабличнойЧасти);
		ЕстьХарактеристикаНоменклатуры	= ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
		ЕстьЕдиницаИзмерения					= ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмерения", МетаданныеДокумента, ИмяТабличнойЧасти);
		ЕстьКоличество						= ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Количество", МетаданныеДокумента, ИмяТабличнойЧасти);
		ЕстьКоэффициент						= ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти);
		
		
		Если НЕ ЕстьНоменклатура
			или НЕ ЕстьХарактеристикаНоменклатуры
			или НЕ ЕстьКоличество
			или НЕ ЕстьЕдиницаИзмерения 
			или не ЕстьКоэффициент        Тогда 			
			Продолжить;
		КонецЕсли;
		
		//Значит все колонки есть, поехали проверять...
		Для Каждого СтрокаТЧ из  ДаннаяТЧ Цикл 
			Номенклатура							= 	СтрокаТЧ.Номенклатура;
			ХарактеристикаНоменклатуры = 	СтрокаТЧ.ХарактеристикаНоменклатуры;
			ЕдиницаИзмерения					= 	СтрокаТЧ.ЕдиницаИзмерения;
			Количество								= 	СтрокаТЧ.Количество;
			Коэффициент							= 	СтрокаТЧ.Коэффициент;
			
			//для перемещения - пересорта, можно просто подменить переменные, но нужно учесть что коеффициента нет!
			Если ЭтоТоварыПересорт Тогда 
				Номенклатура							= 	СтрокаТЧ.НоменклатураНовая;
				ХарактеристикаНоменклатуры = 	СтрокаТЧ.ХарактеристикаНоменклатурыНовая;
				ЕдиницаИзмерения					= 	СтрокаТЧ.ЕдиницаИзмеренияНовая;
				Количество								= 	СтрокаТЧ.КоличествоНовое;
				Коэффициент							= 	СтрокаТЧ.ЕдиницаИзмеренияНовая.Коэффициент;				
			КонецЕсли;
			
			//Проверяем только масло
			Если МассивВидовНоменклатурыДляКонтроля.Найти(Номенклатура.ВидНоменклатуры)= Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			//+003761 ВБалако 20201126
			ФлагКомплект = ЭтоКомплект(ЕдиницаИзмерения);
			//-003761 ВБалако 20201126
			
			//+003431 ВБалако 20200924
			ФлагРТУ 		= ?(ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") ,Истина, Ложь);
			ФлагОливаИлиПрисадка = Разработка.ЭтоОливаИлиПрисадка(Номенклатура);
			//будем проверять на соответствие тороговых марок только документы РеализацияТоваровУслуг
			Если ФлагРТУ И ФлагОливаИлиПрисадка Тогда
				СписокРеквизитовТорговыеМарки 	= ПолучитьРеквизитыТорговыеМаркиНоменклатуры(Номенклатура);
				НаименованиеТорговойМарки			= СписокРеквизитовТорговыеМарки[0].Значение;
				ПродажаЛилиШТ 								= СписокРеквизитовТорговыеМарки[1].Значение;
				ПродажаКГилиШТ 							= СписокРеквизитовТорговыеМарки[2].Значение;
				//Если ПродажаЛилиШТ = NULL ИЛИ ПродажаКГилиШТ = NULL Тогда
				//	ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана номенклатура с незаполненным значением ""Торговая марка номенклатуры""", Отказ);
				//	Возврат;
				//Иначе
				//+ВЛадЧ
				ИспользоватьТМ  = Истина;
				Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
					Если ТипЗнч(Источник.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
						ИспользоватьТМ = Не Источник.Сделка.Спецификация.НеИспользоватьТМ;
					КонецЕсли;
				ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
				    ИспользоватьТМ = Не Источник.Спецификация.НеИспользоватьТМ; 	
				КонецЕсли;
				//-ВладЧ
				СтрокаОшибкиМетодаПродажи = "";
				//+003761 ВБалако 20201126
				//Если ПродажаЛилиШТ = Истина Тогда
				//+ВладЧ
				Если ИспользоватьТМ Тогда
					Если ПродажаЛилиШТ = Истина и ФлагКомплект = Ложь Тогда
						//-003761 ВБалако 20201126
						СтрокаОшибкиМетодаПродажи 	= Строка("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения """ + ЕдиницаИзмерения.Наименование +""", которая не соотвествует методу продажи в торговой марке: """+ НаименованиеТорговойМарки + """ с выбранным значением: продажа только ""л"" или ""шт"".");
						//+003761 ВБалако 20201126
						//ИначеЕсли ПродажаКГилиШТ = Истина Тогда
					ИначеЕсли ПродажаКГилиШТ = Истина и ФлагКомплект = Ложь Тогда
						//-003761 ВБалако 20201126
						СтрокаОшибкиМетодаПродажи 	= Строка("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения """ + ЕдиницаИзмерения.Наименование +""", которая не соотвествует методу продажи в торговой марке: """+ НаименованиеТорговойМарки + """ с выбранным значением: продажа только ""кг или т"" или ""шт"".");					
					КонецЕсли;
				КонецЕсли;
				//КонецЕсли;
			КонецЕсли;
			//003431 ВБалако 20200924                                                	
			
			//Если указана характеристика, то единица измерения должна быть привязана к характеристике или базовая для единицы
			ЭтоНАлив = Ложь;
			Если  ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда 
				
				ЭтоНАлив   = Разработка.ЭтоНАлив(ХарактеристикаНоменклатуры,Номенклатура);
				
				////+003431 ВБалако 20200924
				//Если (ЕдиницаИзмерения.Наименование = "кг" ИЛИ ЕдиницаИзмерения.Наименование = "т") и (ПродажаКГилиШТ = Ложь) и ФлагРТУ Тогда
				//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибкиМетодаПродажи, Отказ);
				//КонецЕсли;	
				////-003431 ВБалако 20200924
				//+003431 ВБалако 20200924
				//Если ПродажаКГилиШТ = Истина и ФлагРТУ Тогда
				//		ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибкиМетодаПродажи, Отказ);
				//КонецЕсли;
				//003431 ВБалако 20200924
				
				Если ФлагРТУ  = Истина Тогда 
					
					НаименованиеЕдиницы = СокрЛП(ЕдиницаИзмерения.Наименование);
					Если ЭтоНАлив Тогда 
						//
						//Если НЕ (НаименованиеЕдиницы = "кг" или НаименованиеЕдиницы = "т") Тогда 
						//	ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения """ + НаименованиеЕдиницы +""", налив можно отгружать только в  кг или т! ", Отказ);	
						//КонецЕсли;
						
						//+003761 ВБалако 20201126	
						//ИначеЕсли  ПродажаКГилиШТ = Истина Тогда
					ИначеЕсли  ПродажаКГилиШТ = Истина и ФлагКомплект = Ложь Тогда
						//-003761 ВБалако 20201126 
						//+ВладЧ
						Если ИспользоватьТМ ТОгда
							Если НЕ (НаименованиеЕдиницы = "кг" или НаименованиеЕдиницы = "т"  или НаименованиеЕдиницы = "шт") Тогда 
								ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибкиМетодаПродажи, Отказ);	
							КонецЕсли;
						КонецЕсли;
						//+003761 ВБалако 20201126
						//ИначеЕсли ПродажаЛилиШТ = Истина Тогда 
					ИначеЕсли ПродажаЛилиШТ = Истина и ФлагКомплект = Ложь Тогда	
						//-003761 ВБалако 20201126 
						Если ИспользоватьТМ ТОгда
							Если НЕ (НаименованиеЕдиницы = "л" или НаименованиеЕдиницы = "шт") Тогда 
								ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибкиМетодаПродажи, Отказ);	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЭтоНАлив Тогда 
					Если ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения <> ХарактеристикаНоменклатуры
						и ЕдиницаИзмерения <>  Номенклатура.ЕдиницаХраненияОстатков Тогда 
						ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения не соотвествующая характеристике "+ ХарактеристикаНоменклатуры, Отказ);
					КонецЕсли;
					
					//нужно проверять кратность базовой единце
					//Если ЕдиницаИзмерения.Коэффициент <> 1 Тогда 
					//еСЛИ ЛИТРЫ, ТО ПОЛЬзователю пишем расчет в литрах
					//иначе все через кг
					
					Если ЕдиницаИзмерения.Наименование = "л" Тогда 
						//тут литры,
						
						Если Не ЗначениеЗаполнено(ЕдиницаИзмерения.Объем ) Тогда 
							ОбщегоНазначения.СообщитьОбОшибке("Объем не заполнен "+ЕдиницаИзмерения,Отказ);
							Продолжить;
						КонецЕсли;
						КОличествоШТ = Количество /ЕдиницаИзмерения.Объем;
						
						Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
							ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество в ""л"" = "+Количество +" не кратно = "+ЕдиницаИзмерения.Объем, Отказ);	
						КонецЕсли;
						
					ИначеЕсли ЕдиницаИзмерения.Наименование = "шт" Тогда 
						
						КОличествоШТ = Количество;
						
						Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
							ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество в ""шт"" = "+КОличествоШТ +", должно быть целы чилом!", Отказ);								
						КонецЕсли;
						
					Иначе
						
						//+003761 ВБалако 20201126
						Если ФлагКомплект = Истина Тогда
							
							Если ПродажаЛилиШТ = Истина Тогда	
								
								КОличествоШТ = Количество;
								
								Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""шт"" = "+КОличествоШТ +", должно быть целым числом!", Отказ);								
								КонецЕсли;
								
								Если Не ЗначениеЗаполнено(ЕдиницаИзмерения.Объем ) Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Объем не заполнен "+ЕдиницаИзмерения,Отказ);
									Продолжить;
								КонецЕсли;
								
								//КОличествоЛ = Количество *ЕдиницаИзмерения.Объем;
								//
								//// + IvanSidoruk 22.12.2020
								//КБазовой = Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
								//КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
								//КоличествоВБазовыхЕдиница = 	(КОличествоШТ *СтрокаТЧ.Коэффициент)/КБазовой; 
								//КоличествоЛитровЧерезБазовую = КоличествоВБазовыхЕдиница*Номенклатура.ЕдиницаХраненияОстатков.Объем;
								//// - IvanSidoruk 22.12.2020
								//
								////КоличесвтоКГ
								//КоличествоВБазовыхЕдиница = 	(Количество *СтрокаТЧ.Коэффициент)/КБазовой; 
								//
								//Если КОличествоЛ <> Цел(КОличествоШТ)  Тогда 
								//	//ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""л"" = "+Количество +" не кратно = "+ЕдиницаИзмерения.Объем, Отказ);	
								//	ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""л"" = "+Количество +" не кратно = "+ЕдиницаИзмерения.Объем);	
								//КонецЕсли;
								
							ИначеЕсли ПродажаКГилиШТ = Истина Тогда	
								
								КОличествоШТ = Количество;
								
								Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""шт"" = "+КОличествоШТ +", должно быть целым числом!", Отказ);								
								КонецЕсли;
								
								Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения.Вес) Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("В строке "+СтрокаТЧ.НомерСтроки+" Вес не заполнен "+ЕдиницаИзмерения,Отказ);
									Продолжить;
								КонецЕсли;
								
								КБазовой = Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
								КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
								
								КоличествоВБазовыхЕдиница = 	(Количество *СтрокаТЧ.Коэффициент)/КБазовой; 
								КОличествоШТ = КоличествоВБазовыхЕдиница/?(ЗначениеЗаполнено(ЕдиницаИзмерения.Вес),ЕдиницаИзмерения.Вес,1);
								
								Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
									//ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""кг"" = "+КоличествоВБазовыхЕдиница +" не кратно = "+ЕдиницаИзмерения.Вес, Отказ);	
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""кг"" = "+КоличествоВБазовыхЕдиница +" не кратно = "+ЕдиницаИзмерения.Вес);	
								КонецЕсли;
								
							КонецЕсли;
							
						Иначе	
							//-003761 ВБалако 20201126
							
							КБазовой = Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
							КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
							
							//КоличесвтоКГ
							КоличествоВБазовыхЕдиница = 	(Количество *СтрокаТЧ.Коэффициент)/КБазовой; 
							
							КОличествоШТ = КоличествоВБазовыхЕдиница/?(ЗначениеЗаполнено(ЕдиницаИзмерения.Вес),ЕдиницаИзмерения.Вес,1);
							
							Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения.Вес) Тогда 
								ОбщегоНазначения.СообщитьОбОшибке("В строке "+СтрокаТЧ.НомерСтроки+" Вес не заполнен "+ЕдиницаИзмерения,Отказ);
								Продолжить;
							КонецЕсли;
							
							Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
								ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""кг"" = "+КоличествоВБазовыхЕдиница +" не кратно ="+ЕдиницаИзмерения.Вес, Отказ);	
							КонецЕсли;
							
						КонецЕсли;
					//+003761 ВБалако 20201126	
					КонецЕсли;
					//-003761 ВБалако 20201126
					
				Иначе 
					
					//Если ЗначениеЗаполнено(ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения) Тогда 
					Если (ЗначениеЗаполнено(ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения) и ЗначениеЗаполнено(ХарактеристикаНоменклатуры) и ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения <> ХарактеристикаНоменклатуры) или (ЗначениеЗаполнено(ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения) и Не ЗначениеЗаполнено(ХарактеристикаНоменклатуры)) Тогда 	
						ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения соотвествующая не наливу"+ ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения, Отказ);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли не ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда  
				
				ЭтоНалив = ЭтоНАлив(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Номенклатура);
				
				Если ФлагРТУ  = Истина Тогда 
					
					НаименованиеЕдиницы = СокрЛП(ЕдиницаИзмерения.Наименование);
					Если ЭтоНАлив Тогда 
						//
						//Если НЕ (НаименованиеЕдиницы = "кг" или НаименованиеЕдиницы = "т") Тогда
						//	ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения """ + НаименованиеЕдиницы +""", налив можно отгружать только в  кг или т! ", Отказ);	
						//КонецЕсли;
						
						//+003761 ВБалако 20201126	
						//ИначеЕсли  ПродажаКГилиШТ = Истина Тогда
					ИначеЕсли  ПродажаКГилиШТ = Истина и ФлагКомплект = Ложь Тогда
						//-003761 ВБалако 20201126
						
						Если НЕ (НаименованиеЕдиницы = "кг" или НаименованиеЕдиницы = "т"  или НаименованиеЕдиницы = "шт") Тогда 
							ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибкиМетодаПродажи, Отказ);	
						КонецЕсли;
						
						//+003761 ВБалако 20201126
						//ИначеЕсли ПродажаЛилиШТ = Истина Тогда 
					ИначеЕсли ПродажаЛилиШТ = Истина и ФлагКомплект = Ложь Тогда	
						//-003761 ВБалако 20201126
						
						Если НЕ (НаименованиеЕдиницы = "л" или НаименованиеЕдиницы = "шт") Тогда 
							ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибкиМетодаПродажи, Отказ);	
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЭтоНалив Тогда 
					
					//ЕСЛИ 1К ТО НЕ НУЖНО					
					Если ЗначениеЗаполнено(ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения) Тогда 
						ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указана единица измерения соотвествующая характеристике "+ ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения+ ", а характеристика в документе не выбрана!", Отказ);	
					КонецЕсли;
					
					Если ЕдиницаИзмерения.Наименование = "л" Тогда
						//тут литры,
						
						Если Не ЗначениеЗаполнено(ЕдиницаИзмерения.Объем ) Тогда 
							ОбщегоНазначения.СообщитьОбОшибке("Объем не заполнен "+ЕдиницаИзмерения,Отказ);
							Продолжить;
						КонецЕсли;
						КОличествоШТ = Количество /ЕдиницаИзмерения.Объем;
						
						Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
							ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""л"" = "+Количество +" не кратно = "+ЕдиницаИзмерения.Объем, Отказ);	
						КонецЕсли;
						
					ИначеЕсли ЕдиницаИзмерения.Наименование = "шт" Тогда 
						
						КОличествоШТ = Количество;
						
						Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
							ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""шт"" = "+КОличествоШТ +", должно быть целым числом!", Отказ);								
						КонецЕсли;						
						
					Иначе
						
						//+003761 ВБалако 20201126
						Если ФлагКомплект = Истина Тогда
							
							Если ПродажаЛилиШТ = Истина Тогда	
								
								КОличествоШТ = Количество;
								
								Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""шт"" = "+КОличествоШТ +", должно быть целым числом!", Отказ);								
								КонецЕсли;
								
								Если Не ЗначениеЗаполнено(ЕдиницаИзмерения.Объем ) Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Объем не заполнен "+ЕдиницаИзмерения,Отказ);
									Продолжить;
								КонецЕсли;
								
								КОличествоЛ = Количество /ЕдиницаИзмерения.Объем;
								
								Если КОличествоЛ <> Цел(КОличествоШТ)  Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""л"" = "+Количество +" не кратно = "+ЕдиницаИзмерения.Объем, Отказ);	
								КонецЕсли;
								
							ИначеЕсли ПродажаКГилиШТ = Истина Тогда	
								
								КОличествоШТ = Количество;
								
								Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""шт"" = "+КОличествоШТ +", должно быть целым числом!", Отказ);								
								КонецЕсли;
								
								Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения.Вес) Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("В строке "+СтрокаТЧ.НомерСтроки+" Вес не заполнен "+ЕдиницаИзмерения,Отказ);
									Продолжить;
								КонецЕсли;
								
								КБазовой = Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
								КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
								
								КоличествоВБазовыхЕдиница = 	(Количество *СтрокаТЧ.Коэффициент)/КБазовой; 
								КОличествоШТ = КоличествоВБазовыхЕдиница/?(ЗначениеЗаполнено(ЕдиницаИзмерения.Вес),ЕдиницаИзмерения.Вес,1);
								
								Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
									ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""кг"" = "+КоличествоВБазовыхЕдиница +" не кратно = "+ЕдиницаИзмерения.Вес, Отказ);	
								КонецЕсли;
							КонецЕсли;
							
						Иначе	
						//-003761 ВБалако 20201126
							
							КБазовой = Номенклатура.ЕдиницаХраненияОстатков.Коэффициент; 
							КБазовой = ?(ЗначениеЗаполнено(КБазовой),КБазовой,1);
							
							//КоличесвтоКГ
							КоличествоВБазовыхЕдиница = 	(Количество *СтрокаТЧ.Коэффициент)/КБазовой; 
							
							КОличествоШТ = КоличествоВБазовыхЕдиница/?(ЗначениеЗаполнено(ЕдиницаИзмерения.Вес),ЕдиницаИзмерения.Вес,1);
							
							Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения.Вес) Тогда 
								ОбщегоНазначения.СообщитьОбОшибке("В строке "+СтрокаТЧ.НомерСтроки+" Вес не заполнен "+ЕдиницаИзмерения,Отказ);
								Продолжить;
							КонецЕсли;
							
							Если КОличествоШТ <> Цел(КОличествоШТ)  Тогда 
								ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" указано количество ""кг"" = "+КоличествоВБазовыхЕдиница +" не кратно ="+ЕдиницаИзмерения.Вес, Отказ);	
							КонецЕсли;
						//+003761 ВБалако 20201126	
						КонецЕсли;
						//-003761 ВБалако 20201126
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЭтоНАлив Тогда 
				Если Коэффициент <> ЕдиницаИзмерения.Коэффициент Тогда 
					ОбщегоНазначения.СообщитьОбОшибке("Внимание! В строке "+СтрокаТЧ.НомерСтроки +" К. = "+Коэффициент + " не соовтетсвует " +ЕдиницаИзмерения.Коэффициент+ "!", Отказ);	
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//ИмяТабличнойЧасти   = ОбщегоНазначения.ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	//МетаданныеДокумента = ДокументОбъект.Метаданные();
	//
	//ХарактеристикаНоменклатуры = Неопределено;
	//Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти)  Тогда
	//	ХарактеристикаНоменклатуры =  СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры;
	//КонецЕсли;
       	
	//// + IvanSidoruk 03.09.2020
	//ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
	//Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры)
	//		и ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения <> ХарактеристикаНоменклатуры Тогда 				
	//		ЕдиницаИзмерения = Разработка.ПолучитьЕдиницуИзмеренияПоХарактеристике(ХарактеристикаНоменклатуры);				
	//КонецЕсли;
	//		
	//		
	////Если вдруг выбрали единицу измерения по Характеристике
	//Если ЗначениеЗаполнено(ЕдиницаИзмерения) 
	//			и   НЕ ЗначениеЗаполнено(ХарактеристикаНоменклатуры)
	//				и ЗначениеЗаполнено(ЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения)  Тогда 					
	//		ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;		
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда 
	//	    ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;		
	//КонецЕсли;
	//
	//СтрокаТабличнойЧасти.ЕдиницаИзмерения 	 = ЕдиницаИзмерения;

КонецПроцедуры


Процедура vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	//Если есть Взаиморасчеты по 361, то наш клиент
	МетаданныеДокумента = Источник.Метаданные();
		
	МожетДелатьДвиженияПоВзаиморасчетам		= МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов);
	МожетДелатьДвиженияПоВзаиморасчетамVR	= МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов);
	
	Если не МожетДелатьДвиженияПоВзаиморасчетамVR 
		Или НЕ МожетДелатьДвиженияПоВзаиморасчетам Тогда 
		Возврат;
	КонецЕсли;
	
	
	СсылкаНАДокумент 	= Источник.Ссылка;
	ДатаРегистратора 	= СсылкаНАДокумент.Дата;
	
	ДатаНачалаЗаписиРегистраВзаиморасчетыVR  = Константы.ДатаНачалаЗаписиРегистраВзаиморасчетыVR.Получить();
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаЗаписиРегистраВзаиморасчетыVR) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДатаРегистратора < ДатаНачалаЗаписиРегистраВзаиморасчетыVR Тогда 
		Возврат;
	КонецЕсли;
	
	
	ТаблицаПроводок = Источник.движения.Хозрасчетный;
	
	МассивСчетовВзаиморасчетов = Новый Массив;
	МассивСчетовВзаиморасчетов .Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями);
	
	
	Организация = Неопределено;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) Тогда 
		Организация =  Источник.Организация;
	КонецЕсли;
	
	наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов = РегистрыНакопления.vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.СоздатьНаборЗаписей();	
	наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Отбор.Регистратор.Установить(СсылкаНАДокумент);
	наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Прочитать();
	наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Очистить();
	
	ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов = наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.ВыгрузитьКолонки();
	
	//Если движение в ДТ 361, то нужно выбирать остатки если они отрицательные(оплаты)
	//Если движение в КТ 361, то нужно выбирать остатки если они положительные(отгрузки)
	
	//Цель Считать просрочку от Реализации,
	
	ТаблицаВзаиморасчетовСлужебная = ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.СкопироватьКолонки(); 
	
	Для Каждого СтрокаТЧ из ТаблицаПроводок Цикл 
		
		//Если в ДТ то+
		Если МассивСчетовВзаиморасчетов.Найти(СтрокаТЧ.СчетДт) <> Неопределено Тогда 
			
			Контрагент 										= СтрокаТЧ.СубконтоДт.Контрагенты;
			ДоговорКонтрагента 						= СтрокаТЧ.СубконтоДт.Договоры;
			ДокументРасчетовСКонтрагентом  	= СтрокаТЧ.СубконтоДт.ДокументыРасчетовСКонтрагентами;
			
			//Значит документ расчетов сам документ			
			
			НоваяСтрока = ТаблицаВзаиморасчетовСлужебная.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период						=  ДатаРегистратора;
			НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
			
			НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Приход;
			
			НоваяСтрока.Организация				= Организация;
			НоваяСтрока.ДоговорКонтрагента	= ДоговорКонтрагента;
			
			НоваяСтрока.Сделка									  		= ДокументРасчетовСКонтрагентом;
			НоваяСтрока.ДокументРасчетовСКонтрагентом	= ДокументРасчетовСКонтрагентом;
			
			
			НоваяСтрока.ВидРасчетовСКонтрагентом			= Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
			НоваяСтрока.Контрагент                  					= Контрагент;
			
			НоваяСтрока.СуммаВзаиморасчетов					=СтрокаТЧ.Сумма;			
			
			// + IvanSidoruk 12.10.2020
			Если НоваяСтрока.СуммаВзаиморасчетов < 0 Тогда 
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрока.СуммаВзаиморасчетов = -НоваяСтрока.СуммаВзаиморасчетов;
			КонецЕсли;
			// - IvanSidoruk 12.10.2020
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументРасчетовСКонтрагентом) Тогда 
				НоваяСтрока.ДокументРасчетовСКонтрагентом =  СсылкаНАДокумент;		
			КонецЕсли;
		КонецЕсли;
			
		// это минус	
		Если  МассивСчетовВзаиморасчетов.Найти(СтрокаТЧ.СчетКт) <> Неопределено Тогда 
			
			Контрагент 										= СтрокаТЧ.СубконтоКт.Контрагенты;
			ДоговорКонтрагента 						= СтрокаТЧ.СубконтоКт.Договоры;
			ДокументРасчетовСКонтрагентом  	= СтрокаТЧ.СубконтоКт.ДокументыРасчетовСКонтрагентами;
			
			НоваяСтрока = ТаблицаВзаиморасчетовСлужебная.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период						=  ДатаРегистратора;
			НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
			
			НоваяСтрока.ВидДвижения 				= ВидДвиженияНакопления.Расход;
			
			НоваяСтрока.Организация				= Организация;
			НоваяСтрока.ДоговорКонтрагента	= ДоговорКонтрагента;
			
			НоваяСтрока.Сделка									  		= ДокументРасчетовСКонтрагентом;
			НоваяСтрока.ДокументРасчетовСКонтрагентом	= ДокументРасчетовСКонтрагентом;
			
			
			НоваяСтрока.ВидРасчетовСКонтрагентом			= Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
			НоваяСтрока.Контрагент                  					= Контрагент;
			
			НоваяСтрока.СуммаВзаиморасчетов					=СтрокаТЧ.Сумма;			
			
			// + IvanSidoruk 12.10.2020
			Если НоваяСтрока.СуммаВзаиморасчетов < 0 Тогда 
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрока.СуммаВзаиморасчетов = -НоваяСтрока.СуммаВзаиморасчетов;
			КонецЕсли;
			// - IvanSidoruk 12.10.2020
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументРасчетовСКонтрагентом) Тогда 
				НоваяСтрока.ДокументРасчетовСКонтрагентом =  СсылкаНАДокумент;		
			КонецЕсли;
			
		КонецЕсли; 
		
		
		//Если 
		
	КонецЦикла;
	
	//Все что в минус будем выбирать по остаткам
	Если ТаблицаВзаиморасчетовСлужебная.Количество() > 0 Тогда 
		
		Запрос = Новый Запрос;
		// + IvanSidoruk 12.10.2020
		//Запрос.УстановитьПараметр("ДатаОстатков", ДатаРегистратора);
		Запрос.УстановитьПараметр("ДатаОстатков", СсылкаНАДокумент.МоментВремени());
		// - IvanSidoruk 12.10.2020
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ТаблицаВзаиморасчетовСлужебная.ВыгрузитьКолонку("ДоговорКонтрагента"));
		Запрос.УстановитьПараметр("Контрагент", ТаблицаВзаиморасчетовСлужебная.ВыгрузитьКолонку("Контрагент"));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Сделка,
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом,
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ВидРасчетовСКонтрагентом,
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация,
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
			|	ВЫБОР КОГДА vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток >0 ТОГДА
			|		vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
			|	ИНАЧЕ
			|		-vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
			|	КОНЕЦ КАК СуммаВзаиморасчетов,
			|	ВЫБОР КОГДА vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток >0 ТОГДА
			|		&Приход
			|	ИНАЧЕ
			|		&Расход
			|	КОНЕЦ ВидОстатков
			|ИЗ
			|	РегистрНакопления.vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
			|			&ДатаОстатков,
			|			Организация = &Организация
			|				И Контрагент В (&Контрагент)
			|				И ДоговорКонтрагента В (&ДоговорКонтрагента)) КАК vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
			|	ГДЕ
			|			vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток <>0
			|
			|УПОРЯДОЧИТЬ ПО
			|	vrВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата";
	
		ТаблицаОстатковВзаиморасчетов = Запрос.Выполнить().Выгрузить();
				
		Для Каждого СтрокаТЧДвижений из  ТаблицаВзаиморасчетовСлужебная Цикл 
			ТекСуммаСписания = СтрокаТЧДвижений.СуммаВзаиморасчетов;
			
			ВидОстатков = ?(СтрокаТЧДвижений.ВидДвижения = ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
			ВидДвижения = СтрокаТЧДвижений.ВидДвижения;
			//А что если документ расчетов указан?!
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ДоговорКонтрагента"	,СтрокаТЧДвижений.ДоговорКонтрагента);
			СтруктураПоиска.Вставить("Контрагент"					,СтрокаТЧДвижений.Контрагент);
			СтруктураПоиска.Вставить("Сделка"						,СтрокаТЧДвижений.Сделка);
			СтруктураПоиска.Вставить("ВидОстатков"				,ВидОстатков);
			
			 МассивПодходящихСТрок = ТаблицаОстатковВзаиморасчетов.НайтиСтроки(СтруктураПоиска); 
			 
			 Для Каждого СтрокаОстатка из МассивПодходящихСТрок Цикл 
				 
				Если ТекСуммаСписания <=0 Тогда 
					Прервать;		 
				КонецЕсли;
				 
				 ДоступнаяСумма = Мин(СтрокаОстатка.СуммаВзаиморасчетов,ТекСуммаСписания);
				 ДоступнаяСумма = Макс(ДоступнаяСумма,0);
				 				 
				 Если ДоступнаяСумма > 0 Тогда 
					 
					 ТекСуммаСписания = ТекСуммаСписания - ДоступнаяСумма;
					 СтрокаОстатка.СуммаВзаиморасчетов = СтрокаОстатка.СуммаВзаиморасчетов-ДоступнаяСумма;
					 
					 
					НоваяСтрока = ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период						=  ДатаРегистратора;
					НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
					
					НоваяСтрока.ВидДвижения 				= ВидДвижения;
					
					НоваяСтрока.Организация				= Организация;
					НоваяСтрока.ДоговорКонтрагента	= СтрокаТЧДвижений.ДоговорКонтрагента;
					
					НоваяСтрока.Сделка									  		= СтрокаОстатка.Сделка;
					НоваяСтрока.ДокументРасчетовСКонтрагентом	= СтрокаОстатка.ДокументРасчетовСКонтрагентом;
										
					НоваяСтрока.ВидРасчетовСКонтрагентом			= СтрокаОстатка.ВидРасчетовСКонтрагентом;
					НоваяСтрока.Контрагент                  					= СтрокаТЧДвижений.Контрагент;
					
					НоваяСтрока.СуммаВзаиморасчетов					=ДоступнаяСумма;			
					
					//Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументРасчетовСКонтрагентом) Тогда 
					//	НоваяСтрока.ДокументРасчетовСКонтрагентом =  СсылкаНАДокумент;		
					//КонецЕсли;

					 
					 
				 КонецЕсли;
				 
			КонецЦикла;
			
			
			//не хватает остатка, что-то нужно сделать!!!
			Если ТекСуммаСписания >0 Тогда 
				   //ОбщегоНазначения.СообщитьОбОшибке( "Не хватает"+ТекСуммаСписания  +"!");
				   
					НоваяСтрока = ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Добавить();
					НоваяСтрока.Активность					= Истина;
					НоваяСтрока.Период						=  ДатаРегистратора;
					НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
					
					НоваяСтрока.ВидДвижения 				= ВидДвижения;
					
					НоваяСтрока.Организация				= Организация;
					НоваяСтрока.ДоговорКонтрагента	= СтрокаТЧДвижений.ДоговорКонтрагента;
					
					НоваяСтрока.Сделка									  		= СтрокаТЧДвижений.Сделка;
					НоваяСтрока.ДокументРасчетовСКонтрагентом	= СтрокаТЧДвижений.ДокументРасчетовСКонтрагентом;
										
					НоваяСтрока.ВидРасчетовСКонтрагентом			=СтрокаТЧДвижений.ВидРасчетовСКонтрагентом;//!!!
					НоваяСтрока.Контрагент                  					=СтрокаТЧДвижений.Контрагент;
					
					НоваяСтрока.СуммаВзаиморасчетов					=ТекСуммаСписания;								

			КонецЕсли;
			
			
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Запишем наш регистр!
	наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Загрузить(ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов);	
	наборvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Записать(Истина);	
	
КонецПроцедуры
// - IvanSidoruk 03.09.2020

// + IvanSidoruk 03.09.2020
Функция ЭтоНАлив(ТекХарактеристика,ТекНоменклатура) Экспорт 
	
	ЭтоНАлив = Ложь;
		 	
	
	Если ЗначениеЗаполнено(ТекХарактеристика) Тогда  
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект", ТекХарактеристика);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияСвойствОбъектов.Объект,
			|	ЗначенияСвойствОбъектов.Объект КАК Объект1,
			|	ЗначенияСвойствОбъектов.Значение
			|ИЗ
			|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Объект = &Объект";
		
		
		
		ТаблицаЗначейнийСвойств = Запрос.Выполнить().Выгрузить();
	

	
		Для Каждого  СтрокаЗначСвойств из ТаблицаЗначейнийСвойств Цикл 
			Если ЗначениеЗаполнено(СтрокаЗначСвойств.Значение)
				и ТипЗнч(СтрокаЗначСвойств.Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") 
				 и ВРег(СокрЛП(СтрокаЗначСвойств.Значение.Наименование)) = ВРег("Налив") Тогда 
				
				 ЭтоНАлив = Истина;
				 Прервать;
			 КонецЕсли;
		 КонецЦикла;	
	 КонецЕсли;
	 
	 Если НЕ ЭтоНАлив 
		 и ЗначениеЗаполнено(ТекНоменклатура) Тогда 
		 
		 ЭтоНАлив = ТекНоменклатура.Налив;
		 
	КонецЕсли;
	
	Возврат ЭтоНАлив;
					 
КонецФункции
// - IvanSidoruk 03.09.2020

// + IvanSidoruk 08.09.2020
Функция ЭтоОливаИлиПрисадка(ТекНоменклатура, СУчетомСтарой = Ложь)  Экспорт 
	
	ЭтоОливаИлиПрисадка = Ложь;
	
	Если Не ЗначениеЗаполнено(ТекНоменклатура) Тогда 
		Возврат ЭтоОливаИлиПрисадка;		
	КонецЕсли;
		
	Если ТипЗнч(ТекНоменклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда 
		Возврат ЭтоОливаИлиПрисадка;	
	КонецЕсли;
	
	МассивОливИПрисадок = Новый Массив;
	МассивОливИПрисадок.Добавить(Справочники.ВидыНоменклатуры.ОЛИВА);
	МассивОливИПрисадок.Добавить(Справочники.ВидыНоменклатуры.Присадки);
	
	 // + IvanSidoruk 30.09.2020
	Если СУчетомСтарой = Истина Тогда 
		МассивВидовСтарый =  ПолучитьМассивНоменклатурыСтарой();
		Для Каждого ТекЭлементСтарый из МассивВидовСтарый Цикл 
			МассивОливИПрисадок.Добавить(ТекЭлементСтарый);	
		КонецЦикла;
	КонецЕсли;
	 // - IvanSidoruk 30.09.2020
	
	ЭтоОливаИлиПрисадка = (МассивОливИПрисадок.Найти(ТекНоменклатура.ВидНоменклатуры)<> Неопределено);
	
	Возврат ЭтоОливаИлиПрисадка;
	
	
КонецФункции
// - IvanSidoruk 08.09.2020


// + IvanSidoruk 09.09.2020
Процедура НачалоВыбораЕдиницыИзмерения(ЭлементФормы, СтандартнаяОбработка, ТекНоменклатура,ТекХарактеристика) Экспорт

	Если Не ЗначениеЗаполнено(ТекНоменклатура) Тогда 
		Возврат;
	КонецЕсли;
	
	Если не ЭтоОливаИлиПрисадка(ТекНоменклатура) Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора          = Справочники.ЕдиницыИзмерения.ПолучитьФормуВыбора(,ЭлементФормы,);
	
	ЭтоНАлив = Ложь;
	Если ЗначениеЗаполнено(ТекХарактеристика) Тогда 
		ЭтоНАлив = Разработка.ЭтоНАлив(ТекХарактеристика,ТекНоменклатура)
	КонецЕсли;
	
	
	
	
	
	//Фсе, это олива, нужно фильтровать по характеристике
	ОтборПоХарактеристике = ФормаВыбора.СписокЕдиницыИзмерения.Отбор.ХарактеристикаЕдиницыИзмерения;
	ОтборПоХарактеристике.ВидСравнения 	= ВидСравнения.Равно;
	ОтборПоХарактеристике.Значение 			= ?(ЭтоНАлив,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),ТекХарактеристика);
	ОтборПоХарактеристике.Использование = ?(ЗначениеЗаполнено(ТекХарактеристика) или НЕ ЭтоНАлив, Истина, Ложь);	
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ХарактеристикаЕдиницыИзмерения.Доступность = Ложь;
	
	//чтоб не дать выбрать левое
	ОтборПоНоменклатуре = ФормаВыбора.СписокЕдиницыИзмерения.Отбор.Владелец;
	ОтборПоНоменклатуре.ВидСравнения		= ВидСравнения.Равно;
	ОтборПоНоменклатуре.Значение 			= ТекНоменклатура;
	ОтборПоНоменклатуре.Использование	= Истина;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
	
	
	//без веса не нужно показыть 
	Если НЕ ЭтоНАлив Тогда 
		ОтборПоВес = ФормаВыбора.СписокЕдиницыИзмерения.Отбор.Вес;
		ОтборПоВес.ВидСравнения		= ВидСравнения.НеРавно;
		ОтборПоВес.Значение 			= 0;
		ОтборПоВес.Использование	= Истина;
		
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Вес.Доступность = Ложь;
	КонецЕсли;
	
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ЭлементФормы.Значение;
	ФормаВыбора.Открыть();
		
	
КонецПроцедуры // НачалоВыбораЕдиницыИзмерения()
// - IvanSidoruk 09.09.2020

// + IvanSidoruk 09.09.2020
Процедура АвтоПодборТекстаЕдиницаИзмерения(Форма, Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ТекНоменклатура,ТекХарактеристика) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекНоменклатура) Тогда 
		Возврат;
	КонецЕсли;
	
	Если не ЭтоОливаИлиПрисадка(ТекНоменклатура) Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СписокНайденных = НайтиЕдиницыИзмеренияПоТексту(Текст, ТекНоменклатура,ТекХарактеристика);
	Если СписокНайденных.Количество()>0 Тогда
		Результат = Форма.ВыбратьИзСписка(СписокНайденных,Элемент);
		Если НЕ Результат = Неопределено Тогда
			ТекстАвтоПодбора 	= Результат.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// - IvanSidoruk 09.09.2020

// + IvanSidoruk 09.09.2020
Процедура ОкончаниеВводаТекстаЕдиницаИзмерения(Элемент, Текст, Значение, СтандартнаяОбработка, ТекНоменклатура,ТекХарактеристика) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекНоменклатура) Тогда 
		Возврат;
	КонецЕсли;
	
	Если не ЭтоОливаИлиПрисадка(ТекНоменклатура) Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Значение = НайтиЕдиницыИзмеренияПоТексту(Текст, ТекНоменклатура,ТекХарактеристика);
	
КонецПроцедуры
// - IvanSidoruk 09.09.2020

// + IvanSidoruk 09.09.2020
Функция НайтиЕдиницыИзмеренияПоТексту(Текст, ТекНоменклатура,ТекХарактеристика)
	
	СписокНайденных = Новый СписокЗначений;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекНоменклатура", ТекНоменклатура);
	Запрос.УстановитьПараметр("ТекХарактеристика", ТекХарактеристика);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕдиницыИзмерения.Ссылка как Ссылка,
	               |	ЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |ГДЕ
	               |	ЕдиницыИзмерения.Владелец = &ТекНоменклатура
	               |	И ЕдиницыИзмерения.ХарактеристикаЕдиницыИзмерения = &ТекХарактеристика
				   |";
	Результат = Запрос.Выполнить().Выбрать();
	
	ДлинаТекста = СтрДлина(СокрЛП(Текст));
	
	Пока Результат.Следующий() Цикл
		Если ВРег(Сред(Результат.Представление,1,ДлинаТекста)) = ВРег(СокрЛП(Текст)) Тогда
			СписокНайденных.Добавить(Результат.Ссылка,Результат.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНайденных;
	
КонецФункции
// - IvanSidoruk 09.09.2020

Процедура ОкончаниеВводаТекстаНоменклатура(Элемент, Текст, Значение, СтандартнаяОбработка, ТекГруппаПродукции,ТекТорговаяМарка) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекГруппаПродукции) И Не ЗначениеЗаполнено(ТекТорговаяМарка) Тогда 
		Возврат;
	КонецЕсли;

	
	СтандартнаяОбработка = Ложь;
	Значение = НайтиНоменклатуруПоГруппеИТМ(Текст, ТекГруппаПродукции,ТекТорговаяМарка);
	
КонецПроцедуры


Процедура АвтоПодборТекстаНоменклатура(Форма, Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ТекГруппаПродукции,ТекТорговаяМарка) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекГруппаПродукции) И Не ЗначениеЗаполнено(ТекТорговаяМарка) Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СписокНайденных = НайтиНоменклатуруПоГруппеИТМ(Текст, ТекГруппаПродукции,ТекТорговаяМарка);
	Если СписокНайденных.Количество()>0 Тогда
		Результат = Форма.ВыбратьИзСписка(СписокНайденных,Элемент);
		Если НЕ Результат = Неопределено Тогда
			ТекстАвтоПодбора 	= Результат.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

функция НайтиНоменклатуруПоГруппеИТМ(Текст, ТекГруппаПродукции , ТекТорговаяМарка)
	  СписокНайденных = Новый СписокЗначений;
	ТекстУсловия = "";	
	Запрос = Новый Запрос;
	
	
	
	Запрос.Текст = "ВЫБРАТЬ Первые 50
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Представление КАК Представление
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ Истина
	               |";
	
	
	Если  ЗначениеЗаполнено(ТекГруппаПродукции) Тогда
		ТекстУсловия = " Номенклатура.ГруппаПродукцииЗаПредназначением = &ГруппаПродукцииЗаПредназначением "+?(ЗначениеЗаполнено(ТекТорговаяМарка)," И ","");
		Запрос.УстановитьПараметр("ГруппаПродукцииЗаПредназначением", ТекГруппаПродукции);
	КонецЕсли;
	Если  ЗначениеЗаполнено(ТекТорговаяМарка) Тогда 
		ТекстУсловия = ТекстУсловия +" Номенклатура.ТорговаяМаркиНоменклатуры = &ТорговаяМаркиНоменклатуры ";
		Запрос.УстановитьПараметр("ТорговаяМаркиНоменклатуры", ТекТорговаяМарка);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстУсловия) Тогда
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Истина",ТекстУсловия);
	КонецЕсли;
	Результат = Запрос.Выполнить().Выбрать();
	
	ДлинаТекста = СтрДлина(СокрЛП(Текст));
	
	Пока Результат.Следующий() Цикл
		Если ВРег(Сред(Результат.Представление,1,ДлинаТекста)) = ВРег(СокрЛП(Текст)) Тогда
			СписокНайденных.Добавить(Результат.Ссылка,Результат.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНайденных;

КонецФункции

Функция  ЕстьНаличиеЕдиницыИзмерения (Номенклатура,Характеристика) Экспорт 
	
	ЕстьЕдинца = Ложь;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда 
		Возврат ЕстьЕдинца;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Наименование
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Владелец = &Владелец
		|	И ХарактеристикаЕдиницыИзмерения = &Характеристика
		|	И ЕдиницыИзмерения.Служебная		
		|";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Результат = Запрос.Выполнить();
	ЕстьЕдинца = (НЕ Результат.Пустой());
	
	Возврат ЕстьЕдинца;
		
КонецФункции	


Процедура СодатьЕдиницыПоНоменклатуре(Владелец) Экспорт 
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда 
		Возврат;
	КонецЕсли;

	КоличествоКГВ1Единице =  Владелец.КоличествоКГВ1Единице;
	КоличествоЛВ1Единице 	=  Владелец.КоличествоЛВ1Единице;
	
		НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЕдиницаИзмерения.Наименование            						= "шт";
		НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторШТ.Получить();  
		
		НовыйЕдиницаИзмерения.Коэффициент             						= КоличествоКГВ1Единице;
		НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
		НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
		
		НовыйЕдиницаИзмерения.Владелец                							= Владелец;
		НовыйЕдиницаИзмерения.Служебная										=Истина;
		
		//НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = Ссылка;
		Попытка
			НовыйЕдиницаИзмерения.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+Владелец);
		КонецПопытки;
			
			
		НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЕдиницаИзмерения.Наименование            						= "л";
		НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторЛ.Получить();  
		
		НовыйЕдиницаИзмерения.Коэффициент             						= КоличествоКГВ1Единице/КоличествоЛВ1Единице;
		НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
		НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
		
		НовыйЕдиницаИзмерения.Владелец                							= Владелец;
		НовыйЕдиницаИзмерения.Служебная										=Истина;
		
		//НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = Ссылка;
		Попытка
			НовыйЕдиницаИзмерения.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+Владелец);
		КонецПопытки;
		
		НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЕдиницаИзмерения.Наименование            						= "кг";
		НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторКГ.Получить();  
		
		НовыйЕдиницаИзмерения.Коэффициент             						= 1;
		НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
		НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
		//
		НовыйЕдиницаИзмерения.Владелец                							= Владелец;
		НовыйЕдиницаИзмерения.Служебная										=Истина;
		
		//НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = Ссылка;
		Попытка
			НовыйЕдиницаИзмерения.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+Владелец);
		КонецПопытки;		
		
		НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЕдиницаИзмерения.Наименование            						= "т";
		НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторТ.Получить();  
		
		НовыйЕдиницаИзмерения.Коэффициент             						= 1000;
		НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
		НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
		//
		НовыйЕдиницаИзмерения.Владелец                							= Владелец;
		НовыйЕдиницаИзмерения.Служебная										=Истина;
		
		//НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = Ссылка;
		Попытка
			НовыйЕдиницаИзмерения.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+Владелец);
		КонецПопытки;
			
КонецПроцедуры

//+003431 ВБалако 20200924
Функция СписокКлючевыхРеквизитовНоменклатуры(Номенклатура) Экспорт
											   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.ГруппаПродукцииЗаПредназначением,
		|	Номенклатура.ТорговаяМаркиНоменклатуры,
		|	Номенклатура.КлассификацияЗаУровнемВязкости//,
		//|	Номенклатура.КлассификацияЗаУровнемЭксплуатационныхСвойств
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выгрузить();
		СписокНаименований = "";
		СписокЗначенийРеквизитов = Новый СписокЗначений;
		СписокЗначенийРеквизитов.Добавить(?(ЗначениеЗаполнено(Выборка[0].ГруппаПродукцииЗаПредназначением), Выборка[0].ГруппаПродукцииЗаПредназначением, ""));
		СписокЗначенийРеквизитов.Добавить(?(ЗначениеЗаполнено(Выборка[0].ТорговаяМаркиНоменклатуры), Выборка[0].ТорговаяМаркиНоменклатуры, ""));
		СписокЗначенийРеквизитов.Добавить(?(ЗначениеЗаполнено(Выборка[0].КлассификацияЗаУровнемВязкости), Выборка[0].КлассификацияЗаУровнемВязкости, ""));
		// + IvanSidoruk 25.01.2021 
		//СписокЗначенийРеквизитов.Добавить(?(ЗначениеЗаполнено(Выборка[0].КлассификацияЗаУровнемЭксплуатационныхСвойств), Выборка[0].КлассификацияЗаУровнемЭксплуатационныхСвойств, ""));
		СписокЗначенийРеквизитов.Добавить("");
		// - IvanSidoruk 25.01.2021 
		
		Возврат СписокЗначенийРеквизитов;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРеквизитыТорговыеМаркиНоменклатуры(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТорговыеМаркиНоменклатуры.Наименование,
		|	ТорговыеМаркиНоменклатуры.ПродажаЛилиШТ,
		|	ТорговыеМаркиНоменклатуры.ПродажаКГилиШТ
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТорговыеМаркиНоменклатуры КАК ТорговыеМаркиНоменклатуры
		|		ПО Номенклатура.ТорговаяМаркиНоменклатуры = ТорговыеМаркиНоменклатуры.Ссылка
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	СписокРеквизитов = Новый СписокЗначений;
	СписокРеквизитов.Добавить(ТаблицаЗапроса[0].Наименование, "НаименованиеТорговойМарки");	
	СписокРеквизитов.Добавить(ТаблицаЗапроса[0].ПродажаЛилиШТ, "ПродажаЛилиШТ");	
	СписокРеквизитов.Добавить(ТаблицаЗапроса[0].ПродажаКГилиШТ, "ПродажаКГилиШТ");	
	Возврат СписокРеквизитов;
КонецФункции	
//-003431 ВБалако 20200924

 // + IvanSidoruk 30.09.2020
Функция ПолучитьМассивНоменклатурыСтарой() Экспорт 
	
	МассивВидовНоменклатурОливаСтараря = Новый Массив;
	ТекВид = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000015");
	Если ЗначениеЗаполнено(ТекВид) Тогда 
		МассивВидовНоменклатурОливаСтараря.Добавить(ТекВид);
	КонецЕсли;
	
	ТекВид = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000016");
	
	Если ЗначениеЗаполнено(ТекВид) Тогда 
		МассивВидовНоменклатурОливаСтараря.Добавить(ТекВид);
	КонецЕсли;
	
	Возврат МассивВидовНоменклатурОливаСтараря;
	
КонецФункции
 // - IvanSidoruk 30.09.2020

  // + IvanSidoruk 05.10.2020
Процедура ОткрытьОтчетПоОстаткам() Экспорт 
	
	     ОткрытьВнешнююОбработкуОтчет(Справочники.ВнешниеОбработки.ОтчетПоОстаткамНовый);
	
КонецПроцедуры
// - IvanSidoruk 05.10.2020


Процедура ОткрытьОтчетПоДЗ() Экспорт 
	
	     ОткрытьВнешнююОбработкуОтчет(Справочники.ВнешниеОбработки.ОтчетПоДЗ);
	
КонецПроцедуры
	 

Процедура ОткрытьОтчетФактическаяКалькуляция() Экспорт 
	
	     ОткрытьВнешнююОбработкуОтчет(Справочники.ВнешниеОбработки.ОтчетФактическаяКалькуляция);
	
КонецПроцедуры

// + IvanSidoruk 14.10.2020
Процедура VRПартииТоваровБухгалтерсикйУчетАльтернативныйОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	
	МетаданныеДокумента = Источник.Метаданные();
	//	
	МожетДелатьДвиженияПоХозрасчетный					= МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыБухгалтерии.Хозрасчетный);
	МожетДелатьДвиженияПоПартиямАльтернатиный	= МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный);
	
	Если не МожетДелатьДвиженияПоХозрасчетный
		Или НЕ МожетДелатьДвиженияПоПартиямАльтернатиный Тогда 
		Возврат;
	КонецЕсли;
	//
	//
	СсылкаНАДокумент 	= Источник.Ссылка;
	ДатаРегистратора 	= СсылкаНАДокумент.Дата;

	Если НЕ ИспользоватьАльтернативныйПартионныйУчет(ДатаРегистратора) Тогда 
		Возврат;
	КонецЕсли;
	//
	//
	//Там где есть контрагент - проверяемя
	//контрагент внутрении или Внешний
	//Внешний- Просто + с стоимостью по партии
	//Внутренний, нужно брать остаток по регистру, по номеклатуре счету и т.д


	ТаблицаПроводок = Источник.движения.Хозрасчетный;
	//
	//МассивСчетовВзаиморасчетов = Новый Массив;
	//МассивСчетовВзаиморасчетов .Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями);
	//
	//
	Организация = Неопределено;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) Тогда 
		Организация =  Источник.Организация;
	КонецЕсли;
	
	ЕстьДокументВнтуригрупповой = Ложь;
	ДокументВнутригрупповой = Неопределено;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДокументОснование", МетаданныеДокумента)
		и ЗначениеЗаполнено(Источник.ДокументОснование) Тогда 
		
		МетаданыеОснования = Источник.ДокументОснование.метаданные();
		
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация",МетаданыеОснования)
			и Организация <> Источник.ДокументОснование.Организация Тогда 
			
			ЕстьДокументВнтуригрупповой = Истина;	
			ДокументВнутригрупповой = Источник.ДокументОснование;
		КонецЕсли;
	КонецЕсли;
	
	//
	наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный = РегистрыНакопления.ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.СоздатьНаборЗаписей();	
	наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Отбор.Регистратор.Установить(СсылкаНАДокумент);
	наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Прочитать();
	наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Очистить();
	//
	ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный = наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.ВыгрузитьКолонки();
	ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный .Колонки.Добавить("КлючСтрокиСвязиСписания",Новый ОписаниеТипов("Строка"));
	//
	////Если движение в ДТ товарного учета и количетсов + Это приход
	////Если движение в КТ товарного учета и количетсов + Это Расход
	//
	
	//
	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная = ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.СкопироватьКолонки(); 
	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Колонки.Добавить("КонтрагентВнутригруппа",Новый ОписаниеТипов("Булево"));
	//ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Колонки.Добавить("КлючСтрокиСвязиСписания",Новый ОписаниеТипов("Строка"));
	МассивСчетовТоварногоУчета = РазработкаСервер.ПолучитьСчетаУчетаНСП();	
	
	Контрагент = Неопределено;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент",МетаданныеДокумента) Тогда 
		Контрагент =  Источник.Контрагент;
	КонецЕсли;
	
	
	МассивКонтрагентовВнутригруппа = ПолучитьКонтрагентовВнутригруппа();
	
	Для Каждого СтрокаТЧ из ТаблицаПроводок Цикл 
	//	
	//	//Если в ДТ то+
		КлючСтрокиСвязиСписания = "";
		ЕстьДТ = Ложь;
		Если МассивСчетовТоварногоУчета.Найти(СтрокаТЧ.СчетДт) <> Неопределено Тогда 
	//		
			//Контрагент может быть в проводках по Кт
			КонтрагентПроводок 		= СтрокаТЧ.СубконтоКт.Контрагенты;
			Если ЗначениеЗаполнено(КонтрагентПроводок) Тогда 
				Контрагент = КонтрагентПроводок; 	
			КонецЕсли;
			
			ЭтоКонтрагентВнутригруппа = ?(ЗначениеЗаполнено(Контрагент) и  МассивКонтрагентовВнутригруппа.Найти(Контрагент)<> Неопределено, Истина, Ложь);
			
			
			
			
			СчетУчета						= СтрокаТЧ.СчетДт; 
			Номенклатура 					= СтрокаТЧ.СубконтоДт.Номенклатура;
			Склад				 				= СтрокаТЧ.СубконтоДт.Склады;
			ПартияПроводок 				= СтрокаТЧ.СубконтоДт.Партии;
			НоменклатурнаяПозиция = СтрокаТЧ.СубконтоДт.НоменклатурныеПозиции;
			ХарактеристикаНоменклатуры = ?(ЗначениеЗаполнено(НоменклатурнаяПозиция),НоменклатурнаяПозиция.ХарактеристикаНоменклатуры, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			
			Количество						= СтрокаТЧ.КоличествоДт;
			Сумма								= СтрокаТЧ.Сумма;
			
			НоваяСтрока = ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период						=  ДатаРегистратора;
			НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
			
			НоваяСтрока.Номенклатура							= Номенклатура;
			НоваяСтрока.СчетУчета								= СчетУчета;
			НоваяСтрока.Склад										= Склад;
			НоваяСтрока.ХарактеристикаНоменклатуры= ХарактеристикаНоменклатуры;
			
			
			Множитель  = ?(Количество>=0,1,-1);
			
			НоваяСтрока.ДокументОприходования= ПартияПроводок;//???
			
			ТекВидДвижения = ?(Множитель = 1,ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			
			НоваяСтрока.ВидДвижения 				= ТекВидДвижения;
			
			НоваяСтрока.Количество                	 	= Количество*Множитель;
			НоваяСтрока.Стоимость						=Сумма*Множитель;			
			
			НоваяСтрока.КонтрагентВнутригруппа		= ЭтоКонтрагентВнутригруппа;
			НоваяСтрока.Контрагент							= Контрагент;
			
			КлючСтрокиСвязиСписания 						=  СокрЛП(Новый УникальныйИдентификатор);			
			НоваяСтрока.КлючСтрокиСвязиСписания =   КлючСтрокиСвязиСписания;
			
			ЕстьДТ = Истина;
		КонецЕсли;
	//		
	//	// это минус
		ЕстьКТ = (МассивСчетовТоварногоУчета.Найти(СтрокаТЧ.СчетКт) <> Неопределено) ;
		Если ЕстьДТ и Не ЕстьКТ Тогда 
			КлючСтрокиСвязиСписания = "";			
			НоваяСтрока.КлючСтрокиСвязиСписания = КлючСтрокиСвязиСписания;
		ИначеЕсли  ЕстьКТ Тогда 
	//		
			//Контрагент может быть в проводках по Кт
			КонтрагентПроводок 		= СтрокаТЧ.СубконтоДт.Контрагенты;
			Если ЗначениеЗаполнено(КонтрагентПроводок) Тогда 
				Контрагент = КонтрагентПроводок; 	
			КонецЕсли;
			
			ЭтоКонтрагентВнутригруппа = ?(ЗначениеЗаполнено(Контрагент) и  МассивКонтрагентовВнутригруппа.Найти(Контрагент)<> Неопределено, Истина, Ложь);
	
			СчетУчета						= СтрокаТЧ.СчетКт; 
			Номенклатура 					= СтрокаТЧ.СубконтоКт.Номенклатура;
			Склад				 				= СтрокаТЧ.СубконтоКт.Склады;
			ПартияПроводок 				= СтрокаТЧ.СубконтоКт.Партии;
			НоменклатурнаяПозиция = СтрокаТЧ.СубконтоКт.НоменклатурныеПозиции;
			ХарактеристикаНоменклатуры = ?(ЗначениеЗаполнено(НоменклатурнаяПозиция),НоменклатурнаяПозиция.ХарактеристикаНоменклатуры, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			
			Количество						= СтрокаТЧ.КоличествоКт;
			Сумма								= СтрокаТЧ.Сумма;
			
			НоваяСтрока = ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Добавить();
			НоваяСтрока.Активность					= Истина;
			НоваяСтрока.Период						=  ДатаРегистратора;
			НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
			
			НоваяСтрока.Номенклатура							= Номенклатура;
			НоваяСтрока.СчетУчета								= СчетУчета;
			НоваяСтрока.Склад										= Склад;
			НоваяСтрока.ХарактеристикаНоменклатуры= ХарактеристикаНоменклатуры;
			
			
			Множитель  = ?(Количество>=0,1,-1);
			
			НоваяСтрока.ДокументОприходования= ПартияПроводок;//???
			
			ТекВидДвижения = ?(Множитель = 1,ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			
			НоваяСтрока.ВидДвижения 				= ТекВидДвижения;
			
			НоваяСтрока.Количество                	 	= Количество*Множитель;
			НоваяСтрока.Стоимость						=Сумма*Множитель;			
			
			НоваяСтрока.КонтрагентВнутригруппа  = ЭтоКонтрагентВнутригруппа;
			НоваяСтрока.Контрагент						  = Контрагент;
			
			НоваяСтрока.КлючСтрокиСвязиСписания =   КлючСтрокиСвязиСписания;
		КонецЕсли;
		
	КонецЦикла;
	//
	////Все что в минус будем выбирать по остаткам
	Если ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Количество() > 0 Тогда 
		
		
		
		Запрос = Новый Запрос;		
		Запрос.УстановитьПараметр("ДатаОстатков"							, СсылкаНАДокумент.МоментВремени());		
		Запрос.УстановитьПараметр("Номенклатура"							, ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("СчетУчета"								, ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.ВыгрузитьКолонку("СчетУчета"));	
		Запрос.УстановитьПараметр("Склад"										, ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.ВыгрузитьКолонку("Склад"));	
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры"	, ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));	
		Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
		Если ЕстьДокументВнтуригрупповой Тогда 
			Запрос.УстановитьПараметр("ДокументВнутригрупповой", ДокументВнутригрупповой);
		КонецЕсли;
		Запрос.Текст = "
		    |
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|Данные.Номенклатура,
			|Данные.СчетУчета,
			|Данные.Склад,
			|Данные.ХарактеристикаНоменклатуры,
			|Данные.СерияНоменклатуры,
			|Данные.ДокументОприходования,
			|Данные.Стоимость,
			|Данные.Количество,
			|Данные.ВидОстатков,
			|Данные.ЭтоВнтуригрупповойДокумент
			|ИЗ
			|	(
			|ВЫБРАТЬ 
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.Номенклатура КАК Номенклатура,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СчетУчета КАК СчетУчета,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.Склад КАК Склад,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.ДокументОприходования КАК ДокументОприходования,
			|	ВЫБОР КОГДА ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СтоимостьОстаток >0 ТОГДА
			|		ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СтоимостьОстаток
			|	ИНАЧЕ
			|		-ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СтоимостьОстаток
			|	КОНЕЦ КАК Стоимость,						
			|	ВЫБОР КОГДА ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СтоимостьОстаток >0 ТОГДА
			|		ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.КоличествоОстаток
			|	ИНАЧЕ
			|		-ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.КоличествоОстаток
			|	КОНЕЦ КАК Количество,						
			|	ВЫБОР КОГДА ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.СтоимостьОстаток >0 ТОГДА
			|		&Приход
			|	ИНАЧЕ
			|		&Расход
			|	КОНЕЦ ВидОстатков,
			| 	ЛОЖЬ ЭтоВнтуригрупповойДокумент
			|ИЗ
			|	РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Остатки(
			|			&ДатаОстатков,
			|			Номенклатура В (&Номенклатура)
			|				И СчетУчета В (&СчетУчета)
			|				И Склад В (&Склад)
			|				И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
			|				) КАК ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки
			|	ГДЕ
			|			ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйОстатки.КоличествоОстаток <>0
			|			
			|"+?(ЕстьДокументВнтуригрупповой, "
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Номенклатура,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.СчетУчета,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Склад,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.ХарактеристикаНоменклатуры,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.СерияНоменклатуры,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.ДокументОприходования,
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Стоимость,			
			|	ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Количество,
			|	ВЫБОР КОГДА ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.ВидДвижения = &Приход ТОГДА &Расход ИНАЧЕ  &Приход КОНЕЦ,
			| 	ИСТИНА ЭтоВнтуригрупповойДокумент
			|ИЗ
			|РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный КАК ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный
			|ГДЕ
			|ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Регистратор = &ДокументВнутригрупповой
			| ", "") +") КАК ДАнные
			|
			|УПОРЯДОЧИТЬ ПО
			|		ДАнные.ДокументОприходования.Дата
			|";
	
		ТаблицаОстатковПартийАльтернативный = Запрос.Выполнить().Выгрузить();
		
		
		ТекПогрешностьСуммы = 0;
		ТекСоответсвиеПогрешностей = Новый Соответствие;
		
		
		ТекПогрешностьСуммыПрихода = 0;
		
		//Вначале пройдемся по расходу
		ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Сортировать("ВидДвижения Убыв");
		
		ЕстьРасходныеДвижения = Ложь;
		
		
		Для Каждого СтрокаТЧДвижений из  ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная Цикл 
			
			//Если птиу по внутригруппе, то остатка нет так как РТИу Его списало, нужно брать движения ртуи и стоимость ложить на наш документ, или не списывать в РТИУ(тогада скдлад счет можжет отличаться),
			
			Номенклатура										= СтрокаТЧДвижений.Номенклатура;
			Склад													= СтрокаТЧДвижений.Склад;
			ХарактеристикаНоменклатуры				= СтрокаТЧДвижений.ХарактеристикаНоменклатуры;			
			СчетУчета											= СтрокаТЧДвижений.СчетУчета;
			СерияНоменклатуры							= СтрокаТЧДвижений.СерияНоменклатуры;
			ДокументОприходования						= СтрокаТЧДвижений.ДокументОприходования;
			//ВидОстатков                                        = СтрокаТЧДвижений.ВидОстатков;
			
			Количество											= СтрокаТЧДвижений.Количество;
			Стоимость                                            = СтрокаТЧДвижений.Стоимость;
			
			КонтрагентВнутригруппа 	= СтрокаТЧДвижений.КонтрагентВнутригруппа;
			ВидДвижения 					= СтрокаТЧДвижений.ВидДвижения;
			
			Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда  
				ЕстьРасходныеДвижения = Истина;
			КонецЕсли;
			
			КлючСтрокиСвязиСписания = СтрокаТЧДвижений.КлючСтрокиСвязиСписания;
			
			ВидОстатков = ?(ВидДвижения = ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
			
			//это не внутригруппа и движение в плюс, то просто пишем движения
			СтрокаОбработана = Ложь;
			
			Если  НЕ КонтрагентВнутригруппа  и ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
				
				БратьСуммуПоРасходам = Ложь;
				//т.к мы сделали ранее расходные движения по суммам внутригруппы, то приход делаем распределяя суммы расхода пропорционально суммам прихода по пороводкам
				
				
				
				Если ЕстьРасходныеДвижения Тогда 
					
					//Получим итоговые суммы прихода
					СтрукутраОтбора = Новый Структура;
					СтрукутраОтбора.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
					Если ЗначениеЗаполнено(КлючСтрокиСвязиСписания) Тогда 						
						СтрукутраОтбора.Вставить("КлючСтрокиСвязиСписания", КлючСтрокиСвязиСписания);	
					КонецЕсли;
					ТалиблицаПриходныхДвижений =   ПартииТоваровНаСкладахБухгалтерскийУчетАльтернативныйСлужебная.Скопировать(СтрукутраОтбора);
					ИтоговаяСуммаПрихода = ТалиблицаПриходныхДвижений.Итог("Стоимость");						
					
					//Получим итоговые суммы Расхода
					СтрукутраОтбора = Новый Структура;
					СтрукутраОтбора.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
					
					Если ЗначениеЗаполнено(КлючСтрокиСвязиСписания) Тогда 						
						СтрукутраОтбора.Вставить("КлючСтрокиСвязиСписания", КлючСтрокиСвязиСписания);	
					КонецЕсли;
					
					ТалицаУжеСформированныхРАсходныхДвижений = ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Скопировать(СтрукутраОтбора);
					
					ИтоговаяСуммаРасхода = ТалицаУжеСформированныхРАсходныхДвижений.Итог("Стоимость");	
					
					Если ИтоговаяСуммаПрихода <> 0 Тогда 
						ТекСуммаДляПрихода = (Стоимость/ИтоговаяСуммаПрихода)* ИтоговаяСуммаРасхода;
						
						ТекСуммаДляПрихода = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ТекСуммаДляПрихода, 2,ТекПогрешностьСуммыПрихода);
						БратьСуммуПоРасходам = Истина;
					КонецЕсли;
					
					
				КонецЕсли;	
					
					
					
					
				
				
				    НоваяСтрока = ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧДвижений);
					
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументОприходования) Тогда 
						НоваяСтрока.ДокументОприходования = НоваяСтрока.Регистратор;
					КонецЕсли;	
					
					Если БратьСуммуПоРасходам Тогда 
						НоваяСтрока.Стоимость = ТекСуммаДляПрихода;
					КонецЕсли;
					
				  	СтрокаОбработана = Истина;
			КонецЕсли;
			
			Если СтрокаОбработана Тогда 
				Продолжить;
			КонецЕсли;
			
			
			//если внутригруппа , или перемещения ТМЦ нужно брать остаток, если расход, нужно брать остаток
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура"								,Номенклатура);
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры"	,ХарактеристикаНоменклатуры);
			
			//нужно распределить что было списано, без учета склада и счета, так как они могут отличаться в связке РТИУ-ПТИУ
			Если ЕстьДокументВнтуригрупповой Тогда 
				СтруктураПоиска.Вставить("ЭтоВнтуригрупповойДокумент"	,Истина);
			Иначе 
				СтруктураПоиска.Вставить("Склад"											,Склад);
				СтруктураПоиска.Вставить("СчетУчета"									,СчетУчета);
				СтруктураПоиска.Вставить("ВидОстатков"								,ВидОстатков);
			КонецЕсли;
			
			
			 МассивПодходящихСТрок = ТаблицаОстатковПартийАльтернативный.НайтиСтроки(СтруктураПоиска); 
			 
			 ТекКоличествоСписания = Количество;
			 
			 Для Каждого СтрокаОстатка из МассивПодходящихСТрок Цикл 
				 
				 Если ТекКоличествоСписания <=0 Тогда 
						Прервать;		 
					КонецЕсли;
					 
					 ДоступноеКоличество = Мин(СтрокаОстатка.Количество,ТекКоличествоСписания);
					 ДоступноеКоличество = Макс(ДоступноеКоличество,0);
					 				 
					 Если ДоступноеКоличество > 0 Тогда 
						 ТекПартияОстатков = СтрокаОстатка.ДокументОприходования;
					//	 
						ТекКлюч = ""+ Номенклатура  +"_"+ХарактеристикаНоменклатуры + "_" +Склад +"_" +СчетУчета + "_"+  ТекПартияОстатков;
						 ТекКоличествоСписания = ТекКоличествоСписания - ДоступноеКоличество;
						 
						ДоступнаяСтоимость = (СтрокаОстатка.Стоимость/СтрокаОстатка.Количество)*ДоступноеКоличество;
						
						ДоступнаяСтоимость = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(ДоступнаяСтоимость,2,ТекПогрешностьСуммы,ТекСоответсвиеПогрешностей,ТекКлюч);
						 
						 СтрокаОстатка.Количество		= СтрокаОстатка.Количество	-ДоступноеКоличество;
						 СтрокаОстатка.Стоимость		= СтрокаОстатка.Стоимость	-ДоступнаяСтоимость;
					//	 
					//	 
						НоваяСтрока = ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Добавить();
						НоваяСтрока.Активность									= Истина;
						НоваяСтрока.Период										=  ДатаРегистратора;
						НоваяСтрока.Регистратор 								= СсылкаНАДокумент;
						НоваяСтрока.Номенклатура								= Номенклатура;
						НоваяСтрока.СчетУчета									= СчетУчета;
						НоваяСтрока.Склад											= Склад;
						НоваяСтрока.ХарактеристикаНоменклатуры	= ХарактеристикаНоменклатуры;
						НоваяСтрока.СерияНоменклатуры					= СерияНоменклатуры;
						
						НоваяСтрока.ДокументОприходования			= ТекПартияОстатков;
						
						НоваяСтрока.ВидДвижения 				= ВидДвижения;
						
						НоваяСтрока.Количество					=ДоступноеКоличество;			
						
						НоваяСтрока.Стоимость					=ДоступнаяСтоимость;				
						
						//если понадобисть связь ДТ и КТ, в противном случае соберем все
						НоваяСтрока.КлючСтрокиСвязиСписания					=КлючСтрокиСвязиСписания;				
					//						
			    КонецЕсли;
			КонецЦикла;///Конец перебора остатков
			
			
			//Что-то пошло не так
			Если ТекКоличествоСписания >0 Тогда 
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
			
	//		ТекСуммаСписания = СтрокаТЧДвижений.СуммаВзаиморасчетов;
	//		
	//		ВидОстатков = ?(СтрокаТЧДвижений.ВидДвижения = ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
	//		ВидДвижения = СтрокаТЧДвижений.ВидДвижения;
	//		//А что если документ расчетов указан?!
	//		
	//		СтруктураПоиска = Новый Структура;
	//		СтруктураПоиска.Вставить("ДоговорКонтрагента"	,СтрокаТЧДвижений.ДоговорКонтрагента);
	//		СтруктураПоиска.Вставить("Контрагент"					,СтрокаТЧДвижений.Контрагент);
	//		СтруктураПоиска.Вставить("Сделка"						,СтрокаТЧДвижений.Сделка);
	//		СтруктураПоиска.Вставить("ВидОстатков"				,ВидОстатков);
	//		
	//		 МассивПодходящихСТрок = ТаблицаОстатковВзаиморасчетов.НайтиСтроки(СтруктураПоиска); 
	//		 
	//		 Для Каждого СтрокаОстатка из МассивПодходящихСТрок Цикл 
	//			 
	//			Если ТекСуммаСписания <=0 Тогда 
	//				Прервать;		 
	//			КонецЕсли;
	//			 
	//			 ДоступнаяСумма = Мин(СтрокаОстатка.СуммаВзаиморасчетов,ТекСуммаСписания);
	//			 ДоступнаяСумма = Макс(ДоступнаяСумма,0);
	//			 				 
	//			 Если ДоступнаяСумма > 0 Тогда 
	//				 
	//				 ТекСуммаСписания = ТекСуммаСписания - ДоступнаяСумма;
	//				 СтрокаОстатка.СуммаВзаиморасчетов = СтрокаОстатка.СуммаВзаиморасчетов-ДоступнаяСумма;
	//				 
	//				 
	//				НоваяСтрока = ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Добавить();
	//				НоваяСтрока.Активность					= Истина;
	//				НоваяСтрока.Период						=  ДатаРегистратора;
	//				НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
	//				
	//				НоваяСтрока.ВидДвижения 				= ВидДвижения;
	//				
	//				НоваяСтрока.Организация				= Организация;
	//				НоваяСтрока.ДоговорКонтрагента	= СтрокаТЧДвижений.ДоговорКонтрагента;
	//				
	//				НоваяСтрока.Сделка									  		= СтрокаОстатка.Сделка;
	//				НоваяСтрока.ДокументРасчетовСКонтрагентом	= СтрокаОстатка.ДокументРасчетовСКонтрагентом;
	//									
	//				НоваяСтрока.ВидРасчетовСКонтрагентом			= СтрокаОстатка.ВидРасчетовСКонтрагентом;
	//				НоваяСтрока.Контрагент                  					= СтрокаТЧДвижений.Контрагент;
	//				
	//				НоваяСтрока.СуммаВзаиморасчетов					=ДоступнаяСумма;			
	//				
	//				//Если НЕ ЗначениеЗаполнено(НоваяСтрока.ДокументРасчетовСКонтрагентом) Тогда 
	//				//	НоваяСтрока.ДокументРасчетовСКонтрагентом =  СсылкаНАДокумент;		
	//				//КонецЕсли;

	//				 
	//				 
	//			 КонецЕсли;
	//			 
	//		КонецЦикла;
	//		
	//		
	//		//не хватает остатка, что-то нужно сделать!!!
	//		Если ТекСуммаСписания >0 Тогда 
	//			   //ОбщегоНазначения.СообщитьОбОшибке( "Не хватает"+ТекСуммаСписания  +"!");
	//			   
	//				НоваяСтрока = ТаблицаvrВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Добавить();
	//				НоваяСтрока.Активность					= Истина;
	//				НоваяСтрока.Период						=  ДатаРегистратора;
	//				НоваяСтрока.Регистратор 				= СсылкаНАДокумент;
	//				
	//				НоваяСтрока.ВидДвижения 				= ВидДвижения;
	//				
	//				НоваяСтрока.Организация				= Организация;
	//				НоваяСтрока.ДоговорКонтрагента	= СтрокаТЧДвижений.ДоговорКонтрагента;
	//				
	//				НоваяСтрока.Сделка									  		= СтрокаТЧДвижений.Сделка;
	//				НоваяСтрока.ДокументРасчетовСКонтрагентом	= СтрокаТЧДвижений.ДокументРасчетовСКонтрагентом;
	//									
	//				НоваяСтрока.ВидРасчетовСКонтрагентом			=СтрокаТЧДвижений.ВидРасчетовСКонтрагентом;//!!!
	//				НоваяСтрока.Контрагент                  					=СтрокаТЧДвижений.Контрагент;
	//				
	//				НоваяСтрока.СуммаВзаиморасчетов					=ТекСуммаСписания;								

	//		КонецЕсли;
	//		
	//		
	//		
	//	КонецЦикла;
	////	
	//КонецЕсли;
	//
	
	////Запишем наш регистр!
	наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Загрузить(ТаблицаПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный);	
	наборПартииТоваровНаСкладахБухгалтерскийУчетАльтернативный.Записать(Истина);	

	
КонецПроцедуры
// - IvanSidoruk 14.10.2020

//+ВладЧ
Процедура СоздатьИзменитьЗаказПокупателяМобильный(Источник,Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ДополнительныеСвойства.Свойство("Обновлен") Тогда
		Возврат;
	КонецЕсли;
	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияСогласованияЗаказовСрезПоследних.Период,
		|	СостоянияСогласованияЗаказовСрезПоследних.Заказ,
		|	СостоянияСогласованияЗаказовСрезПоследних.Пользователь,
		|	СостоянияСогласованияЗаказовСрезПоследних.Состояние,
		|	СостоянияСогласованияЗаказовСрезПоследних.Уровень,
		|	СостоянияСогласованияЗаказовСрезПоследних.Этап
		|ИЗ
		|	РегистрСведений.СостоянияСогласованияЗаказов.СрезПоследних КАК СостоянияСогласованияЗаказовСрезПоследних
		|ГДЕ
		|	СостоянияСогласованияЗаказовСрезПоследних.Заказ = &Заказ
		| И СостоянияСогласованияЗаказовСрезПоследних.Этап <> ЗНАЧЕНИЕ(Справочник.МаршрутыСогласованияЗаказов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Заказ", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭтапСогласования = РезультатЗапроса.Выбрать();
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgСоответствияМобильныхДокументов.МобильныйДокумент
		|ИЗ
		|	РегистрСведений.vrgСоответствияМобильныхДокументов КАК vrgСоответствияМобильныхДокументов
		|ГДЕ
		|	vrgСоответствияМобильныхДокументов.ОсновнойДокумент = &ОсновнойДокумент";
	
	Запрос.УстановитьПараметр("ОсновнойДокумент", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		МобДокумент = ВыборкаДетальныеЗаписи.МобильныйДокумент.ПолучитьОбъект();
		//Редактировать существующий не нужно
		ЗарегистрироватьУдалитьбИзмененияДляТСД(МобДокумент.Ссылка);
		Возврат;
		НеобходимоСделатьЗаписьСоответствия = Ложь;
	Иначе
		МобДокумент = Документы.vrgЗаказКлиентаМобильный.СоздатьДокумент();
		НеобходимоСделатьЗаписьСоответствия = Истина;

	КонецЕсли;
	
	Если ЭтапСогласования.Следующий() Тогда
		Если ЭтапСогласования.Этап.Родитель = Справочники.МаршрутыСогласованияЗаказов.НайтиПоНаименованию("Склад") И Не ЭтапСогласования.Состояние = Перечисления.СостоянияЗаказов.Подготовлен  Тогда
			
	Если МобДокумент.ЭтоНовый() Тогда
		МобДокумент.СтатусЗаказа				= Перечисления.СтатусыСкладаЗаказаПокупателя.Ожидает;
	КонецЕсли;
	МобДокумент.Организация 				= Источник.Организация;
	МобДокумент.Контрагент 					= Источник.Контрагент;
	МобДокумент.Склад 						= Источник.СкладГруппа ;
	МобДокумент.Ответственный 				= Источник.Ответственный;
	Если Источник.Комментарии.Количество() Тогда
		Комментарий = Источник.Комментарии[Источник.Комментарии.Количество()-1].Комментарий;
	Иначе
		Комментарий = "";
	КонецЕсли;
	МобДокумент.Дата						= Источник.Дата;
	МобДокумент.Комментарий 				= Комментарий;
	МобДокумент.СозданНаМобильномУстройстве = Ложь;
	МобДокумент.ТипЦен 						= Источник.ТипЦен;
	МобДокумент.ДоговорКонтрагента 			= Источник.ДоговорКонтрагента;
	МобДокумент.СуммаДокумента 				= Источник.СуммаДокумента;
	МобДокумент.Товары.Очистить();
	Для Каждого СтрокаЗаказа из Источник.Товары Цикл
		НоваяСтрокаМоб = МобДокумент.Товары.Добавить();
		НоваяСтрокаМоб.Номенклатура					  =  СтрокаЗаказа.Номенклатура;
		НоваяСтрокаМоб.ХарактеристикаНоменклатуры     =  СтрокаЗаказа.ХарактеристикаНоменклатуры;
		НоваяСтрокаМоб.СерияНоменклатуры              =  СтрокаЗаказа.СерияНоменклатуры;
		НоваяСтрокаМоб.КоличествоЗаказ                =  СтрокаЗаказа.Количество;
		НоваяСтрокаМоб.Цена                           =  СтрокаЗаказа.Цена;
		НоваяСтрокаМоб.Сумма                          =  СтрокаЗаказа.Сумма;
		НоваяСтрокаМоб.ЕдиницаИзмерения               =  СтрокаЗаказа.ЕдиницаИзмерения;
		НоваяСтрокаМоб.Коэффициент                    =  СтрокаЗаказа.Коэффициент;
	КонецЦикла;
	
	Для Каждого СтрокаЗаказа из Источник.Услуги Цикл
		НоваяСтрокаМоб = МобДокумент.Товары.Добавить();
		НоваяСтрокаМоб.Номенклатура					  =  СтрокаЗаказа.Номенклатура;
		//НоваяСтрокаМоб.ХарактеристикаНоменклатуры     =  СтрокаЗаказа.ХарактеристикаНоменклатуры;
		//НоваяСтрокаМоб.СерияНоменклатуры              =  СтрокаЗаказа.СерияНоменклатуры;
		НоваяСтрокаМоб.КоличествоЗаказ                =  СтрокаЗаказа.Количество;
		НоваяСтрокаМоб.Цена                           =  СтрокаЗаказа.Цена;
		НоваяСтрокаМоб.Сумма                          =  СтрокаЗаказа.Сумма;
		НоваяСтрокаМоб.ЕдиницаИзмерения               =  СтрокаЗаказа.ЕдиницаИзмерения;
		//НоваяСтрокаМоб.Коэффициент                    =  СтрокаЗаказа.Коэффициент;
	КонецЦикла;

	МобДокумент.ДополнительныеСвойства.Вставить("ОбноаленВЦБ",Истина);
	МобДокумент.Записать(РежимЗаписиДокумента.Запись);
	ЗарегистрироватьУдалитьбИзмененияДляТСД(МобДокумент.Ссылка);
	Если НеобходимоСделатьЗаписьСоответствия Тогда
		МенеджерЗаписиСоответствия = РегистрыСведений.vrgСоответствияМобильныхДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСоответствия.МобильныйДокумент = МобДокумент.Ссылка;
		МенеджерЗаписиСоответствия.ОсновнойДокумент = Источник.Ссылка;
		МенеджерЗаписиСоответствия.Записать();
	КонецЕсли;

	Иначе 
	    Если ЗначениеЗаполнено(МобДокумент.Ссылка) Тогда
			ЗарегистрироватьУдалитьбИзмененияДляТСД(МобДокумент.Ссылка, Истина)
		КонецЕсли;
	КонецЕсли;	
КонецЕсли;
			
КонецПроцедуры
//-ВладЧ



//+ВладЧ
Процедура ЗарегистрироватьУдалитьбИзмененияДляТСД(МобДок,УдалятьИзменения = Ложь )
	 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgМобильныеСклад.Ссылка
		|ИЗ
		|	ПланОбмена.vrgМобильныеСклад КАК vrgМобильныеСклад
		|ГДЕ
		|	НЕ vrgМобильныеСклад.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивУзлов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивУзлов.Добавить(ВыборкаДетальныеЗаписи.ссылка);
	КонецЦикла;
	Если Не УдалятьИзменения Тогда 
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,МобДок);
	Иначе
		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов,МобДок);
	КонецЕсли;

КонецПроцедуры
//-ВладЧ


// + IvanSidoruk 14.10.2020
Функция ИспользоватьАльтернативныйПартионныйУчет(ДатаПроверки) Экспорт 
	
	пДата = ?(ЗначениеЗаполнено(ДатаПроверки), ДатаПроверки, ТекущаяДата());
	
	
	ДатаНачалаИспользованияАльтернативногоПартионногоУчета = Константы.ДатаНачалаИспользованияАльтернативногоПартионногоУчета.Получить();
	
	Использовать =  ?(ЗначениеЗаполнено(пДата) и ЗначениеЗаполнено(ДатаНачалаИспользованияАльтернативногоПартионногоУчета) и ДатаНачалаИспользованияАльтернативногоПартионногоУчета <= пДата, Истина, Ложь);
	
	Возврат Использовать;
	
КонецФункции	
// - IvanSidoruk 14.10.2020

// + IvanSidoruk 14.10.2020
Функция ПолучитьКонтрагентовВнутригруппа() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Организации.vr_Контрагент КАК Контрагент
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.vr_Контрагент <> Значение(Справочник.Контрагенты.ПустаяСсылка)
		|";
	
	МассивКонтрагентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	
	Возврат МассивКонтрагентов;
	
КонецФункции
// - IvanSidoruk 14.10.2020


Процедура СоздатьЕдиницыПоХарактеристике(ХарактеристикаСсылка,КоличествоКГВ1Единице,КоличествоЛВ1Единице, Отказ = Ложь, РежимДозаполненияЕдиниц = Ложь) Экспорт 
	
			ТекЕдиницаИзмерения = Разработка.ПолучитьЕдиницуИзмеренияПоХарактеристике(ХарактеристикаСсылка);
			
			Если ЗначениеЗаполнено(ТекЕдиницаИзмерения)  и РежимДозаполненияЕдиниц <> Истина Тогда 
				
				Если ТекЕдиницаИзмерения.Коэффициент <> КоличествоКГВ1Единице Тогда 
					ОбщегоНазначения.СообщитьОбОшибке("Внимание! КоличествоКГВ1Единице  "+КоличествоКГВ1Единице  +" отличается  от  "+ТекЕдиницаИзмерения.Коэффициент +" в единице измерения!");				
				КонецЕсли;			
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(ТекЕдиницаИзмерения)  и ЗначениеЗаполнено(КоличествоЛВ1Единице) и ЗначениеЗаполнено(КоличествоКГВ1Единице)) или РежимДозаполненияЕдиниц = Истина  Тогда 		
				
				СоздаватьЕдинцу = Истина;
				Если РежимДозаполненияЕдиниц = Истина Тогда 
					ЕстьЕдинца = ЕстьЕдиницаИзмерения("шт",ХарактеристикаСсылка,ХарактеристикаСсылка.Владелец);
					Если ЕстьЕдинца Тогда 
						СоздаватьЕдинцу = Ложь;	
					КонецЕсли;
				КонецЕсли;
				
				Если СоздаватьЕдинцу Тогда 
					НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
					НовыйЕдиницаИзмерения.Наименование            						= "шт";
					НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторШТ.Получить();  
					
					НовыйЕдиницаИзмерения.Коэффициент             						= КоличествоКГВ1Единице;
					НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
					НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
					
					НовыйЕдиницаИзмерения.Владелец                							= ХарактеристикаСсылка.Владелец;
					НовыйЕдиницаИзмерения.Служебная										=Истина;
					
					НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = ХарактеристикаСсылка;
					Попытка
						НовыйЕдиницаИзмерения.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+ХарактеристикаСсылка + "! Причина:"+ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
				СоздаватьЕдинцу = Истина;
				Если РежимДозаполненияЕдиниц = Истина Тогда 
					ЕстьЕдинца = ЕстьЕдиницаИзмерения("л",ХарактеристикаСсылка,ХарактеристикаСсылка.Владелец);
					Если ЕстьЕдинца Тогда 
						СоздаватьЕдинцу = Ложь;	
					КонецЕсли;
				КонецЕсли;
				
				Если СоздаватьЕдинцу Тогда 
					
					НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
					НовыйЕдиницаИзмерения.Наименование            						= "л";
					НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторЛ.Получить();  
					
					НовыйЕдиницаИзмерения.Коэффициент             						= КоличествоКГВ1Единице/КоличествоЛВ1Единице;
					НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
					НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
					
					НовыйЕдиницаИзмерения.Владелец                							= ХарактеристикаСсылка.Владелец;
					НовыйЕдиницаИзмерения.Служебная										=Истина;
					
					НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = ХарактеристикаСсылка;
					Попытка
						НовыйЕдиницаИзмерения.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+ХарактеристикаСсылка+"! Причина:"+ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
				СоздаватьЕдинцу = Истина;
				Если РежимДозаполненияЕдиниц = Истина Тогда 
					ЕстьЕдинца = ЕстьЕдиницаИзмерения("кг",ХарактеристикаСсылка,ХарактеристикаСсылка.Владелец);
					Если ЕстьЕдинца Тогда 
						СоздаватьЕдинцу = Ложь;	
					КонецЕсли;
				КонецЕсли;
				
				Если СоздаватьЕдинцу Тогда 
					НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
					НовыйЕдиницаИзмерения.Наименование            						= "кг";
					НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторКГ.Получить();  
					
					НовыйЕдиницаИзмерения.Коэффициент             						= 1;
					НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
					НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
					//
					НовыйЕдиницаИзмерения.Владелец                							= ХарактеристикаСсылка.Владелец;
					НовыйЕдиницаИзмерения.Служебная										=Истина;
					
					НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = ХарактеристикаСсылка;
					Попытка
						НовыйЕдиницаИзмерения.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+ХарактеристикаСсылка+"! Причина:"+ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
				СоздаватьЕдинцу = Истина;
				Если РежимДозаполненияЕдиниц = Истина Тогда 
					ЕстьЕдинца = ЕстьЕдиницаИзмерения("т",ХарактеристикаСсылка,ХарактеристикаСсылка.Владелец);
					Если ЕстьЕдинца Тогда 
						СоздаватьЕдинцу = Ложь;	
					КонецЕсли;
				КонецЕсли;
				
				Если СоздаватьЕдинцу Тогда 
					НовыйЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
					НовыйЕдиницаИзмерения.Наименование            						= "т";
					НовыйЕдиницаИзмерения.ЕдиницаПоКлассификатору 			= Константы.КлассификаторТ.Получить();  
					
					НовыйЕдиницаИзмерения.Коэффициент             						= 1000;
					НовыйЕдиницаИзмерения.Вес				             						= КоличествоКГВ1Единице;
					НовыйЕдиницаИзмерения.Объем			             						= КоличествоЛВ1Единице;
					//
					НовыйЕдиницаИзмерения.Владелец                							= ХарактеристикаСсылка.Владелец;
					НовыйЕдиницаИзмерения.Служебная										=Истина;
					
					НовыйЕдиницаИзмерения.ХарактеристикаЕдиницыИзмерения = ХарактеристикаСсылка;
					Попытка
						НовыйЕдиницаИзмерения.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать единицу измерения по "+ХарактеристикаСсылка+"! Причина:"+ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
КонецПроцедуры
	
Функция 	ЕстьЕдиницаИзмерения(НАзваениеЕдиницы,ХарактеристикаСсылка,НоменклатураСсылка)
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", НоменклатураСсылка);
		Запрос.УстановитьПараметр("ХарактеристикаЕдиницыИзмерения", ХарактеристикаСсылка);
		Запрос.УстановитьПараметр("Наименование", НАзваениеЕдиницы);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕдиницыИзмерения.Ссылка
			|ИЗ
			|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
			|ГДЕ
			|	ЕдиницыИзмерения.Владелец = &Владелец
			|	И ЕдиницыИзмерения.ХарактеристикаЕдиницыИзмерения = &ХарактеристикаЕдиницыИзмерения
			|	И ЕдиницыИзмерения.Наименование = &Наименование
			|";
 	ЕстьЕдинца = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЕстьЕдинца = Истина;
	КонецЕсли;
	
	Возврат ЕстьЕдинца;
	
КонецФункции

// + IvanSidoruk 10.11.2020
Функция ИспользоватьДопРасходовНаТоварныхСчетах(ДатаПроверки) Экспорт 
	
	пДата = ?(ЗначениеЗаполнено(ДатаПроверки), ДатаПроверки, ТекущаяДата());
	
	
	ДатаНачалаИспользованияАльтернативногоПартионногоУчета = Константы.ДатаНачалаИспользованияДопРасходовНаТоварныхСчетах.Получить();
	
	Использовать =  ?(ЗначениеЗаполнено(пДата) и ЗначениеЗаполнено(ДатаНачалаИспользованияАльтернативногоПартионногоУчета) и ДатаНачалаИспользованияАльтернативногоПартионногоУчета <= пДата, Истина, Ложь);
	
	Возврат Использовать;
	
КонецФункции	
// - IvanSidoruk 10.11.2020


// + IvanSidoruk 10.11.2020
Функция ПолучитьТаблицуСоответвияСчетовДопРАсходов() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаДопЗатратСоответсвие.СчетИсходный КАК СчетИсходный,
		|	СчетаДопЗатратСоответсвие.СчетПолучаемый как СчетПолучаемый,
		|	СчетаДопЗатратСоответсвие.СчетДопРасходовИсходный КАК СчетДопРасходовИсходный,
		|	СчетаДопЗатратСоответсвие.СчетДопРасходовПолучаемый КАк СчетДопРасходовПолучаемый,
		|	СчетаДопЗатратСоответсвие.СодержаниеПроводки КАк СодержаниеПроводки,
		|	СчетаДопЗатратСоответсвие.ИдентификаторДопРасходов КАк ИдентификаторДопРасходов
		|ИЗ
		|	РегистрСведений.СчетаДопЗатратСоответсвие КАК СчетаДопЗатратСоответсвие";
	
	ТаблицаСоотсветствияСчетов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСоотсветствияСчетов;
	
КонецФункции
// - IvanSidoruk 10.11.2020


// + IvanSidoruk 10.11.2020
Функция ПолучитьСчетДопЗатратПоСоответсвию(ТаблицаПоиска, СчетИсходный,СчетДопРасходовИсходный,СчетПолучаемый) Экспорт 
	
	СтруктураПоиска =  Новый Структура;
	СтруктураПоиска.Вставить("СчетИсходный",СчетИсходный);
	СтруктураПоиска.Вставить("СчетДопРасходовИсходный",СчетДопРасходовИсходный);
	СтруктураПоиска.Вставить("СчетПолучаемый",СчетПолучаемый);
	
	массивСчетов = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
	
	Если массивСчетов.Количество() = 0 Тогда 
		//Нет соответствия, менять нечего
		СчетДопРасходовПолучаемый = СчетДопРасходовИсходный;	
	Иначе 
		СчетДопРасходовПолучаемый = массивСчетов[0].СчетДопРасходовПолучаемый;	
	КонецЕсли;
	
	Возврат СчетДопРасходовПолучаемый;
	
КонецФункции
// - IvanSidoruk 10.11.2020

// + IvanSidoruk 11.11.2020
Функция ЭтоСчетПринадлежитИдентицифкатору(ТаблицаПоиска, ТекСчет, ТекИдентификатор) Экспорт 
	
	Принадлежит = Ложь;
	Если Не ЗначениеЗаполнено(ТекСчет) Тогда 
		Возврат Принадлежит; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекИдентификатор) Тогда 
		Возврат Принадлежит; 
	КонецЕсли;
	
	СтруктураПоиска =  Новый Структура;
	СтруктураПоиска.Вставить("СчетДопРасходовИсходный",ТекСчет);
	СтруктураПоиска.Вставить("ИдентификаторДопРасходов",ТекИдентификатор);
	
	
	массивСчетов = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
	
	Если массивСчетов.Количество() > 0 Тогда 
		Принадлежит = Истина;
	КонецЕсли;
	
	Возврат Принадлежит;
	
КонецФункции
// - IvanSidoruk 11.11.2020

// + IvanSidoruk 11.11.2020
Функция ПолучитьСчетДопРасходовПоИдентификторуИОсновномуСчету(ТаблицаПоиска, ТекСчет, ТекИдентификатор)  Экспорт 
	
	ТекСчетДопРасходов = ТекСчет;
	Если Не ЗначениеЗаполнено(ТекСчет) Тогда 
		Возврат ТекСчетДопРасходов; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекИдентификатор) Тогда 
		Возврат ТекСчетДопРасходов; 
	КонецЕсли;	
	
	СтруктураПоиска =  Новый Структура;
	СтруктураПоиска.Вставить("СчетИсходный",ТекСчет);
	СтруктураПоиска.Вставить("ИдентификаторДопРасходов",ТекИдентификатор);
	
	массивСчетов = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
	
	Если массивСчетов.Количество() = 0 Тогда 
		//еСЛИ НЕ НАШЛИ эТО МОЖЕТ БЫТЬ 2811,251,261, 2011
		СтруктураПоиска =  Новый Структура;
		
		Если ТекСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТоварыНаСкладе) Тогда 
			ИсходныйСчет = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе;	
		ИначеЕсли ТекСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ГотоваяПродукция)  Тогда 
			ИсходныйСчет = ПланыСчетов.Хозрасчетный.ГотоваяПродукция;	
		ИначеЕсли ТекСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Полуфабрикаты)  Тогда 
			ИсходныйСчет = ПланыСчетов.Хозрасчетный.Полуфабрикаты;	
		ИначеЕсли ТекСчет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.СырьеИМатериалы)  Тогда  
			ИсходныйСчет = ПланыСчетов.Хозрасчетный.СырьеИМатериалы;	
		Иначе 
			ИсходныйСчет = ТекСчет;
		КонецЕсли;
		
		СтруктураПоиска.Вставить("СчетИсходный",ИсходныйСчет);
		СтруктураПоиска.Вставить("ИдентификаторДопРасходов",ТекИдентификатор);
		
		массивСчетов = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
		
		Если массивСчетов.Количество() > 0 Тогда 
			ТекСчетДопРасходов = массивСчетов[0].СчетДопРасходовИсходный;	
		КонецЕсли;
		
		
	Иначе 		 
		ТекСчетДопРасходов = массивСчетов[0].СчетДопРасходовИсходный;
	КонецЕсли;
	
	Возврат ТекСчетДопРасходов;
	
КонецФункции
// - IvanSidoruk 11.11.2020

 // + IvanSidoruk 10.02.2020
Функция ПолучитьМассивСчетовДопРАходовПоИдентификатору(ТаблицаПоиска,ТекИдентификатор)  Экспорт 
	
	
	МассивРез = Новый Массив;
	Если Не ЗначениеЗаполнено(ТекИдентификатор) Тогда 
		Возврат МассивРез; 
	КонецЕсли;	
	
	СтруктураПоиска =  Новый Структура;
	СтруктураПоиска.Вставить("ИдентификаторДопРасходов",ТекИдентификатор);
	
	СкопированнаяТаблица = ТаблицаПоиска.Скопировать(СтруктураПоиска,"СчетДопРасходовПолучаемый");
	СкопированнаяТаблица.свернуть("СчетДопРасходовПолучаемый");
	
	МассивРез = СкопированнаяТаблица.выгрузитьКолонку("СчетДопРасходовПолучаемый");
	
	Возврат МассивРез;
		
КонецФункции
 // - IvanSidoruk 10.02.2020


//+003695 ВБалако 20201120
Функция СимволыПС(Количество) Экспорт //вывод абзацев в СКД (Флайдок)
	Абзац = "";
	Для Счетчик = 1 По Количество Цикл
	     Абзац = Абзац + Символы.ПС;
	КонецЦикла; 
	Возврат Абзац;
КонецФункции

Функция СтрокаПериода(ДатаНачала,ДатаОкончания) Экспорт //вывод ПредставлениеПериода в СКД (Флайдок)
	СтрокаПериода = "";	
	СтрокаПериода = ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), "ФП = Истина; Л =uk");
	Возврат СтрокаПериода;
КонецФункции	
//-003695 ВБалако 20201120

// + IvanSidoruk 11.11.2020
Функция ПолучитьСодержениеПроводоки(ТаблицаПоиска, СчетДопРасходов) Экспорт 
	
	СтруктураПоиска =  Новый Структура;	
	СтруктураПоиска.Вставить("СчетДопРасходовИсходный",СчетДопРасходов);
	
	
	массивСчетов = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
	
	ТекСодержаниеПроводки ="";
	Если массивСчетов.Количество() > 0 Тогда 		
		ТекСодержаниеПроводки = СокрЛП(массивСчетов[0].СодержаниеПроводки);	
	КонецЕсли;
	
	Возврат ТекСодержаниеПроводки;
	
КонецФункции
// - IvanSidoruk 11.11.2020

//+003770 ВБалако 20201127
Функция ЭтоКомплект(ТекЕдиницаИзмерения)  Экспорт 
	
	ЭтоКомплект = Ложь;
	
	Если Не ЗначениеЗаполнено(ТекЕдиницаИзмерения) Тогда 
		Возврат ЭтоКомплект;		
	КонецЕсли;
		
	Если ТипЗнч(ТекЕдиницаИзмерения) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда 
		Возврат ЭтоКомплект;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиницыИзмерения.Вес,
		|	ЕдиницыИзмерения.Объем
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Ссылка = &Ссылка
		|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование",  "%комп%");
	Запрос.УстановитьПараметр("Ссылка",  ТекЕдиницаИзмерения);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ЭтоКомплект = Истина;
	КонецЕсли;	
	
	Возврат ЭтоКомплект;
	
КонецФункции
//-003770 ВБалако 20201127

// + IvanSidoruk 27.01.2021
Процедура ОчиститьПартииПоСсылке(СсылкаНадокумент,ЗадаватьВопросОчистки = Истина) Экспорт 
	
	Если Не ЗначениеЗаполнено(СсылкаНадокумент) Тогда 
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.РегистрацияФиксированнойПартии.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументРеализации.Установить(СсылкаНадокумент);
	Набор.Прочитать();
	
	ЕстьОшибка = Ложь;
	Если Набор.Количество() > 0 Тогда 
		Набор.Очистить();
		
		Попытка
			Набор.Записать(Истина);
		Исключение
			ЕстьОшибка = Истина;
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка очистки партии по документу  "+СсылкаНадокумент+ "! Причина:"+ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
	Если Не ЕстьОшибка Тогда 
		ДанныеУУ = А_ОбщегоНазначения.ПолучитьСвязанныйДокументУУ(СсылкаНадокумент);
		ТекДокУУ = ДанныеУУ.ДокументУУ; 
		//Очистим регистр и по УУ
		Если ЗначениеЗаполнено(ТекДокУУ) Тогда 
			
			Если ДанныеУУ.Заблокирован = Истина Тогда 
				Возврат;
			КонецЕсли;
			
			ОчищатьУУ = Ложь;
			Если ЗадаватьВопросОчистки Тогда 
				#Если Клиент Тогда
					ответ = Вопрос("Очистить партии по УУ "+ТекДокУУ +"?",РежимДиалогаВопрос.ДаНет); 
					ОчищатьУУ = (ответ = КодВозвратаДиалога.Да); 
				#КонецЕсли
			Иначе 
				ОчищатьУУ = Истина;	
			КонецЕсли;
			
			Если НЕ ОчищатьУУ Тогда 
				Возврат
			КонецЕсли;
			
			Набор = РегистрыСведений.РегистрацияФиксированнойПартии.СоздатьНаборЗаписей();
			Набор.Отбор.ДокументРеализации.Установить(ТекДокУУ);
			Набор.Прочитать();
			
			ЕстьОшибка = Ложь;
			Если Набор.Количество() > 0 Тогда 
				Набор.Очистить();
				
				Попытка
					Набор.Записать(Истина);
				Исключение
					ЕстьОшибка = Истина;
					ОбщегоНазначения.СообщитьОбОшибке("Ошибка очистки партии по документу "+ТекДокУУ+ "! Причина:"+ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;	

			Если Не ЕстьОшибка Тогда 
				Если ТекДокУУ.Проведен Тогда 
					ТекОбъектУУ = ТекДокУУ.ПолучитьОбъект();
					Попытка
						ТекОбъектУУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке("Внимание! Документ "+ТекДокУУ + ":Очищены партии, но документ не перепроведен! Причина:"+ОписаниеОшибки() +" "+Символы.ПС +" Перепроведите документ!");
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// - IvanSidoruk 27.01.2021

//+004483 ВБалако 20210320
Функция ПолучитьОбъектИзВнешнейПФ(КодВнешнейПФ) Экспорт  
	
	ОбъектИзВнешнейПФ = Неопределено;
	
	СсылкаНаВПФ = Справочники.ВнешниеОбработки.НайтиПоКоду(КодВнешнейПФ);
	
	Если СсылкаНаВПФ.Пустая() Тогда
		Возврат ОбъектИзВнешнейПФ;
	КонецЕсли;
	
	Попытка
		ИмяВременногоФайла = КаталогВременныхФайлов() + "tmp_vpf.epf"; //для отладки
	Исключение
		Возврат ОбъектИзВнешнейПФ;
	КонецПопытки;    
	
	ДвоичныеДанные = СсылкаНаВПФ.ХранилищеВнешнейОбработки.Получить();        
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ОбъектИзВнешнейПФ = ВнешниеОбработки.Создать(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ОбъектИзВнешнейПФ;
            
КонецФункции 
//-004483 ВБалако 20210320

//+004514 ВБалако 20210324
Процедура ВыгрузкаЭлектронныхДокументовНаFTP() Экспорт
	
	ОбъектИзВнешнейОбработки = ПолучитьОбъектИзВнешнейОбработки("000000069"); //Обработка "СохранениеЭлектронныхДокументовFlydoc"
	
	Если НЕ ОбъектИзВнешнейОбработки = Неопределено Тогда
		ОбъектИзВнешнейОбработки.ЭкспортДокументаСПодписями(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОбъектИзВнешнейОбработки(КодВнешнейПФ) Экспорт  
	
	ОбъектИзВнешнейОбработки = Неопределено;
	
	СсылкаНаВнешнююОбработку = Справочники.ВнешниеОбработки.НайтиПоКоду(КодВнешнейПФ);
	
	Если СсылкаНаВнешнююОбработку.Пустая() Тогда
		Возврат ОбъектИзВнешнейОбработки;
	КонецЕсли;
	
	Попытка
		ИмяВременногоФайла = КаталогВременныхФайлов() + "tmp_vpf.epf"; //для отладки
	Исключение
		Возврат ОбъектИзВнешнейОбработки;
	КонецПопытки;    
	
	ДвоичныеДанные = СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();        
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ОбъектИзВнешнейОбработки = ВнешниеОбработки.Создать(ИмяВременногоФайла,Ложь);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ОбъектИзВнешнейОбработки;
            
КонецФункции
//-004514 ВБалако 20210324

//+005059 ВБалако 20210701
Процедура ЗагрузитьАктуальныйКурсНаТекущуюДату() Экспорт
	
	ИмяСобытия = "Валюты.Загрузка курсов валют";
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , "Начата регламентная задание: ""Загрузка курсов валют"".");
	
	СостояниеЗагрузки = Неопределено;
	ПриЗагрузкеВозниклиОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалют.Валюта КАК Валюта,
	               |	КурсыВалют.Валюта.Код КАК КодВалюты
	               |ИЗ
	               |	РегистрСведений.КурсыВалют КАК КурсыВалют
	               |ГДЕ
	               |	НЕ КурсыВалют.Валюта.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КурсыВалют.Валюта,
	               |	КурсыВалют.Валюта.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокВалют = Новый Массив;
		СписокВалют.Добавить(Выборка);
		
		ЗагрузитьКурсыВалютПоПараметрам(СписокВалют, ТекущаяДата(), ТекущаяДата(), ПриЗагрузкеВозниклиОшибки);
		
	КонецЦикла;
		
	Если ПриЗагрузкеВозниклиОшибки Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , "Во время регламентного задания загрузки курсов валют возникли ошибки.");
	Иначе
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , "Завершена регламентная задание загрузки курсов валют.");
	КонецЕсли;
	
КонецПроцедуры

Функция ЗагрузитьКурсыВалютПоПараметрам(Знач Валюты, Знач НачалоПериодаЗагрузки, Знач ОкончаниеПериодаЗагрузки, ПриЗагрузкеВозниклиОшибки = Ложь) Экспорт
	
	Перем HTTP;
	
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();

	Текст = Новый ТекстовыйДокумент();
	СостояниеЗагрузки = Новый Массив;

	СерверИсточник = "fin.1c.ua";

	Адрес1 = "1c/cb/";  // в интервале
	Адрес2 = "1c/";     // по 1 дате
	
	Если НачалоПериодаЗагрузки = ОкончаниеПериодаЗагрузки Тогда  // по 1 дате
		Адрес = Адрес2;
		ТМП   = "/"+Формат(Год(ОкончаниеПериодаЗагрузки),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(ОкончаниеПериодаЗагрузки),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(ОкончаниеПериодаЗагрузки),"ЧЦ=2;ЧДЦ=0;ЧВН=");
	Иначе    // в интервале
		Адрес = Адрес1;
		ТМП   = "";
	КонецЕсли;

	ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
	СоздатьКаталог(ВремКаталог);
	УдалитьФайлы(ВремКаталог,"*.*");
	ИмяФайла = "Curses.html";
	
	Для Каждого Валюта Из Валюты Цикл
		
		ТекВалюта 		= Валюта.Валюта;
		ТекВалютаКод	= Валюта.КодВалюты;
		Стр = "";
		
		ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
		СтрокаПараметраПолучения = Адрес + Прав(ТекВалютаКод,3) + ТМП + ".tsv";
		
		Если ЗапроситьФайлыССервера(СерверИсточник, СтрокаПараметраПолучения, ИмяВходящегоФайла, HTTP) <> Истина Тогда
			
			ПоясняющееСообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru='Невозможно получить файл данных с курсами валюты (%1 - %2).';uk='Неможливо отримати файл даних з курсами валюти (%1 - %2).'"),
													ТекВалютаКод,
													ТекВалюта) + Символы.ПС;
			СтатусОперации = Ложь;
			ПриЗагрузкеВозниклиОшибки = Истина;
			
		Иначе
			
			ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
			
			Текст.Прочитать(ИмяВходящегоФайла,КодировкаТекста.ANSI);
			
			КолСтрок = Текст.КоличествоСтрок();
			
			Для Инд = 1 По КолСтрок Цикл
				
				Стр = Текст.ПолучитьСтроку(Инд);
				
				Если (Стр = "") ИЛИ (Найти(Стр,Символы.Таб) = 0) Тогда
					Продолжить;
				КонецЕсли;
				
				Если НачалоПериодаЗагрузки = ОкончаниеПериодаЗагрузки Тогда  
					ДатаКурса = ОкончаниеПериодаЗагрузки;
				Иначе 
					ДатаКурсаСтр = ВыделитьПодСтроку(Стр);
					ДатаКурса    = Дата(Лев(ДатаКурсаСтр,4),Сред(ДатаКурсаСтр,5,2),Сред(ДатаКурсаСтр,7,2));
				КонецЕсли;
				
				Кратность = Число(ВыделитьПодСтроку(Стр));
				Курс      = Число(ВыделитьПодСтроку(Стр));
				
				Если ДатаКурса > ОкончаниеПериодаЗагрузки Тогда
					Прервать;
				КонецЕсли;
				
				Если ДатаКурса < НачалоПериодаЗагрузки Тогда 
					Продолжить;
				КонецЕсли;
				
				ЗаписьКурсовВалют.Валюта 	= ТекВалюта;
				ЗаписьКурсовВалют.Период 	= ДатаКурса;
				ЗаписьКурсовВалют.Прочитать();
				ЗаписьКурсовВалют.Валюта		= ТекВалюта;
				ЗаписьКурсовВалют.Период		= ДатаКурса;
				ЗаписьКурсовВалют.Курс			= Курс;
				ЗаписьКурсовВалют.Кратность	= Кратность;
				ЗаписьКурсовВалют.Записать();
				
			КонецЦикла;
			
			ПоясняющееСообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru='Получен курс валюты (%1 - %2).';uk='Отримано курс валюти (%1 - %2).'"),
													ТекВалютаКод,
													ТекВалюта) + Символы.ПС;
			СтатусОперации = Истина;
			ПриЗагрузкеВозниклиОшибки = Ложь;
			
		КонецЕсли; 
		
		СостояниеЗагрузки.Добавить(Новый Структура("Валюта,СтатусОперации,Сообщение", ТекВалюта, СтатусОперации, ПоясняющееСообщение));
		
	КонецЦикла;
	
	УдалитьФайлы(ВремКаталог,"*.*");
	
	Возврат СостояниеЗагрузки;
	
КонецФункции

Функция ЗапроситьФайлыССервера(СерверИсточникПараметр, СтрокаПараметраПолученияПараметр, ИмяВходящегоФайлаПараметр, HTTP = Неопределено)
	
	Если ТипЗнч(HTTP) <> Тип("HTTPСоединение") Тогда
		HTTP = СоздатьСоединение(СерверИсточникПараметр);
	КонецЕсли; 
	
	Попытка
		HTTP.Получить(СтрокаПараметраПолученияПараметр, ИмяВходящегоФайлаПараметр);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ВыделитьПодСтроку(ИсходнаяСтрока)

	Перем ПодСтрока;
	
    Поз = Найти(ИсходнаяСтрока,Символы.Таб);
	Если Поз > 0 Тогда
		ПодСтрока = Лев(ИсходнаяСтрока,Поз-1);
		ИсходнаяСтрока = Сред(ИсходнаяСтрока,Поз+1);
	Иначе
		ПодСтрока = ИсходнаяСтрока;
		ИсходнаяСтрока = "";
	КонецЕсли;
	
	Возврат ПодСтрока;
 
КонецФункции

Функция СоздатьСоединение(СерверИсточник)

	Перем HTTP;
	
	HTTP = Новый HTTPСоединение(СерверИсточник);
	
	Возврат HTTP;
	
КонецФункции
//-005059 ВБалако 20210701

// + IvanSidoruk 19.07.2021
Функция ПолучитьЦенуПрайсаНаСегодня(ДатаСреза, Номенклатура, ХарактеристикаНоменклатуры,Организация)   Экспорт 
	
	пДата  =?(ЗначениеЗаполнено(ДатаСреза), КонецДня(ДатаСреза), КонецДня(ТекущаяДата()));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", пДата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период1", НачалоДня(пДата));
	Запрос.УстановитьПараметр("Период2", КонецДня(пДата));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрайсЛистСрезПоследних.Цена КАк Цена
		|ИЗ
		|	РегистрСведений.ПрайсЛист.СрезПоследних(
		|			&ДатаСреза,
		|			Организация = &Организация
		|				И Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ПрайсЛистСрезПоследних
		|ГДЕ
		|	ПрайсЛистСрезПоследних.Период МЕЖДУ &Период1 И &Период2";
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Цена = 0;
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЕсли;
	
	Возврат Цена;

	
КонецФункции
// - IvanSidoruk 19.07.2021

//+Влад
Функция ПаспортаКачестваДляТТН(СсылкаНаДок) Экспорт
	
	СтрокаВозврата = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрацияФиксированнойПартии.Номенклатура КАК Номенклатура,
		|	РегистрацияФиксированнойПартии.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	РегистрацияФиксированнойПартии.ДокументОприходования КАК ДокументОприходования,
		|	РегистрацияФиксированнойПартии.Количество КАК Количество,
		|	ЕстьNull(АнализыЛаборатории.Ссылка,Значение(Документ.АнализыЛаборатории.ПустаяСсылка)) КАК Паспорт
		|ИЗ
		|	РегистрСведений.РегистрацияФиксированнойПартии.СрезПоследних(, ДокументРеализации = &СсылкаНаОбъект) КАК РегистрацияФиксированнойПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АнализыЛаборатории КАК АнализыЛаборатории
		|		ПО РегистрацияФиксированнойПартии.ДокументОприходования = АнализыЛаборатории.ДокументОснования
		|			И РегистрацияФиксированнойПартии.ХарактеристикаНоменклатуры = АнализыЛаборатории.ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаДок);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы из РезультатЗапроса Цикл
		Если СтрокаТаблицы.Паспорт <> Документы.АнализыЛаборатории.ПустаяСсылка()  Тогда
		СтрокаВозврата = СтрокаВозврата + "№ "+ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаТаблицы.Паспорт)+" від "+ФОрмат(СтрокаТаблицы.Паспорт.Дата,"ДФ=dd.MM.yyyy")+",";	
		КонецЕсли;
	КонецЦикла;
	
	Если Прав(СтрокаВозврата,1) = "," Тогда
		ДлинаСтроки = СтрДлина(СтрокаВозврата);
		СтрокаВозврата = Лев(СтрокаВозврата,ДлинаСтроки-1);
	КонецЕсли;
	
	
	Возврат СтрокаВозврата;
КонецФункции

//+ВЛадЧ
Функция ПолучитьЭтапыСогласованияПользователя(ТекущийПользователь) Экспорт 
	
	СписокЭтапов = Новый Массив;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК ЭтапСогласования
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь.СогласующиеЛица.СогласующееЛицо = &ТекПользователь";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЭтапов.Добавить(Выборка.ЭтапСогласования);
	КонецЦикла;
	
	Возврат СписокЭтапов
	
КонецФункции //

Функция ПолучитьЭтапыМаршрутовВКоторыхУчаствуетПользователь(ЭтапыСогласования,ТекущийПользователь) Экспорт 
	
	СписокЭтапов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласования.Ссылка КАК ЭтапСогласования
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов КАК МаршрутыСогласования
	               |ГДЕ
	               |	МаршрутыСогласования.Ссылка В ИЕРАРХИИ(&ЭтапыСогласования)";
	 
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ЭтапыСогласования", ЭтапыСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЭтапов.Добавить(Выборка.ЭтапСогласования);
	КонецЦикла;
	
	Возврат СписокЭтапов
	
КонецФункции //

Функция ОбработатьСогласованиеЗаказов(Выборка,ТекущийПользователь,НовоеСостояние,ТекущиеСостояние,ЭтапВозврата=Неопределено) Экспорт
	
	//Получим этапы согласования текущего пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК МаршрутСогласования
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователейДляМаршрутаСогласованияЗаявок.СогласующиеЛица КАК ГруппыПользователейДляМаршрутаСогласованияЗаявокСогласующиеЛица
	               |		ПО МаршрутыСогласованияСогласующиеЛица.Пользователь = ГруппыПользователейДляМаршрутаСогласованияЗаявокСогласующиеЛица.Ссылка
	               |ГДЕ
	               |	ГруппыПользователейДляМаршрутаСогласованияЗаявокСогласующиеЛица.СогласующееЛицо = &ТекПользователь";
				   
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	ЭтапыТекущегоПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаршрутСогласования");
	СоответствиеСледующиеЭтапы = Новый Соответствие();
	ЕстьОшибки = Ложь;
	
	Если НЕ ЗначениеЗаполнено(НовоеСостояние)  Тогда
			//ИЛИ (Выборка.ПоследнийСогласующий = ТекущийПользователь
			//	И ТекущиеСостояние = НовоеСостояние) 
				
			Возврат Истина;
		КонецЕсли;
		Отказ = Ложь;
		
	Если НЕ ЗначениеЗаполнено(Выборка.Этап.Родитель) Тогда
		// - ПаламарчукН 16.10.2020
		
			НовыйЭтап = Выборка.Этап;
			
		Иначе
			
			//Определим новый этап - это может быть следующий этап (непосредственный родитель) 
			//	или один из вышестоящих этапов
			НовыйЭтап = Неопределено;
			
			//// + ПаламарчукН 16.10.2020
			Если  не ТекущиеСостояние = Перечисления.СостоянияЗаказов.Подготовлен Тогда 
					ОпределитьСледующийЭтапСогласования(Выборка.Этап,НовыйЭтап, Выборка.Этап.Родитель, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы);
			
					
			Иначе
			//// - ПаламарчукН 16.10.2020

				ОпределитьСледующийЭтапСогласования(Выборка.Этап,НовыйЭтап, Выборка.Этап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы);
				
				Если НовыйЭтап = Неопределено Тогда 
					
					ОпределитьСледующийЭтапСогласованияВторогоУровня(Выборка.Этап,НовыйЭтап, Выборка.Этап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы);
	
				КонецЕсли;
				
			КонецЕсли;
		
			//Если новый этап не удалось определить - сообщим об ошибке
			//	Такой ситуации возникать не должно.
			Если НовыйЭтап = Неопределено Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось определить следующий этап согласования заявки &Заявка.
											|Состояние Заказа изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Заявка", Выборка.Заказ);
				
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,,, Отказ);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НовыйЭтап) Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		
		НовыйУровень = НовыйЭтап.Уровень() + 1;
		
		//Обработаем состояние Отказано
		Если НовоеСостояние = Перечисления.СостоянияЗаказов.Отклонен
			И Выборка.Заказ.Проведен Тогда
			
			Попытка
				//ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
				//ЗаказОбъект.Заблокировать();
				//ЗаказОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось отменить проведение документа &Заявка.
											|Состояние заказа изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Заявка", Выборка.Заказ);
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ,, Отказ);
			КонецПопытки;
		КонецЕсли;
		
				
		Если НовоеСостояние = Перечисления.СостоянияЗаказов.Возвращен Тогда
			НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаказов.СоздатьНаборЗаписей();
			НаборЗаписейСостояниеСогласования.Отбор.Заказ.Установить(Выборка.Заказ);
			НаборЗаписейСостояниеСогласования.Прочитать();
			Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
				
			///Сделаем запись о возвращении этапа
				ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
				НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
				НоваяЗапись.Период       		= ТекущаяДата();
				НоваяЗапись.Активность   	= Истина;
				НоваяЗапись.ЗАказ       		= Выборка.ЗАказ;
				НоваяЗапись.Пользователь = ТекущийПользователь;
				НоваяЗапись.Состояние		= НовоеСостояние;
				НоваяЗапись.Уровень			= НовыйУровень;
				НоваяЗапись.Этап				= НовыйЭтап;
				НаборЗаписейСостояниеСогласования.Записать();
				
				
			///
				ТекущийПользователь = ТекущийПользователь;
				НовоеСостояние = Перечисления.СостоянияЗаказов.Подготовлен;
				НовыйЭтап	= ЭтапВозврата;	
				НовыйУровень =НовыйЭтап.Уровень();
				
			КонецЕсли;
		КонецЕсли;

		
		// Обработаем изменение состояния с Отказано на другое
		Если ТекущиеСостояние = Перечисления.СостоянияЗаказов.Отклонен 
			И НЕ Выборка.Заказ.Проведен Тогда
			
			Попытка
				//ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
				//ЗаказОбъект.Заблокировать();
				//ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Заявка.
											|Состояние заказа изменено не будет'");
											
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Заявка", Выборка.Заказ);
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ,, Отказ);
			КонецПопытки;
		КонецЕсли;
		
		Если Отказ Тогда
			ЕстьОшибки = Истина;
			Возврат ЕстьОшибки;
		КонецЕсли;
		
		//Изменим состояние заявки в регистре
		НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаказов.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.Заказ.Установить(Выборка.Заказ);
		НаборЗаписейСостояниеСогласования.Прочитать();
		
		//Проверим последнюю запись - если она относится к тому же пользователю и этапу, удалим ее
		Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
			ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
			Если ПоследняяЗапись.Пользователь = ТекущийПользователь
				И ПоследняяЗапись.Этап = НовыйЭтап Тогда
				
				НаборЗаписейСостояниеСогласования.Удалить(ПоследняяЗапись);
			КонецЕсли;
		КонецЕсли;

		Если Выборка.Состояние = Перечисления.СостоянияЗаказов.Согласован
			И НовыйУровень = 1 Тогда
			
			НовоеСостояние = Перечисления.СостоянияЗаказов.Утвержден;
		Иначе
			НовоеСостояние = НовоеСостояние;
		КонецЕсли; 
		
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		НоваяЗапись.Период       		= ТекущаяДата()+5;
		НоваяЗапись.Активность   	= Истина;
		НоваяЗапись.ЗАказ       		= Выборка.ЗАказ;
		НоваяЗапись.Пользователь = ТекущийПользователь;
		НоваяЗапись.Состояние		= НовоеСостояние;
		НоваяЗапись.Уровень			= НовыйУровень;
		НоваяЗапись.Этап				= НовыйЭтап;
		
		НаборЗаписейСостояниеСогласования.Записать();
		
		//УспешноОбработанныеЗаявки.Добавить(СтрокаТабличнойЧасти);
		
		// NVV ++ Отправим на e-mail сообщение о Заявке инициатору
		//Если НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден Тогда 
		//	ОбщегоНазначенияДоработка.ДобавитьЗаписьДокументыОперативныйДляИнформирования(СтрокаТабличнойЧасти.Заявка, Перечисления.ВидыИнформированияПоДокументам.EMail);
		//КонецЕсли;
		// NVV --

	
	
	// Удалим из списка заявки по которым удалось изменить состояние
	//Для каждого ЭлКоллекции Из УспешноОбработанныеЗаявки Цикл
	//	ЗаявкиНаРасходованиеСредств.Удалить(ЭлКоллекции);
	//КонецЦикла; 
	
	Возврат НЕ ЕстьОшибки;

	
	
	
КонецФункции

Процедура ОпределитьСледующийЭтапСогласования(ПервыйЭтап , НовыйЭтап, ТекущийЭтап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
	
	НовыйЭтап = СоответствиеСледующиеЭтапы.Получить(ТекущийЭтап);
	
	Если НовыйЭтап = Неопределено Тогда
		//++ Яковлев Р.А. 05.08.2021
		Если (ЭтапыТекущегоПользователя.Найти(ТекущийЭтап)<>Неопределено )   Тогда
			
			НовыйЭтап = ТекущийЭтап;
			СоответствиеСледующиеЭтапы.Вставить(ТекущийЭтап, НовыйЭтап);
			
		КонецЕсли;
		//-- Яковлев Р.А. 05.08.2021
		
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьСледующийЭтапСогласованияВторогоУровня(ПервыйЭтап , НовыйЭтап, ТекущийЭтап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
	
	НовыйЭтап = СоответствиеСледующиеЭтапы.Получить(ТекущийЭтап);
	
	Если НовыйЭтап = Неопределено Тогда
		//++ Яковлев Р.А. 05.08.2021
		Если ЭтапыТекущегоПользователя.Найти(ТекущийЭтап)<>Неопределено   Тогда
			
			НовыйЭтап = ТекущийЭтап;
			СоответствиеСледующиеЭтапы.Вставить(ТекущийЭтап, НовыйЭтап);
			
		ИначеЕсли ЗначениеЗаполнено(ТекущийЭтап.Родитель) Тогда
			ОпределитьСледующийЭтапСогласования(ПервыйЭтап ,НовыйЭтап, ТекущийЭтап.Родитель, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
		КонецЕсли;
		//-- Яковлев Р.А. 05.08.2021
		
	
	КонецЕсли;
	
КонецПроцедуры

Функция РазрешеноИзменениеЗаявки(ДокументСсылка, ТекстСообщенияПользователю = "") Экспорт
	//Если НЕ Константы.ИспользоватьВизированиеЗаказов.Получить()  ИЛИ РольДоступна("ПолныеПрава") Тогда
	//	Возврат Истина;
	//КонецЕсли;
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	//Получим маршруты согласования, в которых текущий пользователь назначен основным
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК МаршрутСогласования
	               |ПОМЕСТИТЬ МаршрутыТекущегоПользователя
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка
	               |ИЗ
	               |	Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователейДляМаршрутаСогласованияЗаявок.СогласующиеЛица КАК ГруппыПользователейДляМаршрутаСогласованияЗаявокСогласующиеЛица
	               |		ПО МаршрутыСогласованияСогласующиеЛица.Пользователь = ГруппыПользователейДляМаршрутаСогласованияЗаявокСогласующиеЛица.Ссылка
	               |ГДЕ
	               |	ГруппыПользователейДляМаршрутаСогласованияЗаявокСогласующиеЛица.СогласующееЛицо = &ТекПользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СостоянияСогласования.Состояние,
	               |	СостоянияСогласования.Этап,
	               |	СостоянияСогласования.Пользователь,
	               |	СостоянияСогласования.Уровень,
	               |	ЕСТЬNULL(СогласующиеЛица.Пользователь, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК СледующийСогласующий,
	               |	ВЫБОР
	               |		КОГДА СостоянияСогласования.Этап В ИЕРАРХИИ
	               |					(ВЫБРАТЬ
	               |						МаршрутыТекущегоПользователя.МаршрутСогласования
	               |					ИЗ
	               |						МаршрутыТекущегоПользователя)
	               |				И НЕ СостоянияСогласования.Этап В
	               |						(ВЫБРАТЬ
	               |							МаршрутыТекущегоПользователя.МаршрутСогласования
	               |						ИЗ
	               |							МаршрутыТекущегоПользователя)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НижестоящийЭтапСогласования,
	               |	ЕСТЬNULL(СогласующиеЛица.Ссылка, ЗНАЧЕНИЕ(Справочник.МаршрутыСогласованияЗаказов.ПустаяСсылка)) КАК СледующийЭтап,
	               |	ЕСТЬNULL(СогласующиеЛица.МожетРедактироватьЗаказ, ЛОЖЬ) КАК МожетРедактироватьЗаказ
	               |ИЗ
	               |	РегистрСведений.СостоянияСогласованияЗаказов.СрезПоследних(, Заказ = &ТекущийЗаказ) КАК СостоянияСогласования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МаршрутыСогласованияЗаказовСогласующиеЛица.Ссылка КАК Ссылка,
	               |			МаршрутыСогласованияЗаказовСогласующиеЛица.НомерСтроки КАК НомерСтроки,
	               |			МаршрутыСогласованияЗаказовСогласующиеЛица.Пользователь КАК Пользователь,
	               |			МаршрутыСогласованияЗаказовСогласующиеЛица.Ссылка.МожетРедактироватьЗаказ КАК МожетРедактироватьЗаказ
	               |		ИЗ
	               |			Справочник.МаршрутыСогласованияЗаказов.СогласующиеЛица КАК МаршрутыСогласованияЗаказовСогласующиеЛица
	               |		ГДЕ
	               |			МаршрутыСогласованияЗаказовСогласующиеЛица.Пользователь = &ТекПользователь) КАК СогласующиеЛица
	               |		ПО (ВЫБОР
	               |				КОГДА СостоянияСогласования.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказов.Подготовлен)
	               |					ТОГДА СогласующиеЛица.Ссылка = СостоянияСогласования.Этап
	               |				КОГДА СостоянияСогласования.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказов.Утвержден)
	               |					ТОГДА СогласующиеЛица.Ссылка = СостоянияСогласования.Этап
	               |				ИНАЧЕ СогласующиеЛица.Ссылка = СостоянияСогласования.Этап.Родитель
	               |			КОНЕЦ)";
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущийЗаказ", ДокументСсылка);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапросов[1].Выбрать();
	//Маршрут согласования заявки не определен
	Если НЕ Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
		
	Если  (Выборка.МожетРедактироватьЗаказ ИЛИ ТипЗнч(ДокументСсылка)= Тип("ДокументСсылка.ЗаявкаНаПроизводство"))  И (Выборка.Пользователь = ТекущийПользователь Или Выборка.СледующийСогласующий = ТекущийПользователь) Тогда
		Возврат Истина;
	КонецЕсли;
	//Заявка еще не начала проходить по маршруту согласования
	Если НЕ ЗначениеЗаполнено(Выборка.Состояние)  Тогда
		Возврат Истина;
	//Заявка уже согласована к оплате
	ИначеЕсли Выборка.Состояние = Перечисления.СостоянияЗаказов.Утвержден Тогда
		ТекстСообщенияПользователю = НСтр("ru = 'Утвержденный заказ не может быть изменена.'");
		Возврат Ложь;
	Иначе
		//Заявка проходит по маршруту согласования. 
		//	Возможность изменения зависит от пользователя, который пытается изменить заявку
		//Заявка в процессе согласования у текущего пользователя (в состоянии Отложен или Отклонен)
		Если ТипЗнч(ДокументСсылка)= Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Если Выборка.МожетРедактироватьЗаказ Тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		// NVV ++ Добавим спр. группы пользователей
		ПользовательЭтапаСогласования = Выборка.Пользователь;
		Если ТипЗнч(ПользовательЭтапаСогласования) = Тип("СправочникСсылка.ГруппыПользователейДляМаршрутаСогласованияЗаявок") Тогда 
			Строки = ПользовательЭтапаСогласования.СогласующиеЛица.НайтиСтроки(Новый Структура("СогласующееЛицо", ТекущийПользователь));
			Если Строки.Количество() <> 0 Тогда
				ПользовательЭтапаСогласования = Строки[0].СогласующееЛицо;
			Иначе
				ПользовательЭтапаСогласования = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;	
		
		СледующийСогласующийЭтапаСогласования = Выборка.СледующийСогласующий;
		Если ТипЗнч(СледующийСогласующийЭтапаСогласования) = Тип("СправочникСсылка.ГруппыПользователейДляМаршрутаСогласованияЗаявок") Тогда 
			Строки = СледующийСогласующийЭтапаСогласования.СогласующиеЛица.НайтиСтроки(Новый Структура("СогласующееЛицо", ТекущийПользователь));
			Если Строки.Количество() <> 0 Тогда
				СледующийСогласующийЭтапаСогласования = Строки[0].СогласующееЛицо;
			Иначе
				СледующийСогласующийЭтапаСогласования = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
		
		Если ПользовательЭтапаСогласования = ТекущийПользователь И 
			(Выборка.Состояние = Перечисления.СостоянияЗаказов.Отклонен ИЛИ
			Выборка.Состояние = Перечисления.СостоянияЗаказов.Отложен) Тогда
			Возврат Истина;
		//Заявка перешла на согласование текущему пользователю
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияЗаказов.Согласован И 
			(СледующийСогласующийЭтапаСогласования = ТекущийПользователь) Тогда
			Возврат Истина;
		//Заявка находится на согласовании у "нижестоящих" этапов согласования
		//ИначеЕсли Выборка.НижестоящийЭтапСогласования Тогда
		//	Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	ТекстСообщенияПользователю = НСтр("ru = 'Заказ в процессе согласования, не может быть изменена.'");
	Возврат Ложь;
КонецФункции

Функция ПолучитьНачалоМаршрута(Тип,Налив=Ложь) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиНачалоМаршрутовЗаказов.Маршрут
		|ИЗ
		|	РегистрСведений.НастройкиНачалоМаршрутовЗаказов КАК НастройкиНачалоМаршрутовЗаказов
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(НастройкиНачалоМаршрутовЗаказов.ТипДокумента) = &ТипДокумента И Налив = &Налив";
	
	Запрос.УстановитьПараметр("ТипДокумента", Тип);
	Запрос.УстановитьПараметр("Налив", Налив);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Маршрут; 
	КонецЕсли;
	
	Возврат Справочники.МаршрутыСогласованияЗаказов.ПустаяСсылка();

	
КонецФункции

Функция ПолучитьОстаткиПоСкладам(Дата, ТаблицаПоТоварам,Склад,Организация) Экспорт
	
	фТаблицаПоТоварам = ТаблицаПоТоварам.Скопировать(, "Номенклатура, ХарактеристикаНоменклатуры");



	фТаблицаПоТоварам.Свернуть("Номенклатура");
	СписокТоваров = Новый СписокЗначений;
	СписокТоваров.ЗагрузитьЗначения(фТаблицаПоТоварам.ВыгрузитьКолонку("Номенклатура"));

	
	СписокСкладов = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Склад) Тогда
		Если ТипЗнч(Склад) = Тип("СправочникСсылка.ГруппыДоступностиСкладов")  Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СоставГруппДоступностиСкладов.Склад
			|ИЗ
			|	РегистрСведений.СоставГруппДоступностиСкладов КАК СоставГруппДоступностиСкладов
			|ГДЕ
			|	СоставГруппДоступностиСкладов.ГруппаДоступности = &ГруппаДоступности";
			
			Запрос.УстановитьПараметр("ГруппаДоступности", Склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СписокСкладов.Добавить(ВыборкаДетальныеЗаписи.Склад)
			КонецЦикла;
			
			
		Иначе
			СписокСкладов.Добавить(Склад);	
		КонецЕсли;
	КонецЕсли;
	
	
	
	
		СчетУчета = РазработкаСервер.ПолучитьСчетаУчетаНСП();
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментКон", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	//Подразделения = Новый Массив;
	//Если НЕ Подразделение.Пустая() Тогда
	//	Подразделения.Добавить(Подразделение);
	//	Подразделения.Добавить(Подразделение.Родитель);
	//КонецЕсли; 
	//ЗапросПоМатериалам.УстановитьПараметр("Подразделения", Подразделения);	
	//ЗапросПоМатериалам.УстановитьПараметр("Подразделение", Подразделение);	
	Запрос.УстановитьПараметр("Номенклатура",  СписокТоваров);
	Запрос.УстановитьПараметр("Счет", СчетУчета);
	Запрос.УстановитьПараметр("Склад", СписокСкладов);
		
	
	
	   
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК СчетУчета,
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки.Субконто1.ЕдиницаХраненияОстатков КАК Ед,
	|	ХозрасчетныйОстатки.Субконто3 КАК Склад,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Субконто4.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&МоментКон,
	|			(Счет В(&Счет))
	|				И НЕ Счет.Забалансовый,
	|			,
	|			Организация = &Организация
	|				И Субконто3 В (&Склад)
	|				И Субконто1 В (&Номенклатура)) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Склад КАК Склад,
	|	Остатки.Номенклатура,
	|	Остатки.Ед КАК Ед,
	|	Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	Остатки КАК Остатки";
	
	
	Результат = Запрос.Выполнить();
	
	
	ТабОстатки = Результат.Выгрузить();
	Возврат ТабОстатки;
	
КонецФункции

//+ВладЧ
функция ЕстьНалоговаяПоРТУ(Док) Экспорт
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговаяНакладная.ДокументОснование
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Проведен = ИСТИНА
		|	И НалоговаяНакладная.ПометкаУдаления = ЛОЖЬ
		|	И НалоговаяНакладная.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Док);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ЛОжь;
	
	
КонецФункции
//-ВладЧ


//+ВладЧ 09.12.2021
// Смотрит значение Списка. Если хоть одно истина возвращает ИСТИну
функция ЗначениеИзСписка(Список) Экспорт
	Значение = Ложь;
	Если Список.НайтиПоЗначению(Истина)<> Неопределено Тогда
		Значение = Истина;
	КонецЕсли;
	
	Возврат Значение
	
	
КонецФункции
//-ВладЧ 09.12.2021

//+ВладЧ 13.12.2021
Процедура ОткрытьФормуВыбораНоменклатурыСОтбором (ПолеВвода,ТоргМарка,ГруппаПродукции)   Экспорт
	
			
		
		ФормаВыбора = Справочники.Номенклатура.ПолучитьФормуВыбора(,ПолеВвода,);
		Если ЗначениеЗаполнено(ТоргМарка) Тогда
			ФормаВыбора.Отбор.ТорговаяМаркиНоменклатуры.Установить(ТоргМарка,Истина);
		Иначе 
			ФормаВыбора.Отбор.ТорговаяМаркиНоменклатуры.Установить(,Ложь);
		КонецЕсли;
		Если ЗначениеЗаполнено(ГруппаПродукции) Тогда
			ФормаВыбора.Отбор.ГруппаПродукцииЗаПредназначением.Установить(ГруппаПродукции,Истина);
		Иначе 
			ФормаВыбора.Отбор.ГруппаПродукцииЗаПредназначением.Установить(,Ложь);
		КонецЕсли;

		ФормаВыбора.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
		ФормаВыбора.Открыть();
		
	

	
КонецПроцедуры
//-ВладЧ 13.12.2021

//+ВладЧ 30.12.2021
Процедура ОткрытьОтчетПоДвижениюТоваров() Экспорт
	Разработка.ОткрытьВнешнююОбработкуОтчет(Справочники.ВнешниеОбработки.НайтиПоКоду("000000156"));
КонецПроцедуры


//+ВладЧ 30.12.2021
Процедура ОткрытьОтчетПоЗаказамПокупателя() Экспорт
	Разработка.ОткрытьВнешнююОбработкуОтчет(Справочники.ВнешниеОбработки.НайтиПоКоду("000000160"));
КонецПроцедуры


//+ВладЧ 03.02.2021
Функция МожноСоздаватьРТУ(Заказ) Экспорт
	
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияСогласованияЗаказовСрезПоследних.Заказ,
		|	СостоянияСогласованияЗаказовСрезПоследних.Пользователь,
		|	СостоянияСогласованияЗаказовСрезПоследних.Состояние,
		|	СостоянияСогласованияЗаказовСрезПоследних.Уровень,
		|	СостоянияСогласованияЗаказовСрезПоследних.Этап
		|ИЗ
		|	РегистрСведений.СостоянияСогласованияЗаказов.СрезПоследних(, Заказ = &Заказ) КАК СостоянияСогласованияЗаказовСрезПоследних";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если Не ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияЗаказов.Утвержден Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Истина
	
КонецФункции
//-ВладЧ 03.02.2021

//-Владч 30.12.2021

//+005838 BalakoD 20220103
Процедура ЗаполнитьТаблицуОтсканированыхТоваров(ДокументСсылка,ТаблицаОтсканировано) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновнойДокумент",ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	vrgСоответствияМобильныхДокументов.МобильныйДокумент
	|ИЗ
	|	РегистрСведений.vrgСоответствияМобильныхДокументов КАК vrgСоответствияМобильныхДокументов
	|ГДЕ
	|	vrgСоответствияМобильныхДокументов.ОсновнойДокумент = &ОсновнойДокумент
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	Если Выборка.Следующий() Тогда
		
		МобильныйИнвентаризацияСсылка = Выборка.МобильныйДокумент;
		ТаблицаТовары = МобильныйИнвентаризацияСсылка.Товары.Выгрузить();
		
		//КолонкиТаблицы = ТаблицаТовары.Колонки;
		//
		//Для Каждого КолонкаТаблицы из КолонкиТаблицы Цикл
		//	Если КолонкаТаблицы.Имя = "КоличествоУчет" Тогда
		//		Продолжить;
		//	КонецЕсли;	
		//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(КолонкаТаблицы.Имя,КолонкаТаблицы.ТипЗначения,"ТаблицаОтсканировано",КолонкаТаблицы.Заголовок));
		//КонецЦикла;	
		//
		//ТаблицаОтсканировано.Колонки.Добавить(КолонкаТаблицы.Имя,,КолонкаТаблицы.Заголовок);
		
		Для Каждого СтрокаТовары из ТаблицаТовары Цикл
			НоваяСтрокаТаблицыОтсканировано = ТаблицаОтсканировано.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыОтсканировано,СтрокаТовары);
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьТаблицуОтсканированыхТоваров(ДокументСсылка,ТаблицаОтсканировано) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновнойДокумент",ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	vrgСоответствияМобильныхДокументов.МобильныйДокумент
	|ИЗ
	|	РегистрСведений.vrgСоответствияМобильныхДокументов КАК vrgСоответствияМобильныхДокументов
	|ГДЕ
	|	vrgСоответствияМобильныхДокументов.ОсновнойДокумент = &ОсновнойДокумент
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МобильныйИнвентаризацияСсылка = Выборка.МобильныйДокумент;
		ТаблицаТовары = МобильныйИнвентаризацияСсылка.Товары.Выгрузить();
		
		ТаблицаОтсканировано.Очистить();	
		
		Для Каждого СтрокаТовары из ТаблицаТовары Цикл
			НоваяСтрокаТаблицыОтсканировано = ТаблицаОтсканировано.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыОтсканировано,СтрокаТовары);
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры 	
//-005838 BalakoD 20220103

Функция ПолучитьДатуВРодительномПадеже(Дата) Экспорт
//Дандали В. 04.07.2025 +

    // Родительный падеж на украинском
    Месяцы = Новый Массив;
    Месяцы.Добавить("січня");
    Месяцы.Добавить("лютого");
    Месяцы.Добавить("березня");
    Месяцы.Добавить("квітня");
    Месяцы.Добавить("травня");
    Месяцы.Добавить("червня");
    Месяцы.Добавить("липня");
    Месяцы.Добавить("серпня");
    Месяцы.Добавить("вересня");
    Месяцы.Добавить("жовтня");
    Месяцы.Добавить("листопада");
    Месяцы.Добавить("грудня");

    День = Формат(Дата, "ДФ=дд"); // например 04
    Месяц = Месяцы[Месяц(Дата) - 1];
    Год = Формат(Дата, "ДФ=гггг");

    Возврат """"+День+"""" + " " + Месяц;
//Дандали В. 04.07.2025 -
КонецФункции



