
Функция ПолучитьСтруктуруПодключенияAPI(НаименованиеAPI) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияКAPI.Наименование,
		|	НастройкиПодключенияКAPI.Логин,
		|	НастройкиПодключенияКAPI.Пароль,
		|	НастройкиПодключенияКAPI.Адрес,
		|	НастройкиПодключенияКAPI.Ссылка
		|ИЗ
		|	Справочник.НастройкиПодключенияКAPI КАК НастройкиПодключенияКAPI
		|ГДЕ
		|	НЕ НастройкиПодключенияКAPI.ПометкаУдаления
		|	И НастройкиПодключенияКAPI.Наименование = &НаименованиеAPI";
	
	Запрос.УстановитьПараметр("НаименованиеAPI", НаименованиеAPI);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметров.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		СтруктураПараметров.Вставить("Логин", ВыборкаДетальныеЗаписи.Логин);
		СтруктураПараметров.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
		СтруктураПараметров.Вставить("Адрес", ВыборкаДетальныеЗаписи.Адрес);
		
	КонецЦикла;
	
	СтруктураПараметров.Вставить("ДопСвойства", ВыборкаДетальныеЗаписи.Ссылка.ДопСвойства.Выгрузить());
	
	Возврат СтруктураПараметров;
	
КонецФункции

