// Обработчик события ПередЗаписью .
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка 
	   И ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если Владелец.ЕдиницаХраненияОстатков = Ссылка Тогда

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийЭлемент", ЭтотОбъект.Ссылка);

			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕдиницыИзмерения.Ссылка КАК Элемент,
			|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент
			|ИЗ
			|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
			|
			|ГДЕ
			|	ЕдиницыИзмерения.Ссылка = &ТекущийЭлемент";

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Если Выборка.Коэффициент <> Коэффициент Тогда
					Если ПолныеПрава.Номенклатура_СуществуютСсылки(Владелец, Неопределено) Тогда
						ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Единица ""';uk='Одиниця ""'") + СокрЛП(Наименование) + НСтр("ru='"" является единицей хранения остатков для ""';uk='"" є одиницею зберігання залишків для ""'") + 
						                 СокрЛП(Владелец) + НСтр("ru='"" и уже участвует в товародвижении. Изменить коэффициент уже нельзя!';uk='"" і вже бере участь у товародвижении. Змінити коефіцієнт вже не можна!'"), Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	Если Не ОбменДанными.Загрузка 
	   И Не Отказ 
	   И Коэффициент = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Для ';uk='Для '")+СокрЛП(Владелец)+НСтр("ru=' у единицы измерения ';uk=' у одиниці виміру '")+СокрЛП(Ссылка)+НСтр("ru=' не задан коэффициент! Он будет установлен равным 1.';uk=' не заданий коефіцієнт! Він буде встановлений рівним 1.'"));
		Коэффициент = 1;
	КонецЕсли;
	
	//Дандали В. 12.06.2025 +
	Если Коэффициент = 0 Тогда
		Коэффициент	= 1;	
	КонецЕсли;
	//Дандали В. 12.06.2025 -

КонецПроцедуры // ПередЗаписью()
