
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    НаборЗаписей = РегистрыСведений.ЦеныНаТопливоПоМаршрутнымЛистам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Для Каждого стр Из Данные Цикл
	    Запись = НаборЗаписей.Добавить();
	    Запись.Период 		= ПериодРегистрации;
	    Запись.Автомобиль	= стр.Автомобиль;
	    Запись.МаркаТоплива = стр.МаркаТоплива;
	    Запись.Цена 		= стр.ЦенаЗаЛитр;
	КонецЦикла;
    НаборЗаписей.Записать();	
	
	НаборЗаписей = РегистрыНакопления.РасчетыПоМаршрутнымЛистам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	   
	Для Каждого стр Из Данные Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Активность   			= Истина;
		Запись.Регистратор  			= Ссылка;
		Запись.Период       			= ПериодРегистрации;
		Запись.Автомобиль    			= стр.Автомобиль;
		Запись.Выплата			  		= стр.Выплата;
		Запись.СуммаЗаТопливо  			= стр.СуммаЗаТопливо;
		Запись.СтоимостьАренды  		= стр.СтоимостьАренды;
		Запись.Удержание  				= стр.Удержание;
		Запись.УдержаниеДополнительное  = стр.УдержаниеДополнительное;
		Запись.КилометражУтвержденный  	= стр.КилометражУтвержденный;
		Запись.РасходТопливаЛитров  	= стр.РасходТопливаЛитров;
		НаборЗаписей.Записать();	
	КонецЦикла;
	
КонецПроцедуры
