Процедура АвтозаполнениеПоШтатномуРасписанию(Организация, ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ШтатноеРасписаниеОрганизаций.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаАктуальности, ПодразделениеОрганизации.Владелец = &Организация ) КАК ШтатноеРасписаниеОрганизаций
		|ГДЕ
		|	ШтатноеРасписаниеОрганизаций.КоличествоСтавок > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизации.Наименование,
		|	Должность.Наименование";
		
	ШтатныеЕдиницы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура АвтозаполнениеПоШтатнойРасстановке(Организация, ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизаций.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &Организация ) КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизации.Наименование,
		|	Должность.Наименование";
		
	ШтатныеЕдиницы.Загрузить(Запрос.Выполнить().Выгрузить()); 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "ШтатныеЕдиницы" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса. В запросе данные документа дополняются значениями
//  проверяемых параметров из связанного с
//
Функция СформироватьЗапросПоШтатныеЕдиницы(Режим)

	Запрос = Новый Запрос;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.ДатаИзменения,
	|	Док.ПодразделениеОрганизации,
	|	Док.Должность,
	|	ВЫБОР
	|	 КОГДА ПараметрыРасчетаИндексации.Период Есть NULL ТОГДА ЛОЖЬ
	|	 ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаДублирование,
	|	Док.НомерСтроки		КАК НомерСтроки
	|ИЗ
	|   Документ.ИзменениеПараметровРасчетаИндексацииПоДолжностям.ШтатныеЕдиницы КАК Док
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   РегистрСведений.КоэффициентыПовышенияОкладов КАК ПараметрыРасчетаИндексации
	|   ПО Док.ПодразделениеОрганизации = ПараметрыРасчетаИндексации.ПодразделениеОрганизации
	|    И Док.Должность = ПараметрыРасчетаИндексации.Должность
	|    И ПараметрыРасчетаИндексации.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|    И Док.ДатаИзменения = ПараметрыРасчетаИндексации.Период
	|    И ПараметрыРасчетаИндексации.Регистратор <> &ДокументСсылка
	|ГДЕ
	|	Док.Ссылка  =  &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();


КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не указана организация, в которой работает работник!';uk='Не зазначена організація, у якій працює працівник!'"), Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ШтатныеЕдиницы" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиШтатныеЕдиницы(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табл. части ""Штатные единицы"": ';uk='У рядку номер ""%1"" табл. частини ""Штатні одиниці"": '"), СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));
	
	// ПодразделениеОрганизации
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбрано подразделение!';uk='не обраний підрозділ!'"), Отказ);
	КонецЕсли;
	
	// Должность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана должность!';uk='не зазначена посада!'"), Отказ);
	КонецЕсли;
	
	// ДатаИзменения
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаИзменения) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата изменения!';uk='не зазначена дата зміни!'"), Отказ);
	КонецЕсли;
	
	//Ошибка дублирования
	Если ВыборкаПоСтрокамДокумента.ОшибкаДублирование Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='уже зарегистрировано изменение параметров индексации другим документом!';uk='!'"), Отказ);
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаСтрокамДокументам, 
		  СтруктураПроведенияПоРегистрамСведений, СтруктураПараметров = "")

	Движение = Движения.КоэффициентыПовышенияОкладов.Добавить();
			
	Движение.Организация  	= ВыборкаПоШапкеДокумента.Организация;
	Движение.Период       	= ВыборкаСтрокамДокументам.ДатаИзменения;
	Движение.ПодразделениеОрганизации		= ВыборкаСтрокамДокументам.ПодразделениеОрганизации;
	Движение.Должность		= ВыборкаСтрокамДокументам.Должность;;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// получим реквизиты табличной части
			РезультатЗапросаПоШтатныеЕдиницы = СформироватьЗапросПоШтатныеЕдиницы(Режим);
			ВыборкаПоШтатныеЕдиницы = РезультатЗапросаПоШтатныеЕдиницы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаПоШтатныеЕдиницы.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиШтатныеЕдиницы(ВыборкаПоШапкеДокумента, ВыборкаПоШтатныеЕдиницы, Отказ);

				Если НЕ Отказ Тогда

					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоШтатныеЕдиницы, СтруктураПроведенияПоРегистрамСведений);
					
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|  РаботникиОрганизаций.Период		КАК ДатаИзменения,
		|  РаботникиОрганизаций.ПодразделениеОрганизации		КАК ПодразделениеОрганизации,
		|  РаботникиОрганизаций.Должность	КАК Должность
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ	РаботникиОрганизаций.Регистратор = &парамРегистратор
		|	И	РаботникиОрганизаций.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|";
		Запрос.УстановитьПараметр("парамРегистратор", Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДокументОснование = Основание;
		Организация = ДокументОснование.Организация; 
		
		Пока Выборка.Следующий() Цикл
			СтрокаШтатныеЕдиницы = ШтатныеЕдиницы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШтатныеЕдиницы, Выборка);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеШтатногоРасписанияОрганизаций") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|  ШтатноеРасписаниеОрганизаций.Период		КАК ДатаИзменения,
		|  ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации		КАК ПодразделениеОрганизации,
		|  ШтатноеРасписаниеОрганизаций.Должность	КАК Должность
		|ИЗ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
		|ГДЕ	ШтатноеРасписаниеОрганизаций.Регистратор = &парамРегистратор
		|	И	ШтатноеРасписаниеОрганизаций.КоличествоСтавок > 0
		|";
		Запрос.УстановитьПараметр("парамРегистратор", Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДокументОснование = Основание;
		
		Организация = ДокументОснование.Организация; 
		
		Пока Выборка.Следующий() Цикл
			СтрокаШтатныеЕдиницы = ШтатныеЕдиницы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШтатныеЕдиницы, Выборка);
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВводСведенийОПлановыхНачисленияхУдержаниях") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|  Начисления.Период		КАК ДатаИзменения,
		|  Начисления.Сотрудник		КАК Сотрудник
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
		|ГДЕ Начисления.Регистратор = &парамРегистратор
		|  И Начисления.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|  И Начисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийРаботникаОрганизации.Основное)
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   Начисления.Сотрудник,
		|   Начисления.ДатаИзменения,
		|   МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
		|ПОМЕСТИТЬ ВТПериодыРаботникиОрганизаций	
		|ИЗ ВТНачисления Как Начисления
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций Как РаботникиОрганизаций
		|	ПО Начисления.Сотрудник = РаботникиОрганизаций.Сотрудник
		|    И Начисления.ДатаИзменения >= РаботникиОрганизаций.Период
		|
		|СГРУППИРОВАТЬ ПО 
		|	Начисления.Сотрудник,
		|	Начисления.ДатаИзменения
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   Начисления.ДатаИзменения,
		|   РаботникиОрганизаций.Должность,
		|   РаботникиОрганизаций.ПодразделениеОрганизации
		|ИЗ ВТНачисления Как Начисления
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботникиОрганизаций Как ПериодыРаботникиОрганизаций
		|	ПО Начисления.Сотрудник = ПериодыРаботникиОрганизаций.Сотрудник 
		|    И Начисления.ДатаИзменения = ПериодыРаботникиОрганизаций.ДатаИзменения
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций Как РаботникиОрганизаций
		|	ПО Начисления.Сотрудник = РаботникиОрганизаций.Сотрудник
		|    И ПериодыРаботникиОрганизаций.Период = РаботникиОрганизаций.Период
		|";
		Запрос.УстановитьПараметр("парамРегистратор", Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДокументОснование = Основание;
		Организация = ДокументОснование.Организация; 
		
		Пока Выборка.Следующий() Цикл
			СтрокаШтатныеЕдиницы = ШтатныеЕдиницы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШтатныеЕдиницы, Выборка);
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;

КонецПроцедуры


