
#Область РабочееМестоЗакупщика

//Процедура записывает товары из заказа в регистр сведений рабочее место закупщика
Процедура ЗаписатьВРабочееМестоЗакупщика(Заказ) Экспорт 
	
	
	НабЗап = РегистрыСведений.РабочееМестоЗакупщика.СоздатьНаборЗаписей();
	НабЗап.Отбор.ЗаказПокупателя.Установить(Заказ);
	НабЗап.Прочитать();
	
	СтатусОбщий = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе;
	Для Каждого Строка из НабЗап Цикл 
		
		Если не Строка.Статус = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе Тогда 
			СтатусОбщий = Строка.Статус; 
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтатусОбщий = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе Тогда 
		НабЗап.Очистить();
		НабЗап.Записать();
	КонецЕсли;
	
	//Дандали В. 28.05.2025 +
	Если Заказ.СтатусИМ = Перечисления.СтатусыЗаказаИМ.Отклонено 
		И СтатусОбщий = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе Тогда
		НабЗап.Очистить();
		НабЗап.Записать();
		Возврат;
	КонецЕсли;
	//Дандали В. 28.05.2025 -
	
	
	Товары = Заказ.Товары.Выгрузить();
	//Дандали В. 30.06.2025 +
	//заккоментировал т.к. кейс когда 1 товар заказывается у разных поставщиков. делается разбивка в заказе покупателя
	//Товары.Свернуть("Номенклатура,Цена","Количество");
	//Дандали В. 30.06.2025 -
	
	Для Каждого стрТовар из Товары Цикл
		
		НабЗап = РегистрыСведений.РабочееМестоЗакупщика.СоздатьНаборЗаписей();
		НабЗап.Отбор.Номенклатура.Установить(стрТовар.Номенклатура);
		НабЗап.Отбор.ЗаказПокупателя.Установить(Заказ);
		НабЗап.Отбор.Ответственный.Установить(Заказ.Ответственный);
		НабЗап.Отбор.УникальныйИдентификаторСтроки.Установить(стрТовар.УникальныйИдентификаторСтроки);
		НабЗап.Прочитать();
		Если НабЗап.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		МенЗап 					= РегистрыСведений.РабочееМестоЗакупщика.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенЗап, стрТовар);
		МенЗап.ДатаОтгрузки		= ?(ЗначениеЗаполнено(Заказ.ДатаОтгрузки), Заказ.ДатаОтгрузки, ТекущаяДата());
		МенЗап.ДатаРабот		= ТекущаяДата();
		МенЗап.ЗаказПокупателя 	= Заказ;
		МенЗап.Ответственный 	= Заказ.Ответственный;
		МенЗап.Статус			= Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе;
		МенЗап.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти