
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Попытка
		Результат = Разработка.ЗапросПроверитьВерсию();
		Если Не Результат.Успех Тогда
			ПоказатьПредупреждение(, "Версія додатку на сервері " + Результат.ВерсияНаСервере + "." +
			Символы.ПС + "Поточна версія " + Результат.ТекущаяВерсия + "." +
			Символы.ПС + "Оновыть додаток! " + Результат.Узел);
			Возврат;
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;

	
	ЗагрузитьДанныеСМобильногоУстройства();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеСМобильногоУстройства()

	
	УзелОбмена = Константы.УзелЦентральнойБазы.Получить();
	Результат = Разработка.ЗагрузитьДанныеНаМобильноеУстройство(УзелОбмена);
	Сообщить("Готово!");

КонецПроцедуры