
//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		// Проверка заполнения
		Заголовок = НСтр("ru='Запись документа <';uk='Запис документа <'") + Ссылка + ">";
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнена организация.';uk='Не заповнена організація.'"), Отказ, Заголовок);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено подразделение.';uk='Не заповнений підрозділ.'"), Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры
