
&НаКлиенте
Процедура НайтиСтрокуПоиска(Команда)

	ОбработатьВводШтрихкодаНаКлиенте(СтрокаПоиска);

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)

	Элементы.ПолеСтрокаПоиска.ЦветРамки = Новый Цвет;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СформироватьСписокКомандРабочегоСтола();
	ОстатокВКассе = ПолучитьОстатокВКассе();
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокКомандРабочегоСтола()

	ТаблицаКомандРабочегоСтола = Константы.ХранилищеТаблицыКомандРабочегоСтола.Получить().Получить();
	Если ТипЗнч(ТаблицаКомандРабочегоСтола) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаКоманды Из ТаблицаКомандРабочегоСтола Цикл
			Попытка
				ЭлементКоманды = Элементы.Найти(СтрокаКоманды.Команда);
				Если ЭлементКоманды <> Неопределено Тогда
					
					ЭлементКоманды.Видимость = СтрокаКоманды.Видимость;
					ЭлементКоманды.Заголовок = СтрокаКоманды.Представление;
					Элементы.Переместить(ЭлементКоманды, ЭлементКоманды.Родитель);
					
				КонецЕсли;
			Исключение
				 Сообщить("іваів");
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если ВводДоступен() И Событие = "UniversalBroadcastEvent" и Источник = глНомерУстройства Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Данные);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		МассивЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("FilterData");
		Если МассивЭлементов.Количество() Тогда
			СтрокаПоиска = МассивЭлементов[0].ТекстовоеСодержимое;
			ОбработатьВводШтрихкодаНаКлиенте(СтрокаПоиска);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШтрихкодаНаКлиенте(Штрихкод)

	СтруктураНоменклатуры = Разработка.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, Истина);
	ЦветРамки = Новый Цвет;
	Если ЗначениеЗаполнено(СтруктураНоменклатуры.Номенклатура) Тогда
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ, Характеристика",
							СтруктураНоменклатуры.Номенклатура, СтруктураНоменклатуры.ХарактеристикаНоменклатуры));
		СтрокаПоиска = "";
	Иначе
		ТекстОповещения = "Штрихкод не знайдено";
		ПоказатьОповещениеПользователя(ТекстОповещения, , Штрихкод, , , Штрихкод);
		ЦветРамки = WebЦвета.Красный;
	КонецЕсли;
	Элементы.ПолеСтрокаПоиска.ЦветРамки = ЦветРамки;

КонецПроцедуры

&НаСервере
Функция ПолучитьОстатокВКассе()

	HTTPСоединение = Новый HTTPСоединение("31.134.113.57", 80, "ryslanyakovlev_1", "7338108");
	
	ГУИДПользователя = Константы.ПользовательПоУмолчанию.Получить().УникальныйИдентификатор();
	
	HTTPЗапрос = Новый HTTPЗапрос("/1C_Xatanet/en/hs/api/rest_kkm/" + ГУИДПользователя);
	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Попытка
		JSON = Новый ЧтениеJSON;
		JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
		
		РезультатСоответствие = ПрочитатьJSON(JSON, Истина);
		Остаток = РезультатСоответствие.Получить("Остаток");
	Исключение
		Возврат 0;
	КонецПопытки;
	Возврат Остаток;
КонецФункции

&НаСервере
Процедура ОбновитьОстатокНаСервере()
	ОстатокВКассе = ПолучитьОстатокВКассе();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаток(Команда)
	ОбновитьОстатокНаСервере();
КонецПроцедуры















