
функция ВыгрузитьПлатежкуИзДокументаВБилинг(Документ) Экспорт 
	Ответ = ПриОткрытииНайтиОсновнуюНастройкуПользователя();
	
	Если Ответ = "Не найденна основная настройка для выгрузки в билинг" Тогда 
		Сообщить(Ответ);
		Возврат Ложь;
	КонецЕсли;
	
	Соед = Подключение();
	
	мUID = Документ.Контрагент.ОсновнойППКДляОплат.UID_Билинг;
	Если Соед = Неопределено Тогда
		РезультатТекст = "Не удалось установить соединение с " + АдресRestAPI;
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(мUID) Тогда 
		Сообщить("Не указан UID в ППК");
		Возврат Ложь;

	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.ОсновнойППКДляОплат.billId) Тогда 
		Сообщить("Не указан Bill_ID в ППК");
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.UID_Abbils) Тогда 
		Сообщить("Для документа:"+ Документ + " уже выгруженна платежка" +". Платежка выгруженна будет выгружена повторно");
	КонецЕсли;
	
	Метод = ПолучитьНаименованиеМетодаДляДобавлениеОплатыПользователю(мUID);			
	
	СтруктураДокумента = Новый Структура;
	  СтруктураДокумента.Вставить("Сумма",     Документ.СуммаДокумента);
	СтруктураДокумента.Вставить("method" ,   ОсновнойМетодДляОплаты);
	СтруктураДокумента.Вставить("Bill_ID",   Документ.Контрагент.ОсновнойППКДляОплат.billId);
	СтруктураДокумента.Вставить("Ссылка",    Документ);
	СтруктураДокумента.Вставить("describe",  Строка(Документ.Дата));
	

	Результат = СоздатьОплатуВБилинге(Метод,Соед,СтруктураДокумента);
	
	Возврат Результат;
КонецФункции

Функция Подключение() Экспорт

	Адрес = ПолучитьАдрес();

	Попытка
		Соед = Новый HTTPСоединение(Адрес,ПортRestAPI,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить соединение с " + Адрес);
	КонецПопытки;

	Возврат Соед;

КонецФункции

Функция ПолучитьАдрес() Экспорт
	Возврат АдресRestAPI;
КонецФункции

функция ПолучитьНаименованиеМетодаДляПолученияДанныхПоГуид(UID) Экспорт
	Метод = "/api.cgi/users/"+UID+"/pi";
	Возврат Метод;
КонецФункции

функция ПолучитьНаименованиеМетодаДляПолученияВсехДанныхПоППК() Экспорт
	Метод = "/api.cgi/users/all"+"?pageRows="+РазмерПакетаДляПолученияДанных;
	Возврат Метод;
КонецФункции

функция ПолучитьНаименованиеМетодаДляДобавлениеОплатыПользователю(UID) Экспорт
	Метод = "/api.cgi/payments/users/"+UID;
	Возврат Метод;
КонецФункции

функция ПолучитьНаименованиеМетодаДляДанныеПользователя_БИЛД_ПоГуид(UID) Экспорт
	Метод = "/api.cgi/users/"+UID;
	Возврат Метод;

КонецФункции

функция СоздатьОплатуВБилинге(Метод,Соед,СтрокаПлатежки) Экспорт
	ПлатажекаСоздана = Ложь;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("KEY", APIKey);
	
	//{
	//"sum": 1.15,
	//"method": 19,
	//"billId": 7475,
	//"describe": "Test payment",
	//"innerDescribe": "this client is pig",
	//"date": "2021-12-01",
	//"exchangeId": 1,
	//"cashboxId": 1,
	//"createReceipt": 1,
	//"applyToInvoice": 1,
	//"extId": "Liqpay:12345"
	//}
	
	СтруктураТовара = Новый Структура;
	СтруктураТовара.Вставить("sum",     СтрокаПлатежки.Сумма);
	СтруктураТовара.Вставить("method"  ,СтрокаПлатежки.method);
	СтруктураТовара.Вставить("billId"  ,СтрокаПлатежки.Bill_ID);
	СтруктураТовара.Вставить("describe",СтрокаПлатежки.describe);

	ЗаписьДжСОН = Новый ЗаписьJSON;
	ЗаписьДжСОН.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьДжСОН,СтруктураТовара);	
	ТелоJson = ЗаписьДжСОН.Закрыть();

	ЗапросАПИ = Новый HTTPЗапрос(Метод, Заголовки);
	ЗапросАпи.УстановитьТелоИзСтроки(ТелоJson,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);

	Ответ = Соед.ОтправитьДляОбработки(ЗапросАПИ);
	
	//Парсинг
	КодОтвета = Ответ.КодСостояния;
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
	//СтрокаОтвета = СтрЗаменить(СтрокаОтвета,""""":","""test"":");
	
	Если КодОтвета = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);      
		Массив = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		ПлатажекаСоздана = Истина;
		paymentId = Массив.paymentId;
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код ответа = "+КодОтвета);
	КонецЕсли;
	
	Если ПлатажекаСоздана Тогда 
		СоздатьЗаписьВРегистреСтатусыВыгрузкиППИВAbbils(СтрокаПлатежки.Ссылка,ПлатажекаСоздана,paymentId);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция СоздатьЗаписьВРегистреСтатусыВыгрузкиППИВAbbils(Документ,ПлатажекаСоздана,UID_Abbils) Экспорт 
	
	Запись = РегистрыСведений.СтатусыВыгрузкиППИВAbbils.СоздатьМенеджерЗаписи();
	Запись.ДатаВыгрузки = ТекущаяДата();
	Запись.Документ = Документ;
	Запись.Настройка = НастройкаПодключенияКБилингу;
	Запись.Отправлено = ПлатажекаСоздана;
	Запись.Записать();
	
	Если ПлатажекаСоздана Тогда 
		Док = Документ.ПолучитьОбъект();
		Док.UID_Abbils = UID_Abbils;
		Док.Записать();		
	КонецЕсли;
КонецФункции

Функция ПриОткрытииНайтиОсновнуюНастройку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияКБилингу.Ссылка,
	|	НастройкиПодключенияКБилингу.Наименование,
	|	НастройкиПодключенияКБилингу.Организация,
	|	НастройкиПодключенияКБилингу.Адрес,
	|	НастройкиПодключенияКБилингу.Логин,
	|	НастройкиПодключенияКБилингу.Пароль,
	|	НастройкиПодключенияКБилингу.ОсновнаяНастройка,
	|	НастройкиПодключенияКБилингу.Актуальная,
	|	НастройкиПодключенияКБилингу.АдресRestAPI,
	|	НастройкиПодключенияКБилингу.ПортRestAPI,
	|	НастройкиПодключенияКБилингу.APIKey,
	|	НастройкиПодключенияКБилингу.РазмерПакетаДляПолученияДанных,
	|	НастройкиПодключенияКБилингу.ОсновнойМетодДляОплаты
	|ИЗ
	|	Справочник.НастройкиПодключенияКБилингу КАК НастройкиПодключенияКБилингу
	|ГДЕ
	|	НастройкиПодключенияКБилингу.ПометкаУдаления = ЛОЖЬ
	|	И НастройкиПодключенияКБилингу.ОсновнаяНастройка = ИСТИНА
	|	И НастройкиПодключенияКБилингу.Актуальная = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда 
		Возврат "Не найденна основная настройка для выгрузки в билинг";
	КонецЕсли;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Логин       = ВыборкаДетальныеЗаписи.Логин;
		Пароль      = ВыборкаДетальныеЗаписи.Пароль;
		Организация = ВыборкаДетальныеЗаписи.Организация;
		Адрес       = ВыборкаДетальныеЗаписи.Адрес;
		НастройкаПодключенияКБилингу = ВыборкаДетальныеЗаписи.Ссылка; 
		
		АдресRestAPI = ВыборкаДетальныеЗаписи.АдресRestAPI;
		ПортRestAPI  = ВыборкаДетальныеЗаписи.ПортRestAPI;
		APIKey       = ВыборкаДетальныеЗаписи.APIKey;
		РазмерПакетаДляПолученияДанных       = ВыборкаДетальныеЗаписи.РазмерПакетаДляПолученияДанных;
		ОсновнойМетодДляОплаты = ВыборкаДетальныеЗаписи.ОсновнойМетодДляОплаты;
		
	КонецЦикла;
		
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	ТипКомпании = ПредопределенноеЗначение("Перечисление.vr_ТипКомпании.БюджетнаяОрганизация");
	
	Возврат Истина;
КонецФункции

Функция ПриОткрытииНайтиОсновнуюНастройкуПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияКБилингу.Ссылка,
	|	НастройкиПодключенияКБилингу.Наименование,
	|	НастройкиПодключенияКБилингу.Организация,
	|	НастройкиПодключенияКБилингу.Адрес,
	|	НастройкиПодключенияКБилингу.Логин,
	|	НастройкиПодключенияКБилингу.Пароль,
	|	НастройкиПодключенияКБилингу.ОсновнаяНастройка,
	|	НастройкиПодключенияКБилингу.Актуальная,
	|	НастройкиПодключенияКБилингу.АдресRestAPI,
	|	НастройкиПодключенияКБилингу.ПортRestAPI,
	|	НастройкиПодключенияКБилингу.APIKey,
	|	НастройкиПодключенияКБилингу.РазмерПакетаДляПолученияДанных,
	|	НастройкиПодключенияКБилингу.ОсновнойМетодДляОплаты
	|ИЗ
	|	Справочник.НастройкиПодключенияКБилингу КАК НастройкиПодключенияКБилингу
	|ГДЕ
	|	НастройкиПодключенияКБилингу.ПометкаУдаления = ЛОЖЬ
	|	И НастройкиПодключенияКБилингу.Ссылка = &Ссылка
	|	И НастройкиПодключенияКБилингу.Актуальная = ИСТИНА";
	
	НастройкаПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОснованаяНастройкаПодключенияAbbils");

	Запрос.УстановитьПараметр("Ссылка",НастройкаПользователя);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда 
		Возврат "Не найденна основная настройка для выгрузки в билинг";
	КонецЕсли;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Логин       = ВыборкаДетальныеЗаписи.Логин;
		Пароль      = ВыборкаДетальныеЗаписи.Пароль;
		Организация = ВыборкаДетальныеЗаписи.Организация;
		Адрес       = ВыборкаДетальныеЗаписи.Адрес;
		НастройкаПодключенияКБилингу = ВыборкаДетальныеЗаписи.Ссылка; 
		
		АдресRestAPI = ВыборкаДетальныеЗаписи.АдресRestAPI;
		ПортRestAPI  = ВыборкаДетальныеЗаписи.ПортRestAPI;
		APIKey       = ВыборкаДетальныеЗаписи.APIKey;
		РазмерПакетаДляПолученияДанных       = ВыборкаДетальныеЗаписи.РазмерПакетаДляПолученияДанных;
		ОсновнойМетодДляОплаты = ВыборкаДетальныеЗаписи.ОсновнойМетодДляОплаты;
		
	КонецЦикла;
		
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	ТипКомпании = ПредопределенноеЗначение("Перечисление.vr_ТипКомпании.БюджетнаяОрганизация");
	
	Возврат Истина;
КонецФункции
