
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	//Проверить есть ли другой бизнес процес по этому заказу
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БП_ОбработкаЗаказа.Ссылка
	               |ИЗ
	               |	БизнесПроцесс.БП_ОбработкаЗаказа КАК БП_ОбработкаЗаказа
	               |ГДЕ
	               |	БП_ОбработкаЗаказа.ЗаказПокупателя = &ЗаказПокупателя
	               |	И БП_ОбработкаЗаказа.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаказОплаченНаСайтеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОплатаОтПокупателяПлатежнойКартой.Ссылка,
	               |	ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
	               |ИЗ
	               |	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	               |ГДЕ
	               |	ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &Заказ";
	Запрос.УстановитьПараметр("Заказ",ЭтотОбъект.ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаказСозданНаСайтеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
// н ЛИВ	
	////Если ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
	////	Результат = Истина;	
	////КонецЕсли;
// к ЛИВ

КонецПроцедуры

Процедура ЗаказОформляетсяНаСайтеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	////Если не ((СокрЛП(ЗаказПокупателя.Статус.код) = "10") или (СокрЛП(ЗаказПокупателя.Статус.код) = "35") или (СокрЛП(ЗаказПокупателя.Статус.код) = "800"))Тогда  
	////	Результат = Истина;		
	////Иначе 
	////	Результат = Ложь;	
	////КонецЕсли;
	
КонецПроцедуры

Процедура УКонтрагентаЕстьКредитныйЛимитПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ЗаказПокупателя.ДоговорКонтрагента.КонтролироватьСуммуЗадолженности Тогда
		
		//Расчет текущей задолженности
		
		Запрос=Новый Запрос;
		
		Запрос.Текст="ВЫБРАТЬ
		|	КонтрагентыВзаиморасчетыКомпанииОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВалОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаАнализа,ДоговорКонтрагента=&ДоговорКонтрагента)
		|	КАК КонтрагентыВзаиморасчетыКомпанииОстатки";
		
		Запрос.УстановитьПараметр("ДатаАнализа",?(ЗаказПокупателя.Дата='00010101000000','00010101000000',ЗаказПокупателя.Дата));
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ЗаказПокупателя.ДоговорКонтрагента);
		
		СуммаВзаиморасчетовВал=0;
		
		Результат = Запрос.Выполнить();
		Выборка=Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаВзаиморасчетовВал=Выборка["СуммаВалОстаток"];
		КонецЕсли;
		
		ДопустимаяЗадолженность=ЗаказПокупателя.ДоговорКонтрагента.ДопустимаяСуммаЗадолженности;
		ТекущаяЗадолженность=?(ПустаяСтрока(СуммаВзаиморасчетовВал),0,СуммаВзаиморасчетовВал);
		ОбъемОтгрузки=?((ДопустимаяЗадолженность-ТекущаяЗадолженность)>0,(ДопустимаяЗадолженность-ТекущаяЗадолженность),0);
		
		Если ЗаказПокупателя.СуммаДокумента <= ОбъемОтгрузки Тогда 
			
			Результат = Истина;
			
		Иначе
			
			Результат = Ложь;
			
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

Процедура ОплатаПриПолученииПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	//Спросить
	//Результат= Ложь;
	Результат = Истина;
			
КонецПроцедуры

Процедура ОплатаПолученнаИлиЗаказЗапущенПодОтветственностьМенеждераПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	////Если ry_ОбщиеПроцедуры.ЕстьОплата(ЗаказПокупателя) или ЗаказПокупателя.ПодОтветственностьМенеджера Тогда 
	////	
	////	Результат = Истина;
	////	
	////Иначе 
	////	
	////	Результат = Ложь;
	////	
	////КонецЕсли;
	
КонецПроцедуры

Процедура ЗаказОплаченПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ry_ОбщиеПроцедуры.ЕстьОплата(ЗаказПокупателя);
	
КонецПроцедуры

Процедура Завершение2ПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	Сообщить("Заказ закрыт так как оплата не была полученна");
КонецПроцедуры

Процедура ОтправитьСМСЗаказЗарегистрированОбработка(ТочкаМаршрутаБизнесПроцесса)
	////Если ЗаказПокупателя.ПересылКлиента Тогда 
	////	НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
	////	Попытка
	////		ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("В "+ЗаказПокупателя.Подразделение+
	////		" создан резерв "+ ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" на "+ЗаказПокупателя.КоличествоДнейРезерва + " дн. Код скидки " +ЗаказПокупателя.СекретныйКодСкидки, НомерТелефона);
	////					
	////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
	////		Менеджер.Активность = Истина;
	////		Менеджер.Период = ТекущаяДата();
	////		Менеджер.ЗаказПокупателя = ЗаказПокупателя;
	////		Менеджер.СодержаниеСобытия = "Отправленно SMS " + "В "+ЗаказПокупателя.Подразделение+
	////		" создан резерв "+ ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" на "+ЗаказПокупателя.КоличествоДнейРезерва + " дн. Код скидки " +ЗаказПокупателя.СекретныйКодСкидки;
	////		Менеджер.ТипСобытия = Перечисления.БП_ТипыСобытий.sms;
	////		Менеджер.Ответственный = Справочники.Пользователи.Система;
	////		Менеджер.Статус = СтатусЗаказа;
	////		Менеджер.СсылкаНаОбъект = "В "+ЗаказПокупателя.Подразделение+
	////		" создан резерв "+ ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" на "+ЗаказПокупателя.КоличествоДнейРезерва + " дн. Код скидки " +ЗаказПокупателя.СекретныйКодСкидки;
	////		
	////		
	////		Менеджер.Записать();
	////		
	////	Исключение
	////	КонецПопытки;
	////Иначе
	////	
	////	//Контрагент  = ЗаказПокупателя.Контрагент;
	////	//Телефон     = УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Контрагент);
	////	НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);

	////	Попытка
	////		ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Создан заказ " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+", "+ЗаказПокупателя.Товары.Количество()+" позиций, сумма "+ЗаказПокупателя.СуммаДокумента+"р.", НомерТелефона);
	////		//ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Ваш заказ зарегистрирован под номером " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер), "+380936839334");
	////		
	////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
	////		Менеджер.Активность = Истина;
	////		Менеджер.Период = ТекущаяДата();
	////		Менеджер.ЗаказПокупателя = ЗаказПокупателя;
	////		Менеджер.СодержаниеСобытия = "Отправленно SMS " + "Создан заказ " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+", "+ЗаказПокупателя.Товары.Количество()+" позиций, сумма "+ЗаказПокупателя.СуммаДокумента+"р.";
	////		Менеджер.ТипСобытия = Перечисления.БП_ТипыСобытий.sms;
	////		Менеджер.Ответственный = Справочники.Пользователи.Система;
	////		Менеджер.Статус = СтатусЗаказа;
	////		Менеджер.СсылкаНаОбъект = "Отправленно SMS " + "Создан заказ " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+", "+ЗаказПокупателя.Товары.Количество()+" позиций, сумма "+ЗаказПокупателя.СуммаДокумента+"р.";
	////		
	////		Менеджер.Записать();
	////		
	////	Исключение
	////	КонецПопытки;
	////КонецЕсли;
		
КонецПроцедуры

Процедура ОтправитьСМСЗарегистрированаОплатаОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Контрагент  = ЗаказПокупателя.Контрагент;
	НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);

	Попытка
		ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("По заказу " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" зарегистрированна оплата.", НомерТелефона);
		
	Исключение	
	КонецПопытки;
	
	Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
	Менеджер.Активность = Истина;
	Менеджер.Период = ТекущаяДата();
	Менеджер.ЗаказПокупателя = ЗаказПокупателя;
	Менеджер.СодержаниеСобытия = "Отправленно SMS : По заказу " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" зарегистрированна оплата.";
	Менеджер.ТипСобытия = Перечисления.БП_ТипыСобытий.sms;
	Менеджер.Ответственный = Справочники.Пользователи.Система;
	Менеджер.Статус = СтатусЗаказа;
	Менеджер.СсылкаНаОбъект = "Отправленно SMS : По заказу " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" зарегистрированна оплата.";

	

	Менеджер.Записать();

КонецПроцедуры

Процедура СозданиеБизнесПроцессовПоСтрокамОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Для Каждого Строка из СтрокиЗаказа цикл
		БП = БизнесПроцессы.БП_ОбработкаСтрокиЗаказа.СоздатьБизнесПроцесс();
		БП.Дата         				= ТекущаяДата();
		БП.Количество   				= Строка.Количество;
		БП.Номенклатура 				= Строка.Номенклатура;
		БП.ХарактеристикаНоменклатуры   = Строка.ХарактеристикаНоменклатуры;
		БП.Цена 	    				= Строка.Цена;
		БП.СкладВыдачи  		    	= Строка.СкладВыдачи;
		БП.РодительскийБизнесПроцес 	= ЭтотОбъект.Ссылка;
		БП.СтатусСтрокиЗаказа 	    	= Перечисления.БП_СтатусыСтрокЗазака.Зарегистрирован;
		БП.НомерСтроки 		  			= Строка.НомерСтроки;
		БП.СпособДоставки				= Строка.СпособДоставки;
		БП.АдресДоставки		    	= Строка.АдресДоставки;
		БП.ЗаказПоставщику				= Строка.ЗаказПоставщику;
////		БП.ПеремещениеТовараПодОтветственностьМенеджера = Строка.ПеремещениеПодОтветственностьМенеджера;
		БП.КомментарийДляПеремещенияТовара = Строка.Комментарий;
		////БП.ДетальИзНеразборногоКомплекта   = ДелатьИзНеРазборногоКомплекта(Строка.ХарактеристикаНоменклатуры);
		////БП.ИсточникПолученияТовара      = Строка.ИсточникПолученияТовара;
		БП.Записать();
		////Если ry_ОбщиеПроцедуры.ОплаченЧеком(ЗаказПокупателя) Тогда 
		////	БП.Завершен = истина;
		////	БП.Записать();
		////Иначе
			БП.Старт();	
		////КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры        


Функция ДелатьИзНеРазборногоКомплекта(ХарактеристикаНоменклатуры)

	ВозвращаемоеЗначение = Ложь;
	
	
	Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда 
		
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
		Запрос.УстановитьПараметр("Объект",ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("3.Вид комплекта"));
		
		РезультатЗапроса = запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() Тогда 
			Если РезультатЗапроса[0].Значение = Перечисления.зетаБУВидыКомплектов.НеразборныйКомплект Тогда 
				
				ЗапросПоВидуКомплектации = Новый запрос;
				ЗапросПоВидуКомплектации.Текст = "ВЫБРАТЬ
				                                 |	ЗначенияСвойствОбъектов.Значение
				                                 |ИЗ
				                                 |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				                                 |ГДЕ
				                                 |	ЗначенияСвойствОбъектов.Объект = &Объект
				                                 |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
				ЗапросПоВидуКомплектации.УстановитьПараметр("Объект",ХарактеристикаНоменклатуры);
				ЗапросПоВидуКомплектации.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("4.Вид комплектации"));
				РезультатЗапроса = ЗапросПоВидуКомплектации.Выполнить().Выгрузить();
		
				Если РезультатЗапроса.Количество() Тогда
					Значение = РезультатЗапроса[0].Значение;
					
					Если Значение = Перечисления.зетаБУВидыКомплектации.НеосновнаяЧастьКомплекта 
						или Значение = Перечисления.зетаБУВидыКомплектации.ОсновнаяЧастьКомплекта Тогда 
						ВозвращаемоеЗначение = Истина;
	
					КонецЕсли;
				КонецЕсли;						 
				
				
			Иначе
				ВозвращаемоеЗначение = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ПомечаемЗаказНаУдалениеОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ЗаказПокупателяОб = ЗаказПокупателя.ПолучитьОбъект();
	ЗаказПокупателяОб.ПометкаУдаления = Истина;
	ЗаказПокупателяОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗаказПокупателяоб = ЗаказПокупателя.ПолучитьОбъект();
	ЗаказПокупателяоб.ПометкаУдаления = Истина;
	ЗаказПокупателяоб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Процедура ПереводВСтатусВыполненОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ЗаказПокупателяоб = ЗаказПокупателя.ПолучитьОбъект();
	////ЗаказПокупателяоб.Статус = Справочники.СтатусыСтрокиЗаказа.ТоварОтгружен;
	ЗаказПокупателяоб.Записать(РежимЗаписиДокумента.Проведение);
	
	ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ЗаказВыполнен;
	
	ЗапросПоБп = новый запрос;
	ЗапросПоБп.Текст = "ВЫБРАТЬ
	                   |	БП_ОбработкаСтрокиЗаказа.Ссылка,
	                   |	БП_ОбработкаСтрокиЗаказа.Ссылка КАК Ссылка1,
	                   |	БП_ОбработкаСтрокиЗаказа.ВерсияДанных,
	                   |	БП_ОбработкаСтрокиЗаказа.ПометкаУдаления,
	                   |	БП_ОбработкаСтрокиЗаказа.Номер,
	                   |	БП_ОбработкаСтрокиЗаказа.Дата,
	                   |	БП_ОбработкаСтрокиЗаказа.Завершен,
	                   |	БП_ОбработкаСтрокиЗаказа.ВедущаяЗадача,
	                   |	БП_ОбработкаСтрокиЗаказа.Стартован,
	                   |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес,
	                   |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                   |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                   |	БП_ОбработкаСтрокиЗаказа.Количество,
	                   |	БП_ОбработкаСтрокиЗаказа.Цена,
	                   |	БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа,
	                   |	БП_ОбработкаСтрокиЗаказа.СкладСОстаткомТовара,
	                   |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи,
	                   |	БП_ОбработкаСтрокиЗаказа.ЗаказПоставщику,
	                   |	БП_ОбработкаСтрокиЗаказа.ВнутреннийЗаказ,
	                   |	БП_ОбработкаСтрокиЗаказа.НомерСтроки,
	                   |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                   |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                   |	БП_ОбработкаСтрокиЗаказа.ПеремещениеТоваров,
	                   |	БП_ОбработкаСтрокиЗаказа.АдресВнутреннейДоставки,
	                   |	БП_ОбработкаСтрокиЗаказа.ДокументДоствкиВнутренний,
	                   |	БП_ОбработкаСтрокиЗаказа.НомерТТН,
	                   |	БП_ОбработкаСтрокиЗаказа.ДатаОтправки,
	                   |	БП_ОбработкаСтрокиЗаказа.Представление
	                   |ИЗ
	                   |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                   |ГДЕ
	                   |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес";
	ЗапросПоБп.УстановитьПараметр("РодительскийБизнесПроцес",ЭтотОбъект.Ссылка);
	РезультатЗапроса = ЗапросПоБп.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультатЗапроса из РезультатЗапроса цикл               
		
	

		
		ЭтотОбъект.СтрокиЗаказа.Очистить();
		СтрокаБП = ЭтотОбъект.СтрокиЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаБП,СтрокаРезультатЗапроса);
		
		//Если СтрокаРезультатЗапроса.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке Тогда 
			
			
			//СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(СтрокаРезультатЗапроса.РодительскийБизнесПроцес.ЗаказПокупателя,СтрокаРезультатЗапроса.Номенклатура,СтрокаРезультатЗапроса.ХарактеристикаНоменклатуры,СтрокаРезультатЗапроса.Цена);
			//Чернавцев Н.А. по задаче №45525 07.07.2021 Начало
			//Функционал устарел
			//ДокументДвиженияСтатусов = ПолучитьДокументДвиженияСтрок(СтрокаРезультатЗапроса.РодительскийБизнесПроцес.ЗаказПокупателя);	
			//Если ЗначениеЗаполнено(ДокументДвиженияСтатусов) Тогда 
			//	Если ЗначениеЗаполнено(СтрокаЗаказа) Тогда 
			//		ДокДвиженияОБ = ДокументДвиженияСтатусов.ПолучитьОбъект();
			//		
			//		СтрокиЗаказа11 = ДокДвиженияОБ.ТабСтрок.НайтиСтроки(Новый структура("СтрокаЗаказа",СтрокаЗаказа));
			//		
			//		Для каждого СтрокаСтрокиЗаказа из СтрокиЗаказа11 цикл
			//			СтрокаСтрокиЗаказа.ВСтатус = Справочники.СтатусыСтрокиЗаказа.ТоварОтгружен;
			//			СтрокаСтрокиЗаказа.ВОткуда = СтрокаРезультатЗапроса.СкладВыдачи; 
			//		КонецЦикла;
			//		ДокДвиженияОБ.Записать(РежимЗаписиДокумента.Проведение);
			//	КонецЕсли;
			//КонецЕсли;
            //Чернавцев Н.А. по задаче №45525 07.07.2021 Конец
			
			
		//КонецЕсли;
		
	
	
	КонецЦикла;
	
	ЭтотОбъект.Записать();
	
	
	Попытка
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	БП_ЗадачиИсполнителей.Ссылка
		               |ИЗ
		               |	Задача.БП_ЗадачиИсполнителей КАК БП_ЗадачиИсполнителей
		               |ГДЕ
		               |	БП_ЗадачиИсполнителей.Наименование ПОДОБНО &Наименование
		               |	И БП_ЗадачиИсполнителей.ЗаказПокупателя = &ЗаказПокупателя";
		Запрос.УстановитьПараметр("Наименование","%Уточнить у покупателя продление резерва%");
		Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
		
		РезультатЗапроса = запрос.Выполнить().Выгрузить();
		
		Для Каждого Строка из РезультатЗапроса цикл
			ОБ = Строка.Ссылка.получитьОбъект();
			Об.удалить();
		КонецЦикла;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

//Функция ЕстьОплата(ЗаказПокупателя) Экспорт 
//	Запрос = новый запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
//	               |	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток
//	               |ИЗ
//	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
//	               |			,
//	               |			Контрагент = &Контрагент
//	               |				И Сделка = &ЗаказПокупателя) КАК ВзаиморасчетыСКонтрагентамиОстатки";
//	Запрос.УстановитьПараметр("Контрагент",ЗаказПокупателя.Контрагент);
//	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	
//	Если РезультатЗапроса[0].СуммаВзаиморасчетовОстаток = 0  Тогда 
//		//Полученна оплата
//		Возврат Истина;
//	Иначе
//		//Не полученна оплата
//		Возврат Ложь;
//	КонецЕсли;	
//КонецФункции

Процедура ОтправитьЕмейлОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Если ТочкаМаршрутаБизнесПроцесса.Имя = "ЗарегистрированаОплата" Тогда 
		
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);
////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление о поступлении оплаты ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Поступила оплата";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("Шапка").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("Подвал").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("Строка").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЭтотОбъект.СтрокиЗаказа цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность = Истина;
////		Менеджер.Период = ТекущаяДата();
////		Менеджер.ЗаказПокупателя = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = Письмо.Тема;
////		Менеджер.ТипСобытия 	= Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный  = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект = Письмо.Ссылка;
////		Менеджер.Статус 		= СтатусЗаказа;

////		Менеджер.Записать();

////		
	КонецЕсли;
	//////КонецЕсли;	
КонецПроцедуры

Процедура ОтправитьEmail() Экспорт
Контрагент    = ЗаказПокупателя.Контрагент;	
ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);
	
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.ИмяОтправителя = СокрЛП("Интернет магазин 7 Деталей");
	Получатель            = Контрагент.Наименование;
	Получатель.Адрес      = "tee-2003ok@mail.ru";
	Письмо.Тема           = "#Заказ " + ЗаказПокупателя.Номер;
	Письмо.Тексты.Добавить("gfgdfgdf");

	
	ПрофильОтправки = Новый ИнтернетПочтовыйПрофиль;
	ПрофильОтправки.АдресСервераSMTP   = "mail.yandex.ru";
	ПрофильОтправки.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	ПрофильОтправки.ПользовательSMTP   = "robot@7detalei.ru";
	ПрофильОтправки.ПарольSMTP         = "Qwe12345robot";

	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(ПрофильОтправки);
	Исключение
		Сообщить("Электронное сообщение не отправлено: "+ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	Попытка
		Почта.Послать(Письмо);
	Исключение
		Сообщить("Электронное сообщение не отправлено: "+ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	Почта.Отключиться();		
	
КонецПроцедуры

Процедура ПеревестиСтатусНаОплаченоОбработка(ТочкаМаршрутаБизнесПроцесса)
	
КонецПроцедуры

Процедура ОтгрузитьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача из ФормируемыеЗадачи цикл
		Задача.Подразделение      = ЗаказПокупателя.Подразделение;
	КонецЦикла;
КонецПроцедуры

Процедура КоличествоСкладовКонсолидацииОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	КоличествоСкладов = 0;
	
	Результат = ТочкаВыбораВарианта.Варианты.ОдинСклад;
	
	ЗапросПоКоличествуСкладов = новый Запрос;
	ЗапросПоКоличествуСкладов.Текст = "ВЫБРАТЬ
	                                  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БП_ОбработкаСтрокиЗаказа.СкладВыдачи) КАК КоличествоСкладов
	                                  |ИЗ
	                                  |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                                  |ГДЕ
	                                  |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.ЗаказПокупателя = &Ссылка
	                                  |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = ЗНАЧЕНИЕ(Перечисление.БП_СтатусыСтрокЗазака.ГотовКОтгрузке)
	                                  |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)";
	ЗапросПоКоличествуСкладов.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка.ЗаказПокупателя);
	
	РезультатЗапроса = ЗапросПоКоличествуСкладов.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество()>0 Тогда 
		КоличествоСкладов = РезультатЗапроса[0].КоличествоСкладов;
	КонецЕсли;
	
	Если КоличествоСкладов = 1 Тогда 
		Результат = ТочкаВыбораВарианта.Варианты.ОдинСклад;
	ИначеЕсли КоличествоСкладов = 2 Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДваСклада;
	ИначеЕсли КоличествоСкладов = 3 Тогда 
		Результат = ТочкаВыбораВарианта.Варианты.ТриСклада;
	ИначеЕсли КоличествоСкладов = 4 Тогда 
		Результат = ТочкаВыбораВарианта.Варианты.ЧетыреСклада;
	ИначеЕсли КоличествоСкладов = 5 Тогда 
		Результат = ТочкаВыбораВарианта.Варианты.ПятьСкладов;
	
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.НетСкладов;
	КонецЕсли;
	
КонецПроцедуры

Процедура Действие5ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПереводСтатусаВГотовКОтгрузкеОбработка(ТочкаМаршрутаБизнесПроцесса)
	ЗапросПоСтатусамПодчиненныхЗадач = новый Запрос;
	ЗапросПоСтатусамПодчиненныхЗадач.Текст = "ВЫБРАТЬ
	                                         |	БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа,
	                                         |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БП_ОбработкаСтрокиЗаказа.Ссылка) КАК КоличествоСтрок
	                                         |ИЗ
	                                         |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                                         |ГДЕ
	                                         |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес
	                                         |
	                                         |СГРУППИРОВАТЬ ПО
	                                         |	БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа";
	ЗапросПоСтатусамПодчиненныхЗадач.УстановитьПараметр("РодительскийБизнесПроцес",ЭтотОбъект.Ссылка);
	РезультатЗапроса = ЗапросПоСтатусамПодчиненныхЗадач.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество()>0 Тогда 
		Если РезультатЗапроса.Количество()=1 Тогда 
			Если РезультатЗапроса[0].СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке Тогда 
				ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ГотовКОтгрузке;
				ЭтотОбъект.Записать();
			ИначеЕсли РезультатЗапроса[0].СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказСклада или РезультатЗапроса[0].СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказПоставщика Тогда 
				ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ОтказСклада;
				ЭтотОбъект.Записать();
			КонецЕсли;
		Иначе
			ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ЕстьПроблемныеПозиции;
			ЭтотОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОтгрузитьЗаказСклад1из2ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение;
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОтгрузитьЗаказ2из2ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи     = МассивСкладов[1];
		Задача.Подразделение   = МассивСкладов[1].Подразделение; 
		задача.ТипЗадачи       = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		задача.ЗАказПокупателя = ЗаказПокупателя;
	КонецЦикла;
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура Действие2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	 
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи     = МассивСкладов[0];
		Задача.Подразделение   = МассивСкладов[0].Подразделение; 
		задача.ТипЗадачи       = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;

КонецПроцедуры

Процедура ОткрузитьЗаказСклад1из3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.заказПокупателя = ЗаказПокупателя;	
	КонецЦикла;
	
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОтгрузитьЗаказСклад2из3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи     = МассивСкладов[1];
		Задача.Подразделение   = МассивСкладов[1].Подразделение; 
		задача.ТипЗадачи       = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОтгрузитьЗаказСклад3из3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[2]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[2];
		Задача.Подразделение = МассивСкладов[2].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////4///////////////////////////////////////
Процедура ОткрузитьЗаказСклад1из4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.заказПокупателя = ЗаказПокупателя;	
	КонецЦикла;
	
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОтгрузитьЗаказСклад2из4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи     = МассивСкладов[1];
		Задача.Подразделение   = МассивСкладов[1].Подразделение; 
		задача.ТипЗадачи       = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОтгрузитьЗаказСклад3из4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[2]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[2];
		Задача.Подразделение = МассивСкладов[2].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОтгрузитьЗаказСклад4из4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[3]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[3];
		Задача.Подразделение = МассивСкладов[3].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ЕстьДоставка1из3ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЕстьДоставка2из3ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ЕстьДоставка3из3ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[2]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////4/////////////////////////////////////////////////
Процедура ЕстьДоставка1из4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЕстьДоставка2из4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ЕстьДоставка3из4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[2]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ЕстьДоставка4из4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[3]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры





Процедура ЕстьДоставка1из2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ЕстьДоставка2из2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры


Процедура ЕстьДоставка1из1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи в (&СкладВыдачи)
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;	
	Иначе 	
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту1из3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи,
	                |	БП_ОбработкаСтрокиЗаказа.ТК
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;

	РезультатЗапроса.Свернуть("АдресДоставки,Номенклатура,ХарактеристикаНоменклатуры,Цена","Количество");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки       = АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		
		ДокументДоставки.ОфисСдекОправителя  =  АдресДоствкаСтр.АдресДоставки.ОфисОтправителя;
		ДокументДоставки.ОфисСдекПолучателя  =  АдресДоствкаСтр.АдресДоставки.ОфисПолучателя;
		
		НовСтрока = ДокументДоставки.ТоварыТК.Добавить();
		НовСтрока.Номенклатура = АдресДоствкаСтр.Номенклатура;
		НовСтрока.ХарактеристикаНоменклатуры = АдресДоствкаСтр.ХарактеристикаНоменклатуры;
		НовСтрока.Количество =  АдресДоствкаСтр.Количество;
		НовСтрока.Цена   =    АдресДоствкаСтр.Цена;
		

		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьЗаказКлиенту2из3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[1];
		Задача.Подразделение = МассивСкладов[1].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки,Номенклатура,ХарактеристикаНоменклатуры,Цена","Количество");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки       = АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ОфисСдекОправителя  =  АдресДоствкаСтр.АдресДоставки.ОфисОтправителя;
		ДокументДоставки.ОфисСдекПолучателя  =  АдресДоствкаСтр.АдресДоставки.ОфисПолучателя;
		
		НовСтрока = ДокументДоставки.ТоварыТК.Добавить();
		НовСтрока.Номенклатура = АдресДоствкаСтр.Номенклатура;
		НовСтрока.ХарактеристикаНоменклатуры = АдресДоствкаСтр.ХарактеристикаНоменклатуры;
		НовСтрока.Количество =  АдресДоствкаСтр.Количество;
		НовСтрока.Цена   =    АдресДоствкаСтр.Цена;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту3из3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[2]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[2];
		Задача.Подразделение = МассивСкладов[2].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки,Номенклатура,ХарактеристикаНоменклатуры,Цена","Количество");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки= АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ОфисСдекОправителя  =  АдресДоствкаСтр.АдресДоставки.ОфисОтправителя;
		ДокументДоставки.ОфисСдекПолучателя  =  АдресДоствкаСтр.АдресДоставки.ОфисПолучателя;
		
		НовСтрока = ДокументДоставки.ТоварыТК.Добавить();
		НовСтрока.Номенклатура = АдресДоствкаСтр.Номенклатура;
		НовСтрока.ХарактеристикаНоменклатуры = АдресДоствкаСтр.ХарактеристикаНоменклатуры;
		НовСтрока.Количество =  АдресДоствкаСтр.Количество;
		НовСтрока.Цена   =    АдресДоствкаСтр.Цена;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;
		КонецЦикла;


	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту1из2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки,Номенклатура,ХарактеристикаНоменклатуры,Цена","Количество");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки       = АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ОфисСдекОправителя  =  АдресДоствкаСтр.АдресДоставки.ОфисОтправителя;
		ДокументДоставки.ОфисСдекПолучателя  =  АдресДоствкаСтр.АдресДоставки.ОфисПолучателя;
		
		НовСтрока = ДокументДоставки.ТоварыТК.Добавить();
		НовСтрока.Номенклатура = АдресДоствкаСтр.Номенклатура;
		НовСтрока.ХарактеристикаНоменклатуры = АдресДоствкаСтр.ХарактеристикаНоменклатуры;
		НовСтрока.Количество =  АдресДоствкаСтр.Количество;
		НовСтрока.Цена   =    АдресДоствкаСтр.Цена;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания; 
		КонецЦикла;


	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту2из2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи     = МассивСкладов[1];
		Задача.Подразделение   = МассивСкладов[1].Подразделение; 
		Задача.типЗадачи       = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки,Номенклатура,ХарактеристикаНоменклатуры,Цена","Количество");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки       = АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ОфисСдекОправителя  =  АдресДоствкаСтр.АдресДоставки.ОфисОтправителя;
		ДокументДоставки.ОфисСдекПолучателя  =  АдресДоствкаСтр.АдресДоставки.ОфисПолучателя;
		
		НовСтрока = ДокументДоставки.ТоварыТК.Добавить();
		НовСтрока.Номенклатура = АдресДоствкаСтр.Номенклатура;
		НовСтрока.ХарактеристикаНоменклатуры = АдресДоствкаСтр.ХарактеристикаНоменклатуры;
		НовСтрока.Количество =  АдресДоствкаСтр.Количество;
		НовСтрока.Цена   =    АдресДоствкаСтр.Цена;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;
		КонецЦикла;


	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту1из1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки,Номенклатура,ХарактеристикаНоменклатуры,Цена","Количество");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя = АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки       = АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ОфисСдекОправителя  =  АдресДоствкаСтр.АдресДоставки.ОфисОтправителя;
		ДокументДоставки.ОфисСдекПолучателя  =  АдресДоствкаСтр.АдресДоставки.ОфисПолучателя;
		
		НовСтрока = ДокументДоставки.ТоварыТК.Добавить();
		НовСтрока.Номенклатура = АдресДоствкаСтр.Номенклатура;
		НовСтрока.ХарактеристикаНоменклатуры = АдресДоствкаСтр.ХарактеристикаНоменклатуры;
		НовСтрока.Количество =  АдресДоствкаСтр.Количество;
		НовСтрока.Цена   =    АдресДоствкаСтр.Цена;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;
		КонецЦикла;


	КонецЦикла;

КонецПроцедуры

Процедура ОформитьДокументыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.подразделение = ЭтотОбъект.ЗаказПокупателя.Подразделение;
		Если не ЗначениеЗаполнено(задача.подразделение) Тогда  
			Если ЭтотОбъект.ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
				задача.подразделение  = Справочники.Подразделения.НайтиПоКоду("4"); 
				
			КонецЕсли;
		КонецЕсли;	
		Задача.заказПокупателя = ЗаказПокупателя;
		Задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.ОформитьДокументы;
	КонецЦикла;
КонецПроцедуры

Процедура ПереводСтатусаВЗаказВРаботеОбработка(ТочкаМаршрутаБизнесПроцесса)
	ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ЗаказВРаботе;
	
	//СтрокиЗаказа.Очистить();
	//Для каждого СтрокаЗаказа из ЗаказПокупателя.Товары цикл
	//	
	//	СтрокаБП = СтрокиЗаказа.Добавить();
	//	СтрокаБП.Номенклатура 		= СтрокаЗаказа.Номенклатура;
	//	СтрокаБП.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
	//	СтрокаБП.Количество   		= СтрокаЗаказа.Количество;
	//	СтрокаБП.Цена         		= СтрокаЗаказа.Цена;
	//	СтрокаБП.СкладВыдачи        = СтрокаЗаказа.Склад;
	//	СтрокаБП.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.Зарегистрирован;
	//	СтрокаБП.АдресДоставки  	= СтрокаЗаказа.АдресДоставки;
	//	СтрокаБП.СпособДоставки 	= СтрокаЗаказа.СпособДоставки;
	//	СтрокаБП.Количество			= СтрокаЗаказа.Количество;	
	//	СтрокаБП.НетНаСкладе		=?(ПроверитьОстатокНаскладе(СтрокаЗаказа.Номенклатура,СтрокаЗаказа.ХарактеристикаНоменклатуры)>СтрокаЗаказа.Количество,Истина,Ложь);
	//КонецЦикла;
	//
	ЭтотОбъект.Записать();
	
КонецПроцедуры

Процедура ПроставитьСпособыДоставкиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.подразделение = ЭтотОбъект.ЗаказПокупателя.Подразделение;
		Если не ЗначениеЗаполнено(задача.подразделение) Тогда  
			////Если ЭтотОбъект.ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
			////задача.подразделение  = Справочники.Подразделения.НайтиПоКоду("4"); 
			////КонецЕсли;
		КонецЕсли;
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.ПроставитьСпособыДоставки;
		Задача.заказПокупателя = ЗаказПокупателя;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроставитьСпособыДоставкиОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
	////Для Каждого СтрокаТовары из ЭтотОбъект.ЗаказПокупателя.Товары Цикл
	////	Если не ЗначениеЗаполнено(СтрокаТовары.СпособДоставки) Тогда 
	////			Результат = Ложь;
	////	КонецЕсли;
	////КонецЦикла;
	Если не ЗначениеЗаполнено(ЭтотОбъект.ЗаказПокупателя.СпособДоставки) Тогда 
			Результат = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьДокументыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.подразделение = ЭтотОбъект.ЗаказПокупателя.Подразделение;
	////	Если не ЗначениеЗаполнено(задача.подразделение) Тогда  
	////		Если ЭтотОбъект.ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
	////			задача.подразделение  = Справочники.Подразделения.НайтиПоКоду("4"); 
	////		КонецЕсли;
	////	КонецЕсли;
		задача.ЗаказПокупателя = ЗаказПокупателя;
	////	
	////	ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
	////	ДокументДоставки.Дата = ТекущаяДата();
	////	ДокументДоставки.ПаспортныеДанныеПолучателя = АдресДоставкиДокументов.ПаспортныеДанныеПолучателя;
	////	ДокументДоставки.АдресДоставки = АдресДоставкиДокументов.АдресДоставки;
	////	ДокументДоставки.Получатель    = АдресДоставкиДокументов.Получатель;
	////	ДокументДоставки.Телефон       = АдресДоставкиДокументов.Телефон;
	////	ДокументДоставки.ИНН   		   = АдресДоставкиДокументов.ИНН;
	////	ДокументДоставки.ТипПеревозки  = АдресДоставкиДокументов.ТипПеревозки;
	////	ДокументДоставки.ТранспортнаяКомпания = АдресДоставкиДокументов.ТранспортнаяКомпания;
	////	ДокументДоставки.ОплатаДоставки       = АдресДоставкиДокументов.ОплатаДоставки;

	////	ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
	////	ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
	////	
	////	задача.ДокументДоставкиДокументов = ДокументДоставки.Ссылка;
	КонецЦикла;

КонецПроцедуры

Процедура ДокументыУехалиСГрузомПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Ложь;
	
	////ТекущееПодразделение = ЗаказПокупателя.Организация.Подразделение;
	////
	////Для Каждого строкаТовары из  ЗаказПокупателя.Товары цикл
	////			
	////	Если строкаТовары.Склад.Подразделение = ТекущееПодразделение Тогда 
	////		Результат = Истина;	
	////	КонецЕсли;
	////	
	////КонецЦикла;
	////
	////Запрос = новый запрос;
	////Запрос.Текст = "ВЫБРАТЬ
	////               |	РеализацияТоваровУслуг.Ссылка
	////               |ИЗ
	////               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	////               |ГДЕ
	////               |	РеализацияТоваровУслуг.Сделка = &ЗаказПокупателя
	////               |	И РеализацияТоваровУслуг.Проведен";
	////Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);	
	////РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	////ВесьЗаказОплаченЧеком = истина;
	////Для каждого СтрокаРезультат из РезультатЗапроса цикл
	////	Если не СтрокаРезультат.ссылка.ОплаченоЧеком Тогда 
	////		ВесьЗаказОплаченЧеком = Ложь;
	////	КонецЕсли;
	////КонецЦикла;
	////
	////Если ВесьЗаказОплаченЧеком Тогда 
	////	Результат = Ложь;
	////КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресДоставкиДокументов) Тогда 
		Результат = Ложь;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПолучитьДокументыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.подразделение = ЭтотОбъект.ЗаказПокупателя.Подразделение;
		Если не ЗначениеЗаполнено(задача.подразделение) Тогда  
			Если ЭтотОбъект.ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
				////задача.подразделение  = Справочники.Подразделения.НайтиПоКоду("4"); 
			КонецЕсли;
		КонецЕсли;	
		задача.ЗаказПокупателя = ЗаказПокупателя;
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.ПолучитьДокументы;
	КонецЦикла;
	
КонецПроцедуры

Процедура РеализацияОформленнаЧекомПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	////РеализацияТовара = ПолучитьРеализацию(ЗаказПокупателя);
	////Если ЗначениеЗаполнено(РеализацияТовара) Тогда 
	////	////Если РеализацияТовара.ОплаченоЧеком Тогда 
	////		////Результат = Истина;
	////	////Иначе
	////		Результат = Ложь;
	////	////КонецЕсли;
	////Иначе
	////	Результат = Ложь;	
	////КонецЕсли;
	Результат = Истина;
КонецПроцедуры

Процедура СистемаЖдетОплатыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого Задача из ФормируемыеЗадачи цикл
		Задача.заказПокупателя = ЗаказПокупателя;
		Задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СистемаЖдетОплаты;
	КонецЦикла;
КонецПроцедуры

Процедура Действие1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого Задача из ФормируемыеЗадачи цикл
		Задача.заказПокупателя = ЗаказПокупателя;	
	КонецЦикла;
КонецПроцедуры

Процедура ЗавершитьДочерниеБизнесПроцессыОбработка(ТочкаМаршрутаБизнесПроцесса)
	ЗапросПоДочернимБП = новый запрос;
	ЗапросПоДочернимБП.Текст = "ВЫБРАТЬ
	                           |	БП_ОбработкаСтрокиЗаказа.Ссылка
	                           |ИЗ
	                           |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                           |ГДЕ
	                           |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес";
	ЗапросПоДочернимБП.УстановитьПараметр("РодительскийБизнесПроцес",ЭтотОбъект.Ссылка);
	РезультатЗапроса = ЗапросПоДочернимБП.Выполнить().Выгрузить();
	Для каждого бп из РезультатЗапроса цикл
		БпОб 		  			= Бп.Ссылка.получитьОбъект();
		БпОб.Завершен 		    = истина;
		БПОб.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке;
		БПОб.Записать();
	КонецЦикла;
	
	ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ГотовКОтгрузке;
	ЭтотОбъект.Записать();

КонецПроцедуры

Процедура ОплаченЧекомПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
Результат = ry_ОбщиеПроцедуры.ОплаченЧеком(ЗаказПокупателя);
КонецПроцедуры

Процедура Обработка7Обработка(ТочкаМаршрутаБизнесПроцесса)
	Контрагент  = ЗаказПокупателя.Контрагент;
	НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);

	Попытка
		ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("По заказу " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" зарегистрированна предоплата.", НомерТелефона);
	Исключение	
	КонецПопытки;
	
	Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
	Менеджер.Активность = Истина;
	Менеджер.Период = ТекущаяДата();
	Менеджер.ЗаказПокупателя = ЗаказПокупателя;
	Менеджер.СодержаниеСобытия = "Отправленно SMS : По заказу " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" зарегистрированна предоплата.";
	Менеджер.ТипСобытия = Перечисления.БП_ТипыСобытий.sms;
	Менеджер.Ответственный = Справочники.Пользователи.Система;
	Менеджер.СсылкаНаОбъект = "Отправленно SMS : По заказу " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" зарегистрированна предоплата.";
	
	Менеджер.Статус = СтатусЗаказа;
	Менеджер.Записать();


КонецПроцедуры

Процедура ОбработкаЗарегистрированнаПредоплатаЕмейлОбработка(ТочкаМаршрутаБизнесПроцесса)
				
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);	

////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление о получении предоплаты заказа в Интернет магазине ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента +",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаПредоплата").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("Подвал").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("Строка").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЭтотОбъект.СтрокиЗаказа цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность = Истина;
////		Менеджер.Период 		   = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = Письмо.Тема;
////		Менеджер.ТипСобытия 	   = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.Статус 		   = СтатусЗаказа;
////		Менеджер.СсылкаНаОбъект = Письмо.Ссылка;

////		Менеджер.Записать();

КонецПроцедуры

Процедура ЕстьПредоплатаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	результат = ry_ОбщиеПроцедуры.ЕстьПредоплата(ЗаказПокупателя);
КонецПроцедуры

Процедура ЗарегистрированЗаказОбработка(ТочкаМаршрутаБизнесПроцесса)

////	// + 58813 ДДГ  2 май 2023
////	Организация   = ЗаказПокупателя.Организация;

////	Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////	ЕмейлОтправителя = "robot@7detalei.ru";
////	ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////	// - 58813 ДДГ  2 май 2023

////	Если ЗаказПокупателя.ПересылКлиента Тогда 
////		
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);	

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Ваш товар зарезервирован. Интернет-магазин ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента +",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш товар зарезервирован. Интернет-магазин ""7detalei.ru""";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаЗарезервированТовар").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалЗарезервированТовар").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("Строка").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЭтотОбъект.СтрокиЗаказа цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","Зарезервирован");
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ДатаИстеченияРезерва",Формат(ЗаказПокупателя.дата + ЗаказПокупателя.КоличествоДнейРезерва*60*60*24,"ДФ=dd.MM.yyyy"));
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#АдресСамовывоза",ЗаказПокупателя.Организация.Подразделение.АдресСамовывозаДляПисьма);
////	
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо();
////		
////		Менеджер                   = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = Письмо.Тема;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.Статус 		   = СтатусЗаказа;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		
////		Менеджер.Записать();
////	Иначе
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);		
////		
////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Ваш заказ зарегистрирован в Интернет-магазине ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован в Интернет-магазине ""7detalei.ru""";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаЗарегистрированЗаказ").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("Подвал").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("Строка").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЭтотОбъект.СтрокиЗаказа цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","Зарегистрирован");
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо();
////		
////		Менеджер                   = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = Письмо.Тема;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.Статус 		   = СтатусЗаказа;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		
////		Менеджер.Записать();
////		
////	КонецЕсли;
////	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьЗаказКлиенту1из3ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
				
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);		
////		
////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента +",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		ТекстСМС = "Товар по зак "+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();

		
		
	КонецПроцедуры

Процедура ОтправитьЗаказКлиенту2из3ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);		
////		
////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента +",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","Отправлен");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		ТекстСМС = "Товар по зак "+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту3из3ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);		
////		
////		
////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = " ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		
////		ТекстСМС = "Товар по зак "+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту1из2ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);
////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		//ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		
////		
////		ТекстСМС = "Товар по зак "+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту2из2ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		//
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);

////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
//////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		//ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо();
////		
////		
////		
////		
////		ТекстСМС = "Товар по зак "+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();

КонецПроцедуры

Процедура ОтправитьЗаказКлиенту1из1ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		//ЕмейлКлиента  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
////		//
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);

////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ зарегистрирован ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","Отправлен в транспортную компанию");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		//ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		
////		
////		ТекстСМС = "Товар по зак."+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		попытка
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();
////	Исключение
////		КонецПопытки;
КонецПроцедуры

Процедура ГотовКОтгрузкеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	ЗапросПоСтатусамПодчиненныхЗадач = новый Запрос;
	ЗапросПоСтатусамПодчиненныхЗадач.Текст = "ВЫБРАТЬ
	                                         |	БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа,
	                                         |	БП_ОбработкаСтрокиЗаказа.Ссылка КАК КоличествоСтрок
	                                         |ИЗ
	                                         |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                                         |ГДЕ
	                                         |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес = &РодительскийБизнесПроцес
	                                         |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа";
	ЗапросПоСтатусамПодчиненныхЗадач.УстановитьПараметр("РодительскийБизнесПроцес",ЭтотОбъект.Ссылка);
	ЗапросПоСтатусамПодчиненныхЗадач.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	РезультатЗапроса = ЗапросПоСтатусамПодчиненныхЗадач.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество()>0 Тогда 
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;

	
КонецПроцедуры

Процедура СвязатьсяСКлиентомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого задача из ФормируемыеЗадачи цикл
		задача.подразделение = ЗаказПокупателя.Подразделение;	
	КонецЦикла;
КонецПроцедуры

Процедура ПереводВСтатусСборкаЗаказаОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.СборкаЗаказа;
	ЭтотОбъект.Записать();	
КонецПроцедуры

Процедура ПереводВСтатусЗаказПолученОбработка(ТочкаМаршрутаБизнесПроцесса)
	ЭтотОбъект.СтатусЗаказа = Перечисления.БП_СтатусыЗаказов.ЗаказПолучен;
	ЭтотОбъект.Записать();
КонецПроцедуры

Процедура СамовывозОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ЗаказПокупателяОб     = ЗаказПокупателя.получитьОбъект();
	Для каждого СтрокаЗаказа из ЗаказПокупателяОб.Товары цикл 
		СтрокаЗаказа.СпособДоставки = Перечисления.БП_СпособыДоставки.Самовывоз;
		СтрокаЗаказа.Склад		    = СтрокаЗаказа.Размещение;
	КонецЦикла;
	
	Для каждого СтрокаЗаказа из СтрокиЗаказа цикл 
		СтрокаЗаказа.СпособДоставки = Перечисления.БП_СпособыДоставки.Самовывоз;
		СтрокаЗаказа.СкладВыдачи    = СтрокаЗаказа.Размещение;
	КонецЦикла;

	ЗаказПокупателяОб.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ПересылКлиентаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	////Если ЗаказПокупателя.ПересылКлиента тогда
	////	Результат = Истина;
	////иначе
	////	Результат = Ложь;
	////КонецЕсли;
КонецПроцедуры

Процедура ОтправитьСМСЗаказВыполненОбработка(ТочкаМаршрутаБизнесПроцесса)
	////Контрагент  = ЗаказПокупателя.Контрагент;
	////НомерТелефона = ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);

	////Попытка
	////	ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("В "+ЗаказПокупателя.Подразделение+ " заказ "+ ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" выполнен", НомерТелефона);
	////	//ОправитьСМС = Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().отправитьСМС("Заказ номер " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" выполнен.", "+380936839334"); 	
	////Исключение	
	////КонецПопытки;
	////
	////Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
	////Менеджер.Активность = Истина;
	////Менеджер.Период = ТекущаяДата();
	////Менеджер.ЗаказПокупателя = ЗаказПокупателя;
	////Менеджер.СодержаниеСобытия = "Отправленно SMS : Заказ " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" выполнен.";
	////Менеджер.ТипСобытия = Перечисления.БП_ТипыСобытий.sms;
	////Менеджер.Ответственный = Справочники.Пользователи.Система;
	////Менеджер.Статус = СтатусЗаказа;
	////Менеджер.СсылкаНаОбъект = "Отправленно SMS : Заказ " + ?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер)+" выполнен.";

	////Менеджер.Записать();

КонецПроцедуры

Процедура ОтправитьЕмейлЗаказВыполненОбработка(ТочкаМаршрутаБизнесПроцесса)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);

////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Ваш заказ выполнен. Интернет магазин ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "Ваш заказ Выполнен ";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("УведомлениеОВыполенииЗаказа").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОВыполненииЗаказа").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОВыполненииЗаказа").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из ЭтотОбъект.СтрокиЗаказа цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус",СтрокаЗаказа.СтатусСтрокиЗаказа);
////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность = Истина;
////		Менеджер.Период 		   = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = Письмо.Тема;
////		Менеджер.ТипСобытия 	   = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.Статус 		   = СтатусЗаказа;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;

////		Менеджер.Записать();

КонецПроцедуры

Процедура ВсеЕстьНаОстаткеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	НетНаОстатке = Ложь;
	
	Для каждого строка Из СтрокиЗаказа цикл
		
		Если строка.НетНаСкладе или строка.ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ЗаказатьУПоставщика Тогда 
			НетНаОстатке = строка.НетНаСкладе или строка.ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ЗаказатьУПоставщика;
		КонецЕсли;
		
	КонецЦикла;
	Результат = не НетНаОстатке;
КонецПроцедуры

Функция ПроверитьОстатокНаскладе(Номенклатура,ХарактеристикаНоменклатуры)
	
		КоличествоОстаток =0;
		ЗапросПоОстатку = новый запрос;
		ЗапросПоОстатку.Текст = "ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Дата,
		|				Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ТоварыНаСкладахОстатки";
		ЗапросПоОстатку.УстановитьПараметр("Дата",ТекущаяДата());
		ЗапросПоОстатку.УстановитьПараметр("Номенклатура",Номенклатура);
		ЗапросПоОстатку.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
		РезультатЗапроса = ЗапросПоОстатку.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда 
			Возврат РезультатЗапроса.КоличествоОстаток; 
		Иначе
			Возврат 0;
		КонецЕсли;
КонецФункции


Процедура ЗаполенениеТЧСтрокиЗаказаОбработка(ТочкаМаршрутаБизнесПроцесса)
	Подразделение = ?(ЗначениеЗаполнено(ЗаказПокупателя.Подразделение),ЗаказПокупателя.Подразделение,Справочники.Подразделения.НайтиПоКоду("4"));
	СтрокиЗаказа.Очистить();
	Для каждого СтрокаЗаказа из ЗаказПокупателя.Товары цикл
		
		СтрокаБП = СтрокиЗаказа.Добавить();
		СтрокаБП.Номенклатура 		= СтрокаЗаказа.Номенклатура;
		СтрокаБП.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
		СтрокаБП.Количество   		= СтрокаЗаказа.Количество;
		СтрокаБП.Цена         		= СтрокаЗаказа.Цена;
		СтрокаБП.СкладВыдачи        = СтрокаЗаказа.Размещение;
		СтрокаБП.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.Зарегистрирован;
		СтрокаБП.АдресДоставки  	= "22222222222";
		СтрокаБП.СпособДоставки 	= "22222222222";
		СтрокаБП.Количество			= СтрокаЗаказа.Количество;	
		СтрокаБП.НетНаСкладе		=?(ПроверитьОстатокНаскладе(СтрокаЗаказа.Номенклатура,СтрокаЗаказа.ХарактеристикаНоменклатуры)>=СтрокаЗаказа.Количество,Ложь,Истина);
		////СтрокаБП.Комментарий		= СтрокаЗаказа.КомментарийДоставки;
		СтрокаБП.Размещение         = СтрокаЗаказа.Размещение;
		СтрокаБП.ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ВыборНеТребуется;
		////Если не ЗначениеЗаполнено(СтрокаБП.Размещение) и не ЗначениеЗаполнено(СтрокаБП.ХарактеристикаНоменклатуры) Тогда 
		////	СтрокаБП.ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ЗаказатьУПоставщика;	
		////КонецЕсли;
					
		////СтрокаБП.ПеремещениеПодОтветственностьМенеджера = СтрокаЗаказа.ПеремещениеПодОтветственностьМенеджера;
	КонецЦикла;
	
	ЭтотОбъект.Записать();

КонецПроцедуры


Процедура ПроставитьПоставщиковНаТоварКоторогоНетНаСкладеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.подразделение = ЭтотОбъект.ЗаказПокупателя.Подразделение;
		Если не ЗначениеЗаполнено(задача.подразделение) Тогда  
			Если ЭтотОбъект.ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
				задача.подразделение  = Справочники.Подразделения.НайтиПоКоду("4"); 
			КонецЕсли;
		КонецЕсли;
		Задача.заказПокупателя = ЗаказПокупателя;
	КонецЦикла;
	
КонецПроцедуры


Процедура ЕстьОстатокПокупателяПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ry_ОбщиеПроцедуры.ЕстьДСКлиента(ЗаказПокупателя);
КонецПроцедуры

Функция ПолучитьРеализацию(ЗаказПокупателя)
	ЗапросПоРеализации = новый запрос;
	ЗапросПоРеализации.Текст = "ВЫБРАТЬ
	                           |	РеализацияТоваровУслуг.Ссылка
	                           |ИЗ
	                           |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                           |ГДЕ
	                           |	РеализацияТоваровУслуг.Проведен
	                           |	И РеализацияТоваровУслуг.Сделка = &ЗаказПокупателя";
	ЗапросПоРеализации.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	РезультатЗапроса = ЗапросПоРеализации.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].ССылка;
	иначе      
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ОтправитьЗаказКлиенту1из3ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОтгрузитьЗаказСклад1из4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция ПолучитьДокументДвиженияСтрок(ЗаказПокупателя)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыСтрокЗаказаОбороты.Регистратор
	               |ИЗ
	               |	РегистрНакопления.СтатусыСтрокЗаказа.Обороты(, , Регистратор, ) КАК СтатусыСтрокЗаказаОбороты
	               |ГДЕ
	               |	СтатусыСтрокЗаказаОбороты.СтрокаЗаказа.ЗаказПокупателя = &ЗаказПокупателя";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Регистратор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Процедура Склад5из5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[4]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[4];
		Задача.Подразделение = МассивСкладов[4].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура Склад1из5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[0]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[0];
		Задача.Подразделение = МассивСкладов[0].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.заказПокупателя = ЗаказПокупателя;	
	КонецЦикла;
	
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура Склад2из5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[1]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[1];
		Задача.Подразделение = МассивСкладов[1].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.заказПокупателя = ЗаказПокупателя;	
	КонецЦикла;
	
	Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура Склад3из5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[2]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[2];
		Задача.Подразделение = МассивСкладов[2].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура Склад4из5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.БП_СпособыДоставки.Самовывоз)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[3]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи = МассивСкладов[3];
		Задача.Подразделение = МассивСкладов[3].Подразделение; 
		задача.ТипЗадачи = Перечисления.БП_ТипыЗадач.СобратьЗаказ;
		Задача.ЗаказПокупателя = ЗаказПокупателя;
	КонецЦикла;
Если задача.ТоварыКВыдачеКлиенту.Количество()=0 Тогда 
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьЗаказ5из5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Попытка
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[4]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[4];
		Задача.Подразделение = МассивСкладов[4].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки= АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;
		КонецЦикла;


	КонецЦикла;
Исключение
	//отказ=Истина;
КонецПопытки;
КонецПроцедуры

Процедура ОтправитьЗаказ5из5ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
////		Контрагент    = ЗаказПокупателя.Контрагент;	
////		ЕмейлКлиента  = ry_ОбщиеПроцедуры.ПолучитьАдресЭлектроннойПочты(Контрагент);		
////		
////		
////		//Если ЗначениеЗаполнено(ЕмейлКлиента) Тогда 	
////		//ОтправитьEmail();

////		// + 58813 ДДГ  2 май 2023
////		Организация   = ЗаказПокупателя.Организация;

////		Локация = РазработкаСервер.БезопасноПолучитьЧерезЦепочкуРеквизитов(Организация, "Подразделение.Локация");

//////		ЕмейлОтправителя = "robot@7detalei.ru";
////		ЕмейлОтправителя = ry_ПолучениеДанных.ПолучитьЕмейлДляАвтоматическойРассылкиПоЛокации(Локация);
////		// - 58813 ДДГ  2 май 2023

////		Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
////		Письмо.УчетнаяЗапись	 = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию(ЕмейлОтправителя);
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
////		Письмо.Тема 			 = "Уведомление об отправке товара ""7detalei.ru""";
////		Письмо.Дата              = ТекущаяДата();
////		Письмо.ЕстьВложения      = Ложь;
////		Письмо.ВидТекстаПисьма   = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
////		Письмо.КодировкаПисьма   = "koi8-r";
////		Письмо.ЗаголовокПисьма   = "#Заказ " + ЗаказПокупателя.Номер;
////		Письмо.ОтправительАдресЭлектроннойПочты =  ЕмейлОтправителя;
////		Письмо.Кому              = ЕмейлКлиента+",Sale@7detalei.ru";
////		Письмо.КомуПредставление = Контрагент.Наименование;
////		Письмо.ОтправительИмя    = "Интернет магазин ""7detalei.ru""";
////		Письмо.ТекстПисьма       = "";
////		Письмо.ПроверитьЗаполнение();
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = ЕмейлКлиента;
////		Получатели.Представление 	     = Контрагент.Наименование;
////		
////		Получатели = Письмо.КомуТЧ.Добавить();
////		Получатели.АдресЭлектроннойПочты = "sale@7detalei.ru";
////		Получатели.Представление 	     = Контрагент.Наименование;
////		Письмо.Записать();
////		
////		
////		ТекстШапка  = ПолучитьМакет("ШапкаУведомлениеОбОтправке").ПолучитьТекст();
////		ТекстПодвал = ПолучитьМакет("ПодвалУведомлениеОбОтправке").ПолучитьТекст(); 
////		ТекстСтрока = ПолучитьМакет("СтрокаУведомлениеОбОтправке").ПолучитьТекст();  
////		
////		ТекстПисьма = ТекстШапка;
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"%НомерЗаказа%",?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер));
////		ТекстПисьма = СтрЗаменить(ТекстПисьма,"#ДатаЗаказа",Формат(ЗаказПокупателя.Дата,"ДФ=dd.MM.yyyy"));
////		
////		
////		Количество = 0;                                          
////		Сумма      = 0;
////		
////		Для Каждого СтрокаЗаказа из Задача.ТоварыКВыдачеКлиенту цикл
////			ЛокальныйТекстСтроки = ТекстСтрока;
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Наименование",СтрокаЗаказа.Номенклатура.Артикул + " " +СтрокаЗаказа.Номенклатура + " "+СтрокаЗаказа.ХарактеристикаНоменклатуры);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Количество",СтрокаЗаказа.Количество);
////			//ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Сумма",СтрокаЗаказа.Цена*СтрокаЗаказа.Количество);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#Статус","В работе");
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#ДатаОтправки",СтрокаЗаказа.ДатаОтправки);
////			ЛокальныйТекстСтроки = СтрЗаменить(ЛокальныйТекстСтроки,"#НомерТТН",СтрокаЗаказа.НомерТТН);

////			ТекстПисьма = ТекстПисьма + ЛокальныйТекстСтроки;
////			Количество  = Количество  + СтрокаЗаказа.Количество;
////			//Сумма = Сумма + СтрокаЗаказа.Количество*СтрокаЗаказа.Цена;
////		КонецЦикла;
////		
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоКоличество",Количество);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#ИтогоСумма",Сумма);
////		ТекстПодвал = СтрЗаменить(ТекстПодвал,"#СпособДоставки",ЗаказПокупателя.АдресДоставки);
////		
////		ТекстПисьма = ТекстПисьма + ТекстПодвал; 	
////		
////		Письмо.ТекстПисьма = ТекстПисьма;
////		Письмо.ОтправитьПисьмо(); 
////		
////		
////		
////		ТекстСМС = "Товар по зак "+?(ЗначениеЗаполнено(ЗаказПокупателя.СайтНомер),ЗаказПокупателя.СайтНомер,ЗаказПокупателя.Номер) 
////		+" отправлен из "+Задача.подразделение + ".ТК "+Лев(СтрокаЗаказа.ТК,10)+" ТТН " +Лев(СтрокаЗаказа.НомерТТН,14);
////		
////		Константы.БП_ИспользуемыйSMSШлюз.Получить().ПолучитьОбъект().ОтправитьСМС(ТекстСМС,ry_ОбщиеПроцедуры.ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент));
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = ТекстСМС;
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.sms;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = ТекстСМС;
////		Менеджер.Записать();
////		
////		Менеджер = РегистрыСведений.ЛегендаЗаказа.СоздатьМенеджерЗаписи();
////		Менеджер.Активность        = Истина;
////		Менеджер.Период            = ТекущаяДата();
////		Менеджер.ЗаказПокупателя   = ЗаказПокупателя;
////		Менеджер.СодержаниеСобытия = "Уведомление об отправке товара";
////		Менеджер.ТипСобытия        = Перечисления.БП_ТипыСобытий.email;
////		Менеджер.Ответственный     = Справочники.Пользователи.Система;
////		Менеджер.СсылкаНаОбъект    = Письмо.Ссылка;
////		Менеджер.Записать();

КонецПроцедуры

Процедура Действие23ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗапросПоСкладам = новый Запрос;
	ЗапросПоСкладам.Текст = "ВЫБРАТЬ
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи КАК Склад
	                        |ИЗ
	                        |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                        |ГДЕ
	                        |	БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                        |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                        |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки = ЗНАЧЕНИЕ(перечисление.БП_СпособыДоставки.ДоставкаКлиенту)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи";
	ЗапросПоСкладам.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ЗапросПоСкладам.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	
	МассивСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("склад");
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БП_ОбработкаСтрокиЗаказа.Номенклатура,
	                |	БП_ОбработкаСтрокиЗаказа.ХарактеристикаНоменклатуры,
	                |	БП_ОбработкаСтрокиЗаказа.Количество,
	                |	БП_ОбработкаСтрокиЗаказа.Цена,
	                |	БП_ОбработкаСтрокиЗаказа.АдресДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СпособДоставки,
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи
	                |ИЗ
	                |	БизнесПроцесс.БП_ОбработкаСтрокиЗаказа КАК БП_ОбработкаСтрокиЗаказа
	                |ГДЕ
	                |	БП_ОбработкаСтрокиЗаказа.СкладВыдачи = &СкладВыдачи
	                |	И БП_ОбработкаСтрокиЗаказа.СтатусСтрокиЗаказа = &СтатусСтрокиЗаказа
	                |	И БП_ОбработкаСтрокиЗаказа.РодительскийБизнесПроцес.Ссылка = &Ссылка
	                |	И БП_ОбработкаСтрокиЗаказа.СпособДоставки В(&СпособДоставки)";
	Запрос.УстановитьПараметр("СкладВыдачи",МассивСкладов[3]);
	Запрос.УстановитьПараметр("СтатусСтрокиЗаказа",Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);

	
	МассивСпособовДоствки = новый Массив;
	МассивСпособовДоствки.Добавить(Перечисления.БП_СпособыДоставки.ДоставкаКлиенту);
	Запрос.УстановитьПараметр("СпособДоставки",МассивСпособовДоствки);
	
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
		
	Для каждого задача из ФормируемыеЗадачи Цикл 
		задача.ТоварыКВыдачеКлиенту.загрузить(РезультатЗапроса);
		задача.складВыдачи   = МассивСкладов[3];
		Задача.Подразделение = МассивСкладов[3].Подразделение; 
		Задача.типЗадачи     = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		задача.Заказпокупателя = ЗаказПокупателя;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("АдресДоставки");
	Для каждого АдресДоствкаСтр из РезультатЗапроса цикл
		ДокументДоставки = Документы.УД_Доставка.СоздатьДокумент();
		ДокументДоставки.Дата = ТекущаяДата();
		ДокументДоставки.ПаспортныеДанныеПолучателя =АдресДоствкаСтр.АдресДоставки.ПаспортныеДанныеПолучателя;
		ДокументДоставки.АдресДоставки = АдресДоствкаСтр.АдресДоставки.АдресДоставки;
		ДокументДоставки.Получатель    = АдресДоствкаСтр.АдресДоставки.Получатель;
		ДокументДоставки.Телефон       = АдресДоствкаСтр.АдресДоставки.Телефон;
		ДокументДоставки.ИНН   		   = АдресДоствкаСтр.АдресДоставки.ИНН;
		ДокументДоставки.ТипПеревозки  = АдресДоствкаСтр.АдресДоставки.ТипПеревозки;
		ДокументДоставки.ТранспортнаяКомпания = АдресДоствкаСтр.АдресДоставки.ТранспортнаяКомпания;
		ДокументДоставки.ОплатаДоставки= АдресДоствкаСтр.АдресДоставки.ОплатаДоставки;
		ДокументДоставки.ДокументОснование = ЭтотОбъект.ЗаказПокупателя;
		ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
		
		
		Отбор = новый Структура("АдресДоставки",АдресДоствкаСтр.АдресДоставки);
		Строки = задача.ТоварыКВыдачеКлиенту.НайтиСтроки(Отбор);
		Для каждого строкаТоварыКВыдачи из Строки Цикл 
			строкаТоварыКВыдачи.ДокументДоставки = ДокументДоставки.Ссылка;
			строкаТоварыКВыдачи.ТК = ДокументДоставки.ТранспортнаяКомпания;
		КонецЦикла;


	КонецЦикла;

КонецПроцедуры

Процедура ПеренестиДанныеВЗаказОбработка(ТочкаМаршрутаБизнесПроцесса)
	Для Каждого Строка из СтрокиЗаказа цикл
		Попытка
			ЗаказПокупателяОб = ЗаказПокупателя.ПолучитьОбъект();
			////ЗаказПокупателяОб.Товары[СтрокиЗаказа.Индекс(Строка)].Склад  = строка.СкладВыдачи;
			////ЗаказПокупателяОб.Товары[СтрокиЗаказа.Индекс(Строка)].СпособДоставки  = строка.СпособДоставки;
			////ЗаказПокупателяОб.Товары[СтрокиЗаказа.Индекс(Строка)].АдресДоставки   = строка.АдресДоставки;
			ЗаказПокупателяОб.СкладГруппа  = строка.СкладВыдачи;
			ЗаказПокупателяОб.СпособДоставки  = строка.СпособДоставки;
			ЗаказПокупателяОб.АдресДоставки   = строка.АдресДоставки;
			ЗаказПокупателяОб.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
