// +++ А_ИТ4Б Ересько 2016-05-12 {Добавлен общий модуль} 

Процедура ПереключитьОрганизации(ВыбраннаяОрганизация, ТекПользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Узнаем в какой группе пользователей находится текущий пользователь 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыПользователейПользователиГруппы.Ссылка КАК ГруппаПользователя
	|ИЗ
	|	Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
	|		ПО ГруппыПользователейПользователиГруппы.Ссылка = НастройкиПравДоступаПользователей.Пользователь
	|			И (НастройкиПравДоступаПользователей.ВидОбъектаДоступа = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовДоступа.Организации))
	|ГДЕ
	|	ГруппыПользователейПользователиГруппы.Пользователь = &ТекПользователь
	|	И НЕ НастройкиПравДоступаПользователей.ОбъектДоступа ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Удаляем пользователя с групп
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГруппаПользователяОбъект = ВыборкаДетальныеЗаписи.ГруппаПользователя.ПолучитьОбъект();
		СтрокаТЧ = ГруппаПользователяОбъект.ПользователиГруппы.Найти(ТекПользователь);
		ГруппаПользователяОбъект.ПользователиГруппы.Удалить(СтрокаТЧ);
		ГруппаПользователяОбъект.Записать()
		
	КонецЦикла;
	
	//Получаем группы пользователей, в которые нужно добавить текущего пользователя
	МассивГрупп = Новый Массив;
	
	Если ВыбраннаяОрганизация = "Все организации" Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеГруппПользователяОрганизациям.ГруппаПользователя
		|ИЗ
		|	Справочник.Пользователи.А_ДоступныеОрганизации КАК ПользователиА_ДоступныеОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.А_СоответствиеГруппПользователяОрганизациям КАК А_СоответствиеГруппПользователяОрганизациям
		|		ПО ПользователиА_ДоступныеОрганизации.Организация = А_СоответствиеГруппПользователяОрганизациям.Организация
		|ГДЕ
		|	ПользователиА_ДоступныеОрганизации.Ссылка = &ТекПользователь";
		
		Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивГрупп.Добавить(ВыборкаДетальныеЗаписи.ГруппаПользователя)
		КонецЦикла;
		
	Иначе 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СоответствиеГруппПользователяОрганизациям.ГруппаПользователя
		|ИЗ
		|	РегистрСведений.А_СоответствиеГруппПользователяОрганизациям КАК А_СоответствиеГруппПользователяОрганизациям
		|ГДЕ
		|	А_СоответствиеГруппПользователяОрганизациям.ПредставлениеОрганизации = &ПредставлениеОрганизации";
		
		Запрос.УстановитьПараметр("ПредставлениеОрганизации", ВыбраннаяОрганизация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивГрупп.Добавить(ВыборкаДетальныеЗаписи.ГруппаПользователя)
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ГруппаПользователя Из МассивГрупп Цикл
		
		ГруппаБУОбъект = ГруппаПользователя.ПолучитьОбъект();
		НоваяСтрока = ГруппаБУОбъект.ПользователиГруппы.Добавить();
		НоваяСтрока.Пользователь = ТекПользователь;
		ГруппаБУОбъект.Записать();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьСписокОрганизаций(ТекПользователь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОрганизаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользователиА_ДоступныеОрганизации.Организация
	|ИЗ
	|	Справочник.Пользователи.А_ДоступныеОрганизации КАК ПользователиА_ДоступныеОрганизации
	|ГДЕ
	|	ПользователиА_ДоступныеОрганизации.Ссылка = &ТекПользователь";
	
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КолЗаписей = ВыборкаДетальныеЗаписи.Количество();	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОрганизаций.Добавить(ВыборкаДетальныеЗаписи.Организация.Наименование);
	КонецЦикла;
	
	Если КолЗаписей > 1 Тогда 
		МассивОрганизаций.Добавить("Все организации")
	КонецЕсли;
	
	Возврат МассивОрганизаций;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

//
// Параметры СчетНаОплатуПокупателю - ДокументСсылка СчетНаОплатуПокупателю
//
Функция ПроверитьИспользованиеСчетаВДокументах(СчетНаОплатуПокупателю) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивИскомых = Новый Массив;
	МассивИскомых.Добавить(СчетНаОплатуПокупателю);

	МассивОбластьПоиска = Новый Массив;

	МассивВключаемые = Новый Массив;
	МассивВключаемые.Добавить(Метаданные.Документы.ПлатежноеПоручениеВходящее);
	МассивВключаемые.Добавить(Метаданные.Документы.НалоговаяНакладная);
	МассивВключаемые.Добавить(Метаданные.Документы.РеализацияТоваровУслуг);
	
	ТабЗнч = НайтиПоСсылкам(МассивИскомых, МассивОбластьПоиска, МассивВключаемые);
	
	ТекстСообщенияСсылокНаОбъект = "";
	
	Для Каждого СтрокаТЗ Из ТабЗнч Цикл
		
		Если СтрокаТЗ.Метаданные <> Метаданные.Документы.ПлатежноеПоручениеВходящее
			И СтрокаТЗ.Метаданные <> Метаданные.Документы.НалоговаяНакладная
			И СтрокаТЗ.Метаданные <> Метаданные.Документы.РеализацияТоваровУслуг Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрокаТЗ.Данные.Проведен Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекстСообщенияСсылокНаОбъект = ТекстСообщенияСсылокНаОбъект + Символы.ПС + СтрокаТЗ.Данные
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстСообщенияСсылокНаОбъект
	
КонецФункции 
 
// Функция определяет адрес электронной почты объекта
//
// Параметры
//  Объект - СправочникСсылка, для которого необходимо определить адрес электронной почты
//
Функция ПолучитьСтруктуруАдресаПолучателя(Объект,АдресДляПоиска=Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактнаяИнформация.Представление,
	               |	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	               |	КонтактнаяИнформация.Вид
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип";
	Если ЗначениеЗаполнено(АдресДляПоиска) Тогда
		Запрос.Текст = Запрос.Текст + " И КонтактнаяИнформация.Представление ПОДОБНО &Представление";
		Запрос.УстановитьПараметр("Представление", "%"+АдресДляПоиска+"%");
	КонецЕсли; 		   
	               
	
	Адрес = Новый Структура("Адрес,Вид","",Неопределено);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Индексы.Добавить("ЗначениеПоУмолчанию");
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрокаПоУмолчанию = ТаблицаЗапроса.Найти(Истина, "ЗначениеПоУмолчанию");
		Если СтрокаПоУмолчанию <> Неопределено Тогда
			Адрес.Вставить("Адрес",СтрокаПоУмолчанию.Представление);
			Адрес.Вставить("Вид",СтрокаПоУмолчанию.Вид);
		Иначе
			Адрес.Вставить("Адрес",ТаблицаЗапроса[0].Представление);
			Адрес.Вставить("Вид",ТаблицаЗапроса[0].Вид);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Адрес;

КонецФункции


Функция ПолучитьСвойствоОбъекта(пОбъект,пИмяСвойства) Экспорт 

	лСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(пИмяСвойства);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";

	Запрос.УстановитьПараметр("Объект", пОбъект);
	Запрос.УстановитьПараметр("Свойство", лСвойство);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;

	Возврат Неопределено;


КонецФункции // ПолучитьСвойствоОбъекта()
 
Функция ПолучитьВсеСвойстваОбъекта(пОбъект) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение КАК Значение,
		|	ЗначенияСвойствОбъектов.Свойство
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект";

	Запрос.УстановитьПараметр("Объект", пОбъект);

	Результат = Запрос.Выполнить().Выбрать();
	лСоот = Новый Соответствие;
	
	Пока Результат.Следующий() Цикл
		лСоот.Вставить(Результат.Свойство.Наименование,Результат.Значение);
	КонецЦикла; 

	Возврат лСоот;

КонецФункции // ПолучитьСвойствоОбъекта()

Процедура УстановитьСвойствоОбъекта(пОбъект,пИмяСвойства,пЗначение) Экспорт 

	пСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(пИмяСвойства);
	Если ЗначениеЗаполнено(пСвойство) И ЗначениеЗаполнено(пОбъект) Тогда
	
		НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(пОбъект);
		НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(пСвойство);
		УстановитьПривилегированныйРежим(Истина);	
		Если ЗначениеЗаполнено(пЗначение) Тогда
		
			НаборЗаписейЗначенияСвойств.Прочитать();
			
			Если НаборЗаписейЗначенияСвойств.Количество()=1 Тогда
				Запись = НаборЗаписейЗначенияСвойств[0];
				Если Запись.Значение = пЗначение Тогда
					Возврат; // значение не изменилось
				КонецЕсли; 
			Иначе	
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
			КонецЕсли;	
				Запись.Объект   = пОбъект;
				Запись.Свойство = пСвойство;
				Запись.Значение = пЗначение;
		КонецЕсли;	
		
		Попытка
			НаборЗаписейЗначенияСвойств.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		Исключение
			#Если Клиент Тогда
				Предупреждение(НСтр("ru='Не удалось записать значения свойств';uk='Не вдалося записати значення властивостей'") + Символы.ПС + ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры // ПолучитьСвойствоОбъекта()

Функция ПолучитьОрганизациюПоСобственномуКонтрагенту(Знач пКонтрагент,Знач пБУ) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_ВнутренниеКонтрагенты.Организация
		|ИЗ
		|	РегистрСведений.А_ВнутренниеКонтрагенты КАК А_ВнутренниеКонтрагенты
		|ГДЕ
		|	А_ВнутренниеКонтрагенты.Контрагент = &Контрагент
		|	И А_ВнутренниеКонтрагенты.Организация.А_БухгалтерскийУчет = &БУ";
	
	Запрос.УстановитьПараметр("Контрагент", пКонтрагент);
	Запрос.УстановитьПараметр("БУ", пБУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Организация,Неопределено);

КонецФункции // ПолучитьОрганизациюПоСобственномуКонтрагенту()
 
Функция ПолучитьСобственногоКонтрагентаПоОрганизации(пОрганизация) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_ВнутренниеКонтрагенты.Контрагент
		|ИЗ
		|	РегистрСведений.А_ВнутренниеКонтрагенты КАК А_ВнутренниеКонтрагенты
		|ГДЕ
		|	А_ВнутренниеКонтрагенты.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", пОрганизация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Контрагент,Неопределено);

КонецФункции // ПолучитьСобственногоКонтрагентаПоОрганизации()

Функция ПолучитьСвязанныйДокумент(пИзначальныйДокумент) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СвязанныеВнутренниеДокументы.СвязанныйДокумент
		|ИЗ
		|	РегистрСведений.А_СвязанныеВнутренниеДокументы КАК А_СвязанныеВнутренниеДокументы
		|ГДЕ
		|	А_СвязанныеВнутренниеДокументы.ИзначальныйДокумент = &ИзначальныйДокумент";
	
	Запрос.УстановитьПараметр("ИзначальныйДокумент", пИзначальныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(),Выборка.СвязанныйДокумент,Неопределено);

КонецФункции // ПолучитьСвязанныйДокумент()

Процедура УстановитьСвязанныйДокумент(пИзначальныйДокумент,пСвязанныйДокумент) Экспорт 

	лРС = РегистрыСведений.А_СвязанныеВнутренниеДокументы.СоздатьМенеджерЗаписи();
	лРС.ИзначальныйДокумент = пИзначальныйДокумент;
	лРС.Прочитать();
	лРС.ИзначальныйДокумент = пИзначальныйДокумент;
	лРС.СвязанныйДокумент = пСвязанныйДокумент;
	лРС.Записать();

КонецПроцедуры
 
Функция ПолучитьИзначальныйДокументИзСвязанного(пДокумент) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_СвязанныеВнутренниеДокументы.ИзначальныйДокумент
		|ИЗ
		|	РегистрСведений.А_СвязанныеВнутренниеДокументы КАК А_СвязанныеВнутренниеДокументы
		|ГДЕ
		|	А_СвязанныеВнутренниеДокументы.СвязанныйДокумент = &СвязанныйДокумент";
	
	Запрос.УстановитьПараметр("СвязанныйДокумент", пДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(),Выборка.ИзначальныйДокумент,Неопределено);

КонецФункции // ПолучитьСвязанныйДокумент()

Функция ПолучитьТаблицуСертификатовИПроизводителей() Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_Сертификаты.Сертификат КАК Сертификат,
		|	А_Сертификаты.Производитель КАК Производитель
		|ИЗ
		|	РегистрСведений.А_Сертификаты КАК А_Сертификаты
		|
		|УПОРЯДОЧИТЬ ПО
		//|	Производитель,
		|	Сертификат";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьТаблицуСертификатовИПроизводителей()
 
Функция ПолучитьПроизводителяПоСертификату(пСертификат) Экспорт 

	рс = РегистрыСведений.А_Сертификаты.СоздатьМенеджерЗаписи();
	рс.Сертификат = СокрЛП(пСертификат);
	рс.Прочитать();
	Возврат ?(рс.Выбран(),рс.Производитель,Неопределено);

КонецФункции 

Процедура ОтправкаУведомлений() Экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмо.Ссылка
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	               |ГДЕ
	               |	ЭлектронноеПисьмо.Уведомление
	               |	И ЭлектронноеПисьмо.ДатаТранспорта = &ДатаОтправления
	               |	И ЭлектронноеПисьмо.УчетнаяЗапись = &УчетнаяЗапись";
	Запрос.УстановитьПараметр("ДатаОтправления",Дата(1,1,1));
	Запрос.УстановитьПараметр("УчетнаяЗапись",Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001"));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат из РезультатЗапроса цикл
		Попытка
			
			Об = СтрокаРезультат.ссылка.ПолучитьОбъект();	
			об.ОтправитьПисьмо();
			Об.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьЗаписьЛогирования(стрДанные) Экспорт
	
	МенЗап = РегистрыСведений.Логирование.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенЗап, стрДанные);
	МенЗап.Записать(Ложь);
	
КонецПроцедуры

#Область ОтправкаПоПочте	

Процедура ОтправитьПоПочте(стрДанные) Экспорт
	
	ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
	ПутьСохранения = Неопределено;
	Если стрДанные.Документ = "Приходный" Тогда
		
		Приходный = стрДанные.Приходный;
		ЗаказПоставщику = Приходный.ДокументОснования;
		
		СписокПолучателей = Новый СписокЗначений;
		ЗаполнитьСписокПолучателей(СписокПолучателей, Приходный.Проект);
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Организация", ЗаказПоставщику.Организация);
		стрПараметры.Вставить("Склад", Приходный.Склад);
		стрПараметры.Вставить("Подразделение", ЗаказПоставщику.Подразделение);
		стрПараметры.Вставить("Проект", ЗаказПоставщику.Проект);
		стрПараметры.Вставить("Дата", Приходный.Дата);
		стрПараметры.Вставить("Номер", Приходный.Номер);
		стрПараметры.Вставить("Приходный", Приходный);
		
		ТекстПисьма = "По замовленню " + Приходный.ДокументОснования.Номер +" отриманний товар згідно прибуткового ордера";
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(Приходный, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", Приходный.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Надходження по проекту " + Приходный.Проект);
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	ИначеЕсли стрДанные.Документ = "Поступление" Тогда
		
		Поступление = стрДанные.Поступление;
		
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.Добавить("k.kyka@vechir.ua");//y.volchenkov@vechir.ua	

		ТекстПисьма = "Надходження " + Поступление.Номер;
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Ввели надходження на рахунки ");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(, ПользовательОтправкиПоПочте);
		
	ИначеЕсли стрДанные.Документ = "Заявка" Тогда
		
		Заявка = стрДанные.Заявка;
		СписокПолучателей = Новый СписокЗначений;
		
		МассПользователей = Новый Массив;
		МассПользователей.Добавить(Заявка.Ответственный);
		МассПользователей.Добавить(Заявка.Заявитель);
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("МассПользователей", МассПользователей);
		ЗаполнитьПоФизЛицу(СписокПолучателей, стрПараметры);
		
		ТемаПисьма 	= "За заявкою  " + Заявка.Номер +" є оплата";
		ТекстПисьма = "За заявкою  " + Заявка.Номер +" є оплата. Проект " + Заявка.РасшифровкаПлатежа[0].Проект;
		СписокВложений = Новый СписокЗначений;
		ФайлыЗаявки = ПолучитьВсеВложенияЗаявки(Заявка);
		Для Каждого стрФайл из ФайлыЗаявки Цикл
			стрФайла = Новый Структура;
			стрФайла.Вставить("Хранилище", стрФайл.Файл);
			стрФайла.Вставить("ИмяФайла", стрФайл.ИмяФайла);
			СписокВложений.Добавить(стрФайла);
		КонецЦикла;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", ТемаПисьма);
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(, ПользовательОтправкиПоПочте);
		
		
	ИначеЕсли стрДанные.Документ = "Перемещение" Тогда
		
		Перемещение = стрДанные.Перемещение;
		
		СписокПолучателей = Новый СписокЗначений;
		
		ЗаполнитьСписокПолучателейПоСкладу(СписокПолучателей, Перемещение.СкладПолучатель);
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей = Новый СписокЗначений;
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		КонецЕсли;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Организация", Перемещение.Организация);
		стрПараметры.Вставить("Склад", Перемещение.СкладПолучатель);
		стрПараметры.Вставить("Подразделение", Перемещение.Подразделение);
		стрПараметры.Вставить("Проект", Перемещение.ПроектПолучатель);
		стрПараметры.Вставить("Дата", Перемещение.Дата);
		стрПараметры.Вставить("Номер", Перемещение.Номер);
		стрПараметры.Вставить("Перемещение", Перемещение);
		
		ТекстПисьма = "На склад " + Перемещение.СкладПолучатель +" переміщений товар";
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(Перемещение, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", Перемещение.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Переміщення на склад " + Перемещение.СкладПолучатель);
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	ИначеЕсли стрДанные.Документ = "ВводВЭксплуатациюОС" Тогда
		
		ВводВЭксплуатациюОС = стрДанные.ВводВЭксплуатациюОС;
		СписокПолучателей 	= Новый СписокЗначений;
		стрПараметры 		= Новый Структура;
		МассПользователей 	= Новый Массив;
		МассПользователей.Добавить(ВводВЭксплуатациюОС.МОЛБУ);
		стрПараметры.Вставить("МассПользователей", МассПользователей);
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		Иначе
			ЗаполнитьПоФизЛицу(СписокПолучателей, стрПараметры);
		КонецЕсли;
		
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Организация", ВводВЭксплуатациюОС.Организация);
		стрПараметры.Вставить("Номер", ВводВЭксплуатациюОС.Номер);
		стрПараметры.Вставить("Дата", ВводВЭксплуатациюОС.Дата);
		стрПараметры.Вставить("Склад", ВводВЭксплуатациюОС.Склад);
		стрПараметры.Вставить("Подразделение", ВводВЭксплуатациюОС.Подразделение);
		стрПараметры.Вставить("Ввод");
		
		тзДанные = ВводВЭксплуатациюОС.ОС.Выгрузить();		
		тзДанные.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзДанные.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		тзДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов(,,,Новый КвалификаторыЧисла(15,2)));
		
		тзДанные.ЗаполнитьЗначения(ВводВЭксплуатациюОС.Номенклатура, "Номенклатура");
		тзДанные.ЗаполнитьЗначения(ВводВЭксплуатациюОС.Номенклатура.ЕдиницаХраненияОстатков, "ЕдиницаИзмерения");
		тзДанные.ЗаполнитьЗначения(1, "Количество");
		
		ТекстПисьма = "Введено ОЗ в експлуатацію №" + ВводВЭксплуатациюОС.Номер;
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(ВводВЭксплуатациюОС, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", ВводВЭксплуатациюОС.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Введено ОЗ в експлуатацію");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	ИначеЕсли стрДанные.Документ = "Сервис" Тогда
		
		Сервис 				= стрДанные.Сервис;
		СписокПолучателей 	= Новый СписокЗначений;
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		Иначе
			ЗаполнитьПоДокументуСервис(СписокПолучателей, Сервис);
		КонецЕсли;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		//СписокПолучателей.Добавить("y.volchenkov@vechir.ua");//y.volchenkov@vechir.ua	
		
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Статус", Сервис.Статус);
		стрПараметры.Вставить("ДокументОснование", Сервис.ДокументОснование);
		стрПараметры.Вставить("Подразделение", Сервис.Подразделение);
		стрПараметры.Вставить("Контрагент", Сервис.Контрагент);
		стрПараметры.Вставить("Ответственный", Сервис.Ответственный);
		стрПараметры.Вставить("Организация", Сервис.Организация);
		стрПараметры.Вставить("ПричинаПоломки", Сервис.ПричинаПоломки);
		стрПараметры.Вставить("Номер", Сервис.Номер);
		стрПараметры.Вставить("Дата", Сервис.Дата);
		
		стрПараметры.Вставить("Сервис", Сервис);
		
		ТекстПисьма = "Заявка сервіс № " + Сервис.Номер + " від " + Формат(Сервис.Дата, "ДЛФ=Д")
		+ Символы.ПС + "Підрозділ " + Сервис.Подразделение;
		
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(Сервис, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", Сервис.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Сервис № " + Сервис.Номер + " від " + Формат(Сервис.Дата, "ДЛФ=Д") );
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	ИначеЕсли стрДанные.Документ = "Обходной" Тогда
		
		Обходной = стрДанные.Обходной;
		
		СписокПолучателей 	= Новый СписокЗначений;
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		Иначе
			СписокПолучателей = стрДанные.СписокПолучателей;
		КонецЕсли;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		Тело = "";
		Если стрДанные.Доступ.Количество() = 1 Тогда
			Доступ = стрДанные.Доступ[0];
			Тело = "Необхідно закрити доступ - " + Доступ +" для працівника " + Обходной.Сотрудник +". № "+Обходной.Номер;
		Иначе
			ТекстДоступов = "";
			сч = 1;
			Для Каждого стрДоступ из стрДанные.Доступ Цикл
				ТекстДоступов = ТекстДоступов + Символы.ПС + сч +". " + стрДоступ;	
				сч = сч + 1;
			КонецЦикла;
			Тело = "Необхідно закрити доступи: " + Символы.ПС + ТекстДоступов;
			
		КонецЕсли;
		
		ТекстПисьма = "Обхідний лист на звільнення працівника " + Обходной.Сотрудник +" № "+Обходной.Номер;
				
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тема", ТекстПисьма);
		СтрПисьма.Вставить("Тело", Тело);
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
	ИначеЕсли стрДанные.Документ = "ПередачаМНМА" Тогда
		
		ПередачаМНМА = стрДанные.ПередачаМНМА;
		
		СписокПолучателей 	= Новый СписокЗначений;
		стрПараметры 		= Новый Структура;
		МассПользователей 	= Новый Массив;
		Для Каждого СтрПользователь из ПередачаМНМА.МалоценныеАктивы Цикл
			Если МассПользователей.Найти(СтрПользователь.ФизЛицо) = Неопределено Тогда
				МассПользователей.Добавить(СтрПользователь.ФизЛицо);
			КонецЕсли;
		КонецЦикла;
		стрПараметры.Вставить("МассПользователей", МассПользователей);
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		Иначе
			ЗаполнитьПоДокументуПередачаМНМА(СписокПолучателей, стрПараметры);
		КонецЕсли;
		
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Организация", ПередачаМНМА.Организация);
		стрПараметры.Вставить("Номер", ПередачаМНМА.Номер);
		стрПараметры.Вставить("Дата", ПередачаМНМА.Дата);
		стрПараметры.Вставить("Склад", ПередачаМНМА.Склад);
		стрПараметры.Вставить("Подразделение", ПередачаМНМА.Подразделение);
				
		ТекстПисьма = "Передача малоцінки в експлуатацію №" + ПередачаМНМА.Номер;
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(ПередачаМНМА, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", ПередачаМНМА.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Передача малоцінки в експлуатацію");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	ИначеЕсли стрДанные.Документ = "ТабельУПР" Тогда
		
		ТабельУПР = стрДанные.ТабельУПР;
		
		СписокПолучателей 	= Новый СписокЗначений;
		стрПараметры 		= Новый Структура;
		МассПользователей 	= Новый Массив;
		МассПользователей.Добавить(ТабельУПР.Ответственный);
		стрПараметры.Вставить("МассПользователей", МассПользователей);
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");	
		Иначе
			ЗаполнитьПоФизЛицу(СписокПолучателей, стрПараметры);
		КонецЕсли;
		
		ТекстПисьма = "Був створенний табель обліку робочого часу за " + Формат(ТабельУПР.Дата, "ДЛФ=Д");
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Погодженя табелю");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
	ИначеЕсли стрДанные.Документ = "ЗадачаПользователя" Тогда
		
		ЗадачаПользователя = стрДанные.ЗадачаПользователя;
		
		СписокПолучателей 	= Новый СписокЗначений;
		стрПараметры 		= Новый Структура;
		МассПользователей 	= Новый Массив;
		Если ЗадачаПользователя.Выполнена Тогда
			МассПользователей.Добавить(ЗадачаПользователя.Инициатор);
		Иначе
			МассПользователей.Добавить(ЗадачаПользователя.Исполнитель);
		КонецЕсли;
		стрПараметры.Вставить("МассПользователей", МассПользователей);
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");
		Иначе
			ЗаполнитьПоФизЛицу(СписокПолучателей, стрПараметры);
		КонецЕсли;
		Если ЗадачаПользователя.Выполнена Тогда
			ТекстПисьма = "Задача №" + ЗадачаПользователя.НомерЗадачи + ". " + ЗадачаПользователя.Наименование + " була виконана";
		Иначе
			ТекстПисьма = "Ви отримали задачу №"+ ЗадачаПользователя.НомерЗадачи + ". " + ЗадачаПользователя.Наименование;
			ТекстПисьма = ТекстПисьма + Символы.ПС + ЗадачаПользователя.Описание + ".";
			ТекстПисьма = ТекстПисьма + Символы.ПС + "Виконати до: " + ЗадачаПользователя.СрокИсполнения;
		КонецЕсли;
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Задача користувача №" + ЗадачаПользователя.НомерЗадачи + ". " + ЗадачаПользователя.Наименование);
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		
		СписокВложений = Новый СписокЗначений;
		ФайлыЗаявки = ПолучитьВсеВложенияЗаявки(ЗадачаПользователя);
		Для Каждого стрФайл из ФайлыЗаявки Цикл
			стрФайла = Новый Структура;
			стрФайла.Вставить("Хранилище", стрФайл.Файл);
			стрФайла.Вставить("ИмяФайла", стрФайл.ИмяФайла);
			СписокВложений.Добавить(стрФайла);
		КонецЦикла;
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);

		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
	ИначеЕсли стрДанные.Документ = "ЧекККМ" Тогда
		
		ЧекККМ = стрДанные.ЧекККМ;
		
		СписокПолучателей 	= Новый СписокЗначений;
		стрПараметры 		= Новый Структура;
		
		СписокПолучателей.Добавить("byh@vechir.ua");
			
		ТекстПисьма = "ЧекККМ надійшов після 23:30, він не потрапив до Звіту про роздрібні продажі за " + Формат(ТекущаяДата(), "ДЛФ=Д");
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "ЧекККМ після 23:30");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
	ИначеЕсли стрДанные.Документ = "ВозвратТоваровОтПокупателя" Тогда
		
		ВозвратТоваровОтПокупателя	= стрДанные.ВозвратТоваровОтПокупателя;
		СписокПолучателей 			= Новый СписокЗначений;
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		Иначе
			ЗаполнитьПоДокументуВозвратТоваровПокупателя(СписокПолучателей, ВозвратТоваровОтПокупателя);
		КонецЕсли;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;

		ТекстПисьма = "Повернення товарів від покупця № " + ВозвратТоваровОтПокупателя.Номер + " від " + Формат(ВозвратТоваровОтПокупателя.Дата, "ДЛФ=Д")
		+ Символы.ПС + "Підрозділ " + ВозвратТоваровОтПокупателя.Подразделение;
		
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(ВозвратТоваровОтПокупателя, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", ВозвратТоваровОтПокупателя.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Повернення товарів від покупця № " + ВозвратТоваровОтПокупателя.Номер + " від " + Формат(ВозвратТоваровОтПокупателя.Дата, "ДЛФ=Д") );
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	ИначеЕсли стрДанные.Документ = "ВозвратПоТребованииНакладной" Тогда
		
		ВозвратПоТребованииНакладной	= стрДанные.ВозвратПоТребованииНакладной;
		СписокПолучателей 			= Новый СписокЗначений;
		
		ДляТеста = Ложь;
		Если ДляТеста Тогда
			СписокПолучателей.Добавить("");//y.volchenkov@vechir.ua	
		Иначе
			ЗаполнитьПоДокументуВозвратПоТребованииНакладной(СписокПолучателей, ВозвратПоТребованииНакладной);
		КонецЕсли;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;

		ТекстПисьма = "Повернення за вимогою накладної № " + ВозвратПоТребованииНакладной.Номер + " від " + Формат(ВозвратПоТребованииНакладной.Дата, "ДЛФ=Д")
		+ Символы.ПС + "Підрозділ " + ВозвратПоТребованииНакладной.Подразделение;
		
		СписокВложений = Новый СписокЗначений;
		стрФайла = Новый Структура;
		стрФайла.Вставить("Хранилище", СоздатьФайлЕксель(ВозвратПоТребованииНакладной, ПутьСохранения));
		стрФайла.Вставить("ИмяФайла", ВозвратПоТребованииНакладной.Номер + ".xls");
		СписокВложений.Добавить(стрФайла);
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Повернення за вимогою накладної № " + ВозвратПоТребованииНакладной.Номер + " від " + Формат(ВозвратПоТребованииНакладной.Дата, "ДЛФ=Д") );
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьма.Вставить("СписокФайловВложений", СписокВложений);
		
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		
		УдалитьФайлы(ПутьСохранения);
		
	КонецЕсли;
		
КонецПроцедуры

Функция СоздатьФайлЕксель(Док, ПутьСохранения = Неопределено)
	
	НазваниеДока = "";
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		НазваниеДока = "Прибутковий";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Номер КАК НомерДокумента,
		|	ПриходныйОрдерНаТовары.Дата КАК ДатаДокумента,
		|	ПриходныйОрдерНаТовары.Организация КАК Организация
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура.Артикул КАК Артикул,
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Товар,
		|	ПриходныйОрдерНаТоварыТовары.ЕдиницаИзмерения КАК ЕдИзм,
		|	ПриходныйОрдерНаТоварыТовары.СерияНоменклатуры КАК Серия,
		|	ПриходныйОрдерНаТоварыТовары.Количество КАК Количество
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|ГДЕ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Товары = Запрос.Выполнить().Выбрать();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСклад");
		ОбластьМакета.Параметры.Склад = Док.Склад;
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодразделение");
		ОбластьМакета.Параметры.Подразделение = Док.Подразделение;
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПроект");
		ОбластьМакета.Параметры.Проект = Док.Проект;
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.Товары.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока Товары.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		НазваниеДока = "Переміщення";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Номер КАК НомерДокумента,
		|	ПеремещениеТоваров.Дата КАК ДатаДокумента,
		|	ПеремещениеТоваров.Организация КАК Организация,
		|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель  КАК СкладПолучатель
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
		|	ПеремещениеТоваровТовары.Номенклатура КАК Товар,
		|	ПеремещениеТоваровТовары.ЕдиницаИзмерения КАК ЕдИзм,
		|	ПеремещениеТоваровТовары.СерияНоменклатуры КАК Серия,
		|	ПеремещениеТоваровТовары.Количество КАК Количество
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Товары = Запрос.Выполнить().Выбрать();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСкладОтправитель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСкладПолучатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодразделение");
		ОбластьМакета.Параметры.Подразделение = Док.Подразделение;
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПроект");
		ОбластьМакета.Параметры.Проект = Док.ПроектПолучатель;
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.Товары.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока Товары.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВводВЭксплуатациюОС") Тогда
		НазваниеДока = "ОЗ";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюОС.Номер КАК НомерДокумента,
		|	ВводВЭксплуатациюОС.Дата КАК ДатаДокумента,
		|	ВводВЭксплуатациюОС.Организация КАК Организация
		|ИЗ
		|	Документ.ВводВЭксплуатациюОС КАК ВводВЭксплуатациюОС
		|ГДЕ
		|	ВводВЭксплуатациюОС.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюОСОС.ОсновноеСредство КАК ОС,
		|	1 КАК Количество,
		|	ВводВЭксплуатациюОСОС.ОсновноеСредство.Код КАК Код
		|ИЗ
		|	Документ.ВводВЭксплуатациюОС.ОС КАК ВводВЭксплуатациюОСОС
		|ГДЕ
		|	ВводВЭксплуатациюОСОС.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		ОС = Запрос.Выполнить().Выбрать();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.ОС.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОСШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока ОС.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОССтрока");
				ОбластьМакета.Параметры.Заполнить(ОС);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.Сервис") Тогда
		НазваниеДока = "Сервіс";

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сервис.Номер КАК НомерДокумента,
		|	Сервис.Дата КАК ДатаДокумента,
		|	Сервис.Организация КАК Организация,
		|	Сервис.Контрагент,
		|	Сервис.Статус,
		|	Сервис.Ответственный,
		|	Сервис.Подразделение,
		|	Сервис.ДокументОснование,
		|	Сервис.ПричинаПоломки
		|ИЗ
		|	Документ.Сервис КАК Сервис
		|ГДЕ
		|	Сервис.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСтатус");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДокументОснование");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодразделение");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьКонтрагент");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПричинаПоломки");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОтветственный");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.Товары.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СервисТовары.ЕдиницаИзмерения КАК ЕдИзм,
			|	СервисТовары.Количество,
			|	СервисТовары.Номенклатура КАК Товар,
			|	СервисТовары.СерияНоменклатуры КАК Серия,
			|	СервисТовары.Номенклатура.Артикул КАК Артикул
			|ИЗ
			|	Документ.Сервис.Товары КАК СервисТовары
			|ГДЕ
			|	СервисТовары.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			Товары = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока Товары.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
		Если Док.Оборудование.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
			ТабДок.Вывести(ОбластьМакета);

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СервисОборудование.ЕдиницаИзмерения КАК ЕдИзм,
			|	СервисОборудование.Количество,
			|	СервисОборудование.Номенклатура КАК Товар,
			|	СервисОборудование.СерияНоменклатуры КАК Серия,
			|	СервисОборудование.Номенклатура.Артикул КАК Артикул
			|ИЗ
			|	Документ.Сервис.Оборудование КАК СервисОборудование
			|ГДЕ
			|	СервисОборудование.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			Оборудование = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока Оборудование.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(Оборудование);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
		Если Док.ОС.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
			ТабДок.Вывести(ОбластьМакета);

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СервисОС.Количество,
			|	СервисОС.ОсновноеСредство КАК ОС,
			|	СервисОС.ОсновноеСредство.Код КАК Код
			|ИЗ
			|	Документ.Сервис.ОС КАК СервисОС
			|ГДЕ
			|	СервисОС.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			ОС = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОСШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока ОС.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОССтрока");
				ОбластьМакета.Параметры.Заполнить(ОС);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПередачаМалоценкиВЭксплуатацию") Тогда
		
		НазваниеДока = "ПередачаМНМА";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаМалоценкиВЭксплуатацию.Номер КАК НомерДокумента,
		|	ПередачаМалоценкиВЭксплуатацию.Дата КАК ДатаДокумента,
		|	ПередачаМалоценкиВЭксплуатацию.Организация КАК Организация
		|ИЗ
		|	Документ.ПередачаМалоценкиВЭксплуатацию КАК ПередачаМалоценкиВЭксплуатацию
		|ГДЕ
		|	ПередачаМалоценкиВЭксплуатацию.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.МалоценныеАктивы.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы.Номенклатура КАК Товар,
			|	ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы.Количество,
			|	ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы.СерияНоменклатуры КАК Серия,
			|	ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы.ЕдиницаИзмерения КАК ЕдИзм,
			|	ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы.Номенклатура.Артикул КАК Артикул
			|ИЗ
			|	Документ.ПередачаМалоценкиВЭксплуатацию.МалоценныеАктивы КАК ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы
			|ГДЕ
			|	ПередачаМалоценкиВЭксплуатациюМалоценныеАктивы.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			МалоценныеАктивы = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока МалоценныеАктивы.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(МалоценныеАктивы);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		
		НазваниеДока = "Повернення товарів від покупця";

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Номер КАК НомерДокумента,
		|	ВозвратТоваровОтПокупателя.Дата КАК ДатаДокумента,
		|	ВозвратТоваровОтПокупателя.Организация КАК Организация,
		|	ВозвратТоваровОтПокупателя.Контрагент КАК Контрагент,
		|	ВозвратТоваровОтПокупателя.Ответственный КАК Ответственный,
		|	ВозвратТоваровОтПокупателя.Подразделение КАК Подразделение,
		|	ВозвратТоваровОтПокупателя.Сделка КАК ДокументОснование
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
				
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДокументОснование");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодразделение");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьКонтрагент");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
				
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОтветственный");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.Товары.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения КАК ЕдИзм,
			|	ВозвратТоваровОтПокупателяТовары.Количество,
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Товар,
			|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры КАК Серия,
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул КАК Артикул
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			|ГДЕ
			|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			Товары = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока Товары.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратПоТребованииНакладной") Тогда
		
		НазваниеДока = "Повернення за вимогою накладної";

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратПоТребованииНакладной.Номер КАК НомерДокумента,
		|	ВозвратПоТребованииНакладной.Дата КАК ДатаДокумента,
		|	ВозвратПоТребованииНакладной.Организация КАК Организация,
		|	ВозвратПоТребованииНакладной.Контрагент КАК Контрагент,
		|	ВозвратПоТребованииНакладной.Ответственный КАК Ответственный,
		|	ВозвратПоТребованииНакладной.Подразделение КАК Подразделение,
		|	ВозвратПоТребованииНакладной.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ВозвратПоТребованииНакладной КАК ВозвратПоТребованииНакладной
		|ГДЕ
		|	ВозвратПоТребованииНакладной.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабДок 	= Новый ТабличныйДокумент;
		Макет	= ПолучитьОбщийМакет("МакетРассылка");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
				
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДокументОснование");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодразделение");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьКонтрагент");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
				
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОтветственный");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
		ТабДок.Вывести(ОбластьМакета);
		
		Если Док.Материалы.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВозвратПоТребованииНакладнойМатериалы.ЕдиницаИзмерения КАК ЕдИзм,
			|	ВозвратПоТребованииНакладнойМатериалы.Количество КАК Количество,
			|	ВозвратПоТребованииНакладнойМатериалы.Номенклатура КАК Товар,
			|	ВозвратПоТребованииНакладнойМатериалы.СерияНоменклатуры КАК Серия,
			|	ВозвратПоТребованииНакладнойМатериалы.Номенклатура.Артикул КАК Артикул
			|ИЗ
			|	Документ.ВозвратПоТребованииНакладной.Материалы КАК ВозвратПоТребованииНакладнойМатериалы
			|ГДЕ
			|	ВозвратПоТребованииНакладнойМатериалы.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			Материалы = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока Материалы.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(Материалы);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
		Если Док.МатериалыЗаказчика.Количество() > 0 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПробел");
			ТабДок.Вывести(ОбластьМакета);

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВозвратПоТребованииНакладнойМатериалыЗаказчика.Количество,
			|	ВозвратПоТребованииНакладнойМатериалыЗаказчика.Номенклатура КАК Товар,
			|	ВозвратПоТребованииНакладнойМатериалыЗаказчика.СерияНоменклатуры КАК Серия,
			|	ВозвратПоТребованииНакладнойМатериалыЗаказчика.Номенклатура.Артикул КАК Артикул
			|ИЗ
			|	Документ.ВозвратПоТребованииНакладной.МатериалыЗаказчика КАК ВозвратПоТребованииНакладнойМатериалыЗаказчика
			|ГДЕ
			|	ВозвратПоТребованииНакладнойМатериалыЗаказчика.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Док);
			
			МатериалыЗаказчика = Запрос.Выполнить().Выбрать();
			
			ОбластьМакета = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьМакета);
			
			сч = 1;
			Пока МатериалыЗаказчика.Следующий() Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварыСтрока");
				ОбластьМакета.Параметры.Заполнить(МатериалыЗаказчика);
				ОбластьМакета.Параметры.НомерПП = сч;
				ТабДок.Вывести(ОбластьМакета);
				сч = сч + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПутьСохранения = КаталогВременныхФайлов() + НазваниеДока + "_" + Док.Номер + "_"+ СтрЗаменить(Формат(Док.Дата, "ДЛФ=Д"), ".", "_") + ".xls";
	ТабДок.Записать(ПутьСохранения, ТипФайлаТабличногоДокумента.XLS);
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьСохранения);
	Возврат ДвоичныеДанные;
		
КонецФункции

Функция ПолучитьВсеВложенияЗаявки(Заявка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Хранилище КАК Файл,
		|	ХранилищеДополнительнойИнформации.ИмяФайла
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьСписокПолучателей(СписокПолучателей, Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроектыОтветственныеЛица.Пользователь
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	Справочник.Проекты.ОтветственныеЛица КАК ПроектыОтветственныеЛица
		|ГДЕ
		|	ПроектыОтветственныеЛица.Ссылка = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Email
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				ВТ_Итог.Пользователь
		|			ИЗ
		|				ВТ_Итог КАК ВТ_Итог)
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПолучателей.добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьСписокПолучателейПоСкладу(СписокПолучателей, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыОтветственныеЛица.Пользователь
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	Справочник.Склады.ОтветственныеЛица КАК СкладыОтветственныеЛица
		|ГДЕ
		|	СкладыОтветственныеЛица.Ссылка = &Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Email
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				ВТ_Итог.Пользователь
		|			ИЗ
		|				ВТ_Итог КАК ВТ_Итог)
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПолучателей.добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьПоФизЛицу(СписокПолучателей, стрПараметры)
	
	Если стрПараметры.МассПользователей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Email
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В(&Пользователи)
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Пользователи", стрПараметры.МассПользователей);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПолучателей.Добавить(Выборка.Email);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуСервис(СписокПолучателей, Сервис)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СервисПолучатели.Получатель,
		|	СервисПолучатели.Email КАК Email 
		|ИЗ
		|	Документ.Сервис.Получатели КАК СервисПолучатели
		|ГДЕ
		|	СервисПолучатели.Ссылка = &Сервис
		|
		|СГРУППИРОВАТЬ ПО
		|	СервисПолучатели.Email,
		|	СервисПолучатели.Получатель";
	
	Запрос.УстановитьПараметр("Сервис", Сервис);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПолучателей.Добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуВозвратТоваровПокупателя(СписокПолучателей, ВозвратТоваровОтПокупателяПолучатели)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяПолучатели.Получатель,
		|	ВозвратТоваровОтПокупателяПолучатели.Email КАК Email
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Получатели КАК ВозвратТоваровОтПокупателяПолучатели
		|ГДЕ
		|	ВозвратТоваровОтПокупателяПолучатели.Ссылка = &ВозвратТоваровОтПокупателяПолучатели
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтПокупателяПолучатели.Email,
		|	ВозвратТоваровОтПокупателяПолучатели.Получатель";
	
	Запрос.УстановитьПараметр("ВозвратТоваровОтПокупателяПолучатели", ВозвратТоваровОтПокупателяПолучатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПолучателей.Добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуВозвратПоТребованииНакладной(СписокПолучателей, ВозвратПоТребованииНакладной)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратПоТребованииНакладнойПолучатели.Получатель,
		|	ВозвратПоТребованииНакладнойПолучатели.Email КАК Email
		|ИЗ
		|	Документ.ВозвратПоТребованииНакладной.Получатели КАК ВозвратПоТребованииНакладнойПолучатели
		|ГДЕ
		|	ВозвратПоТребованииНакладнойПолучатели.Ссылка = &ВозвратПоТребованииНакладной
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратПоТребованииНакладнойПолучатели.Email,
		|	ВозвратПоТребованииНакладнойПолучатели.Получатель";
	
	Запрос.УстановитьПараметр("ВозвратПоТребованииНакладной", ВозвратПоТребованииНакладной);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПолучателей.Добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуПередачаМНМА(СписокПолучателей, стрПараметры)
	
	Если стрПараметры.МассПользователей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Email
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В(&Пользователи)
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Пользователи", стрПараметры.МассПользователей);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор("ce8efbb2-a37f-11f0-bf30-00155d190803")));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПолучателей.Добавить(Выборка.Email);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьДокументВОчередьНаОтправку(ОбъектОтправки) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусОтправкиДокументовПоПочте.Статус КАК Статус,
		|	СтатусОтправкиДокументовПоПочте.ДатаОтправки,
		|	СтатусОтправкиДокументовПоПочте.ГуидОтправки,
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки
		|ИЗ
		|	РегистрСведений.СтатусОтправкиДокументовПоПочте КАК СтатусОтправкиДокументовПоПочте
		|ГДЕ
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки = &ОбъектОтправки";
	
	Запрос.УстановитьПараметр("ОбъектОтправки", ОбъектОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		МенЗап 					= РегистрыСведений.СтатусОтправкиДокументовПоПочте.СоздатьМенеджерЗаписи();
		МенЗап.ОбъектОтправки 	= ОбъектОтправки;
		МенЗап.Статус 			= Перечисления.СтатусыОтправкиДокументовПоПочте.КОтправке;
		МенЗап.ДатаОтправки 	= ТекущаяДата();
		МенЗап.ГуидОтправки 	= Новый УникальныйИдентификатор;
		МенЗап.Записать();
		Возврат;
	КонецЕсли;
	
	ДанныеРС = РезультатЗапроса.Выбрать();
	ДанныеРС.Следующий();
	
	МенЗап = РегистрыСведений.СтатусОтправкиДокументовПоПочте.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенЗап, ДанныеРС);
	МенЗап.Прочитать();
	МенЗап.Записать();
	
КонецПроцедуры

Функция ПолучитьСтатусОтправкиДокумента(ОбъектОтправки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусОтправкиДокументовПоПочте.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусОтправкиДокументовПоПочте КАК СтатусОтправкиДокументовПоПочте
		|ГДЕ
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки = &ОбъектОтправки";
	
	Запрос.УстановитьПараметр("ОбъектОтправки", ОбъектОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеРС = РезультатЗапроса.Выбрать();
	ДанныеРС.Следующий();
		
	Возврат ?(РезультатЗапроса.Пустой(), "", ДанныеРС.Статус);
	
КонецФункции

Процедура УстановитьСтатусОтправкиПоПочте(ОбъектОтправки, Статус) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусОтправкиДокументовПоПочте.Статус КАК Статус,
		|	СтатусОтправкиДокументовПоПочте.ДатаОтправки,
		|	СтатусОтправкиДокументовПоПочте.ГуидОтправки,
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки
		|ИЗ
		|	РегистрСведений.СтатусОтправкиДокументовПоПочте КАК СтатусОтправкиДокументовПоПочте
		|ГДЕ
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки = &ОбъектОтправки";
	
	Запрос.УстановитьПараметр("ОбъектОтправки", ОбъектОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		МенЗап 					= РегистрыСведений.СтатусОтправкиДокументовПоПочте.СоздатьМенеджерЗаписи();
		МенЗап.ОбъектОтправки 	= ОбъектОтправки;
		МенЗап.Статус 			= Статус;
		МенЗап.ДатаОтправки 	= ТекущаяДата();
		МенЗап.ГуидОтправки 	= Новый УникальныйИдентификатор;
		МенЗап.Записать();
		Возврат;
	КонецЕсли;
	
	ДанныеРС = РезультатЗапроса.Выбрать();
	ДанныеРС.Следующий();
	
	МенЗап = РегистрыСведений.СтатусОтправкиДокументовПоПочте.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенЗап, ДанныеРС);
	МенЗап.Прочитать();
	МенЗап.Статус = Статус;
	МенЗап.Записать();
	
КонецПроцедуры

Процедура ОбходнойЛистОтправитьПоПочте(Ссылка,РольИсполнителя) Экспорт
	
	Возврат;
	
		НеобходимоЦФО = Ложь;
		Если РольИсполнителя = Справочники.РолиИсполнителей.обКладовщик Тогда 
			НеобходимоЦФО = Истина;
		КонецЕсли;
	
	
	    ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
		
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.ЗагрузитьЗначения(ПолучитьПользователейПоРолиИЦФО(РольИсполнителя,?(НеобходимоЦФО,Ссылка.Подразделение,Неопределено)));
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
				
		ТекстПисьма = "Обхідний лист на звільнення працівника " + Ссылка.Сотрудник +" № "+Ссылка.Номер +" потребує погодження";
				
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Обхідний лист на звільнення працівника " + Ссылка.Сотрудник +" № "+Ссылка.Номер +" потребує погодження");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		
		Если СписокПолучателей.Количество() Тогда 
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьПользователейПоРолиИЦФО(РольИсполнителя,ЦФО)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.Исполнитель,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО ИсполнителиЗадач.Исполнитель = КонтактнаяИнформация.Объект
	               |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Служебныйадресэлектроннойпочтыпользователя))
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
	               |	И ИсполнителиЗадач.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации
	               |	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))) <> """"";
	Запрос.УстановитьПараметр("РольИсполнителя",РольИсполнителя);
	Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",ЦФО);
	
	Возврат запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Представление");
	
КонецФункции

Процедура ОтправитьПисьмаРассылку() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки КАК Документ,
		|	СтатусОтправкиДокументовПоПочте.ДатаОтправки,
		|	СтатусОтправкиДокументовПоПочте.Статус
		|ИЗ
		|	РегистрСведений.СтатусОтправкиДокументовПоПочте КАК СтатусОтправкиДокументовПоПочте
		|ГДЕ
		|	СтатусОтправкиДокументовПоПочте.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиДокументовПоПочте.КОтправке)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		стрДанные = Новый Структура;
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ВводВЭксплуатациюОС") Тогда
			
			стрДанные.Вставить("Документ", "ВводВЭксплуатациюОС");
			стрДанные.Вставить("ВводВЭксплуатациюОС", ВыборкаДетальныеЗаписи.Документ);
			
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
			
			стрДанные.Вставить("Документ", "Заявка");
			стрДанные.Вставить("Заявка", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			
			стрДанные.Вставить("Документ", "Перемещение");
			стрДанные.Вставить("Перемещение", ВыборкаДетальныеЗаписи.Документ);
			
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			
			стрДанные.Вставить("Документ", "Поступление");
			стрДанные.Вставить("Поступление", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			
			стрДанные.Вставить("Документ", "Приходный");
			стрДанные.Вставить("Приходный", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.Сервис") Тогда
			
			стрДанные.Вставить("Документ", "Сервис");
			стрДанные.Вставить("Сервис", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ПередачаМалоценкиВЭксплуатацию") Тогда
			
			стрДанные.Вставить("Документ", "ПередачаМНМА");
			стрДанные.Вставить("ПередачаМНМА", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениУправленческий") Тогда
			
			стрДанные.Вставить("Документ", "ТабельУПР");
			стрДанные.Вставить("ТабельУПР", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ЗадачаСсылка.ЗадачиПользователя") Тогда
			
			стрДанные.Вставить("Документ", "ЗадачаПользователя");
			стрДанные.Вставить("ЗадачаПользователя", ВыборкаДетальныеЗаписи.Документ);
			
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ЧекККМ") Тогда
			
			стрДанные.Вставить("Документ", "ЧекККМ");
			стрДанные.Вставить("ЧекККМ", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
			
			стрДанные.Вставить("Документ", "ВозвратТоваровОтПокупателя");
			стрДанные.Вставить("ВозвратТоваровОтПокупателя", ВыборкаДетальныеЗаписи.Документ);
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Документ) = Тип("ДокументСсылка.ВозвратПоТребованииНакладной") Тогда
			
			стрДанные.Вставить("Документ", "ВозвратПоТребованииНакладной");
			стрДанные.Вставить("ВозвратПоТребованииНакладной", ВыборкаДетальныеЗаписи.Документ);
			
		КонецЕсли;
		
		А_ОбщегоНазначенияСервер.ОтправитьПоПочте(стрДанные);
		А_ОбщегоНазначенияСервер.УстановитьСтатусОтправкиПоПочте(ВыборкаДетальныеЗаписи.Документ, Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте);
		
	КонецЦикла;	
	
	Если ДеньНедели(ТекущаяДата()) = 6 Тогда //по субботам чистим старые записи
		
		ОчиститьСтарыеЗаписи();
		
	КонецЕсли;

КонецПроцедуры

Функция СегодняУжеЕстьЧек() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.СтатусОтправкиДокументовПоПочте КАК СтатусОтправкиДокументовПоПочте
		|ГДЕ
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки ССЫЛКА Документ.ЧекККМ
		|	И КОНЕЦПЕРИОДА(СтатусОтправкиДокументовПоПочте.ДатаОтправки, ДЕНЬ) = КОНЕЦПЕРИОДА(&ТекДата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ОчиститьСтарыеЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусОтправкиДокументовПоПочте.ОбъектОтправки,
		|	СтатусОтправкиДокументовПоПочте.ДатаОтправки,
		|	СтатусОтправкиДокументовПоПочте.ГуидОтправки
		|ИЗ
		|	РегистрСведений.СтатусОтправкиДокументовПоПочте КАК СтатусОтправкиДокументовПоПочте
		|ГДЕ
		|	СтатусОтправкиДокументовПоПочте.ДатаОтправки <= &ДатаТриМесяца";
	
	Запрос.УстановитьПараметр("ДатаТриМесяца", ТекущаяДата() - 24*60*60*90);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенЗап = РегистрыСведений.СтатусОтправкиДокументовПоПочте.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенЗап, ВыборкаДетальныеЗаписи);
		МенЗап.Прочитать();
		МенЗап.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьЗадачу(Объект, Параметры = Неопределено) Экспорт
	
	ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказПокупателя") 
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		
		ЗадачаОб 			= Задачи.ЗадачиПользователя.СоздатьЗадачу();
		ЗадачаОб.Дата 		= ТекущаяДата();
		ЗадачаОб.Объект		= Объект.Ссылка;
		ЗадачаОб.Оповещение = Истина;
		ЗадачаОб.СрокОповещения = ТекущаяДата();
		НужноСоздатьЗадачу 	= Ложь;
		
		Если Объект.БезналичныйРасчет Тогда
			
			НужноСоздатьЗадачу = Ложь;
			
			Менеджеры = Новый Массив;
			Менеджеры.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Петро Давидюк", Истина));
			Менеджеры.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Вовкотруб Мирослава", Истина));
			
			Для Каждого Менеджер из Менеджеры Цикл
				
				ЗадачаМенеджеру 				= Задачи.ЗадачиПользователя.СоздатьЗадачу();
				ЗадачаМенеджеру.Дата 			= ТекущаяДата();
				ЗадачаМенеджеру.Объект			= Объект.Ссылка;
				ЗадачаМенеджеру.Исполнитель		= Менеджер;
				ЗадачаМенеджеру.Оповещение 		= Истина;
				ЗадачаМенеджеру.СрокОповещения 	= ТекущаяДата();
				
				ЗадачаМенеджеру.Наименование 	= "Надійшло нове замовлення № " + Объект.Номер +". від " + Формат(Объект.Дата, "ДЛФ=Д");
				ЗадачаМенеджеру.Описание		= "Надійшло нове замовлення № " + Объект.Номер 
				+ ". від " + Формат(Объект.Дата, "ДЛФ=Д")
				+ ". oder id " + Объект.OrderID;
				
				ЗадачаМенеджеру.Записать();
				
			КонецЦикла;
			
			СписокПолучателей = Новый СписокЗначений;
			стрПараметры = Новый Структура;
			стрПараметры.Вставить("МассПользователей", Менеджеры);
			ЗаполнитьПоФизЛицу(СписокПолучателей, стрПараметры);
			
			СтрПисьма = Новый Структура;
			СтрПисьма.Вставить("ОтправленоФоном", Истина);
			СтрПисьма.Вставить("Тело", ЗадачаМенеджеру.Описание);
			СтрПисьма.Вставить("Тема", "Надійшло нове замовлення");
			СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
			СтрПисьма.Вставить("Кому", СписокПолучателей);			
			//
			//СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
			//СтрПисьмо.Письмо.ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
			
		КонецЕсли;
		
		Если НужноСоздатьЗадачу Тогда
			ЗадачаОб.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

