
Функция ПолучитьСтруктуруПодключенияРРО(ВидРРО, КассаККМ) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключениеРРО.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА НастройкиПодключениеРРО.ИспользоватьТестовыйФН
		|			ТОГДА ""7000000512""
		|		ИНАЧЕ НастройкиПодключениеРРО.Ссылка.ФискальныйНомер
		|	КОНЕЦ КАК ФН,
		|	НастройкиПодключениеРРО.ИспользоватьТестовыйФН,
		|	НастройкиПодключениеРРО.Организация,
		|	НастройкиПодключениеРРО.Склад,
		|	НастройкиПодключениеРРО.ОтправлятьСообщение,
		|	НастройкиПодключениеРРО.БезНДС,
		|	НастройкиПодключениеРРО.ПутьКЧекамФайл,
		|	НастройкиПодключениеРРО.РасширениеФайлаЧеков
		|ИЗ
		|	Справочник.НастройкиПодключениеРРО КАК НастройкиПодключениеРРО
		|ГДЕ
		|	НЕ НастройкиПодключениеРРО.ПометкаУдаления
		|	И НастройкиПодключениеРРО.ВидРРО = &ВидРРО
		|	И НастройкиПодключениеРРО.КассаККМ = &КассаККМ";
	
	Запрос.УстановитьПараметр("ВидРРО", ВидРРО);
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	МассВидовОплат 			= Новый Массив;
	СтрВидОплаты 			= Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметров.Вставить("ФН", ВыборкаДетальныеЗаписи.ФН);
		
		ВидыОплат = ВыборкаДетальныеЗаписи.Ссылка.ВидОплаты;
		Если ВидыОплат.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не заполнен вид оплат");	
		КонецЕсли;
		
		Для Каждого ВидОплаты из ВидыОплат Цикл
			СтрВидОплаты.Вставить("ВидОплаты", ВидОплаты.ID);
			СтрВидОплаты.Вставить("ФормаОплаты", ВидОплаты.ФормаОплаты);
			МассВидовОплат.Добавить(СтрВидОплаты);
		КонецЦикла;	
		
		Операторы = ВыборкаДетальныеЗаписи.Ссылка.Операторы;
		Если Операторы.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не заполнен оператор");	
		КонецЕсли;
		
		Для Каждого Оператор ИЗ Операторы Цикл
			Если ВыборкаДетальныеЗаписи.Ссылка.ИспользоватьТестовыйФН Тогда
				СтруктураПараметров.Вставить("Оператор","1111111111"); 
			Иначе
				СтруктураПараметров.Вставить("Оператор", Оператор.ID); 
			КонецЕсли;
		КонецЦикла;
		
		СтруктураПараметров.Вставить("ОтправлятьСообщение", ВыборкаДетальныеЗаписи.ОтправлятьСообщение); 
		СтруктураПараметров.Вставить("ТаблицаОплат", МассВидовОплат);
		СтруктураПараметров.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
		СтруктураПараметров.Вставить("Склад", ВыборкаДетальныеЗаписи.Склад);
		СтруктураПараметров.Вставить("БезНДС", ВыборкаДетальныеЗаписи.БезНДС);
		СтруктураПараметров.Вставить("ПутьКЧекамФайл", ВыборкаДетальныеЗаписи.ПутьКЧекамФайл);
		СтруктураПараметров.Вставить("РасширениеФайлаЧеков", ВыборкаДетальныеЗаписи.РасширениеФайлаЧеков);
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции