
Процедура ПриЗаписи(Отказ)

	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("РеализацияМобильная", Ссылка);
	//Запрос.Текст =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	РеализацияТоваровУслуг.Ссылка
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|ГДЕ
	//|	РеализацияТоваровУслуг.vrgРеализацияМобильная = &РеализацияМобильная
	//|";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//	Если ДокументОбъект.Проведен Тогда
	//		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	КонецЕсли;
	//	ДокументОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	//Иначе
	//	ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	//КонецЕсли;

	//НеобходимоСделатьЗаписьСоответствия = Ложь;
	//МенеджерЗаписиСоответствия = РегистрыСведений.vrgСоответствияМобильныхДокументов.СоздатьМенеджерЗаписи();
	//МенеджерЗаписиСоответствия.МобильныйДокумент = Ссылка;
	//МенеджерЗаписиСоответствия.Прочитать();
	//Если МенеджерЗаписиСоответствия.Выбран() Тогда
	//	ДокументОбъект = МенеджерЗаписиСоответствия.ОсновнойДокумент.ПолучитьОбъект();
	//	Если ДокументОбъект.Проведен Тогда
	//		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	КонецЕсли;
	//	Если ПометкаУдаления <> ДокументОбъект.ПометкаУдаления Тогда
	//		ДокументОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	//	КонецЕсли;
	//Иначе
	//	НеобходимоСделатьЗаписьСоответствия = Истина;
	//	ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	//КонецЕсли;

	//ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), ДокументОбъект.мВалютаРегламентированногоУчета, "Продажа", , );
	//ДокументОбъект.Дата = Дата;
	//ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	//ДокументОбъект.ОтражатьВБухгалтерскомУчете = Ложь;
	//ДокументОбъект.Контрагент = Контрагент;
	//ДокументОбъект.ДоговорКонтрагента = ДоговорКонтрагента;
	//ДокументОбъект.Комментарий = Комментарий;
	//ДокументОбъект.Склад = Склад;
	//ДокументОбъект.Ответственный = Ответственный;
	//ДокументОбъект.ТипЦен = ТипЦен;

	//НайденныйМобильныйУзел = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУзлаОбмена);
	//Если ЗначениеЗаполнено(НайденныйМобильныйУзел) Тогда
	//	Если ЗначениеЗаполнено(НайденныйМобильныйУзел.Организация) Тогда
	//		ДокументОбъект.Организация = НайденныйМобильныйУзел.Организация;
	//	КонецЕсли;
	//КонецЕсли;

	//ДокументОбъект.Товары.Очистить();
	//ДокументОбъект.Услуги.Очистить();
	//Для Каждого СтрокаИсходногоДокумента Из Товары Цикл

	//	СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
	//	СтрокаТабличнойЧасти.Номенклатура = СтрокаИсходногоДокумента.Номенклатура;

	//	// Выполнить общие действия для всех документов при изменении номенклатуры.
	//	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	//	// Заполняем реквизиты табличной части.
	//	ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, "Реализация");
	//	ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	//	// Заполнение цены зависит от розничности операции.
	//	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета); 

	//	СтрокаТабличнойЧасти.Количество = СтрокаИсходногоДокумента.Количество;
	//	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаИсходногоДокумента.ЕдиницаИзмерения;
	//	СтрокаТабличнойЧасти.Коэффициент = СтрокаИсходногоДокумента.ЕдиницаИзмерения.Коэффициент;
	//	СтрокаТабличнойЧасти.Цена = СтрокаИсходногоДокумента.Цена;

	//	// Рассчитать реквизиты табличной части.
	//	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	//	// Рассчитать реквизиты табличной части.
	//	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
	//	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	//КонецЦикла;

	//Если ДокументОбъект.ПометкаУдаления Тогда
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	//Иначе
	//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//КонецЕсли;

	//Если НеобходимоСделатьЗаписьСоответствия Тогда
	//	МенеджерЗаписиСоответствия.МобильныйДокумент = Ссылка;
	//	МенеджерЗаписиСоответствия.ОсновнойДокумент = ДокументОбъект.Ссылка;
	//	МенеджерЗаписиСоответствия.Записать();
	//КонецЕсли;

КонецПроцедуры
