Процедура ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ТребованиеНакладная") Тогда 
		Если Ложь Тогда Источник = Документы.ТребованиеНакладная.СоздатьДокумент();КонецЕсли;
		Источник.НаправлениеЗатрат = Источник.СтатьяЗатрат.НаправлениеЗатрат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда 
		Если Ложь Тогда Источник = Документы.ОприходованиеТоваров.СоздатьДокумент();КонецЕсли;
		Источник.НаправлениеЗатрат = Источник.СтатьяЗатрат.НаправлениеЗатрат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
		Если Ложь Тогда Источник = Документы.РеализацияТоваровУслуг.СоздатьДокумент();КонецЕсли;
		Источник.ВидДоговора = Источник.ДоговорКонтрагента.ВидДоговора;
	КонецЕсли;
	
	//тодо доп право отв
	Право = Справочники.Константы.НайтиПоНаименованию("ПланыВидовХарактеристик.ПраваПользователей.РедактированиеНеСвоихДокументов").Значение;
	ЕстьПраво = ПолучитьПраво(Право); 
	ЕстьРеквизит = Источник.метаданные().Реквизиты.Найти("Ответственный");
	Если ТипЗнч(Источник) = тип("ДокументОбъект.ЗаявкаНаРасходованиеСредств") Тогда 
	Иначе
		Если Не ЕстьРеквизит = Неопределено И НЕ ЕстьПраво И ЗначениеЗаполнено(Источник.Ссылка.Ответственный) Тогда
			
			////Дандали В. 17.05.2023 
			//Если НЕ Источник.Ссылка.Ответственный = ПараметрыСеанса.ТекущийПользователь Тогда
			//	//Разрешать редактировать если это реализация/заказ из моб.приложения
			//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") 
			//		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ТребованиеНакладная") 
			//		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			//		
			//		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
			//			Заказ = Источник.Ссылка;
			//		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда
			//			Заказ = Источник.Ссылка.Сделка;
			//		Иначе
			//			Заказ = Источник.Ссылка; 
			//		КонецЕсли;
			//		//
			//		//Если НЕ ЭтоМобильноеПриложение(Заказ) Тогда
			//		//	Сообщить("Користувач не має права редагувати не свої документи!");	
			//		//	Отказ = Истина;
			//		//КонецЕсли;

			//	Иначе
			//		Сообщить("Користувач не має права редагувати не свої документи!");	
			//		Отказ = Истина;
			//	КонецЕсли;
			//КонецЕсли;
			//Дандали В. 17.05.2023 
		КонецЕсли;
	КонецЕсли;
	
	//тодо доп право  бу
	ДопПраво = Справочники.Константы.НайтиПоНаименованию("ПланыВидовХарактеристик.ПраваПользователей.РедактироватьБухУчет").Значение;
	ЕстьПраво = ПолучитьПраво(ДопПраво); 
	ЕстьРеквизит = Источник.метаданные().Реквизиты.Найти("ОтражатьВБухгалтерскомУчете");
	Если Не ЕстьРеквизит = Неопределено И НЕ ЕстьПраво Тогда
		//Если Источник.Ссылка.ОтражатьВБухгалтерскомУчете  ИЛИ  Источник.ОтражатьВБухгалтерскомУчете Тогда  
		//	Сообщить("Користувач не має права редагувати бухгалтерський облік!");	
		//	Отказ = Истина;
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПраво(Право) Экспорт 
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЗначенияДопПрав = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	Отбор = ЗначенияДопПрав.Отбор;
	Отбор.Пользователь.Использование = Истина;
	Отбор.Пользователь.Значение =  ТекПользователь;
	Отбор.Право.Использование = Истина;
	Отбор.Право.Значение = Право;
	ЗначенияДопПрав.Прочитать();
	
	Если ЗначенияДопПрав.Количество() > 0 Тогда
		Для каждого Запись ИЗ ЗначенияДопПрав Цикл
			Результат = Запись.Значение;
		КонецЦикла;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМобильноеПриложение(Заказ)
	
	ЗапросДок = Новый Запрос;
	ЗапросДок.Текст = 
	"ВЫБРАТЬ
	|	vrgСоответствияМобильныхДокументов.МобильныйДокумент.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.vrgСоответствияМобильныхДокументов КАК vrgСоответствияМобильныхДокументов
	|ГДЕ
	|	vrgСоответствияМобильныхДокументов.ОсновнойДокумент = &ОсновнойДокумент";
	
	ЗапросДок.УстановитьПараметр("ОсновнойДокумент", Заказ);
	
	Возврат НЕ ЗапросДок.Выполнить().Пустой();
		
КонецФункции
