Функция ПолнотекстовыйПоискТоваров(СтрокаПоиска, РезультатПоиска, РазмерПорции =  1000) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивХарактеристик = Новый Массив;
	
	// Поиск данных
	
	// ... по группам кроссов
	ОбластьПоиска = Новый Массив;

	// + PN3-125 ДДГ  2 ноя 2023
	//ОграничитьОбластьПоиска = Истина;

	//Если ОграничитьОбластьПоиска Тогда
		ОбластьПоиска.Добавить(Метаданные.Справочники.Номенклатура);
		//ОбластьПоиска.Добавить(Метаданные.Справочники.ХарактеристикиНоменклатуры);
		//ОбластьПоиска.Добавить(Метаданные.Справочники.СайтГруппыКроссов);
		//ОбластьПоиска.Добавить(Метаданные.Справочники.зс_НаименованиеНоменклатуры);
	//КонецЕсли;
	//// - PN3-125 ДДГ  2 ноя 2023

	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, РазмерПорции);
	СписокПоиска.ПолучатьОписание = Ложь;
	СписокПоиска.ОбластьПоиска = ОбластьПоиска;
	
	Попытка
	    СписокПоиска.ПерваяЧасть();
	Исключение
		Возврат "Ошибка поиска";
	КонецПопытки;
	
	Если СписокПоиска.СлишкомМногоРезультатов() Тогда
		РазмерПорции = 99999; 
		Возврат "Слишком много результатов, уточните запрос";
	КонецЕсли;
	
	Если СписокПоиска.ПолноеКоличество() > РазмерПорции Тогда
		
		РазмерПорции = СписокПоиска.ПолноеКоличество();
		Возврат "Слишком много результатов, уточните запрос";
		
	КонецЕсли; 
	
	КоличествоНайденныхЭлементовВсего = 0;
	КоличествоНайденныхЭлементовВсего = КоличествоНайденныхЭлементовВсего + СписокПоиска.ПолноеКоличество();
	
	Если СписокПоиска.ПолноеКоличество() = 0 Тогда //возможно, это был артикул, попробуем поискать по очищенной строке
		
		
		
		СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СписокПоиска, РазмерПорции);
		СписокПоиска.ПолучатьОписание = Ложь;
		
		
		Попытка
		    СписокПоиска.ПерваяЧасть();
		Исключение
			Возврат "Ошибка поиска";
		КонецПопытки;
		
		Если СписокПоиска.СлишкомМногоРезультатов() Тогда
			Возврат "Слишком много результатов, уточните запрос";
		КонецЕсли;
		
		Если СписокПоиска.ПолноеКоличество() > РазмерПорции Тогда
			Возврат "Слишком много результатов, уточните запрос";
		КонецЕсли; 
		
		КоличествоНайденныхЭлементовВсего = 0;
		КоличествоНайденныхЭлементовВсего = КоличествоНайденныхЭлементовВсего + СписокПоиска.ПолноеКоличество();
	КонецЕсли;
	
	СписокНоменклатуры = Новый Массив;
	СписокХарактеристикНоменклатуры = Новый Массив;
	
	// Обработка данных
	Если СписокПоиска.ПолноеКоличество() <> 0 Тогда
		
		КоличествоНайденныхЭлементов = СписокПоиска.ПолноеКоличество();
		
		НачальнаяПозиция = 0;
		КонечнаяПозиция = ?(КоличествоНайденныхЭлементов > РазмерПорции, РазмерПорции, КоличествоНайденныхЭлементов) - 1;
		
		ЕстьСледующаяПорция = Истина;
		МассивНаименованийНоменклатуры = новый Массив;
		
		Пока ЕстьСледующаяПорция Цикл
			
			Для СчетчикЭлементов = 0 По КонечнаяПозиция Цикл
				
				Элемент = СписокПоиска.Получить(СчетчикЭлементов);
				
				Если Элемент.Метаданные = Метаданные.Справочники.Номенклатура Тогда
					
					РезультатПоиска.Добавить(Элемент.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
			НачальнаяПозиция = НачальнаяПозиция + РазмерПорции;
			ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоНайденныхЭлементов - 1);
			
			Если ЕстьСледующаяПорция Тогда
				
				КонечнаяПозиция = ?(КоличествоНайденныхЭлементов > НачальнаяПозиция + РазмерПорции,
				РазмерПорции,
				КоличествоНайденныхЭлементов - НачальнаяПозиция
				) - 1;
				
				СписокПоиска.СледующаяЧасть();
				
			КонецЕсли;
			
		КонецЦикла;		
	КонецЕсли;
			
	

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат "Поиск завершен";
	
КонецФункции
