
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТарифиППК
	Движения.ТарифиППК.Записывать = Истина;
	Движения.ТарифиППК.Очистить();
	Для Каждого ТекСтрокаУстановкаТарифов Из УстановкаТарифов Цикл
		Движение = Движения.ТарифиППК.Добавить();
		Движение.Период = Дата;
		Движение.Тариф = ТекСтрокаУстановкаТарифов.Тариф;
		Движение.ЦенаТарифа = ТекСтрокаУстановкаТарифов.ЦенаТарифа;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
