
Перем мРегламентноеЗадание Экспорт;

Процедура ПередЗаписью(Отказ)
	//
	//	
	//УстановитьЗначенияПеременныхРегламентныхНастроек();
	//
	//Если ПометкаУдаления
	//	ИЛИ НЕ Истина Тогда  
	//	
	//	Если мРегламентноеЗадание <> Неопределено Тогда
	//		мРегламентноеЗадание.Использование = Ложь;			
	//	КонецЕсли;		
	//				
	//Иначе
	//	
	//	// если оба выключены регл задания - то включаем основное регл задание
	//	Если мРегламентноеЗадание = Неопределено Тогда
	//		
	//		//ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не выбрано регламентное задание для настройки обмена.';uk='Не обране регламентне завдання для настройки обміну.'"), Отказ);
	//			
	//	КонецЕсли;			
	//			
	//	Если мРегламентноеЗадание <> Неопределено Тогда
	//		
	//		мРегламентноеЗадание.Использование = Истина;
	//					
	//	КонецЕсли;
	//		
	//КонецЕсли;
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если мРегламентноеЗадание <> Неопределено 
	//	И Не ПустаяСтрока(мРегламентноеЗадание.Ключ) Тогда
	//	
	//	КлючРегламентногоЗадания = мРегламентноеЗадание.Ключ;
	//	
	//Иначе
	//	
	//	КлючРегламентногоЗадания = Строка(Новый УникальныйИдентификатор);
	//	
	//КонецЕсли;
	//
	//УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание, КлючРегламентногоЗадания);
	//
	//	
КонецПроцедуры

Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания, Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе	
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = КлючРегламентногоЗадания;
		КонецЕсли;
		
		Массив = Новый Массив();
		Массив.Добавить(Код);
		
		ПараметрЗадания.Параметры = Массив;
		ПараметрЗадания.Записать();	
					
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	мРегламентноеЗадание = Неопределено;
	РегламентноеЗадание = "";
	
КонецПроцедуры

Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	ПроцедурыОбменаДанными.ЗаполнитьНастройкуОбменаWEBЗначениямиПоУмолчанию(ЭтотОбъект);
			
КонецПроцедуры

Процедура УстановитьРежимРегламетныхЗадач() Экспорт
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если мРегламентноеЗадание.Использование = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мРегламентноеЗадание.Использование = Ложь;
		
	мРегламентноеЗадание.Записать();
		
КонецПроцедуры

Функция НайтиРеглЗаданиеПоПараметру(УникальныйНомерЗадания)
	
	Попытка
		
		Если НЕ ПустаяСтрока(УникальныйНомерЗадания) Тогда
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
			
		Иначе
			
			ТекущееРегламентноеЗадание = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		ТекущееРегламентноеЗадание = Неопределено;
		
    КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

Функция НайтиРегламентноеЗаданиеПоНастройке() Экспорт
	
	ТекущееРегламентноеЗадание =НайтиРеглЗаданиеПоПараметру(РегламентноеЗадание);
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

Функция ПолучитьОбъектРегламентногоЗадания() Экспорт
	
	Задание = НайтиРегламентноеЗаданиеПоНастройке();
	
	Возврат Задание;	
	
КонецФункции


Процедура УстановитьЗначенияПеременныхРегламентныхНастроек() Экспорт
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание = ПолучитьОбъектРегламентногоЗадания();
			
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если мРегламентноеЗадание <> Неопределено Тогда
		мРегламентноеЗадание.Удалить();
	КонецЕсли;
	
КонецПроцедуры
