///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ ДОКУМЕНТОВ
Функция ПодборДанныхПоСотруднику(Форма, ЭлементФормы, Сотрудник, Организация, ОбязательныйПодбор = Ложь, УчетнаяПолитикаПоПерсоналу) Экспорт



	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ФизЛицо", Сотрудник.ФизЛицо);

	// Выбор приказов о приеме на работу
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",Организация);
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
		|	Работники.Подразделение							КАК ПодразделениеУпр,
		|	РаботникиОрганизаций.Должность					КАК Должность,
		|	Работники.Должность								КАК ДолжностьУпр,
		|	ЕСТЬNULL(РаботникиОрганизаций.ГрафикРаботы,Работники.ГрафикРаботы)				КАК ГрафикРаботы,
		|	РаботникиОрганизаций.Сотрудник.Код				КАК ТабельныйНомерРегл,
		|	РаботникиОрганизаций.ЗанимаемыхСтавок			КАК ЗанимаемыхСтавок,
		|	Работники.ЗанимаемыхСтавок						КАК ЗанимаемыхСтавокУпр,
		|	РаботникиОрганизаций.СпособОтраженияВБухУчете	КАК СпособОтраженияВБухУчете,
		|	Работники.СпособОтраженияВУпрУчете				КАК СпособОтраженияВУпрУчете,
		|	РаботникиОрганизаций.Сотрудник.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	РаботникиОрганизаций.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|	РаботникиОрганизаций.Должность.Наименование КАК ДолжностьНаименование,
		|	РаботникиОрганизаций.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто
    	|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Сотрудник = &Сотрудник И Организация В (&СписокСтруктурныхПодразделений)) КАК РаботникиОрганизаций
		|"; 
		
		Если УчетнаяПолитикаПоПерсоналу[Организация].ОтражатьВРеглУчете Тогда
			ТекстЗапроса = ТекстЗапроса + "		
			|ЛЕВОЕ СОЕДИНЕНИЕ	РегистрСведений.Работники.СрезПоследних(, ФизЛицо = &ФизЛицо ) КАК Работники
			|ПО Работники.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
			|
			|УПОРЯДОЧИТЬ ПО
			|	РаботникиОрганизаций.Период";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "		
			|ПРАВОЕ СОЕДИНЕНИЕ	РегистрСведений.Работники.СрезПоследних(, ФизЛицо = &ФизЛицо ) КАК Работники
			|ПО Работники.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
			|
			|УПОРЯДОЧИТЬ ПО
			|	РаботникиОрганизаций.Период";
		КонецЕсли;
	
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	NULL	КАК ПодразделениеОрганизации,
		|	Работники.Подразделение		КАК ПодразделениеУпр,
		|	NULL						КАК Должность,
		|	Работники.Должность			КАК ДолжностьУпр,
		|	Работники.ГрафикРаботы				КАК ГрафикРаботы,
		|	Работники.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	NULL КАК ПодразделениеОрганизацииНаименование,
		|	Работники.Должность.Наименование КАК ДолжностьНаименование
		|ИЗ (
		|	ВЫБРАТЬ 
		|		МАКСИМУМ(Работники.Период)	КАК Период
		|	ИЗ РегистрСведений.Работники КАК Работники
		|   ГДЕ		Работники.ФизЛицо = &ФизЛицо
		|   )КАК Работники1
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ	РегистрСведений.Работники КАК Работники
		|ПО		Работники.Физлицо = &Физлицо
		|	И	Работники.Период = Работники1.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Работники.Период";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	
	НаборыДанных = Запрос.Выполнить().Выгрузить(); 
	
	// Если не нашли данных - ничего не делаем
	Если НаборыДанных.Количество() = 0 Тогда
		
		Если ОбязательныйПодбор Тогда
			СписокНаборовДанных = Новый СписокЗначений;
			СписокНаборовДанных.Добавить(Неопределено, НСтр("ru='Нет приказов о приеме';uk='Немає наказів про прийом'"));
			Форма.ВыбратьИзСписка(СписокНаборовДанных, ЭлементФормы);
		КонецЕсли;
		
		Возврат НеОпределено; 

	ИначеЕсли НаборыДанных.Количество() = 1 И НЕ ОбязательныйПодбор Тогда  // Если нашли один набор данных то используем его
		Возврат НаборыДанных[0]; 

	Иначе  // Если набоов данных несколько - предложим выбрать из списка.

		СписокНаборовДанных = Новый СписокЗначений;

		Для Каждого Строка Из НаборыДанных Цикл
			СписокНаборовДанных.Добавить(Строка, Строка.ФизлицоНаименование + " (" + Строка.ПодразделениеОрганизацииНаименование + ", " + Строка.ДолжностьНаименование + ")");
		КонецЦикла;

		ВыбранныйНаборДанных = Форма.ВыбратьИзСписка(СписокНаборовДанных, ЭлементФормы);

		Если ВыбранныйНаборДанных = НеОпределено Тогда
			Возврат НеОпределено;

		Иначе
			Возврат ВыбранныйНаборДанных.Значение;

		КонецЕсли;

	КонецЕсли;

КонецФункции  // ПодборДанныхПоСотруднику

// Процедура ищет единственное физлицо среди работников предприятия или организаций по
//  началу его наименования
//
// Параметры
//  Текст 		- строка - начало ФИО
//  Организация - СправочникСсылка.Организации - организация, 
//					среди работников которой производится поиск, необязательна,
//					если не указана - поиск ведется по всем организациям
//
// Возвращаемое значение
//  строка - наименование найденного кандидата, работника (предприятия или организаций), если он единственный
//
Функция ПодобратьФИОРаботникаКандидата1(Знач Текст, Организация = "", ОтражатьВУпрУчете = Истина, ОтражатьВРеглУчете = Истина) Экспорт

	ТекстАвтоПодбора = "";
	Запрос = Новый Запрос;

	ТекстУсловияОрганизации = "";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстУсловияОрганизации = " И Организация = &парамГоловнаяОрганизация";
		Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	КонецЕсли;
	
	Если ОтражатьВУпрУчете и НЕ ОтражатьВРеглУчете Тогда 
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	Работники.Физлицо.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(, Физлицо.Наименование ПОДОБНО &парамТекст СПЕЦСИМВОЛ ""~"") КАК Работники";
	Иначе	
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	РаботникиОрганизаций.Физлицо.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Физлицо.Наименование ПОДОБНО &парамТекст СПЕЦСИМВОЛ ""~"" " + ТекстУсловияОрганизации +") КАК РаботникиОрганизаций";
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;

	// заменим спецсимволы
	Текст = СтрЗаменить(Текст, "~", "~~");
	Текст = СтрЗаменить(Текст, "%", "~%");
	Текст = СтрЗаменить(Текст, "_", "~_");
	Текст = СтрЗаменить(Текст, "[", "~[");
	Текст = СтрЗаменить(Текст, "-", "~-");
	Текст = Текст + "%";

	Запрос.УстановитьПараметр("парамТекст", Текст);
	Запрос.УстановитьПараметр("парамПустаяОрганизация", Справочники.Организации.ПустаяСсылка());

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ТекстАвтоПодбора = Выборка.Наименование;
	КонецЕсли;

	Возврат ТекстАвтоПодбора

КонецФункции // ПодобратьФИОРаботникаКандидата()

// Получение значения учетной политики по персоналу
// Если в соответствии по данной организации нет политики - пытаемся прочитать ее из ИБ, если там нет - 
// она добавляется как политика по умолчанию
//
// Параметры:
//
//  УчетнаяПолитика - соответствие политик по организациям
//  Организация - ссылка на организацию
//  ИмяПолитики - название получаемой учетной политики
//
Функция ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитика, Организация, ИмяПолитики) Экспорт
	//Если удаляем организацию из документа (пустая организация)
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если УчетнаяПолитика[Организация] = Неопределено Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетЗарплатыОрганизацииПоОтветственным, ЛОЖЬ) КАК РасчетЗарплатыОрганизацииПоОтветственным,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ПоказыватьТабельныеНомераВДокументах, ЛОЖЬ) КАК ПоказыватьТабельныеНомераВДокументах
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоПерсоналу КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|		ПО (ВЫБОР
		|				КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА Организации.Ссылка
		|				ИНАЧЕ Организации.ГоловнаяОрганизация
		|			КОНЕЦ = УчетнаяПолитикаПоПерсоналуОрганизаций.Организация)
		|ГДЕ
		|	Организации.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка",Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			УчетнаяПолитика.Вставить(Организация, 
				Новый Структура(
				"РасчетЗарплатыОрганизацииПоОтветственным,
				|ПоказыватьТабельныеНомераВДокументах",
				Выборка.РасчетЗарплатыОрганизацииПоОтветственным,
				Выборка.ПоказыватьТабельныеНомераВДокументах));
		Иначе 
			УчетнаяПолитика.Вставить(Организация, 
				Новый Структура(
				"РасчетЗарплатыОрганизацииПоОтветственным,
				|ПоказыватьТабельныеНомераВДокументах",
				Ложь,
				Ложь));
		КонецЕсли;		
	КонецЕсли;
	
	Возврат УчетнаяПолитика[Организация][ИмяПолитики];
	
КонецФункции // ЗначениеУчетнойПолитикиПоПерсоналуОрганизации()

#Если Клиент Тогда

// Процедура ищет физлиц среди работников предприятия или организаций по
//  началу его наименования
//
// Параметры
//  Текст 		- строка - начало ФИО
//  НачальноеЗначение	- СправочникСсылка.ФизическиеЛица - значение по умолчанию
//  Организация - СправочникСсылка.Организации - организация, 
//					среди работников которой производится поиск, необязательна,
//					если не указана - поиск ведется по всем организациям
//
// Возвращаемое значение
//  СправочникСсылка.ФизическиеЛица - возвращается значение по умолчанию, если 
//									не найдено ни одного подходящего кандидата, работника (предприятия или организаций)
//  СписокЗначений - список подходящих физлиц, если их найдено не более 50
//  Неопределено - если найдено более 50 подходящих физлиц
//
Функция ПодобратьСписокРаботниковКандидатов1(Знач Текст, НачальноеЗначение, Организация = "", ОтражатьВУпрУчете = Истина, ОтражатьВРеглУчете = Истина) Экспорт

	Запрос = Новый Запрос;

	ТекстУсловияОрганизации = "";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	КонецЕсли;
	
	Если ОтражатьВУпрУчете и НЕ ОтражатьВРеглУчете Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
		|	Работники.Физлицо КАК Ссылка,
		|	Работники.Физлицо.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(, Физлицо.Наименование ПОДОБНО &парамТекст СПЕЦСИМВОЛ ""~"") КАК Работники";
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
		|	РаботникиОрганизаций.Физлицо КАК Ссылка,
		|	РаботникиОрганизаций.Физлицо.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Физлицо.Наименование ПОДОБНО &парамТекст СПЕЦСИМВОЛ ""~"" " + ТекстУсловияОрганизации + ") КАК РаботникиОрганизаций";
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;

	// заменим спецсимволы
	Текст = СтрЗаменить(Текст, "~", "~~");
	Текст = СтрЗаменить(Текст, "%", "~%");
	Текст = СтрЗаменить(Текст, "_", "~_");
	Текст = СтрЗаменить(Текст, "[", "~[");
	Текст = СтрЗаменить(Текст, "-", "~-");
	Текст = Текст + "%";

	Запрос.УстановитьПараметр("парамТекст", Текст);
	Запрос.УстановитьПараметр("парамПустаяОрганизация", Справочники.Организации.ПустаяСсылка());

	Выборка = Запрос.Выполнить().Выбрать();

	Количество = Выборка.Количество();

	Если Количество = 0 Тогда

		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В поле ввода неверно задано наименование работника!';uk='В полі введення невірно задане найменування працівника!'"));

		Возврат НачальноеЗначение;

	ИначеЕсли Количество < 51 Тогда

		Значение = Новый СписокЗначений;

		Пока Выборка.Следующий() Цикл
			Значение.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЦикла;

		Возврат Значение;

	Иначе
		Возврат Неопределено;

	КонецЕсли;

КонецФункции // ПодобратьСписокРаботниковКандидатов()

// Процедура ищет единственное физлицо среди работников предприятия или организаций по
//  началу его наименования
//
// Параметры
//  Режим 		- строка - определяет, среди кандидатов, работников предприятия или организаций производится поиск
//  Текст 		- строка - начало ФИО
//  Организация - СправочникСсылка.Организации - организация, 
//					среди работников которой производится поиск, необязательна,
//					если не указана - поиск ведется по всем организациям
//
// Возвращаемое значение
//  строка - наименование найденного кандидата, работника (предприятия или организаций), если он единственный
//
Функция ПодобратьФИОРаботникаКандидата(СтандартнаяОбработка, Режим, Знач Текст, Организация = "", ВозвращатьФизлицо = Ложь) Экспорт
	
	ТекстАвтоПодбора = "";
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Если Режим = "Работники" Тогда
		
		Запрос.УстановитьПараметр("ДатаАктуальности",		ТекущаяДата());
			
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	Сотрудники.Сотрудник.Наименование КАК Наименование,
		|	Работники.ФизЛицо.Наименование КАК ФизлицоНаименование
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокСотрудников.Сотрудник КАК Сотрудник,
		|			СписокСотрудников.Физлицо КАК Физлицо
		|		ИЗ
		|			(ВЫБРАТЬ
		|				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
		|				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|				1 КАК Приоритет
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|			ГДЕ
		|				РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиОсновноеМесто.Сотрудник.Физлицо
		|			
		|			ОБЪЕДИНИТЬ
		|			
		|			ВЫБРАТЬ
		|				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
		|				РаботникиСовместительство.Сотрудник.Физлицо,
		|				2
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|			ГДЕ
		|				РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиСовместительство.Сотрудник.Физлицо
		|			
		|			ОБЪЕДИНИТЬ
		|			
		|			ВЫБРАТЬ
		|				МАКСИМУМ(СотрудникиДУ.Ссылка),
		|				СотрудникиДУ.Физлицо,
		|				ВЫБОР
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|						ТОГДА 3
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|						ТОГДА 4
		|					ИНАЧЕ 5
		|				КОНЕЦ
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
		|			
		|			СГРУППИРОВАТЬ ПО
		|				СотрудникиДУ.Физлицо,
		|				ВЫБОР
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|						ТОГДА 3
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|						ТОГДА 4
		|					ИНАЧЕ 5
		|				КОНЕЦ) КАК СписокСотрудников
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					СписокФизическихЛиц.Физлицо КАК Физлицо,
		|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
		|				ИЗ
		|					(ВЫБРАТЬ
		|						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|						1 КАК Приоритет
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|								&ДатаАктуальности,
		|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|					ГДЕ
		|						РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						РаботникиСовместительство.Сотрудник.Физлицо,
		|						2
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|								&ДатаАктуальности,
		|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|					ГДЕ
		|						РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						СотрудникиДУ.Физлицо,
		|						ВЫБОР
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|								ТОГДА 3
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|								ТОГДА 4
		|							ИНАЧЕ 5
		|						КОНЕЦ
		|					ИЗ
		|						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
		|				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
		|					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
		|		ПО Работники.ФизЛицо = Сотрудники.Физлицо
		|ГДЕ
		|	Работники.ФизЛицо.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""";
			
	ИначеЕсли Режим = "РаботникиИДоговорники" Тогда
		
		ДоговорыГПХ = Новый Массив;
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
		Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
		
		ТекстУсловияРаботники = "";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияРаботники = " И Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	ВложенныйЗапрос.Наименование КАК Наименование
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизации.Сотрудник.Наименование КАК Наименование
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|	ГДЕ
		|       РаботникиОрганизации.Сотрудник.Актуальность
		|		И РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияРаботники + "
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДоговорникиОрганизаций.Наименование
		|	ИЗ
		|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
		|	ГДЕ
		|		ДоговорникиОрганизаций.Актуальность
		|		И ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
		|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ") КАК ВложенныйЗапрос";
		
	ИначеЕсли Режим = "Договорники" Тогда
		
		ДоговорыГПХ = Новый Массив;
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
		Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
		
		ТекстУсловияРаботники = "";
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияРаботники = " И ДоговорникиОрганизаций.Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорникиОрганизаций.Наименование
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
		|ГДЕ
		|   ДоговорникиОрганизаций.Актуальность
		|	И ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
		|	И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники;
	
	ИначеЕсли Режим = "РаботникиОрганизации" Тогда
		
		ТекстУсловияОрганизации = "";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	РаботникиОрганизации.Сотрудник.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|ГДЕ
		|	РаботникиОрганизации.Сотрудник.Актуальность
		|	И РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации;
		
	ИначеЕсли Режим = "Сотрудники" Тогда
		
		ТекстУсловияОрганизации = "";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СотрудникиОрганизаций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Актуальность
		|	И СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В процедуру ПроцедурыУправленияПерсоналом.ПодобратьФИОРаботникаКандидата() передано неверное значение параметра Режим!';uk='В процедуру ПроцедурыУправленияПерсоналом.ПодобратьФИОРаботникаКандидата() передано невірне значення параметра Режим!'"));
		
	КонецЕсли;
	
	// заменим спецсимволы
	Текст = СтрЗаменить(Текст, "~", "~~");
	Текст = СтрЗаменить(Текст, "%", "~%");
	Текст = СтрЗаменить(Текст, "_", "~_");
	Текст = СтрЗаменить(Текст, "[", "~[");
	Текст = СтрЗаменить(Текст, "-", "~-");
	Текст = Текст+"%";
	
	Запрос.УстановитьПараметр("Текст", Текст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Если ВозвращатьФизлицо Тогда
			ТекстАвтоПодбора = Выборка.ФизлицоНаименование;
		Иначе
			ТекстАвтоПодбора = Выборка.Наименование;
		КонецЕсли;
	КонецЕсли;

	Возврат ТекстАвтоПодбора;
	
КонецФункции // ПодобратьФИОРаботникаКандидата()

// Процедура ищет физлиц среди работников предприятия или организаций по
//  началу его наименования
//
// Параметры
//  Режим 		- строка - определяет, среди кандидатов, работников предприятия или организаций производится поиск
//  Текст 		- строка - начало ФИО
//  НачальноеЗначение	- СправочникСсылка.ФизическиеЛица - значение по умолчанию
//  Организация - СправочникСсылка.Организации - организация, 
//					среди работников которой производится поиск, необязательна,
//					если не указана - поиск ведется по всем организациям
//
// Возвращаемое значение
//  СправочникСсылка.ФизическиеЛица - возвращается значение по умолчанию, если 
//									не найдено ни одного подходящего кандидата, работника (предприятия или организаций)
//  СписокЗначений - список подходящих физлиц, если их найдено не более 50
//  Неопределено - если найдено более 50 подходящих физлиц
//
Функция ПодобратьСписокРаботниковКандидатов(СтандартнаяОбработка, Режим, Знач Текст, НачальноеЗначение, Организация = "", ВозвращатьФизлицо = Ложь) Экспорт
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Новый СписокЗначений;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если Режим = "Работники" Тогда
		
		Запрос.УстановитьПараметр("ДатаАктуальности",		ТекущаяДата());
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
		|	Сотрудники.Сотрудник КАК Ссылка,
		|	Сотрудники.Сотрудник.Наименование КАК Наименование,
		|	Работники.ФизЛицо КАК Физлицо,
		|	Работники.ФизЛицо.Наименование КАК ФизлицоНаименование
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокСотрудников.Сотрудник КАК Сотрудник,
		|			СписокСотрудников.Физлицо КАК Физлицо
		|		ИЗ
		|			(ВЫБРАТЬ
		|				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
		|				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|				1 КАК Приоритет
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|			ГДЕ
		|				РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиОсновноеМесто.Сотрудник.Физлицо
		|			
		|			ОБЪЕДИНИТЬ
		|			
		|			ВЫБРАТЬ
		|				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
		|				РаботникиСовместительство.Сотрудник.Физлицо,
		|				2
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|			ГДЕ
		|				РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиСовместительство.Сотрудник.Физлицо
		|			
		|			ОБЪЕДИНИТЬ
		|			
		|			ВЫБРАТЬ
		|				МАКСИМУМ(СотрудникиДУ.Ссылка),
		|				СотрудникиДУ.Физлицо,
		|				ВЫБОР
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|						ТОГДА 3
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|						ТОГДА 4
		|					ИНАЧЕ 5
		|				КОНЕЦ
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
		|			
		|			СГРУППИРОВАТЬ ПО
		|				СотрудникиДУ.Физлицо,
		|				ВЫБОР
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|						ТОГДА 3
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|						ТОГДА 4
		|					ИНАЧЕ 5
		|				КОНЕЦ) КАК СписокСотрудников
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					СписокФизическихЛиц.Физлицо КАК Физлицо,
		|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
		|				ИЗ
		|					(ВЫБРАТЬ
		|						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|						1 КАК Приоритет
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|								&ДатаАктуальности,
		|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|					ГДЕ
		|						РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						РаботникиСовместительство.Сотрудник.Физлицо,
		|						2
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|								&ДатаАктуальности,
		|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|					ГДЕ
		|						РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						СотрудникиДУ.Физлицо,
		|						ВЫБОР
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|								ТОГДА 3
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|								ТОГДА 4
		|							ИНАЧЕ 5
		|						КОНЕЦ
		|					ИЗ
		|						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
		|				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
		|					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
		|		ПО Работники.ФизЛицо = Сотрудники.Физлицо
		|ГДЕ
		|	Работники.ФизЛицо.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""";
		
	ИначеЕсли Режим = "РаботникиИДоговорники" Тогда
		
		ДоговорыГПХ = Новый Массив;
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
		Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
		
		ТекстУсловияРаботники = "";
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияРаботники = " И Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Если ВозвращатьФизлицо Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	ВложенныйЗапрос.Физлицо,
			|	ВложенныйЗапрос.ФизлицоНаименование
			|ИЗ
			|	(ВЫБРАТЬ 
			|		РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|		РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
			|	ГДЕ
			|       РаботникиОрганизации.Сотрудник.Актуальность
			|		И РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияРаботники + "
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДоговорникиОрганизаций.Физлицо,
			|		ДоговорникиОрганизаций.Физлицо.Наименование
			|	ИЗ
			|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
			|	ГДЕ
			|		ДоговорникиОрганизаций.Актуальность
			|		И ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ") КАК ВложенныйЗапрос";
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	ВложенныйЗапрос.Ссылка,
			|	ВложенныйЗапрос.Наименование
			|ИЗ
			|	(ВЫБРАТЬ 
			|		РаботникиОрганизации.Сотрудник КАК Ссылка,
			|		РаботникиОрганизации.Сотрудник.Наименование КАК Наименование
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
			|	ГДЕ
			|       РаботникиОрганизации.Сотрудник.Актуальность
			|		И РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияРаботники + "
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ 
			|		ДоговорникиОрганизаций.Ссылка,
			|		ДоговорникиОрганизаций.Наименование
			|	ИЗ
			|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
			|	ГДЕ
			|		ДоговорникиОрганизаций.Актуальность
			|		И ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ") КАК ВложенныйЗапрос";
		КонецЕсли;
		
	ИначеЕсли Режим = "Договорники" Тогда
		
		ДоговорыГПХ = Новый Массив;
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
		ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
		Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
		
		ТекстУсловияРаботники = "";
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияРаботники = " И ДоговорникиОрганизаций.Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорникиОрганизаций.Наименование,
		|	ДоговорникиОрганизаций.Ссылка,
		|	ДоговорникиОрганизаций.Физлицо
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
		|ГДЕ
		|	ДоговорникиОрганизаций.Актуальность
		|	И ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
		|	И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники;
		
	ИначеЕсли Режим = "РаботникиОрганизации" Тогда
		
		ТекстУсловияОрганизации = "";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		КонецЕсли;
		
		Если ВозвращатьФизлицо Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
			|ГДЕ
			|   РаботникиОрганизации.Сотрудник.Актуальность
			|	И РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации;
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	РаботникиОрганизации.Сотрудник КАК Ссылка,
			|	РаботникиОрганизации.Сотрудник.Наименование КАК Наименование
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
			|ГДЕ
			|   РаботникиОрганизации.Сотрудник.Актуальность
			|	И РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации;
		КонецЕсли;
		
	ИначеЕсли Режим = "Сотрудники" Тогда
		
		ТекстУсловияОрганизации = "";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
		КонецЕсли;
		
		Если ВозвращатьФизлицо Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	СотрудникиОрганизаций.Физлицо КАК Физлицо,
			|	СотрудникиОрганизаций.Физлицо.Наименование КАК ФизлицоНаименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Актуальность
			|	И СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации;
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	СотрудникиОрганизаций.Ссылка КАК Ссылка,
			|	СотрудникиОрганизаций.Наименование КАК Наименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Актуальность
			|	И СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации;
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("В процедуру ПроцедурыУправленияПерсоналом.ПодобратьСписокРаботниковКандидатов() передано неверное значение параметра Режим!");
		
	КонецЕсли;
	
	// заменим спецсимволы
	Текст = СтрЗаменить(Текст, "~", "~~");
	Текст = СтрЗаменить(Текст, "%", "~%");
	Текст = СтрЗаменить(Текст, "_", "~_");
	Текст = СтрЗаменить(Текст, "[", "~[");
	Текст = СтрЗаменить(Текст, "-", "~-");
	Текст = Текст+"%";
	
	Запрос.УстановитьПараметр("Текст", Текст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Количество = Выборка.Количество();
	
	Если Количество < 51 Тогда
		
		Значение = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			Если ВозвращатьФизлицо Тогда
				Значение.Добавить(Выборка.Физлицо, Выборка.ФизлицоНаименование);
			Иначе
				Значение.Добавить(Выборка.Ссылка, Выборка.Наименование);
			КонецЕсли;
		КонецЦикла;
		
		СтандартнаяОбработка = Ложь;
		Возврат Значение;
		
	Иначе
		// значений для выбора больше 50
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ПодобратьСписокРаботниковКандидатов()

// Процедура строит список должностей (или подразделений), по штатному расписанию организации.
//  
// Параметры: 
//  Режим - строка, может принимать значения: "Должность" или "ПодразделениеОрганизации"
//			определяет, что именно будет выбирать пользователь
//  ДолжностьИлиПодразделениеОрганизации - СправочникСсылка.ПодразделенияОрганизаций или   
//          СправочникСсылка.Должности, второе значение в текущей строке т.п.
//
// Возвращаемое значение
//  нет
//
Функция ВыбратьИзШтатногоРасписанияОрганизации(Режим, Организация, ДолжностьИлиПодразделениеОрганизации) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(ДолжностьИлиПодразделениеОрганизации) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("ДолжностьИлиПодразделениеОрганизации", ДолжностьИлиПодразделениеОрганизации);
	
	Если Режим = "ПодразделениеОрганизации" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК Элемент,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ЭлементНаименование
		|ИЗ
		|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(, ПодразделениеОрганизации.Владелец = &Владелец) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность = &ДолжностьИлиПодразделениеОрганизации
		|	И ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок > 0";
		
	ИначеЕсли Режим = "Должность" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Элемент,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Наименование КАК ЭлементНаименование
		|ИЗ
		|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(, ПодразделениеОрганизации.Владелец = &Владелец) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = &ДолжностьИлиПодразделениеОрганизации
		|	И ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок > 0";
		
	Иначе
		Возврат Новый СписокЗначений
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый СписокЗначений
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	СписокВыбора = Новый СписокЗначений();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Элемент, Выборка.ЭлементНаименование);	
	КонецЦикла;
	
    Возврат СписокВыбора
	
КонецФункции // ВыбратьИзШтатногоРасписанияОрганизации

// Процедура строит список должностей (или подразделений), по штатному расписанию.
//  
// Параметры: 
//  Режим - строка, может принимать значения: "Должность" или "Подразделение"
//			определяет, что именно будет выбирать пользователь
//  ДолжностьИлиПодразделение - СправочникСсылка.Подразделения или   
//          СправочникСсылка.Должности, второе значение в текущей строке т.п.
//
// Возвращаемое значение
//  нет
//
Функция ВыбратьИзШтатногоРасписания(Режим, ДолжностьИлиПодразделение) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДолжностьИлиПодразделение) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДолжностьИлиПодразделение", ДолжностьИлиПодразделение);
	
	Если Режим = "ПодразделениеУпр" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтатноеРасписаниеСрезПоследних.Подразделение КАК Элемент,
		|	ШтатноеРасписаниеСрезПоследних.Подразделение.Наименование КАК ЭлементНаименование
		|ИЗ
		|	РегистрСведений.КадровыйПлан.СрезПоследних(,) КАК ШтатноеРасписаниеСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеСрезПоследних.Должность = &ДолжностьИлиПодразделение
		|	И ШтатноеРасписаниеСрезПоследних.Количество > 0";
		
	ИначеЕсли Режим = "ДолжностьУпр" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтатноеРасписаниеСрезПоследних.Должность КАК Элемент,
		|	ШтатноеРасписаниеСрезПоследних.Должность.Наименование КАК ЭлементНаименование
		|ИЗ
		|	РегистрСведений.КадровыйПлан.СрезПоследних(,) КАК ШтатноеРасписаниеСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеСрезПоследних.Подразделение = &ДолжностьИлиПодразделение
		|	И ШтатноеРасписаниеСрезПоследних.Количество > 0";
		
	Иначе
		Возврат Новый СписокЗначений
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый СписокЗначений
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	СписокВыбора = Новый СписокЗначений();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Элемент, Выборка.ЭлементНаименование);	
	КонецЦикла;
	
    Возврат СписокВыбора
	
КонецФункции // ВыбратьИзШтатногоРасписанияОрганизации

// Открывает форму обработки для подготовки списка работников, отобранного по указанным пользователем критериям
//
// Владелец - форма, для которой требуется вызвать обработку
// ДатаАктуальности - дата, по состоянию на которую осматривается список работников
// Организация - ссылка на организацию (может быть в том числе обособленным подразделением), если передана пустая ссылка, выбираются 
//					работники всех организаций
// Подразделение - ссылка на подразделение, если передана пустая ссылка, выбираются 
//					работники всех подразделений
// 
Процедура ОткрытьФормуОтбораСпискаРаботников(Владелец, ДатаАктуальности, ИменаСтраницФормы = Неопределено
	, Организация = Неопределено, Подразделение = Неопределено, ИсполнятьЗапрос = Истина
	, ЗаполнитьДату = Ложь, ВыбиратьСотрудника = Истина
	, УпрУчет = Ложь, РеглУчет = Истина
	, Реквизиты = Неопределено
	, ДатаУволенных = Неопределено, ВключатьУволенных = Ложь
	, ВключатьСовместителей = Истина) Экспорт
	                                                                                                                                                                                                                                                    
	
	Если (Не УпрУчет) и (Не РеглУчет) Тогда
		Предупреждение(НСтр("ru='Не указан вид учета, отобрать список работников невозможно!';uk='Не зазначений вид обліку, відібрати список працівників неможливо!'"));
		Возврат;
	КонецЕсли;
	
	Если РеглУчет И НЕ ЗначениеЗаполнено(Организация) Тогда
		Предупреждение(НСтр("ru='Не указана организация, отобрать список работников невозможно!';uk='Не зазначена організація, відібрати список працівників неможливо!'"));
		Возврат;
	КонецЕсли;
		
	ФормированиеСпискаРаботников = Обработки.ФормированиеСпискаРаботников.Создать();
	ФормированиеСпискаРаботников.ДатаАктуальности		= ДатаАктуальности;
	ФормированиеСпискаРаботников.ДатаУволенных			= ?(ДатаУволенных = Неопределено, НачалоГода(ДатаАктуальности), ДатаУволенных);
	ФормированиеСпискаРаботников.ИсполнятьЗапрос		= ИсполнятьЗапрос;
	ФормированиеСпискаРаботников.ВыбиратьСотрудника		= ВыбиратьСотрудника;
	ФормированиеСпискаРаботников.Реквизиты				= Реквизиты;
	ФормированиеСпискаРаботников.ВключатьУволенных	    = ВключатьУволенных;
	ФормированиеСпискаРаботников.РеглУчет				= РеглУчет;
	ФормированиеСпискаРаботников.УпрУчет				= УпрУчет;

	
	// подготовим Построитель отчета к работе
	ФормированиеСпискаРаботников.ЗаполнитьНачальныеНастройки();
	
	ФормированиеСпискаРаботников.ПостроительОтчета.Параметры.Вставить("ГоловнаяОрганизация", Организация);

	СтруктураНедоступныхОтборов = Новый Структура;
		
	Если ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Найти("ГоловнаяОрганизация") = Неопределено Тогда
			ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Добавить("ГоловнаяОрганизация")
	КонецЕсли;
	ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.ГоловнаяОрганизация.Установить(Организация,);
	СтруктураНедоступныхОтборов.Вставить("ГоловнаяОрганизация");

	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Если ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Найти("Подразделение") = Неопределено Тогда
			ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Добавить("Подразделение")
		КонецЕсли;
		ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.Значение = Подразделение;
		ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.Использование = Истина;
		ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.ВидСравнения = ВидСравнения.ВИерархии;
		СтруктураНедоступныхОтборов.Вставить("Подразделение");
	КонецЕсли;
	
	// Теперь откроем подготовленную форму
	Форма = ФормированиеСпискаРаботников.ПолучитьФорму("ФормаНастройки",Владелец);
	Форма.мСтруктураНедоступныхОтборов = СтруктураНедоступныхОтборов;	
	
	Если Реквизиты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Форма,Реквизиты);
	КонецЕсли;
	
	Если ИменаСтраницФормы = Неопределено Тогда // страницу дополнительных данных не показываем
		Форма.ЭлементыФормы.ПанельСтраницы.Свертка = РежимСверткиЭлементаУправления.Низ;
	Иначе
		УдаляемыеСтраницы = Новый Массив;
		Страницы = Форма.ЭлементыФормы.ПанельСтраницы.Страницы;
		Для каждого СтраницаПанели Из Страницы Цикл
			Если СтраницаПанели.Имя <> ИменаСтраницФормы Тогда
				УдаляемыеСтраницы.Добавить(СтраницаПанели);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтраницаПанели Из УдаляемыеСтраницы Цикл
			Страницы.Удалить(Страницы.Индекс(СтраницаПанели))
		КонецЦикла;
	КонецЕсли;
	
	Форма.ОткрытьМодально();
	
КонецПроцедуры  // ОткрытьФормуОтбораСпискаРаботников()

// Открывает для выбора список доков ЗарплатаКВыплатеОрганизаций конкретной организации
//
// Параметры
//  Элемент - поле ввода, в котором выбирается платежная ведомость 
//  СтандартнаяОбработка - булево, признак стандартной обработки события
//  Организация - СправочникСсылка.Организации, организация ведости которой надо выбрать
//  СпособыВыплатыЗарплаты - ПеречислениеСсылка.СпособыВыплатыЗарплаты - дополнительное ограничение на список ведомостей
//
Процедура ОткрытьФормуВыбораПлатежныхВедомостейОрганизации(Элемент, СтандартнаяОбработка, Организация, СпособыВыплатыЗарплаты = Неопределено) Экспорт

	СтандартнаяОбработка  = Ложь;
	
	ФормаВыбора = Документы.ЗарплатаКВыплатеОрганизаций.ПолучитьФормуВыбора(, Элемент);
	
	ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение;	
	
	ФормаВыбора.Отбор.Организация.ВидСравнения	= ВидСравнения.Равно;
	ФормаВыбора.Отбор.Организация.Значение		= Организация;
	ФормаВыбора.Отбор.Организация.Использование	= Истина;
		
	ФормаВыбора.Открыть();
	

КонецПроцедуры // ОткрытьФормуВыбораКассовыхПлатежныхВедомостейОрганизации()

#КонецЕсли

// Формирует список головных организаций предприятия
//
Функция ПолучитьСписокГоловныхОрганизаций() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");

	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());

	СписокОрганизаций = Новый СписокЗначений;

	Выборка = Запрос.Выполнить().Выбрать(); 

	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат СписокОрганизаций;

КонецФункции 

// Формирует список организаций предприятия
Функция ПолучитьСписокОрганизаций() Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");

	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());						  

	СписокОрганизаций = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать(); 

	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла; 

	Возврат СписокОрганизаций;
	
КонецФункции 

// Формирует список обособленных структурных подразделений организации
//
Функция ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Организация");
	Запрос.УстановитьПараметр("Организация", Организация);

	СписокОрганизаций = Новый СписокЗначений;

	Выборка = Запрос.Выполнить().Выбрать(); 

	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат СписокОрганизаций;

КонецФункции 

// Определяет размер часовой тарифной ставки на основании месячного оклада и других необходимых параметров
//
Функция ПолучитьЧасовуюТарифнуюСтавкуНаОсновеМесячнойСтавки(Оклад, ПродолжительностьРабочейНедели, ЧислоРабочихДнейВГоду, ЧислоПредпраздничныхДнейВГоду) Экспорт

	Если ПродолжительностьРабочейНедели = 40 Тогда
		СреднемесячноеКоличествоЧасов = (ЧислоРабочихДнейВГоду * 8 + ЧислоПредпраздничныхДнейВГоду * 7) / 12;

	Иначе
		СреднемесячноеКоличествоЧасов = ПродолжительностьРабочейНедели / 5 * (ЧислоРабочихДнейВГоду + ЧислоПредпраздничныхДнейВГоду) / 12;

	КонецЕсли;

	// расчет часовой ставки
	Возврат ?(СреднемесячноеКоличествоЧасов = 0, 0, Оклад / СреднемесячноеКоличествоЧасов);

КонецФункции

// Возвращает подразделение работника на дату начала события 
//
Функция ПодразделениеРаботникаНаДату(ФизЛицо, Приказ, ДатаАктуальности) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("Приказ",  Приказ);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Текст = "ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Физлицо = &ФизЛицо И Приказ = &Приказ) КАК РаботникиОрганизацийСрезПоследних
	|
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Физлицо = &Физлицо";
	ПрежниеДанные = Запрос.Выполнить().Выбрать();

	Если ПрежниеДанные.Следующий() тогда
		Возврат ПрежниеДанные.ПодразделениеОрганизации; 
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Возвращает значение ставки НДФЛ с доходов нерезидентов 
//
Функция ЗначениеСтавкиНДФЛСНерезидента() Экспорт

	Возврат 30;

КонецФункции 

// Функция возвращает массив видов времени, 
// по идексам этого массива происходит упорядочивание видов времени в сводном табеле
//
Функция ПолучитьМассивУпорядоченныхВидовИспользованияРабочегоВремени() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторИспользованияРабочегоВремени.Ссылка
	|ИЗ
	|	Справочник.КлассификаторИспользованияРабочегоВремени КАК КлассификаторИспользованияРабочегоВремени
	|ГДЕ
	|	(НЕ КлассификаторИспользованияРабочегоВремени.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|			ТОГДА 1
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Ночные)
	|			ТОГДА 2
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|			ТОГДА 3
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|			ТОГДА 4
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|			ТОГДА 5
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Сверхурочные)
	|			ТОГДА 6
	|		ИНАЧЕ 100
	|	КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьМассивДляУпорядочивания()

// Функция проверяет, заполнен ли Регламентированный производственный календарь
Функция ЗаполненРегламентированныйПроизводственныйКалендарь(НачалоПериода, КонецПериода) Экспорт
	ТЗ = "ВЫБРАТЬ
	     |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	     |ИЗ
	     |	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	     |ГДЕ
	     |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода";
		 
	Запрос = Новый Запрос(ТЗ);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции  //ЗаполненРегламентированныйПроизводственныйКалендарь()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ ДОКУМЕНТОВ


// Открывает форму выбора работника для подбора его в табличную часть
//
// Владелец - табличное поле с табличной частью документа
//            в такой табличной части документа подбирается физлицо из числа работников компании
//
// СтандартнаяОбработка - флаг стандартной обработки события НачалоВыбора
//
// Ключ - ключ уникальности открываемой формы
//
// Подразделение - ссылка на подразделение, если передана пустая ссылка, выбираются 
//					работники всех подразделений
// 
Процедура ОткрытьФормуВыбораРаботника(Владелец, СтандартнаяОбработка, Ключ, Подразделение) Экспорт

	Форма = ПолучитьОбщуюФорму("ФормаВыбораРаботника", Владелец, Ключ);

	Форма.РежимВыбора   = Истина;
	Форма.Подразделение = Подразделение;

	Если ТипЗнч(Владелец) = Тип("ТабличноеПоле") Тогда // Выбор работника организации из ТЧ документа
		
		Форма.ПараметрФизлицо = Владелец.ТекущаяСтрока.Физлицо;
		
	ИначеЕсли ТипЗнч(Владелец) = Тип("ПолеВвода") Тогда                                            
		
		Форма.ПараметрФизлицо = Владелец.Значение;
		
	ИначеЕсли ТипЗнч(Владелец) = Тип("Форма") Тогда   // Выбор работника организации из формы документа; физлицо и приказ - реквизиты документа
		Форма.ПараметрФизлицо = Владелец.Физлицо;

	КонецЕсли;

	Форма.Открыть();

	СтандартнаяОбработка = Ложь;

КонецПроцедуры  // ОткрытьФормуВыбораФизлица

Процедура ПроставитьДанныеСтроки(Сотрудник, ДатаСобытия, ЭлементФормы) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ФизЛицо", Сотрудник.ФизЛицо);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("парамДатаСобытия", ДатаСобытия);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Работники.Подразделение КАК ПодразделениеУпр,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ГрафикРаботы ЕСТЬ NULL 
	|			ТОГДА Работники.ГрафикРаботы
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	РаботникиОрганизации.Должность КАК Должность,
	|	Работники.Должность КАК ДолжностьУпр,
	|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ПринятНаНовоеРабочееМесто КАК ПринятНаНовоеРабочееМесто,
	|	Работники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокУпр,
	|	РаботникиОрганизации.СпособОтраженияВБухучете,
	|	Работники.СпособОтраженияВУпрУчете
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДатаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизации
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&парамДатаСобытия, ФизЛицо = &ФизЛицо) КАК Работники
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.Текст = ТекстЗапроса;
	НаборыДанных = Запрос.Выполнить().Выгрузить();
	
	Если НаборыДанных.Количество() = 0 Тогда
		// Если не нашли данных - ничего не делаем
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЭлементФормы) = Тип("ТабличноеПоле") Тогда
		
		// поле ПодразделениеОрганизации есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("ПодразделениеОрганизации") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока.ПодразделениеОрганизации = НаборыДанных[0].ПодразделениеОрганизации;
		КонецЕсли;
		
		// поле ПодразделениеОрганизации есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("ПодразделениеУпр") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока.ПодразделениеУпр = НаборыДанных[0].ПодразделениеУпр;
		КонецЕсли;
		
		// поле ГрафикРаботы есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("ГрафикРаботы") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока.ГрафикРаботы = НаборыДанных[0].ГрафикРаботы;
		КонецЕсли;
		
		// поле Должность есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("Должность") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока.Должность = НаборыДанных[0].Должность;
		КонецЕсли;
		
			// поле Должность Упр есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("ДолжностьУпр") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока.ДолжностьУпр = НаборыДанных[0].ДолжностьУпр;
		КонецЕсли;
						
		// поле Авторасчет есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("Авторасчет") <> НеОпределено Тогда
			ЭлементФормы.ТекущаяСтрока["Авторасчет"] = Истина;
		КонецЕсли;
				
		// поле Состояние есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("Состояние") <> НеОпределено Тогда
			ЭлементФормы.ТекущаяСтрока["Состояние"] = Перечисления.СостоянияРаботникаОрганизации.НеИзменять;
		КонецЕсли;
		
		//поле Занимаемых ставок есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("ЗанимаемыхСтавок") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока["ЗанимаемыхСтавок"] = НаборыДанных[0].ЗанимаемыхСтавок;
		КонецЕсли;
		
		//поле Занимаемых ставок упр есть не во всех табличных частях
		Если ЭлементФормы.Колонки.Найти("ЗанимаемыхСтавокУпр") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока["ЗанимаемыхСтавокУпр"] = НаборыДанных[0].ЗанимаемыхСтавокУпр;
		КонецЕсли;
		
		//поле Способ отражения в бухучете есть не во всех табличных частях
        Если ЭлементФормы.Колонки.Найти("СпособОтраженияВБухучете") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока["СпособОтраженияВБухучете"] = НаборыДанных[0].СпособОтраженияВБухучете;
		КонецЕсли;
		
		//поле Способ отражения в упручете есть не во всех табличных частях
        Если ЭлементФормы.Колонки.Найти("СпособОтраженияВУпрУчете") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока["СпособОтраженияВУпрУчете"] = НаборыДанных[0].СпособОтраженияВУпрУчете;
		КонецЕсли;
		Если ЭлементФормы.Колонки.Найти("ПринятНаНовоеРабочееМесто") <> Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока.ПринятНаНовоеРабочееМесто = НаборыДанных[0].ПринятНаНовоеРабочееМесто;
		КонецЕсли;
		
	Иначе	
		ЭлементФормы.ПодразделениеОрганизации = НаборыДанных[0].ПодразделениеОрганизации;
		ЭлементФормы.ПодразделениеУпр = НаборыДанных[0].ПодразделениеУпр;
		ЭлементФормы.ГрафикРаботы = НаборыДанных[0].ГрафикРаботы;
		ЭлементФормы.Должность = НаборыДанных[0].Должность;
		ЭлементФормы.ДолжностьУпр = НаборыДанных[0].ДолжностьУпр;
		ЭлементФормы.СпособОтраженияВБухучете = НаборыДанных[0].СпособОтраженияВБухучете;
		ЭлементФормы.СпособОтраженияВУпрУчете = НаборыДанных[0].СпособОтраженияВУпрУчете;
		ЭлементФормы.ПринятНаНовоеРабочееМесто = НаборыДанных[0].ПринятНаНовоеРабочееМесто;
	
	КонецЕсли;

КонецПроцедуры // ПроставитьДанныеСтроки()

// Открывает форму выбора работника для подбора его в табличную часть
//
// Владелец - табличное поле с табличной частью документа
//            в такой табличной части документа подбирается физлицо из числа работников компании
//
// СтандартнаяОбработка - флаг стандартной обработки события НачалоВыбора
//
// Ключ - ключ уникальности открываемой формы
//
// Подразделение - ссылка на подразделение, если передана пустая ссылка, выбираются 
//					работники всех подразделений
// 
Процедура ОткрытьФормуВыбораКандидата(Владелец, СтандартнаяОбработка, Ключ, Статус) Экспорт

	Форма = ПолучитьОбщуюФорму("ФормаВыбораКандидата", Владелец, Ключ);

	Форма.РежимВыбора      = Истина;
	Форма.СтатусКандидатов = Статус;
	Форма.ПараметрФизлицо  = Владелец.ТекущаяСтрока.Физлицо;

	Форма.Открыть();
	СтандартнаяОбработка   = Ложь;

КонецПроцедуры  // ОткрытьФормуВыбораФизлица

// процедура устанавливает текущую строку в табличных полях формы 
// объекта, связанных с табличными частями объекта
// предположения:
// все табличные части и соответсвующие им табличные поля - одноименны
// все "синхронизируемые" табличные части имеют колонку с одинаковым 
// именем по которой ведется синхронизация
// 
// Параметры:
// 	Форма - форма объекта
//  Объект - объект данных
//  Элемент - элемнт формы в котором возникла активизация строки
//  СинхронизируемыеТабличныеЧасти - соответствие с 
//  			элементами, соответствующими синхронизируемым табличным полям
//  ИмяКолонки - имя колнки синхронизации
Процедура СинхронизироватьСтроки(Форма, Объект, Элемент, СинхронизируемыеТабличныеЧасти, ИмяКолонки) Экспорт

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Имя = Элемент.Имя;
	Если СинхронизируемыеТабличныеЧасти[Имя] = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если СинхронизируемыеТабличныеЧасти[Имя] Тогда
		СинхронизируемыеТабличныеЧасти[Имя] = Ложь;
		Возврат;
	КонецЕсли;

	Для Каждого ЭлементСоответствия Из СинхронизируемыеТабличныеЧасти Цикл

		Если ЭлементСоответствия.Ключ = Имя Тогда 
			Продолжить;
		КонецЕсли;

		Попытка
			СтрокаТЧ = Объект[ЭлементСоответствия.Ключ].Найти(Элемент.ТекущиеДанные[ИмяКолонки], ИмяКолонки);
		Исключение
			СтрокаТЧ = Форма[ЭлементСоответствия.Ключ].Найти(Элемент.ТекущиеДанные[ИмяКолонки], ИмяКолонки);
		КонецПопытки;

		Если СтрокаТЧ <> Неопределено Тогда

			СинхронизируемыеТабличныеЧасти[ЭлементСоответствия.Ключ]    = Истина;
			Форма.ЭлементыФормы[ЭлементСоответствия.Ключ].ТекущаяСтрока = СтрокаТЧ;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры  //  СинхронизироватьСтроки

// Увеличивает номер в переданной строке на 1
//
// Параметры
//  ПоследнийНомер - строка - представляет собой номер (документа, табельный и т.п.)
//
// Возвращаемое значение:
//  строка  - следующий по порядку номер
//
Функция ПолучитьСледующийНомер(ПоследнийНомер) Экспорт 

	ДлинаНомера = СтрДлина(ПоследнийНомер);
	Если ДлинаНомера = 0 Тогда
		Возврат "1"
	КонецЕсли;
	СчетчикСимв = ДлинаНомера;
	Пока СчетчикСимв > 0 Цикл
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Сред(ПоследнийНомер, СчетчикСимв, 1)) Тогда
			СчетчикСимв = СчетчикСимв - 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если СчетчикСимв = ДлинаНомера Тогда
		НомерЧисловой = 1
	Иначе
		НомерЧисловой = Число(Сред(ПоследнийНомер, СчетчикСимв + 1));
	КонецЕсли;
	Если НомерЧисловой < Pow(10, ДлинаНомера - СчетчикСимв) - 1 Тогда
		СледующийНомер = НомерЧисловой + 1;
	Иначе
		СледующийНомер = НомерЧисловой;
	КонецЕсли;
	НовыйНомер = Лев(ПоследнийНомер,  СчетчикСимв) + Формат(СледующийНомер,"ЧЦ=" + (ДлинаНомера - СчетчикСимв) + "; ЧВН=; ЧГ=0");
	Возврат НовыйНомер
	
КонецФункции // ПолучитьСледующийНомер()

// Заполняет реквизит "КраткийСоставДокумента" документа по его табличным частям.
//
// Параметры
//  ТЧДокумента					– табличная часть документа по которой происходит заполнение реквизита
//  ДополнительнаяТЧДокумента	- табличная часть документа, как правило это ТЧ с дополнительными начислениями
//
// Возвращаемое значение:
//   строка, значение реквизита "КраткийСоставДокумента".
//
Функция ЗаполнитьКраткийСоставДокумента(ТЧДокумента, ДополнительнаяТЧДокумента = Неопределено, КраткийСоставДокумента = "") Экспорт

	Если КраткийСоставДокумента <> "" Тогда
	
		КраткийСоставДокумента = КраткийСоставДокумента + ", ";
	
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ТЧДокумента Цикл
			
		ФИОФизЛица = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаТЧ.ФизЛицо);
		Если Найти(КраткийСоставДокумента, ФИОФизЛица) = 0 Тогда
			
			Если СтрДлина(КраткийСоставДокумента) < 100 Тогда
				КраткийСоставДокумента = КраткийСоставДокумента + ", " + ФИОФизЛица;
			Иначе
				КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
				Прервать;
			КонецЕсли;
			
		КонецЕсли; 
	
	КонецЦикла;
	
	Если ДополнительнаяТЧДокумента <> Неопределено И СтрДлина(КраткийСоставДокумента) < 100 Тогда
	
		Для каждого СтрокаТЧ Из ДополнительнаяТЧДокумента Цикл
			
			ФИОФизЛица = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаТЧ.ФизЛицо);
			Если Найти(КраткийСоставДокумента, ФИОФизЛица) = 0 Тогда
				
				Если СтрДлина(КраткийСоставДокумента) < 100 Тогда
					КраткийСоставДокумента = КраткийСоставДокумента + ", " + ФИОФизЛица;
				Иначе
					Если Лев(КраткийСоставДокумента,2) = ", " Тогда
						КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
					Иначе
						КраткийСоставДокумента = Лев(КраткийСоставДокумента,97) + "...";
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	 
	КонецЕсли;
	
	Если Лев(КраткийСоставДокумента,2) = ", " Тогда
		ДлинаСтроки = СтрДлина(КраткийСоставДокумента);
		Если ДлинаСтроки < 100 Тогда
			КраткийСоставДокумента = Сред(КраткийСоставДокумента,3)
		Иначе
			КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат КраткийСоставДокумента;
	
КонецФункции // ЗаполнитьКраткийСоставДокумента()

// Функция возвращает график работы по умолчанию
// График получается из настроек пользователя или из константы.
//
Функция ПолучитьГрафикРаботы(Ответственный) Экспорт
	
	ГрафикРаботы = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Ответственный, "ГрафикРаботы");
	Если НЕ ЗначениеЗаполнено(ГрафикРаботы) Тогда
		ГрафикРаботы = Константы.ОсновнойГрафикРаботыПредприятий.Получить();
	КонецЕсли;
	Возврат ГрафикРаботы;
	
КонецФункции	


Процедура ЗаполнитьФизЛицоПоТЧ(ДокументТЧ, ИмяСотрудник = "Сотрудник", ИмяФизЛицо = "ФизЛицо") Экспорт
	
	Для Каждого СтрокаДок из ДокументТЧ Цикл
		Если ЗначениеЗаполнено(СтрокаДок[ИмяФизЛицо]) и НЕ ЗначениеЗаполнено(СтрокаДок[ИмяСотрудник]) Тогда
			Продолжить;
		КонецЕсли;	
		СтрокаДок[ИмяФизЛицо]= СтрокаДок[ИмяСотрудник].ФизЛицо;
	КонецЦикла;	
    	
КонецПроцедуры	

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция Просклонять(Компонента, Знач Фраза = "", Падеж = 1, Результат) Экспорт
	
	Результат = Фраза;
	
	#Если Клиент Тогда
		
	Попытка
		Результат = Компонента.Просклонять(Фраза, Падеж);
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
	#Иначе
	
	Возврат Ложь;
	
	#КонецЕсли
	
КонецФункции // Просклонять()

// Функция склоняет ФИО
// Параметры:
//  ФИО (обязательный), тип строка
//   Параметр должен содержать фамилию, имя и отчество в именительном падеже единственного числа.
//   Строка должна состоять только из букв русского алфавита, пробелов и дефисов. Фамилия, имя и отчество
//   должны разделяться пробелами. Внутри фамилии, имени, отчества пробелов быть не должно.
//   Допустимы следующие сочетания фамилии, имени и отчества: ФИО, ИОФ, ИО, ИФ, ФИ, Ф, И, О.
//   Двойные и тройные имена и фамилии должны писаться через дефис. Имена и отчества должны быть полные
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Пол (необязательный), тип ПеречислениеСсылка.ПолФизическихЛиц
//   Данный параметр предназначен для разрешения возможных неоднозначностей, например, имя Карен Акопян
//   может принадлежать и мужчине, и женщине, и в зависимости от этого склоняться или не склоняться.
//   В остальных случаях рекомендуется опускать этот параметр.
//
Функция ПросклонятьФИО(Компонента, Знач ФИО = "", Падеж = 1, Пол = 0, Результат = "", СообщениеОбОшибке = "") Экспорт
	
	Результат = ФИО;
	
	Если ПустаяСтрока(ФИО) Тогда
		СообщениеОбОшибке = НСтр("ru='Строка с ФИО не должна быть пустой.';uk='Рядок з ПІБ не повинен бути порожнім.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не РегламентированнаяОтчетность.ФИОНаписаноВерно(ФИО) Тогда
		СообщениеОбОшибке = НСтр("ru='Строка с ФИО должна состоять только из букв русского алфавита, пробелов и дефисов.';uk='Рядок з ПІБ повинен складатися тільки з букв російського алфавіту, пробілів і дефісів.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ФИО, " ") > 3 Тогда
		СообщениеОбОшибке = НСтр("ru='Фамилия, имя и отчество должны разделяться пробелами. Внутри фамилии, имени и отчества пробелов быть не должно.';uk=""Прізвище, ім'я та по батькові повинні відокремлюватися пробілами. Всередині прізвища, імені та по батькові пробілів бути не повинно.""");
		Возврат Ложь;
	КонецЕсли;
	
	#Если Клиент Тогда
		
	Попытка
		Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 1);
				
		ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 2);
				
		Иначе
			Результат = Компонента.Просклонять(ФИО, Падеж);
				
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
	#Иначе
	
	Возврат Ложь;
	
	#КонецЕсли
	
КонецФункции // ПросклонятьФИО()

// Функция склоняет Фамилию, Имя и Отчество
// Параметры:
//  Фамилия, Имя, Отчество (обязательный), тип строка
//   Параметры должены содержать фамилию, имя и отчество в именительном падеже единственного числа.
//   Строка должна состоять только из букв русского алфавита, пробелов и дефисов. 
//   Внутри фамилии, имени, отчества пробелов быть не должно.
//   Двойные и тройные имена и фамилии должны писаться через дефис. Имена и отчества должны быть полные
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Пол (необязательный), тип ПеречислениеСсылка.ПолФизическихЛиц
//   Данный параметр предназначен для разрешения возможных неоднозначностей, например, имя Карен Акопян
//   может принадлежать и мужчине, и женщине, и в зависимости от этого склоняться или не склоняться.
//   В остальных случаях рекомендуется опускать этот параметр.
//
Функция ПросклонятьФамилиюИмяОтчество(Компонента, Знач Фамилия = "", Знач Имя = "", Знач Отчество = "", Падеж = 1, Пол = 0, Результат = "", СообщениеОбОшибке = "") Экспорт
	
	ФамилияНовая	= Фамилия;
	ИмяНовое		= Имя;
	ОтчествоНовое	= Отчество;
	
	Результат = Фамилия + " " + Имя + " " + Отчество;
	
	// Двойные и тройные ФИО, если указаны с пробелами, исправим на использование дефиса
	НужноИсправитьФамилию	= Найти(Фамилия, " ") > 0;
	НужноИсправитьИмя		= Найти(Имя, " ") > 0;
	НужноИсправитьОтчество	= Найти(Отчество, " ") > 0;
	Если НужноИсправитьФамилию Тогда
		ФамилияНовая = СтрЗаменить(Фамилия, " ", "-");
	КонецЕсли;
	Если НужноИсправитьИмя Тогда
		ИмяНовое = СтрЗаменить(Имя, " ", "-");
	КонецЕсли;
	Если НужноИсправитьОтчество Тогда
		ОтчествоНовое = СтрЗаменить(Отчество, " ", "-");
	КонецЕсли;
	
	ФИО = ФамилияНовая + " " + ИмяНовое + " " + ОтчествоНовое;
	
	Если ПустаяСтрока(ФИО) Тогда
		СообщениеОбОшибке = НСтр("ru='Строка с ФИО не должна быть пустая.';uk='Рядок з ПІБ не повинен бути порожнім.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не РегламентированнаяОтчетность.ФИОНаписаноВерно(ФИО) Тогда
		СообщениеОбОшибке = НСтр("ru='Строка с ФИО должна состоять только из букв русского алфавита, пробелов и дефисов.';uk='Рядок з ПІБ повинен складатися тільки з букв російського алфавіту, пробілів і дефісів.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ФИО, " ") > 3 Тогда
		СообщениеОбОшибке = НСтр("ru='Фамилия, имя и отчество должны разделяться пробелами. Внутри фамилии, имени, отчества пробелов быть не должно.';uk=""Прізвище, ім'я та по батькові повинні відокремлюватися пробілами. Всередині прізвища, імені, по батькові пробілів бути не повинно.""");
		Возврат Ложь;
	КонецЕсли;
	
	#Если Клиент Тогда
		
	Попытка
		Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 1);
				
		ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 2);
				
		Иначе
			Результат = Компонента.Просклонять(ФИО, Падеж);
				
		КонецЕсли;
		
		// Вернем пробелы в составные ФИО обратно, если до этого их изменили
		Если НужноИсправитьФамилию ИЛИ НужноИсправитьИмя ИЛИ НужноИсправитьОтчество Тогда
			
			МассивФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Результат, " ");
			
			Результат = "";
			
			ИндексФИО = 0;
			
			Если Не ПустаяСтрока(Фамилия) Тогда
				ФамилияНовая = МассивФИО[ИндексФИО];
				ИндексФИО = ИндексФИО + 1;
				
				Если НужноИсправитьФамилию Тогда
					
					Если СтрЧислоВхождений(Фамилия, "-") > 0 Тогда
						
						МассивФамилия = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ФамилияНовая, "-");
						ФамилияНовая = МассивФамилия[0];
						ИндексФамилия = 1;
						
						Пока Истина Цикл
							
							ПозПробел = Найти(Фамилия, " ");
							ПозДефис  = Найти(Фамилия, "-");
							
							Если ПозПробел = ПозДефис Тогда
								Прервать;
							КонецЕсли;
							
							Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
								ФамилияНовая = ФамилияНовая + " ";
								Фамилия = Сред(Фамилия, ПозПробел+1);
								
							ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
								ФамилияНовая = ФамилияНовая + "-";
								Фамилия = Сред(Фамилия, ПозДефис+1);
								
							КонецЕсли;
							
							ФамилияНовая = ФамилияНовая + МассивФамилия[ИндексФамилия];
							ИндексФамилия = ИндексФамилия + 1;
							
						КонецЦикла;
						
					Иначе
						ФамилияНовая = СтрЗаменить(ФамилияНовая, "-", " ");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Результат = Результат + ФамилияНовая;
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(Имя) Тогда
				ИмяНовое = МассивФИО[ИндексФИО];
				ИндексФИО = ИндексФИО + 1;
				
				Если НужноИсправитьИмя Тогда
					
					Если СтрЧислоВхождений(Имя, "-") > 0 Тогда
						
						МассивИмя = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ИмяНовое, "-");
						ИмяНовое = МассивИмя[0];
						ИндексИмя = 1;
						
						Пока Истина Цикл
							
							ПозПробел = Найти(Имя, " ");
							ПозДефис  = Найти(Имя, "-");
							
							Если ПозПробел = ПозДефис Тогда
								Прервать;
							КонецЕсли;
							
							Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
								ИмяНовое = ИмяНовое + " ";
								Имя = Сред(Имя, ПозПробел+1);
								
							ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
								ИмяНовое = ИмяНовое + "-";
								Имя = Сред(Имя, ПозДефис+1);
								
							КонецЕсли;
							
							ИмяНовое = ИмяНовое + МассивИмя[ИндексИмя];
							ИндексИмя = ИндексИмя + 1;
							
						КонецЦикла;
						
					Иначе
						ИмяНовое = СтрЗаменить(ИмяНовое, "-", " ");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Результат = СокрЛП(Результат + " " + ИмяНовое);
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(Отчество) Тогда
				ОтчествоНовое = МассивФИО[ИндексФИО];
				ИндексФИО = ИндексФИО + 1;
				
				Если НужноИсправитьОтчество Тогда
					
					Если СтрЧислоВхождений(Отчество, "-") > 0 Тогда
						
						МассивОтчество = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ОтчествоНовое, "-");
						ОтчествоНовое = МассивОтчество[0];
						ИндексОтчество = 1;
						
						Пока Истина Цикл
							
							ПозПробел = Найти(Отчество, " ");
							ПозДефис  = Найти(Отчество, "-");
							
							Если ПозПробел = ПозДефис Тогда
								Прервать;
							КонецЕсли;
							
							Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
								ОтчествоНовое = ОтчествоНовое + " ";
								Отчество = Сред(Отчество, ПозПробел+1);
								
							ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
								ОтчествоНовое = ОтчествоНовое + "-";
								Отчество = Сред(Отчество, ПозДефис+1);
								
							Иначе
								Прервать;
								
							КонецЕсли;
							
							ОтчествоНовое = ОтчествоНовое + МассивОтчество[ИндексОтчество];
							ИндексОтчество = ИндексОтчество + 1;
							
						КонецЦикла;
						
					Иначе
						ОтчествоНовое = СтрЗаменить(ОтчествоНовое, "-", " ");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Результат = СокрЛП(Результат + " " + ОтчествоНовое);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
	#Иначе
	
	Возврат Ложь;
	
	#КонецЕсли
	
КонецФункции // ПросклонятьФИО()

// Функция формирует наименовние элемента справочника СотрудникиОрганизаций
//
// Параметры
//  <Физлицо>  – <СправочникСсылка.ФизическиеЛица> – физлицо 
//  <Постфикс>  – <Строка> – постфикс наименования сотрудника
//
// Возвращаемое значение:
//   <Строка>   – наименование сотрудника
//
Функция УстановитьНаименованиеСотрудника(Физлицо, Постфикс) Экспорт

	Возврат  Физлицо.Наименование + " " + Постфикс;

КонецФункции // УстановитьНаименованиеСотрудника()

// Процедура производит синхронирзацию наименований сотрудников
Процедура СинхронизироватьНаименованияСотрудников(Физлицо, Сотрудник = Неопределено) Экспорт
	
	Если Сотрудник = Неопределено Тогда
		Сотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	КонецЕсли; 

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизаций.Наименование,
	|	СотрудникиОрганизаций.ПостфиксНаименования,
	|	СотрудникиОрганизаций.Ссылка
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|ГДЕ
	|	СотрудникиОрганизаций.Физлицо = &парамФизлицо";	
	
	Запрос.УстановитьПараметр("парамФизлицо", Физлицо);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = Сотрудник Тогда
			// не обрабатываем сотрудника, из которого вызвана синхронизация
			Продолжить;
		КонецЕсли; 
		
		СотрудникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка	
			СотрудникОбъект.Заблокировать();
		Исключение
			Продолжить;
		КонецПопытки;
		СотрудникОбъект.Наименование = УстановитьНаименованиеСотрудника(Физлицо, Выборка.ПостфиксНаименования);
		СотрудникОбъект.Записать();
		СотрудникОбъект.Разблокировать();
	КонецЦикла; 

КонецПроцедуры

// Процедура открывает форму выбора сотрудников организации
// Параметры:
//	Владелец 			- владелец формы
//	Ключ 				- ключ, ссылка на документ из которого открывается форма
//	ЗакрыватьПриВыборе 	- Булево
//	ДатаСреза 			- дата, передается в форму для получения доп. данных по сотруднику на эту дату
//	ГоловнаяОрганизация - головная организация
//	КогоПодбирать 		- 0-всех, 1 - только по трудовым договорам, 2 - только договора ГПХ
//                      - 3 - внешние совместители, 4 - основные сотрудники и внешние совместители
//	СтандартнаяОбработка- Булево
//	ТекущееЗначение 	- ссылка на элемент, на котором необходимо спозиционироваться при открытии формы
//
Процедура ОткрытьФормуВыбораСотрудникаОрганизации(Владелец, Ключ, ЗакрыватьПриВыборе, ДатаСреза, ГоловнаяОрганизация = Неопределено, КогоВыбирать = 0, СтандартнаяОбработка = Неопределено, ТекущееЗначение = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуВыбора(, Владелец, Ключ);
	
	Форма.ДатаСреза 					= ДатаСреза;
	Форма.ПараметрВыборГруппИЭлементов	= ИспользованиеГруппИЭлементов.Элементы;
	Форма.РежимВыбора					= Истина;
	Форма.ЗакрыватьПриВыборе			= ЗакрыватьПриВыборе;
	
	Если ТекущееЗначение <> Неопределено Тогда
		Если ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			Форма.ПараметрТекущаяСтрока		= ТекущееЗначение;
			
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Физлицо",				ТекущееЗначение);
			Запрос.УстановитьПараметр("ВидЗанятости",			Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
			Запрос.УстановитьПараметр("Трудовой",				Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
			Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ГоловнаяОрганизация);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Ссылка,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизаций.ВидДоговора = &Трудовой
			|			ТОГДА 1
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК Порядок
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	(СотрудникиОрганизаций.ВидДоговора <> &Трудовой
			|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> &ВидЗанятости)
			|	И СотрудникиОрганизаций.Физлицо = &Физлицо
			|	И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Форма.ПараметрТекущаяСтрока	= Выборка.Ссылка;
			КонецЕсли;
			
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Неверный тип параметра: ';uk='Невірний тип параметра: '") + ТипЗнч(ТекущееЗначение));
			
		КонецЕсли;
	КонецЕсли;
	
	//установим отборы
	Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		Форма.Отбор.Организация.Установить(ГоловнаяОрганизация);
		Форма.Отбор.Организация.Использование = ЗначениеЗаполнено(ГоловнаяОрганизация);
	КонецЕсли;
		
	Если КогоВыбирать = 2 Тогда
		//выбор только договорников
		СписокДоговоров = Новый СписокЗначений;
		СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
		СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
		Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.ВСписке;
		Форма.Отбор.ВидДоговора.Использование = Истина;
		Форма.Отбор.ВидДоговора.Значение	  = СписокДоговоров;
	ИначеЕсли КогоВыбирать = 1 Тогда
		//выбор только трудовые договора
		Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.Равно;
		Форма.Отбор.ВидДоговора.Использование = Истина;
		Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
	ИначеЕсли КогоВыбирать = 0 Тогда
		//отбор по всем, исключим сотрудников упр. учета
		Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.НеРавно;
		Форма.Отбор.ВидДоговора.Использование = Истина;
		Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий;
	ИначеЕсли КогоВыбирать = 5 Тогда
		//отбор по всем
	ИначеЕсли КогоВыбирать = 3 Тогда
		//выбор только внешних совместителей
		Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.Равно;
		Форма.Отбор.ВидДоговора.Использование = Истина;
		Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
		Форма.Отбор.ВидЗанятости.ВидСравнения  = ВидСравнения.Равно;
		Форма.Отбор.ВидЗанятости.Использование = Истина;
		Форма.Отбор.ВидЗанятости.Значение	  = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
	ИначеЕсли КогоВыбирать = 4 Тогда
		//выбор основных сотрудников и внешних совместителей
		Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.Равно;
		Форма.Отбор.ВидДоговора.Использование = Истина;
		Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
		Форма.Отбор.ВидЗанятости.ВидСравнения  = ВидСравнения.ВСписке;
		Форма.Отбор.ВидЗанятости.Использование = Истина;
		Форма.Отбор.ВидЗанятости.Значение.Добавить(Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
		Форма.Отбор.ВидЗанятости.Значение.Добавить(Перечисления.ВидыЗанятостиВОрганизации.Совместительство);	
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры // ОткрытьФормуВыбораСотрудникаОрганизации()

Процедура ЗаполнитьФизЛицо(Документ, ИмяСотрудник = "Сотрудник", ИмяФизЛицо = "ФизЛицо") Экспорт
	
	Если ЗначениеЗаполнено(Документ[ИмяФизЛицо]) и НЕ ЗначениеЗаполнено(Документ[ИмяСотрудник]) Тогда
		Возврат;
	КонецЕсли;	
	Документ[ИмяФизЛицо]= Документ[ИмяСотрудник].ФизЛицо;
    	
КонецПроцедуры

// Функция возвращает сведения о позиции штатного расписания на выбранную дату
// для измерений Подразделение и Должность
//
Функция СведенияОПозицииШтатногоРасписания(Период, Подразделение, Должность) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаАктуальности",	Период);
	Запрос.УстановитьПараметр("Подразделение",		Подразделение);
	Запрос.УстановитьПараметр("Должность",			Должность);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.МинимальнаяТарифнаяСтавка,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.МаксимальнаяТарифнаяСтавка,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.ВидТарифнойСтавки,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.ГрафикРаботы,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.ВалютаТарифнойСтавки,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		ПодразделениеОрганизации = &Подразделение
	|			И Должность = &Должность) КАК ШтатноеРасписаниеОрганизацийСрезПоследних";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // СведенияОПозицииШтатногоРасписания()


//{NB 06.02.2025

//Данная функция возвращает положенное количество дней основного ежегодного отпуска для заданной организации
Функция ПолучитьПоложенноеКоличествоДнейОтпуска(Организация) Экспорт
	//Значение по выбранной организации
	ОтборОрганизация = Новый Структура("Организация", Организация);
	КоличествоДнейОтпуска = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(ОтборОрганизация).КоличествоДнейПоложенногоОтпуска;
	
	Возврат КоличествоДнейОтпуска;	
КонецФункции

Процедура ПолучитьТаблицуОстатковДнейОтпуска(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ДополнитьРабочиеПериоды(МенеджерВременныхТаблиц);
	
	
	//Получем информацию о положенном количестве дней отпуска
	//ВТОстаткиОтпусковПоРабочимПериодам
	//В этой временной таблице храним информацию о количестве дней остающихся на конец каждого рабочего периода 
	Запрос.Текст =" 
	|ВЫБРАТЬ 
	|	ДатаЗаписиПоложенныхОтпусков.Сотрудник			КАК Сотрудник,
	|	ДатаЗаписиПоложенныхОтпусков.Организация		КАК Организация,
	|	ДатаЗаписиПоложенныхОтпусков.ВидОтпуска			КАК ВидОтпуска,
	|	ДатаЗаписиПоложенныхОтпусков.ДатаЗаписи 		КАК ДатаИзмененияРазмераПоложенныхОтпусков,
	|	ДатаЗаписиПоложенныхОтпусков.РабочийПериодНачало 	КАК РабочийПериодНачало,
	|	ДатаЗаписиПоложенныхОтпусков.РабочийПериодОкончание КАК РабочийПериодОкончание,
	|	ПоложенныеЕжегодныеОтпуска.Положено 	КАК ПоложеноДнейОтпуска
	|ПОМЕСТИТЬ
	|	ВТПоложеноДнейОтпуска
	|ИЗ
	|(
	|	ВЫБРАТЬ 
	|		РабочиеПериодыОтпуска.Сотрудник			 	 	КАК Сотрудник,
	|		РабочиеПериодыОтпуска.ВидОтпуска			 	КАК ВидОтпуска,
	|		РабочиеПериодыОтпуска.Организация				КАК Организация,
	|		РабочиеПериодыОтпуска.РабочийПериодНачало		КАК РабочийПериодНачало,
	|		РабочиеПериодыОтпуска.РабочийПериодОкончание	КАК РабочийПериодОкончание,
	|		МАКСИМУМ(ПоложенныеОтпускаРаботников.Период)    КАК ДатаЗаписи
	|	ИЗ
	|		ВТРаботникиРабочиеПериоды КАК РабочиеПериодыОтпуска
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ПоложенныеЕжегодныеОтпускаРаботников КАК ПоложенныеОтпускаРаботников	
	|	ПО
	|		РабочиеПериодыОтпуска.Сотрудник = ПоложенныеОтпускаРаботников.Сотрудник
	|		И РабочиеПериодыОтпуска.ВидОтпуска = ПоложенныеОтпускаРаботников.ВидОтпуска
	|		И РабочиеПериодыОтпуска.Организация = ПоложенныеОтпускаРаботников.Организация
	|		И РабочиеПериодыОтпуска.РабочийПериодОкончание >= ПоложенныеОтпускаРаботников.Период 
	|	СГРУППИРОВАТЬ ПО
	|		РабочиеПериодыОтпуска.Сотрудник,
	|		РабочиеПериодыОтпуска.ВидОтпуска,
	|		РабочиеПериодыОтпуска.Организация,
	|		РабочиеПериодыОтпуска.РабочийПериодНачало,
	|		РабочиеПериодыОтпуска.РабочийПериодОкончание
	|)КАК ДатаЗаписиПоложенныхОтпусков
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ПоложенныеЕжегодныеОтпускаРаботников КАК ПоложенныеЕжегодныеОтпуска
	|ПО
	|	ДатаЗаписиПоложенныхОтпусков.ДатаЗаписи = ПоложенныеЕжегодныеОтпуска.Период
	|	И ДатаЗаписиПоложенныхОтпусков.Сотрудник = ПоложенныеЕжегодныеОтпуска.Сотрудник
	|	И ДатаЗаписиПоложенныхОтпусков.ВидОтпуска = ПоложенныеЕжегодныеОтпуска.ВидОтпуска
	|	И ДатаЗаписиПоложенныхОтпусков.Организация = ПоложенныеЕжегодныеОтпуска.Организация	
	|";
	Запрос.Выполнить();	
	
	//Запрос по использованным дням отпуска
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВТПоложеноДнейОтпуска.Сотрудник					КАК Сотрудник,
	|	ВТПоложеноДнейОтпуска.Организация				КАК Организация,
	|	ВТПоложеноДнейОтпуска.РабочийПериодНачало 		КАК РабочийПериодНачало,
	|	ВТПоложеноДнейОтпуска.РабочийПериодОкончание	КАК РабочийПериодОкончание,
	|	ВТПоложеноДнейОтпуска.ВидОтпуска				КАК ВидОтпуска,
	|	ВТПоложеноДнейОтпуска.ПоложеноДнейОтпуска		КАК ПоложеноДнейОтпуска,
	|	СУММА(ЕстьNULL(ИспользованиеОтпусков.ИспользованоОсновногоОборот,0))	КАК ИспользованоДней
	|ПОМЕСТИТЬ ВТИспользованоДнейОтпуска
	|ИЗ
	|	ВТПоложеноДнейОтпуска КАК ВТПоложеноДнейОтпуска
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	РегистрНакопления.ИспользованиеЕжегодныхОтпусковРаботников.Обороты КАК ИспользованиеОтпусков
	|ПО
	|	ВТПоложеноДнейОтпуска.Сотрудник = ИспользованиеОтпусков.Сотрудник	       
	|	И ИспользованиеОтпусков.РабочийПериодНачало >= ВтПоложеноДнейОтпуска.РабочийПериодНачало
	|	И ИспользованиеОтпусков.РабочийПериодОкончание <= ВтПоложеноДнейОтпуска.РабочийПериодОкончание
	|	И ВТПоложеноДнейОтпуска.Организация = ИспользованиеОтпусков.Организация
	|	И ВТПоложеноДнейОтпуска.ВидОтпуска = ИспользованиеОтпусков.ВидОтпуска
	|СГРУППИРОВАТЬ ПО
	|	ВТПоложеноДнейОтпуска.Сотрудник,
	|	ВТположеноДнейОтпуска.Организация,
	|	ВТПоложеноДнейОтпуска.РабочийПериодНачало,
	|	ВТПоложеноДнейОтпуска.РабочийПериодОкончание,
	|	ВТПоложеноДнейОтпуска.ВидОтпуска,
	|	ВТПоложеноДнейОтпуска.ПоложеноДнейОтпуска
	|";
	Запрос.Выполнить();
	
	//В следующем запросе определяется остаток дней отпуска
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Сотрудник				КАК Сотрудник,
	|	Организация				КАК Организация,
	|	РабочийПериодНачало		КАК РабочийПериодНачало,
	|	РабочийПериодОкончание	КАК РабочийПериодОкончание,
	|	ВидОтпуска				КАК ВидОтпуска,
	|	ПоложеноДнейОтпуска		КАК ПоложеноДнейОтпуска,
	|	ИспользованоДней	КАК ИспользованоДнейОтпуска,
	|	ПоложеноДнейОтпуска - ИспользованоДней КАК ОстатокДнейОтпуска
	|ПОМЕСТИТЬ ВТОстатокДнейОтпуска
	|ИЗ
	|	ВТИспользованоДнейОтпуска	КАК ИспользованоДнейОтпуска
	|ГДЕ
	|	ПоложеноДнейОтпуска - ИспользованоДней > 0 
	|";
	Запрос.Выполнить();	
	//Окончательный запрос, сопоставляем требуемому количеству дней отпуска остаток
	Запрос.Текст = "ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.ВидОтпуска КАК ВидОтпуска,
	|	РаботникиОрганизации.Организация КАК Организация,
	|	ОсталосьДнейОтпуска.РабочийПериодНачало КАК РабочийПериодНачало,
	|	ОсталосьДнейОтпуска.РабочийПериодокончание КАК РабочийПериодОкончание,
	|	ЕСТЬNULL(ОсталосьДнейОтпуска.ПоложеноДнейОтпуска, 0) КАК ПоложеноДнейОтпуска,
	|	ЕСТЬNULL(ОсталосьДнейОтпуска.ИспользованоДнейОтпуска, 0) КАК ИспользованоДнейОтпуска,
	|	ЕСТЬNULL(ОсталосьДнейОтпуска.ОстатокДнейОтпуска, 0) КАК ОстатокДнейОтпуска
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|		РаботникиОрганизации.ВидОтпуска КАК ВидОтпуска,
	|		РаботникиОрганизации.Организация КАК Организация
	|	ИЗ
	|		ВТРаботникиОрганизации КАК РаботникиОрганизации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизации.Сотрудник,
	|		РаботникиОрганизации.ВидОтпуска,
	|		РаботникиОрганизации.Организация) КАК РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатокДнейОтпуска КАК ОсталосьДнейОтпуска
	|		ПО РаботникиОрганизации.Сотрудник = ОсталосьДнейОтпуска.Сотрудник
	|			И РаботникиОрганизации.ВидОтпуска = ОсталосьДнейОтпуска.ВидОтпуска
	|			И РаботникиОрганизации.Организация = ОсталосьДнейОтпуска.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.Сотрудник,
	|	РаботникиОрганизации.ВидОтпуска,
	|	РаботникиОрганизации.Организация,
	|	ОсталосьДнейОтпуска.РабочийПериодНачало,
	|	ОсталосьДнейОтпуска.РабочийПериодокончание,
	|	ОсталосьДнейОтпуска.ПоложеноДнейОтпуска,
	|	ОсталосьДнейОтпуска.ИспользованоДнейОтпуска,
	|	ОсталосьДнейОтпуска.ОстатокДнейОтпуска
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсталосьДнейОтпуска.РабочийПериодНачало,
	|	ОсталосьДнейОтпуска.РабочийПериодокончание
	|ИТОГИ
	|	МИНИМУМ(РабочийПериодНачало),
	|	МАКСИМУМ(РабочийПериодОкончание),
	|	СУММА(ПоложеноДнейОтпуска),
	|	СУММА(ИспользованоДнейОтпуска),
	|	СУММА(ОстатокДнейОтпуска)
	|ПО
	|	Сотрудник,
	|	ВидОтпуска";
	Запрос.Выполнить();

КонецПроцедуры

//Процедура добавляет в менеджер временных таблиц дополнительную таблицу
Функция ДополнитьРабочиеПериоды(МенеджерВременныхТаблиц) экспорт
	
	КоличествоЛет=0;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	СрезПервых.Период КАК Период,
	|	РаботникиОрганизации.ДатаОкончания	КАК ДатаОкончания,
	|	СрезПервых.Период КАК ДатаНачала,
	|	РаботникиОрганизации.ВидОтпуска	КАК ВидОтпуска,
	|	РаботникиОрганизации.Организация	КАК Организация
	|ИЗ
	|	ВТРаботникиОрганизации КАК РаботникиОрганизации
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.РаботникиОрганизаций.СрезПервых(,Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТРаботникиОрганизации)) КАК СрезПервых
	|ПО
	|	СрезПервых.Сотрудник = РаботникиОрганизации.Сотрудник
	|";                                                      
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	ТаблицаСотрудникиРабочиеПериоды = Новый ТаблицаЗначений;
	ТаблицаСотрудникиРабочиеПериоды.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
	ТаблицаСотрудникиРабочиеПериоды.Колонки.Добавить("РабочийПериодНачало", Новый ОписаниеТипов("Дата"));
	ТаблицаСотрудникиРабочиеПериоды.Колонки.Добавить("РабочийПериодОкончание", Новый ОписаниеТипов("Дата"));
	ТаблицаСотрудникиРабочиеПериоды.Колонки.Добавить("ВидОтпуска", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления")); 
	ТаблицаСотрудникиРабочиеПериоды.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Пока Выборка.Следующий() Цикл 	
		//Если Выборка.ВидОтпуска.ОтпускНеПереноситсяНаСледующийГод Тогда
		//	РабочийПериодНачало = ДобавитьМесяц(Выборка.Период,(Год(Выборка.ДатаНачала) - Год(Выборка.Период))*12)
		//Иначе
			РабочийПериодНачало =?(КоличествоЛет=0,Выборка.Период,ДобавитьМесяц(Выборка.Период,(Год(Выборка.ДатаНачала) - Год(Выборка.Период)-1-КоличествоЛет)*12));
		//КонецЕсли;	
			
		Пока (Год(РабочийПериодНачало) <= Год(Выборка.ДатаОкончания)) 
			И РабочийПериодНачало < Выборка.ДатаОкончания Цикл
			НоваяСтрока = ТаблицаСотрудникиРабочиеПериоды.Добавить();
			НоваяСтрока.РабочийПериодНачало = РабочийПериодНачало;
			НоваяСтрока.РабочийПериодОкончание = ДобавитьМесяц(РабочийПериодНачало,12) - 1;
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.ВидОтпуска = Выборка.ВидОтпуска;
			НоваяСтрока.Организация	= Выборка.Организация;
			
			РабочийПериодНачало = ДобавитьМесяц(РабочийПериодНачало,12);
		КонецЦикла;		
		//Добавим следующий рабочий период для возможного начисления отпуска авансом
		//Если НЕ Выборка.ВидОтпуска.ОтпускНеПереноситсяНаСледующийГод Тогда
			//НоваяСтрока = ТаблицаСотрудникиРабочиеПериоды.Добавить();
			////Рабочий период изменился в предыдущем цикле
			//НоваяСтрока.РабочийПериодНачало = РабочийПериодНачало;
			//НоваяСтрока.РабочийПериодОкончание = ДобавитьМесяц(РабочийПериодНачало,12) - 1;
			//НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			//НоваяСтрока.ВидОтпуска = Выборка.ВидОтпуска;
			//НоваяСтрока.Организация = Выборка.Организация;
		//КонецЕсли;	
	КонецЦикла;
		
	Запрос.УстановитьПараметр("ТаблицаСотрудникиРабочиеПериоды", ТаблицаСотрудникиРабочиеПериоды);
	Запрос.Текст =" 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиРабочиеПериоды.Сотрудник				КАК Сотрудник,
	|	СотрудникиРабочиеПериоды.РабочийПериодНачало	КАК РабочийПериодНачало,
	|	СотрудникиРабочиеПериоды.РабочийПериодОкончание КАК РабочийПериодОкончание,
	|	СотрудникиРабочиеПериоды.ВидОтпуска				КАК ВидОтпуска,
	|	СотрудникиРабочиеПериоды.Организация			КАК Организация
	|
	|ПОМЕСТИТЬ ВТРаботникиРабочиеПериоды 
	|ИЗ
	|	&ТаблицаСотрудникиРабочиеПериоды КАК СотрудникиРабочиеПериоды";
	
	Запрос.Выполнить();
КонецФункции

Функция ПолучитьОстатокОтпускаПропорционально (Дата, ДатаУвольнения, НачалоПериода, КонецПериода, ДнейВсего, ДнейДоступно, ДнейИспользовано, ДнейКомпенсировано) Экспорт
	
	ДатаОтсчета = ?(Дата > ДатаУвольнения И ЗначениеЗаполнено(ДатаУвольнения), ДатаУвольнения, Дата);
	
	Если ДнейВсего = NULL Тогда
		КвоДнейВсего = 0;
	Иначе
		КвоДнейВсего = ДнейВсего;
	КонецЕсли;
	
	Если ДнейДоступно = NULL Тогда
		КвоДнейДоступно = 0;
	Иначе
		КвоДнейДоступно = ДнейДоступно;
	КонецЕсли;
	
	Если ДнейИспользовано = NULL Тогда
		КвоДнейИспользовано = 0;
	Иначе
		КвоДнейИспользовано = ДнейИспользовано;
	КонецЕсли;
	
	Если ДнейКомпенсировано = NULL Тогда
		КвоДнейКомпенсировано = 0;
	Иначе
		КвоДнейКомпенсировано = ДнейКомпенсировано;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОтсчета) или НЕ ЗначениеЗаполнено(НачалоПериода) или НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		Возврат 0;
	ИначеЕсли ДатаОтсчета >= КонецПериода Тогда
		Возврат КвоДнейДоступно;
	ИначеЕсли ДатаОтсчета < НачалоПериода Тогда
		Возврат 0;
	КонецЕсли;
	
	Пропорция = Окр((ДатаОтсчета-НачалоПериода)/(КонецПериода - НачалоПериода)*КвоДнейВсего);
	Возврат Макс(Пропорция - КвоДнейИспользовано - КвоДнейКомпенсировано,0);  
		
	
КонецФункции

Функция ПолучитьПоложеноДнейОтпускаПропорционально (Дата, ДатаУвольнения, НачалоПериода, КонецПериода, ДнейВсего) Экспорт
	
	ДатаОтсчета = ?(Дата > ДатаУвольнения И ЗначениеЗаполнено(ДатаУвольнения), ДатаУвольнения, Дата);
	
	Если ДнейВсего = NULL Тогда
		КвоДнейВсего = 0;
	Иначе
		КвоДнейВсего = ДнейВсего;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОтсчета) или НЕ ЗначениеЗаполнено(НачалоПериода) или НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		Возврат 0;
	ИначеЕсли ДатаОтсчета >= КонецПериода Тогда
		Возврат КвоДнейВсего;
	ИначеЕсли ДатаОтсчета < НачалоПериода Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Окр((ДатаОтсчета-НачалоПериода)/(КонецПериода - НачалоПериода)*КвоДнейВсего);
		
	
КонецФункции

//}